{"200377265": {"jobID": "200377265", "origin_search": null, "posted": "May 23, 2022", "jobTitle": "Wireless Coexistence Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200377265/wireless-coexistence-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's in Electrical Engineering, Computer Engineering or equivalent.\n\nMaster's Degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years of software engineering experience in the wireless domainStrong Software Engineering skills including design, programming (C, C++, or Objective C), scripting (Python preferred) and debuggingHighly motivated and self-directedGood understanding in 3GPP, Wi-Fi or Bluetooth technologiesDeep knowledge of PHY/MAC layers of a radio technologyConsistent track record of project deliverables from concept to commercializationExcellent communication, collaboration, critical thinking, and problem-solving skillsPassionate , inquisitive, and driven to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersBachelor's in Electrical Engineering, Computer Engineering or equivalent.\n\nMaster's Degree preferred", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly motivated and self-directed individual who can excel in a fast-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it."}, "200458303": {"jobID": "200458303", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458303/wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. in EE or Physics. M.S. or Ph.D. preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "5-15 years of industry level experience in semiconductor design, devices and technologies and/or vendor/project managementBackground in project management and schedulingUnderstanding and experience with hardware and software aspects of a complex electronic systemExperience at working with suppliers and contract manufacturersPrior working experience in semiconductor design or manufacturing, qualification and productionMust have strong problem-solving skillsMust be highly motivated self-starter and a phenomenal teammate who can thrive in a dynamic startup-like environmentMust be able to work well with othersWillingness and ability to travel: 10% travel estimate in 5-10 day tripsExcellent oral and written communication skills. Excellent presentation skillsDynamic and “can do” attitude with the desire to work with an extraordinary team and productB.S. in EE or Physics. M.S. or Ph.D. preferredPrevious work experience in integrated circuit design, integrated circuit device physics, RF/microwave circuit design, semiconductor manufacturing, semiconductor backend processing, semiconductor packaging, RF measurements using vector network analyzer, spectrum analyzers and call boxes, antenna designSoftware design experience in Python, C, C++", "jobDescription": "Join our wireless team and drive innovation that matters! At Apple, you will be a part of a team that is responsible for design and development of various Apple products. You will have a once-in-a-lifetime opportunity to deliver outstanding performance for our wireless products and participate in pushing the boundaries of achievable radiation performance in wireless devices."}, "200443107": {"jobID": "200443107", "origin_search": null, "posted": "Jan 14, 2023", "jobTitle": "Development Test Coordinator, Autonomous Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443107/development-test-coordinator-autonomous-systems?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Degree in STEM field preferred, or relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$91,500", "max": "$164,500"}, "benefits": null, "requirements": "Functional technical skills to translate requests for tests of hardware, software and sensor technologies into test execution instructions. Sound functional understanding of autonomous hardware and software, including servers, compute technologies, operating systems, sensors, networking, and the software environment.An intermediate working knowledge of software development practices and related tools, such as Git and Github, is a requirement. Ability to read and debug Bash and Python at an intermediate proficiency strongly desired. Knowledge or proficiency with JSON and SQL a plus.Command of tools such as Confluence, Jira, and data visualization tools.Effective communicator, both when writing and speaking. Able to communicate technical information clearly, tailoring the message for the audience.Ability to translate technical descriptions of instructions or expected behaviors from software engineers and develop detailed instructions to produce the desired result. Possess a keen eye for context clues when provided with ambiguous language or requests that are out of scope.Skilled at expectation setting, negotiation and conflict resolution with partners and coworkers.A safety-first mindset; identifies, reports, and ensures the documentation of issues that may require investigation or critical attention.Creates detailed briefs and skilled at modeling data to capture program requirements, develop training criteria, projects, and roadmaps.Degree in STEM field preferred, or relevant experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we take pride in surprising and delighting our customers with innovative products and services that enrich their lives. The people here at Apple explore ideas that create new markets and revolutionize how people live. Bring your passion, dedication, and expertise, and discover the difference you can make."}, "200436311": {"jobID": "200436311", "origin_search": null, "posted": "Oct 15, 2022", "jobTitle": "Algorithm & Performance Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436311/algorithm-performance-engineer-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years of professional software development experience.Expert knowledge in Modern C++.Experience in either ComputerVision, High Performance Computing or Numerical Algorithms.Familiarity with SIMD, concurrency and/or GPU kernels.Passion for optimizations and efficient implementations.High software engineering standards: desire to write clean, well-tested and well-structured code.Excellent communication and presentation skills.Track record of collaborating across teams, gathering requirements and delivering results.", "jobDescription": "The Apple Special Projects Group, working on autonomous systems, we are implementing highly complex algorithms. We are looking for a talented, dedicated and result oriented C++ Software Engineer to help improve, expand and further optimize our stack. \n\nYou will be part of a world class team with a highly diverse skillsets. Implementing complex numerical algorithms in a well designed, testable manner is as much part of an Algorithm & Performance Engineer’s day-to-day as optimizing cache coherency of existing implementations, applying SIMD optimization or reducing memory footprint of modules. You will be addressing a vast variety of challenges from implementing GPU kernels over deploying and optimizing machine-learned models all the way to architecting, implementing and testing a complex software stack."}, "200455287": {"jobID": "200455287", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Automation Flow Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455287/soc-automation-flow-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate will have experience in the development and maintenance of automation within a hardware or software development environment.-  Significant experience scripting in Unix environment with Perl, Python, or Ruby-  Solid understanding of modern software development processes and standard methodologies-  Ability to design quantitative experiments, capture data, and analyze and present results-  Experience with batch job / cloud execution environments is a plus-  Experience with SQL and database configuration and operation is a plus-  Knowledge of hardware design verification tool configuration and operation is a plus-  Knowledge of hardware design verification methodologies is a plusMinimum of BS + 10 years relevant industry experience.", "jobDescription": "Does making the next phenomenal technology product excite you? Imagine what you could do here. At Apple, our new insights have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200455274": {"jobID": "200455274", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Automation Flow Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455274/soc-automation-flow-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate will have experience in the development and maintenance of automation within a hardware or software development environment.-  Significant experience scripting in Unix environment with Perl, Python, or Ruby-  Solid understanding of modern software development processes and standard methodologies-  Ability to design quantitative experiments, capture data, and analyze and present results-  Experience with batch job / cloud execution environments is a plus-  Experience with SQL and database configuration and operation is a plus-  Knowledge of hardware design verification tool configuration and operation is a plus-  Knowledge of hardware design verification methodologies is a plusMinimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200266950": {"jobID": "200266950", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Software Engineer, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200266950/software-engineer-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent is required; Master's degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "8 or more years of industry experience building scalable micro services or data driven platforms.Strong computer science fundamentals.Prior experience with Java/Scala/C++ or equivalent.Expertise in NoSQL datastores ( e.g Cassandra )Proficiency in data processing technologies (e.g Kafka, Spark, Flink )Experience crafting scalable micro services.Familiarity with cloud paradigms ( e.g AWS )Proven ability to work on sophisticated problems and systemsStrong problem solving and debugging skills.Have the ability to communicate effectively, both written and verbal, with technical and non-technical multi-functional teams.A desire to work in a fast-paced and challenging work environment.Bachelor's degree in Computer Science or equivalent is required; Master's degree preferred.", "jobDescription": "At Apple, we work every day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy."}, "200456332": {"jobID": "200456332", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Product Design Engineer - Mac", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456332/product-design-engineer-mac?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. Mechanical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Genuine curiosityA sense of ownershipCollaborative & receptive to feedbackEngineering fundamentals: solid mechanics, material science, heat transfer, mechanism design, manufacturingExcellent communication skills: both written and verbal, ability to clearly communicate design ideas and contribute to brainstorms2+ years experience in full time mechanical design engineering roleB.S. Mechanical Engineering or equivalent", "jobDescription": "Do you love utilizing your creativity, spatial reasoning & attention to detail to collaboratively solve design challenges? The Mac Product Design team works with other engineers and designers to seamlessly integrate technology into the next generation of portable and desktop computers. We apply a genuine sense of curiosity and dedication to delivering truly innovative and relevant products that enrich our customers’ lives. We want you to join our cohesive and diverse family of Product Design Engineers to do the most impactful work of your life. In this role, you will ideate concepts, design down to the details, prototype & test, and travel to assembly sites to optimize the design."}, "200461011": {"jobID": "200461011", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Senior Software Engineer Apple TV Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461011/senior-software-engineer-apple-tv-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA in Computer Science/Engineering or equivalent is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience in a professional software development position.Passionate about sharing your in-depth knowledge and experience building applications.Solid programming experience in Java.BS/BA in Computer Science/Engineering or equivalent is preferred", "jobDescription": "Ready to make a difference? The Apple Media Products Engineering team is one of the most dynamic examples of Apple’s long-held passion for combining art and technology. Our team is responsible for the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books on a massive scale, meeting Apple’s high expectations with dedication to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. Our team of engineers build secure, end-to-end solutions. They develop custom software used to process all the creative work, the tools that providers use to deliver that media, the server-side systems, and the APIs for many Apple services. Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Today Apple continues to push the boundaries of innovation. At Apple, innovation has a way of quickly becoming category-defining products, services, and customer experiences. With your passion and dedication, there's no telling what you could accomplish here."}, "200455085": {"jobID": "200455085", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "Software Developer Test - CoreLocation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455085/software-developer-test-corelocation?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors, Masters, or equivalent degree in Computer Science or Electrical Engineering."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Knowledge of object oriented languages: e.g. C, C++, Objective-CKnowledge of scripting languages: e.g. Python, Perl, shell scriptingKnowledge of automated build & test systemsOS X or UNIX experienceThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsBachelors, Masters, or equivalent degree in Computer Science or Electrical Engineering.", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters! Create and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. If you're passionate about building technology that will make a difference, this is the job for you."}, "200455044": {"jobID": "200455044", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Wireless Systems Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455044/wireless-systems-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor or Masters in Computer Science, Electrical engineering, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands-on experience with testing cellular technologies (5G, LTE, UMTS, CDMA, IMS etc).Excellent work experience on MTBF issues analysis e.g. Performance, CA, 5G, VoLTE, SRVCC, CSFB, Crashes, Resets, Panics etcGood knowledge of how to write testable codeGood understanding of MTBF/Stability Testing, Automation Tools, Test Suits, Execution and test setupsExposure to modem bring-up from early development to maintenance phaseAbility to work efficient with teammates who work remotelyGood attention to detail, strong written and interpersonal skillsExperience in leading global teamsBachelor or Masters in Computer Science, Electrical engineering, or equivalent", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nThe Wireless Frameworks and Services team is looking for a highly motivated and hardworking Wireless Systems Test Engineer to help develop and maintain test automation for all Apple platforms. (i.e Apple Watch, Apple TV, AirPods, iOS and macOS)"}, "200465298": {"jobID": "200465298", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Software/Infrastructure Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465298/software-infrastructure-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 10 relevant years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expertise in at least one modern programming language such as Python, Javascript, C++, etcGood understanding of data structures, algorithms, code efficiency, designing for scale, etcExperience with application development using modern frameworks such as AngularJS, NodeJS, ReactJS, JavaScript, HTML5, etcExperience with at least one modern web framework such as Django, Flask, Rails, etcExperience with GitDatabase experience (Relational, non-relational) is a plusContainer/Cloud experience (Kubernetes, AWS, Docker) is a plusCI/CD experience (Jenkins, TeamCity, etc) is a plusSoftware architecture experience (i.e. building applications from the ground up, from design to maintenance) is a plusBachelor's degree and a minimum of 10 relevant years of experience.", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it.\n\nIn this highly-versatile, extremely rewarding role, you will be part of an exciting, talent-overflowing team working on developing software that will be widely adopted. You will be part of Apple's prototyping and emulation team focusing on infrastructure that accelerates overall productivity in countless areas. Your work will bring tremendous impact to the overall chip design and in getting functional products to millions of customers."}, "200420218": {"jobID": "200420218", "origin_search": null, "posted": "Sep 9, 2022", "jobTitle": "iOS and macOS SW Application Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420218/ios-and-macos-sw-application-program-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "3-5+ years experience as a technical software Project or Program ManagerStrong understanding of and experience in managing complex, multi-functional software projectsStrong technical understanding of operating systems and how the various layers in the software stack fit togetherExcellent spoken and written communication with the ability to tailor communication style to multiple audiencesProven track record in defining processes and executing on themSelf-motivated and enthusiastic with demonstrated creative and critical thinking capabilitiesHas a deeply curious mindset about new ideasExcellent attention to detail and highly organizedAbility to build relationships and influence othersBS in Computer Science or related field, preferred.", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we strive to achieve will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. Do you have a passion for creating ground-breaking, impactful features that surprise and delight millions of users? Do you enjoy solving challenging problems in a fast-paced, dynamic environment where you’ll work with many different teams across Apple? If so, we are looking for a Software Engineering Project Manager to join our team and help us innovate and take the most advanced operating systems to the next level!"}, "200441453": {"jobID": "200441453", "origin_search": null, "posted": "Nov 2, 2022", "jobTitle": "Optical Metrology Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441453/optical-metrology-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD or Master with 5+ years of industry experience in Optics, Computer Science, Software Engineering, Electrical Engineering, Physics."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Knowledge in following areas: Optical instrument, e.g. CCD/CMOS camera, lens, spectrum meter, colorimeter etc. Metrology system design, development and qualification. Vendor management experience3+ years of experience in leading an engineering team in drive project development from concept to mass productionPast work experiences with optical products (camera, display and lens etc.) and have a strong passion and interest in this areaExcellent interpersonal skills; clear technical communications with teammates, self-motivated and very responsibleStrong leadership and problem solving abilityResponsible and motivated; comfortable in stepping into uncharted technology space and work hard to deliver solutions in a timely fashionPhD or Master with 5+ years of industry experience in Optics, Computer Science, Software Engineering, Electrical Engineering, Physics.", "jobDescription": "Apple’s Optical Metrology Manager is a terrific position for someone passionate about technology. Be part of the Hardware Technology team that fosters a collaborative environment with creative talents that build elite products and innovative technologies.\n\nWe are looking for a motivated individual to manage a team of optical metrology engineers that supports the design, development, qualification and manufacturing of optical modules. Imagine yourself leading a team of dedicated engineers to help shape and ship the epochal Apple products for future."}, "200464696": {"jobID": "200464696", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Cloud Infrastructure Engineer - Caching", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464696/cloud-infrastructure-engineer-caching?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science / related fields or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in operating distributed databases.Understanding of hardware fundamentals (system components and how they interact).Familiarity with datacenter concepts (networking, rack topology, power and performance).Linux kernel experience - e.g., filesystems, kernel tuneables and their influence on latency/performanceCuriosity and drive to learn, ability to apply existing knowledge to new concepts and new domains in dialogue with others.BS or MS in Computer Science / related fields or equivalent work experience.– Excellent written and verbal communications skills.– Ability to propose and lead projects with significant scope and impact.– Comfort and experience operating with a high degree of autonomy.– Organizational acumen and ability to map effort to impact.", "jobDescription": "Imagine what you could do at Apple. Bring passion and dedication to your work and there’s no limit to what you could accomplish.\n\nApple Cloud Infrastructure is seeking a new team member interested in engineering at the intersection of hardware, operating systems, and database performance.\n\nAs a member of the Caching team, you’ll partner with datacenter engineering and operating systems teams to identify and take advantage of opportunities to improve efficiency, stability, and performance.\n\nYour work will be deployed at massive scale, serving millions of queries per second over hundreds of terabytes of cache across our data centers worldwide. It also has huge impact, forming the platform upon which many iCloud and other internet services at Apple are built. In Apple Cloud Infrastructure, your work will benefit hundreds of millions of users and is essential to the success of Apple’s products."}, "200390063": {"jobID": "200390063", "origin_search": null, "posted": "Sep 16, 2022", "jobTitle": "FPGA Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200390063/fpga-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE or Equivalent required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proven experience with design, bring up, debugging and verification on FPGAExperience in large scale FPGA development for imaging / signal processing / embedded applications strongly preferredExpertise in design and implementation of large SoCsBroad knowledge and experience working with peripheral interfaces including SPI, USB, MIPI, I2C and on-chip bus protocols such as AMBA (AXI, AHB, APB)Understanding of communication protocols including TCP/IP, UDPProven Experience with C++ and PythonDesign and verification using Verilog/System VerilogPerform FPGA Synthesis, Place & Route, timing optimizationsPerform bring-up, debug, and validation of designs to achieve functional and performance goalsThoroughly document and support each of above stepsCollaborate with cross-functional teams in order to define prototype hardware to evaluate new technologies and features5+ years experience preferredMSEE or Equivalent required", "jobDescription": "As a FPGA Design Engineer, you will work in a team developing custom tester solutions for Display products. You will integrate industry standard and custom hardware IP into SoCs. You will develop and maintain methodology and flows checks for your design.  Collaborate with multi-disciplinary groups to make sure designs are delivered on time and with the highest quality by incorporating accurate checks at every stage of the design process."}, "200396269": {"jobID": "200396269", "origin_search": null, "posted": "Jul 15, 2022", "jobTitle": "WiFi Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200396269/wifi-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "WiFi driver SW developmentWiFi protocol and 802.11 standardEmbedded Linux programmingProven excellence in Software development, with deep understanding of ARM architecture and RTOS conceptsDeep understanding of data structures, object-oriented design, and system architecture in an embedded environmentStrong software engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingIn-depth understanding and strong hands-on experience on 802.11 technologies and standardsProficient understanding of TCP/IP suite of protocolsExperience with versioning and automation tools, such as git or unit testingEffective written and oral communication skills, particularly with technical content.Highly organized, creative, motivated, and passionate about achieving resultsBachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe success we are striving will be the result of very skilled people working in an environment which nurtures creativity, partnership, and thinking of old problems in new ways. \n\nThe mission of the WiFi Technology team - Build the world’s best WiFi experience and most innovative use cases by inventing and improving state-of-the-art technologies. We develop ground breaking WiFi technologies and ecosystems that are central to Apple’s products - the iPhone, Mac products, HomePod, and more! New challenges arise every day that require the sharp problem-solving skills of individuals. Are you in for these challenges? \n\nJoin us! We are looking for a forward-thinking, self-confident, experienced firmware engineer to design, develop & launch next-generation WiFi technologies in Apple products."}, "200464541": {"jobID": "200464541", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "RFIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464541/rfic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Strong knowledge of RFIC circuit design. Direct tape-out experience with one or more of the following blocks: RF front-end circuits, PA, LNA, mixer, oscillator, PLL, LO, VGA, filter, ADC/DAC, TIA or other baseband analog blocks in deep sub-micron CMOS technology.Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability, and other analog impairments.Knowledge of CMOS device physics, RF device modeling, device noise parameters, inductor modeling, and circuit layout for optimum RF performance.Familiarity with various RF transceiver architectures and their trade-offsExposure with Cadence Virtuoso, Spectre RF, EMX and similar tools.Experience in Si characterization and debug.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Wireless SoC Radio Team designs state-of-art highly energy efficient CMOS radios, from RF to bits. To deliver these radios, our team is responsible for the design of a wide range of RF, analog, and mixed-signal blocks from RF front-end amplifiers to data converters, including baseband filters, baseband and RF phase-locked loops, crystal oscillators, and bandgap references. We are working on new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an RFIC design engineer, you will be at the center of this wireless SoC design group. You will have a critical impact on developing Apple’s state-of-the-art radios and getting them into hundreds of millions of products."}, "200464148": {"jobID": "200464148", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Car Experience Partner Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464148/car-experience-partner-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science, Electrical Engineering, or related degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Development experience on embedded automotive systemsUnderstanding of automotive development, design-to-releaseBalanced expertise between technical development work and project management. Ownership experience. Responsible for a feature, product, protocol or interfaceFocus to create and enable phenomenal user experienceExcellent problem solving, project documentation skills and authoring technical requirements and specificationsExperience to engage, create and foster relationships with external development partnersDriving initiatives with external development teams, i.e. system design, requirement review, debugging workshops. Experience in multi-functional collaborationProficiency in handling development escalationsExperience with wired and wireless communication standards (USB, Wi-Fi, Bluetooth, NFC)Experience to assess usability concepts, to provide design feedback and constructive improvement suggestionsBachelor's degree in Computer Science, Electrical Engineering, or related degree.3-5 years industry experienceSoftware development experience", "jobDescription": "The Car Experience team is looking for a hardworking, highly motivated Partner engineer to help provide technical design and development support to automotive partners from initial concept through production launch. Your technical expertise in embedded systems and software development enables you to provide hands-on support to automotive systems developers in form of integration directions, technical specification clarification and failure assessment. Excellent user interface solutions excite you and you’re able to constructively critique product experience and design concepts. You’ll be interfacing with automotive industry engineering, designers and development executives to integrate CarPlay and other iOS car integration features into their systems, and to achieve the highest level of end customer quality. It would be great if you came with previous automotive software development experience, ideally in fields of infotainment, connectivity solutions or online applications."}, "200459133": {"jobID": "200459133", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "System Stability Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459133/system-stability-quality-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in CS, CE, EE, or related."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$109,500", "max": "$207,000,"}, "benefits": null, "requirements": "3+ years of Systems QA or System Test experience, preferably on consumer electronicsExcellent knowledge of software development lifecycle, test methodologies and tools, and passion for quality processesStrong organizational and communication skillsAbility to define/design/develop/maintain test automation frameworksDevelopment skills in Python, Object Oriented Programming and scripting languagesExperience being responsible for a complete functional area of a product or applicationAbility to independently investigate, debug and triage difficult problems and work towards results by working with a wide range of cross-functional teamsAbility to quantify and analyze large datasets and relate them to user experienceFamiliarity in geometric computer vision or image processing is a plusBS in CS, CE, EE, or related.", "jobDescription": "Are you looking for a new opportunity to work on a dynamic team that is all about delivering a quality experience on some of the world’s most creative products? Do you enjoy exploring applications for augmented reality, thrive on building test solutions rapidly and then iterating on them? We in Systems Stability team are looking for a highly motivated, upbeat, and experienced stability QA engineer with a passion for consumer electronics and breaking new ground on the forefront of technology! \n\nWe are a group of diverse-minded systems QA engineers, and we have the unique and rewarding opportunity to partner closely with the engineering teams, to drive stability and shape upcoming products that will delight and inspire millions of Apple’s customers every day.\n\nYour work throughout every step of the development cycle will help make our products more flexible, reliable, and easy to use. Come be a part of a team using creativity and innovation to qualify features and technologies that our customers love and that you will be proud of and our customers love!"}, "200434785": {"jobID": "200434785", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Software Engineer, System Services & Daemons", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434785/software-engineer-system-services-daemons?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Expert level C, exposure to Objective-CExperience with daemon and library developmentCreative, critical thinking and troubleshooting skillsExcellent collaborative skillsExceptional professionalism, with the ability to deliver solid work on tight schedulesExcellent written and verbal communicationA genuine passion for consumer devicesB.S. in Computer Science or equivalent experienceAdditional Success Factors:Development experience on macOS and/or iOSExperience with common embedded hardware architectures Familiar with cryptographic concepts and techniquesFamiliar with open source technologies and development communitiesFamiliar with Xcode", "jobDescription": "Are you a big-picture thinker who loves setting high-reaching goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole! That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, comprehensive user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Core OS organization is seeking an extraordinary engineer to work on state-of-the art technology for macOS, iOS, tvOS and watchOS. You should have a strong understanding of operating system fundamentals and experience working throughout the stack. As a member of the team, you would participate in all stages of software development, from new feature design and implementation, to maintenance and bug fixing of released code. You will develop and improve unit tests and performance tests, and may also work on diagnosing and resolving customer reported issues."}, "200439880": {"jobID": "200439880", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Display EE Platform Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439880/display-ee-platform-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD degree in Electrical Engineering, or MSEE degree plus minimum 5 years work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Demonstrate engineering passion, intuition, and inquisitiveness.Excellence in at least one area of chip design (analog/ mixed-signal/ digital) with proved record of leading publications.Hands-on lab experience including data acquisition and measurement automation.Circuit simulation experience such as HSPICE or Spectre is required.Ability to travel internationally up to 10% of the timeExperience in electro-optics systems, such as camera or image sensor or lidar is a plus.Strong python and Matlab scripting skill are a plus.PhD degree in Electrical Engineering, or MSEE degree plus minimum 5 years work experience.", "jobDescription": "We are looking for an electric engineer who can architect the next generation display technology for various Apple products. In this unique position, you will be learning & pushing the limits of panel technology, proposing various compensation algorithms for SoC or other silicon, prototyping the target performance in executive demo, and supporting product development to mass production.  \n\nAn average day in this wide-dynamic position could include hands-on characterization of electro-optical performance, image processing for data analysis, proposing design iterations for panel or new algorithms, system integration of the proposal, prototype demo, presentation and documentation of the proposals for cross-functional teams."}, "200310107": {"jobID": "200310107", "origin_search": null, "posted": "Aug 30, 2022", "jobTitle": "Cellular Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200310107/cellular-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Bachelor's degree in Electrical Engineering, Wireless Communications or equivalent \n\nMaster's or PhD Preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Hands on experience in wireless protocol development and system engineeringStrong Software Engineering skills including design, programming (C or C++, script) and debuggingDeep knowledge of 3GPP specifications on protocols layers preferably NAS, IMS, VOLTE and VONRHardworking and inquisitive with a focus on solving problems in innovative waysAttention to the smallest details that are meaningful to customersBachelor's degree in Electrical Engineering, Wireless Communications or equivalent \n\nMaster's or PhD Preferred", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems organization and be part of an extraordinary team of engineers. We work with cross functional teams to drive innovation and develop products used by millions worldwide. Apple’s Wireless Software Architecture team is seeking dedicated, highly motivated and self-directed engineers to work across layers on innovative cellular technologies. The position involves identifying and developing core wireless technologies that solve everyday problems for customers using iPhone, iPad, Watch and other wireless product lines."}, "200327755": {"jobID": "200327755", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "System Architecture Engineering Program Manager (EPM) - Silicon focus - Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200327755/system-architecture-engineering-program-manager-epm-silicon-focus-technology-development-group-tdg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Required: BS/MS in CE/EE/CS or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "Understanding of the System on chip (SOC) architecture and design.Deep understanding of the interactions between SOC and consumer electronic System Architectures.Ability to translate a customer use-case to technical details.Demonstrated ability to work through architecture tradeoffs, specifically in systems with custom silicon components.Proven track record of managing silicon and system validation for advanced hardware products.Strong technical background in Electrical, Mechanical, or Software Engineering.5+ years of relevant hardware engineering experience in consumer electronics.3+ years of project management experience.Proactive and highly self-motivated; good critical thinking capabilities and strong attention to detail.Ability to operate well in an environment with rapid development cycles and constant change.Required: BS/MS in CE/EE/CS or equivalent work experience.", "jobDescription": "Do you enjoy tackling ambiguous problem statements, evaluating technical trade-offs, driving teams to recommendations that are strongly grounded in customer experience? Apple’s Technology Development Group (TDG) is looking for an experienced, highly technical EPM to join the team driving System Architecture definition and validation of a new product category. If you have broad experience across various key hardware technologies (e.g displays, cameras, RF, custom silicon), and strong product/customer sense, we’d love to hear from you!"}, "200342594": {"jobID": "200342594", "origin_search": null, "posted": "Sep 22, 2022", "jobTitle": "iPad Touch HW - Touch EE Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200342594/ipad-touch-hw-touch-ee-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. in EE or Physics related fields (PhD preferred) + 3 yrs related industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong logical thought process and analytical skill set. Ability to break-down complex problems fundamental blocks that can be analyzed via understanding of electro-magnetic interactionsElectrical engineering background in analog and mixed-signal design, especially board-level circuitsHands-on experience in system-level designExcellent written and verbal communication skills and solid teamwork and leadership skillsProficiency in FEA (Comsol, ANSYS, Maxwell) MATLAB, SPICE, or similar simulation and modeling toolsM.S. in EE or Physics related fields (PhD preferred) + 3 yrs related industry experience", "jobDescription": "The Sensor Technology team develops cutting-edge sensor solutions and technologies that are central to Apple’s products. The key goal of the team is to enable the world’s best user-experience through state- of-the-art sensor solutions, such as the high-precision, low-latency multi-touch and stylus sensors in our products. New challenges arise everyday that require the sharp problem-solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation."}, "200451142": {"jobID": "200451142", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "SoC Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451142/soc-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Demonstrated expertise in SoC hardware architecture in the area of consumer electronics. Experience in the areas of Wireless and Cellular technologies such as LTE/5G NR is preferred.Must have outstanding SoC and system architecture fundamentals backed with substantial experience. This means a good understanding of power and performance tradeoffs, transient and steady-state performance states, idle and dynamic power states, as well as how SoC data and control flows interact.Sound understanding of Microprocessor Subsystems, Memory Controllers and Communication Fabrics.Good understanding the Digital ASIC Flow and Debug methodology.Solid understanding of electrical and thermal considerations at the chip, package and system levels.Good understanding of hardware-software interfaces.Excellent communication skills across organizations and at the executive level.Excellent written skills for clear and concise reporting.Excellent organization skills to prioritize conflicting requirements.Strong cross-site teamwork skills with the willingness to work independently.BS and 10+ years of relevant experience.", "jobDescription": "We’re a unique team of innovative, diverse individuals who have come together from multiple backgrounds to create advanced Cellular Architectures. The people who work here are generalists in nature, and together we complement each other. It is the passion of exploring uncharted territory that makes us thrive.\n\nOur team is seeking a highly motivated and experienced SoC Architect to help drive strategic 5G Cellular Modem technology, analyze key architectural trade-offs in coordination with cross-functional domain experts."}, "200388940": {"jobID": "200388940", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200388940/firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or Electrical Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Genuine passion for innovation and embedded development.4+ years of firmware and device driver development.Strong, proven coding skills in C and C++.Experience in software feature design and development, rapid prototyping, hardware bring-up and reading schematicsExperience with standard bus interfaces (I2C, SPI, UART, USB).Familiarity with BT and BLE technology/protocols is a plus.Familiarity with compilers and toolchains targeting ARM Cortex-M/R/A, ATMEL AVR, etc.Excellent interpersonal skills, including the ability to work with multiple cross-functional groups.BS/MS in Computer Science or Electrical Engineering or equivalent experience", "jobDescription": "The Apple Beats team is seeking a Firmware Engineer with firm footing with engineering principles and passion for new technologies; a passionate individual with the skills to research and develop new and innovative solutions for the next Apple audio products. Come join us!"}, "200457051": {"jobID": "200457051", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Analog Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457051/analog-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience crafting Analog and Mixed-signal IPs and productsExperience working in a dynamic engineering environment and real-time crisis management skillsCommitted to own/drive project development using well-defined metrics.Strong teammate and creative thinker who is able to lead technical teams, multi-functional groups and vendors against plans.High tech industry experience with a track record of hands-on product development, program management, project management or engineering management.Excellent written and verbal interpersonal skills.Advanced knowledge of IP development process, tools/flows and methodologies and life cycle in a SoC.BS + 10 years of relevant experience", "jobDescription": "Apple is looking for design engineering professionals with strong leadership ability to ensure that Analog/Mixed signal IP's for our SoC's that meet the technical, quality, and schedule requirements for Apple products. You will be responsible for multi-functional communication and representation for the groups involved in Apple IP development and SoC IP Integration. You will utilize your project management experience in VLSI Chip Design, ASIC Chip Design, and/or Technology Process Development."}, "200349280": {"jobID": "200349280", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "AR/VR Embedded SW and Prototyping", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200349280/ar-vr-embedded-sw-and-prototyping?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills with operating systems focus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Genuine interest in system software architectureKnowledge of hardware-software interfacesExperience in developing kernel drivers, embedded firmware, system frameworks, etcIn-depth knowledge of C/C++Experience with development in simulation and emulation environmentAbility to work under tight schedule and deliver on timeExcellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersStrong communication and collaboration skillsBS in Computer Science/Computer Engineering or equivalent experience/skills with operating systems focus.", "jobDescription": "The Technology Development Group at Apple is actively looking for a highly motivated Software Engineer to contribute and build Apple’s future technologies in Augmented Reality (AR) and Virtual Reality (VR) space. The successful candidate will demonstrate deep knowledge in kernel driver development, embedded firmware development, systems debugging and a desire to work with C and C++ System Programming for our devices. Role entails architecting, prototyping and developing real-time software stack for Apple's revolutionary AR/VR roadmap.\n\nOur team builds technology that defines industry standards, and therefore we seek people who thrive to innovate. Tenacity and the passion to learn are skills we value on our team, and if you want to impact millions of customers by working on the most advanced technology solutions, we want to talk to you."}, "200456694": {"jobID": "200456694", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "AR/VR Camera Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456694/ar-vr-camera-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands on experience developing Camera software stackComfortable working close to hardwareExperience in developing kernel drivers, embedded firmware, system frameworks, user-space daemons, etcIn-depth knowledge of C/C++Ability to work under tight schedule and deliver on timeExcellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersStrong communication and collaboration skillsBS in Computer Science/Computer Engineering or equivalent experience/skills.", "jobDescription": "The Technology Development Group at Apple is actively looking for a highly motivated Software Engineer to contribute and build Apple’s future technologies in Augmented Reality (AR) and Virtual Reality (VR) space. The successful candidate will demonstrate deep knowledge of Camera software stack ranging from ISP firmware, kernel drivers to user-space application. Candidate is expected to be proficient in operating systems concepts, software development, embedded firmware development and C/C++ programming. Role entails designing and developing real-time software stack for Apple's revolutionary AR/VR roadmap.\n\nOur team builds technology that defines industry standards, and therefore we seek people who thrive to innovate. Tenacity and the passion to learn are skills we value on our team, and if you want to impact millions of customers by working on the most advanced technology solutions, we want to talk to you."}, "200387515": {"jobID": "200387515", "origin_search": null, "posted": "Sep 22, 2022", "jobTitle": "Video Streaming Software Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200387515/video-streaming-software-quality-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in Computer Science or Computer Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Knowledge of Adaptive Video Streaming Technology (ie. HLS), or other media testing experienceAutomation experience (creating or utilizing existing test automation frameworks)Scripting or Programming Experience (ie. Python, Objective-C, or Swift)Performance and functional testing experienceKnowledge with networking concepts (QoS, packet traces) is a plusBachelors in Computer Science or Computer Engineering or equivalent", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we're looking for individuals like you!\n\nApple is seeking a software quality engineer to join the video streaming technology team in the Interactive Media Group (IMG). IMG provides the multimedia and graphics software frameworks across all of Apple's innovative products, including iPhone, iPad, Apple Watch, Apple TV, HomePod, and Macs, enabling media playback on those devices."}, "200466446": {"jobID": "200466446", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Electrochemistry Modeling Engineer - Battery", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466446/electrochemistry-modeling-engineer-battery?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "B.S.+ 10 years of relevant industry experience. \nPh.D. preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "B.S.+ 10 years of relevant industry experience.Physics-based modeling of thermo-electrochemical and mechanical performance/safety characterization of lithium cells.Experience in cell aging mechanism identification, characterization, and modeling.Strong background using standard experimental techniques or developing new testing techniques to enable high accuracy of modeling.Ability to drive effectively with other specialists and teams to build and validate high-fidelity, high-accuracy models with test data and cell design/manufacture documentation.Knowledge of various, latest testing techniques and standard processes.Expertise in numerical methods of optimization, statistical analysis and data evaluation, visualization.Experience in numerical methods of PDEs and ODEs.Experience and shown ability to mentor the team as well as drive technical development roadmap.Ability to own and drive large-scale development projects as an individual contributor.Previous experience in leading a small engineering team is a plus.B.S.+ 10 years of relevant industry experience. \nPh.D. preferred.", "jobDescription": "Are you looking to push the limits of what’s considered feasible? As part of our Battery Engineering group, you’ll be a team member to craft creative battery solutions that deliver more energy in smaller spaces than ever before! The Electrochemistry Modeling Engineer role is focused on the research and development of cell performance and aging mechanisms and modeling in an effort to capture relevant physics underlying these behaviors in the early design architecture phase in order to guide the design decisions and trade-offs. The work will involve multi-disciplinary expertise, primarily electrochemistry (special focus on Li-ion batteries in consumer electronics), mechanical and thermal engineering as well as software development! This role entails deep expertise in the field of battery electrochemistry modeling, and testing as well as numerical methods of data analysis, modeling, and optimization."}, "200380732": {"jobID": "200380732", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Motion Sensing System Integration Engineer – Inertial Sensors", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380732/motion-sensing-system-integration-engineer-inertial-sensors?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Requires PhD degree in engineering or BS/MS degree plus a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "4+ years of hands-on experience and proven track record in sensing system hardware engineering.Fundamental knowledge and experience in physics, mechanical, electrical, and material science engineering.Practical understanding of accelerometers and gyroscopes.Experience interfacing microcontrollers with analog and digital sensors.Practical knowledge of C/C++, embedded programming, and signal processing.Solid board bring-up and debugging skills.Proficient in data collection, data analysis, and statistical analysis tools (Matlab, Python,JMP).Excellent written and verbal communication skills and solid collaboration and leadershipskills.The willingness and ability to travel are required.Requires PhD degree in engineering or BS/MS degree plus a minimum of 3 years of relevant industry experience", "jobDescription": "You will play a key role in specifying, developing, characterizing, and validating motion sensing systems. You should be familiar with MEMS sensor technologies such as inertial sensor performance metrics, inertial sensor usage and limitations, and system integration.\n\nThe Motion Sensing Hardware Team features a collaborative environment with creative, smart people and state of the art technologies. This team defines and integrates MEMS accelerometers and gyroscopes across a variety of Apple products such as iPhones, iPads, and Watch. Engineering excellence and thoroughness, invention and patent creation are expected, encouraged and supported. Opening up the boundaries to design and ship innovative products with exclusive technologies and user experiences is the main goal of this sensing technology team at Apple."}, "200452744": {"jobID": "200452744", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "SoC Silicon Debug Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452744/soc-silicon-debug-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience in SOC / VLSI Chip Design, DRAM, Product Engineering.Technical program management / vendor management experience.Experience in silicon validation or qualification of ASIC's.Experience with ARM architecture and leading silicon projects from concept to production is considered a plus.Extraordinary leadership skills and ability to inspire team members with an innate ability to see the bigger picture.Passion to own/drive project development using well-defined metrics.Experience working in a high-energy multi-disciplined engineering environment, strong at multi-tasking, and real-time crisis managementThrive in dynamic schedule driven development environmentAbility to understand and extract action plans from complex technical discussions and translate into succinct messaging for multi-functional and executive status reportingExcellent debugging skills. Proven ability to drive resolution of critical problems.BS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, dedicated people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nCome to Apple and work within a team to deliver a broad range of technologies. This is an extraordinary opportunity to engage with the latest technologies and contribute to groundbreaking Apple products year after year. You will go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. \n\nBe at the center of the action on new silicon product development for Apple's groundbreaking SoC's! Apple seeks a Silicon Program Manager within the Silicon Engineering Group (SEG) Engineering organization. You help lead and drive programs involving silicon debug, bring-up and validation for state-of-the-art technology used in next generation Apple products. In this complex role, and as a member of a Senior Project Management team, you will drive Silicon program schedules and resolve technical issues that enable on time silicon delivery. This position will collaborate with multi-functional teams to resolve silicon issues blocking product development starting with initial silicon bring up through production release and beyond."}, "200457400": {"jobID": "200457400", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Ergonomics Product Design Engineering Program Manager (EPM), Technology Development Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457400/ergonomics-product-design-engineering-program-manager-epm-technology-development-group?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Mechanical Engineering, Systems Engineering, Computer Engineering, Biomedical Engineering, Human Computer Interaction OR equivalent degree/experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years of combined experience in program management and human/systems engineering delivering products comprised of multiple materials, complex integration, user study development and execution with a consistent track record leading and shipping multiple complex projects simultaneouslyExperience leading full life-cycle program development in highly dynamic and ambiguous work environments, with a keen eye for user experience and impactWide knowledge of product development processes including familiarity of manufacturing, rapid-prototyping and assembly processesExperience managing projects that require in-person user-study sessions and complex data analysisPrior experience with design of human studies for engineering evaluation is highly desirableAbility to anticipate functional direction and roadblocks, prioritize parallel closure paths, and effectively distill and communicate relevant HW/SW design trade-offs to the appropriate functional teams, including leadershipExcellent communication, teamwork, and cross-functional engagement skills are criticalExcellent problem solving and creative thinking.BS/MS in Mechanical Engineering, Systems Engineering, Computer Engineering, Biomedical Engineering, Human Computer Interaction OR equivalent degree/experience.", "jobDescription": "At Apple, we strive to achieve surprise and delight for every one of our millions of customers around the world.  Our team is seeking an experienced, highly technical EPM to drive cross-functional research, user studies, safety, comfort, and performance requirements supporting an advanced ergonomic product design organization. \n\nThis role will include frequent multi-disciplinary collaboration with teams like Product Design, Human Engineering, Core Technology, and more to define specification, and validation plans that map from top level features down to hardware, research study and experimentation specifications. We need someone to work cross-functionally to accurately demonstrate human factor trade-offs, distill them into key performance requirements, and drive product decisions.  Does this sound like you? If so we'd love to hear from you!"}, "200466282": {"jobID": "200466282", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Cellular Protocol Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466282/cellular-protocol-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering, Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Strong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingHighly motivated and self-directedExcellent debugging skillsExperience with cellular protocol stacks preferred 2G, 3G, LTE and 5G NR.Thrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seeks to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering, Computer Science or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200462562": {"jobID": "200462562", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462562/firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or Electrical Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Genuine passion for innovation and embedded development.4+ years of firmware and device driver development.Strong, proven coding skills in C and C++.Experience in software feature design and development, rapid prototyping, hardware bring-up and reading schematicsExperience with standard bus interfaces (I2C, SPI, UART, USB).Familiarity with BT and BLE technology/protocols is a plus.Familiarity with compilers and toolchains targeting ARM Cortex-M/R/A, ATMEL AVR, etc.Excellent interpersonal skills, including the ability to work with multiple cross-functional groups.BS/MS in Computer Science or Electrical Engineering or equivalent experience", "jobDescription": "The Apple Beats team is seeking a Firmware Engineer with firm footing with engineering principles and passion for new technologies; a passionate individual with the skills to research and develop new and innovative solutions for the next Apple audio products. Come join us!"}, "200452428": {"jobID": "200452428", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Software Engineer – Wireless Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452428/software-engineer-wireless-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 10+ years of relevant industry experience required\n\nMS or Ph.D. in CS/EE is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands-on SW experience using modern C++ (C++14 or later) and PythonUnderstanding of test-driven and API-driven development methodologiesDeep understanding of algorithm and data structure designHands-on experience in software performance and optimizationExperience with large-scale code-base and repo managementExperience working with OS kernel to support parallel computing and emulationExcellent verbal and written communication skillsKnowledge of network protocols and/or wireless technologies is a plusBS and 10+ years of relevant industry experience requiredBS and 10+ years of relevant industry experience required\n\nMS or Ph.D. in CS/EE is preferred", "jobDescription": "Would you like to be a key member of the Wireless Architecture team to build a state-of-art, high fidelity and high-performance wireless system simulation platform? Your ideas, passion, and dedication are going to craft Apple’s current and future wireless technologies including 5G, WiFi, Bluetooth, and emerging technologies in an unprecedented way. This is a unique opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day!\n\nThe simulation platform calls for sophisticated and rigorous architecture to cover in-depth details of wireless networking technologies in rich use cases under diverse radio environments. In-depth knowledge of modern C++, performance and release engineering, together with mature judgment is key to success. As a critical thinker, you appreciate the deep nature of science and engineering in wireless communications systems. You are a clear communicator, capable of translating sophisticated yet fuzzy ideas into coherent and structured software. You love learning from wireless system experts in Apple’s multi-functional teams. You love creating opportunities to bring synergy in. You lead by helping others in a tangible way."}, "200412638": {"jobID": "200412638", "origin_search": null, "posted": "Sep 28, 2022", "jobTitle": "SWE Fall Accelerate ERP 2022", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200412638/swe-fall-accelerate-erp-2022?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Different together. At Apple, we’re not all the same. And that’s our greatest strength.We are looking for talented engineers across multiple roles and teams in SWE.", "jobDescription": "Discover Apple.\n\nWe’re looking for people like you.\n\nApple is a place where people from all backgrounds get together to do their life’s best work. Come join us.\nAt Apple, great ideas have a way of becoming great products, services and customer experiences very quickly. Bring your passion to your job and there’s no telling what you could accomplish. Apple offers a collaborative work environment that fosters creativity and innovation."}, "200449340": {"jobID": "200449340", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Wireless System Engineer - Wireless Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449340/wireless-system-engineer-wireless-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS + 10 years of relevant industry experience is required.\nMS in Electrical Engineering or Computer Science/PhD is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands-on experience and knowledge of wireless systems and protocols such as LTE/WiFi/Bluetooth, and networking protocols like TCP/IP.Experience with transceiver algorithm designUnderstanding of RF and channel propagationSkilled in Software languages: C++/C, PythonPreferred knowledge of event driven simulatorsFamiliarity with version control toolsBS + 10 years of relevant industry experience is required.BS + 10 years of relevant industry experience is required.\nMS in Electrical Engineering or Computer Science/PhD is preferred.", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! Are you ready to join our Wireless Platform Architecture team?\n\nIn this role, you will be a key member of the platform architecture team involved in the development of wireless technologies at all layers through wireless system modeling and simulations.\n\nWireless technologies have become a crucial part of all Apple devices that delight our customers. Our devices operate in radio environments with various applications, using different wireless technologies. With the latest developments in cellular, WiFi, BT, etc. we utilize a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions. We are looking for an expert wireless systems engineer who has deep understanding of wireless protocol interactions within the network, interactions across different layers of wireless protocols, such as WiFi or BT, and interactions of different technologies within the same device. You will be responsible for modeling the network protocols as well as the effect of the wireless channel and RF interactions of different wireless technologies in the simulation platform. In addition, provide reference simulations and conducting particular studies using the simulation platform."}, "200307170": {"jobID": "200307170", "origin_search": null, "posted": "Oct 28, 2022", "jobTitle": "Silicon Validation Triage Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200307170/silicon-validation-triage-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Engineering or Electrical Engineering or equivalent is required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "System-level understanding of CPU/SoC architecture, DRAM/memory, and boardsExperience with Silicon chip bringup, validation and debugEnjoy hands-on debug and problem-solvingPatient and disciplined problem-solving skills in the face of partial dataGood understanding of typical Silicon debug features and techniquesClear and concise interpersonal skillsEffective collaboration across teams.Understanding of system software and kernel conceptsModerate UNIX command line and scripting skillsBS or MS in Computer Engineering or Electrical Engineering or equivalent is requiredKnowledge of SoC and IP design flowsKnowledge and use of lab measurement and analytical equipmentIP block-level knowledgeKnowledge of manufacturing test flows and stepsKnowledge of SOC validation conceptsC, Assembly, UNIX system programmingKernel and device driver programming and concepts.", "jobDescription": "Imagine what you could do here!  At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly.  Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here.  The people who work at Apple have reinvented entire industries with all Apple Hardware products.  The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.  Do you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? \n\nAs a member of the Apple SOC Silicon Validation Team, you will use your knowledge of SOC/IP design, debug features and related tools, validation, and problem-solving in order to drive failures to resolution. You will be debugging failures that come from validation, software checkout, or factory screening that appear to be Silicon issues or that require silicon expertise in order to root cause. You will work at the cross-section of hardware and software and partner with engineers to quickly root cause failures. You will also drive systematic improvements in debug methods, tools and features based on your findings and expertise."}, "200461634": {"jobID": "200461634", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Security Software Engineer - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461634/security-software-engineer-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Strong Software Engineering skills in programming (C or C++)Ability to simultaneously support multiple projectsMust be able to clearly communicate ideas and concernsMust be able to work effectively with different teamsBS in Computer ScienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Join the team that provides content protection technologies to Apple. You'll architect and develop core software that is incorporated in products and services across Apple. We're looking for a focused, meticulous engineer to develop rock-solid code and work with other teams to launch new features and products.\n\nThe Apple Media Products Engineering team is one of the most exciting examples of Apple's long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a substantial scale, meeting Apple's high expectations with dedication to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple's outstanding integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep dedication to strengthening Apple's privacy policy, one of Apple's core values. Although services are a bigger part of Apple's business than ever before, these teams remain small, flexible, and cross-functional, offering greater exposure to the array of opportunities here. We are looking for an outstanding software engineer to join the Apple Universal Media team and help us build the next generation products that change the way millions of users consume video. As a Software Engineer at Apple, you will be owning key modules of the product and be responsible for delivering industry grade quality solutions."}, "200447771": {"jobID": "200447771", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Performance Control Software Engineer - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447771/performance-control-software-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and 3+ years of relevant experience. M.S. in Computer Science or Electrical and Computer Engineering preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Academic or practical experience with operating system design and implementationKernel software development experience in C or C++Knowledge of computer architecture and hardware performance monitoring instrumentation is desirable.Userland software development experience in environments such as C, C++ or Python is a plus.BS and 3+ years of relevant experienceBS and 3+ years of relevant experience. M.S. in Computer Science or Electrical and Computer Engineering preferred", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people who work here have reinvented entire industries with all Apple Hardware products.  The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our multifaceted group, you will have the unique and phenomenal opportunity to craft upcoming products that will delight and inspire millions of Apple's customers every single day.\n\nPlatform Architecture is looking for a Performance Control Software Engineer to measure, analyze and control the relationship between power and performance in Apple’s most advanced systems. In this position, you will study the execution of workloads on Apple silicon across all Apple platforms and leverage that understanding to invent new operating system performance control features. You will design and conduct performance experiments, create instrumentation and data visualizations, prototype innovative in-kernel performance control algorithms, collaborate with teams ranging from the core operating system through user-facing applications, and productize the software that controls the performance of every workload executed on hundreds of millions of Apple products around the world."}, "200411640": {"jobID": "200411640", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Software Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200411640/software-quality-engineer?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CPE/EE or related degrees"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Partner with a development team to quickly learn a new application, break it into functional parts, and identify potential weaknessesStrong software development/test automation skills, with high proficiency in Swift ProgrammingDevelop robust and repeatable automated testing solutionsPrior experience in developing iOS test automation with Xcode UI automation frameworkUnderstand the context where an application will be deployed, providing insights to potential failuresAuthor detailed test plans that cover all functionality and edge cases of a systemImplement manual and automated test plans on a variety of hardware and software configurationsCraft quality from an early stage by being involved through the entire project lifecycleDocumentation of test cases and code used for test executionTracking performance, reporting results to management, driving issues to closureCollaborating with multi-functional teams, guaranteeing complete test coverage and a detailed end user experience.Building creative new tools, fixtures, and methodologies to stress software featuresExperience Programming in SwiftBS or MS in CS/CPE/EE or related degrees2+ years experience of test automation experience with Xcode/Swift", "jobDescription": "Be part of the Health Study QE team responsible for enabling research into the next generation of Health Sensing features. As part of this team you will be passionate about testing application software used to collect a wide range of health and sensor data. This includes working with technologies such as ECG and PPG based Heart-rate sensing as well as novel investigative prototype sensors. Testing is focused on macOS, iOS, and watchOS applications that drive outstanding UI experiences, interface with firmware and low level software drivers, and provide data to processing pipelines. You will be a motivated individual who independently follows up on bugs, collaborates with developers to resolve issues and can understand and discuss technical problems with other Quality engineers, development partners and program managers."}, "200229584": {"jobID": "200229584", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Senior Manager, Core Technologies Quality Engineering- Camera", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200229584/senior-manager-core-technologies-quality-engineering-camera?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS in Mechanical, Electrical, Materials Science or Industrial Engineering or equivalent. (MS/MBA preferred)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,500,"}, "benefits": null, "requirements": "Deep knowledge of component manufacturing methods relevant to Core Technologies: Connectors, Haptics, Inductive, Camera, Depth, Optical SensingStrong statistical and data analytics skills - statistical process control and sampling methodsData driven and results oriented approach to problem solving, failure analysis techniquesClear and consistent communication, including executive level presentation skills and ability to drive multi-functional teamsKnowledge of Quality Systems, Design of Experiments, Reliability Models5+ years of experience in technical domain, high volume manufacturing, or development of consumer electronics or components2+ years of people management experienceBS in Mechanical, Electrical, Materials Science or Industrial Engineering or equivalent. (MS/MBA preferred)• Excellent written and verbal communication skills in English. Mandarin language skills are a plus but not required• Finance/business acumen (understand cost drivers and derive costs associated with managing quality)• Reliability methods and quality sampling methodologies• Third party production quality & process management experience• Experience working with customers• Project management experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nAt Apple, Quality is one of the cornerstones of what makes our products and technologies great. Leading the team responsible for ensuring our customers receive the high quality and reliability they expect in addition to enabling a design where quality is built in to scale large volumes at capable suppliers is an incredibly challenging job requiring a broad array of technical and management skills. You will engage early in development to enable new technologies that goes across Apple Products."}, "200441953": {"jobID": "200441953", "origin_search": null, "posted": "Nov 4, 2022", "jobTitle": "Calendar QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441953/calendar-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or Computer Engineering (or equivalent experience)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Experience working as a Software QA Automation EngineerExperience developing in Swift, Objective C, or PythonExperience in crafting, writing, and automating test cases for specific UI and non-UI featuresAbility to investigate, analyze logs, debug customer issues and drive issues to resolutionProven ability to lead and drive initiatives with cross-functional teamsExcellent written and verbal communication skills are needed to foster communication with team members, developers, cross-functional teams and managementBS/MS in Computer Science or Computer Engineering (or equivalent experience)", "jobDescription": "Be ready to make something great when you come here! Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it. Join the Calendar Quality Engineering Team to help deliver the next amazing Apple product."}, "200383456": {"jobID": "200383456", "origin_search": null, "posted": "May 26, 2022", "jobTitle": "Cellular Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200383456/cellular-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering, Computer Science, Wireless Communications or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred), debugging and/or commercialization.Hands on experience in embedded system software development (RTOS).Knowledge of wireless/internet standards, including but not limited to 3GPP 4G / 5G Non Access Stratum and Data protocols and their applications in end to end product design.Broad spectrum insight to comprehensively understand network system architecture from physical layer to application/user interface end-point is a strong plus.Thrive in a collaborative environment and can clearly communicate while confidently developing software in highly cross functional projects.Highly motivated, self-directed and inquisitive personality, focussed on bringing meaningful solutions to our customers.Bachelors or Masters in Electrical Engineering, Computer Science, Wireless Communications or equivalent.", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems team and be part of an elite team of engineers, driving innovation and developing products used by millions worldwide. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. \n\nThe same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. \n\nYou should join Apple if you want to help deliver the next amazing Apple product. Be ready to make something extraordinary when you come here."}, "200444683": {"jobID": "200444683", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "iOS Software Engineer - Proactive Experience", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444683/ios-software-engineer-proactive-experience?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS or Ph.d in Computer Science or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of proven iOS development or other embedded systemA deep understanding of software development lifecycle, methodologies, and standard processesAttention to detail and a strong passion for quality — experience architecting, designing, and developing high quality customer-facing softwareAbility to lead various aspects of the software development process, including user experience, prototyping, system architecture, APIsExperience working with multi-functional technical teams and excellent collaborative skills including written and verbal communicationExperience with macOS/iOS development and/or Objective-C and/or Swift preferredBS or MS or Ph.d in Computer Science or equivalent industry experience", "jobDescription": "The Proactive Experience team is looking for a software engineer to help make the iOS system experience more thoughtful, proactive and delightful. Our diverse and dedicated team of engineers uses privacy preserving on-device intelligence to drive new experiences on iOS, macOS, and watchOS that improve the lives of millions of Apple customers daily.\n\nAs part of the team you will be working on prototyping and shipping new experiences that will surprise & delight customers all over the world. Our team comprises of world class engineers with a broad range of backgrounds ranging from UI to ML. We work closely together on many levels of the OS stack and partner deeply with multi-functional teams in software and services to deliver intelligent experiences."}, "200437150": {"jobID": "200437150", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "HID-Haptics Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437150/hid-haptics-quality-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Engineering, Computer Science, or Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "1+ years of QE experienceStrong knowledge of validation strategiesExcellent written and verbal communication skillsStrong attention to detail and proven skill in bug hunting and regression testingExperience using hardware debugging tools – Oscilloscopes, Logic Analyzers, DAQsExperience with test automation using Python, Bash, Swift, or other scripting languagesExperience with and knowledge of embedded software/firmware architectureExperience with signal processing and data analysis in Matlab or other numerical computingenvironmentsExperience developing and deploying test automation tools and frameworksBS/MS in Computer Engineering, Computer Science, or Electrical Engineering", "jobDescription": "We are looking for a motivated, technical, and hard-working Quality Engineer to test and validate haptic firmware, software, and algorithms in next-generation Apple products including iPhone, Watch, Mac, and beyond. Quality Engineers at Apple play a direct role in upholding our standard for having the highest quality products in the world. Work collaboratively with developers and other industry leading haptic experts in a fast-paced, diverse team that never compromises when it comes to delivering a world class experience to millions of customers around the world."}, "200447729": {"jobID": "200447729", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447729/software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Advanced experience in Python & SwiftStrong fundamentals in one of C++, Java, or C languagesAdvanced experience in developing test automation systemsExperience with handling complete end-end Software lifecycle of software projects from requirements, design, development to maintenanceDeep understanding of Software engineering design methodologiesStrong experience in Object Oriented programming, database systems, data structures, big data and excellent debugging skillsProficiency in using Git repository & software integration toolsExperience with UNIX shell scriptingStrong Knowledge of working with different communication protocols like socket, GPIB, RS232, USB, UART and basics of Networking is a plusProficiency in UI/UX design and implementation is a plusBasic understanding of RF lab test equipment is a plusStrong written and verbal communication skillsBS with 3+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur team is looking for a passionate, self-motivated individual with strong in-depth knowledge of software methodologies to develop test automation infrastructures, tools and applications."}, "200396778": {"jobID": "200396778", "origin_search": null, "posted": "Jun 30, 2022", "jobTitle": "Test Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200396778/test-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MS or BS in Mechanical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Master's in Mechanical Engineering with  5+ yrs. mechanical system design experience (tool, fixture, mechatronics, electronics packaging, optics)or BS in Mechanical Engineering + 8 years of experience3D CAD experience required (NX, Solid works, Pro/E)Disciplined in drafting & GD&T practicesExperience with analysis: FEA, Tolerance stackup, Error budget, RCAKnowledge of manufacturing methods (precision machining, heat treatments etc.)Excellent written & verbal communication skillsMS or BS in Mechanical Engineering-  MS in Mechanical Engineering or equivalent experience-  10+ yrs. experience in equipment development ideally in mass production environments-  5+ yrs. experience in opto-mechanical design (camera\\optical mounts, kinematic mounts, compliant mechanism design)-  Experience in crafting stand-alone functional test stations ideally for consumer electronics products/modules-  Experience designing mechanical outlines for PCB, FPC, connectors etc.-  Experience in design of high precision mechanisms & motion control systems-  Experience in designing for low particle environments/cleanrooms-  Knowledge of machine/computer vision systems-  Knowledge of optical system integration, alignment and stability testing-  Knowledge of robotics, automation and wafer/DUT handling systems-  Programming knowledge", "jobDescription": "The PPO-Test team features a collaborative environment with highly creative, inquisitive people developing technologies and solutions to test display and sensing modules for various Apple products and new technologies. Our team features opportunities for individuals to contribute across a wide spectrum of subject areas and product lines. Partnering closely with product design team, and optics, electrical and software engineering to deliver outstanding products and ground breaking technologies!\n\nJoin us as a Mechanical Engineer owning the design, development and deployment of test systems for touch, sensing and display modules for mass production. The role involves working closely with the product design teams to support the entire gamut of Apple products and new technologies."}, "200451800": {"jobID": "200451800", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "IC Packaging Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451800/ic-packaging-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for an individual with experience working in the Semiconductor Packaging field.Knowledge in materials characterization and analysis.Ideal candidate will have proven understanding of Wafer Level Packaging, 2.5D packaging and 3D packaging technology.General understanding of packaging technologies, assembly processes, IC packaging materials, reliability standards, FA techniques, etc.Excellent interpersonal skills and has strong business partnership building and collaboration with multi-functional teams and overseas suppliers.Ability to work independently and orchestrate projects with minimum supervision.Solution-oriented engineer who has proven fundamentals in engineering physics.Shown capabilities using package design softwares, APD, Virtuoso, etc.Confirmed understanding in memory packaging.Good program management skills.BS and 10+ years of relevant industry experience.- BS and 10+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technology? Have a passion for creating amazing products? Our team is looking for a hardworking, IC Packaging Engineer with strong attention for details and love for excellence and precision to accomplish extraordinary results!\n\nIn this highly impactful role, you will initiate package concepts, own and drive sophisticated package selection, new product package structure and configuration optimization. You will be responsible for packaging integration and package technology development for a variety of projects including SoC."}, "200319371": {"jobID": "200319371", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "AIML - Software Engineer, Spotlight Search Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200319371/aiml-software-engineer-spotlight-search-infrastructure?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in a related field, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proficiency in C++Interest in low-level, high performance systemsStrong background in fundamental systems concepts such as multithreading, concurrency, memory management, persistent indexes, crash recovery, algorithms, data structures, system designStrong communication skillsBS or MS in a related field, or equivalent experienceExperience with systems (e.g., database internals, operating systems, file systems, or embedded systems) a plus, but not requiredExperience with text indexing and search systems a plus, but not requiredExperience with performance, memory or storage optimization a plus, but not requiredAbility to learn new technologies quicklyExcellent communication and teamwork skills", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great product, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe Apple AI/ML Information Intelligence team is building best-in-class, privacy-aware search experiences in Spotlight - the search engine on every iPhone and Mac. You will be part of the team that builds and optimizes the core systems that store, index and search user data on device in a secure, privacy-aware manner. You will partner with apps and other teams across Apple to redefine how users search. \n\nThe ideal candidate should be excited about building systems that are powerful enough to support a wide range of user experiences, and yet responsive and efficient enough to run on any device. The expected impact of your work will be to delight millions of Apple customers who rely on Apple devices for every aspect of daily life."}, "200442643": {"jobID": "200442643", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "AR/VR Graphics/Multimedia Processing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442643/ar-vr-graphics-multimedia-processing-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. or higher in Computer Science, Electrical Engineering OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Programming skills and knowledge of C/C++ and/or Objective-CGood understanding and comfort with 3D math, 3D geometry, graphics, and renderingExperience with shaders for real-time 3D rendering (e.g. Metal, OpenGL, etc)Excellent communication and collaboration skillsStrong problem solving and analytical thinking skillsA strong focus on end user experienceB.S. or higher in Computer Science, Electrical Engineering OR equivalent degree OR equivalent experienceExperience with developing state-of-the-art rendering methods is a plusFamiliarity with 6DoF video technologies and standards (VPCC, MIV) is a plusSuccess shipping media products involving image and video processing, video capture/playback, or media processing pipeline is a plusExperience with video compression technologies and standards is a plusFamiliarity with AR/VR technologies is helpful", "jobDescription": "The Technology Development Group (TDG) is working on exciting technologies, including ARKit and RealityKit to create ground-breaking new products. We are looking for a forward-thinking and skilled 3D graphics and multimedia engineer to build the next generation of multimedia technologies. Apply your passion, knowledge, and creativity to solve complex problems and architect software that powers exciting media experiences. As a member of our fast-paced group, you will have a uniquely rewarding opportunity to work with a fantastic team and create future products that will delight and inspire millions of Apple’s customers every day."}, "200363229": {"jobID": "200363229", "origin_search": null, "posted": "Mar 31, 2022", "jobTitle": "Jr. Software Developer (C/C++)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200363229/jr-software-developer-c-c?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Strong Software Engineering skills including design, programming (C, C++, script) and debuggingHighly motivated and self-directedExcellent debugging skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seeks to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degreeExperience with cellular protocol stacks 2G, 3G, LTE and 5G NR is a huge plus", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product. New grads encouraged to apply!"}, "200460816": {"jobID": "200460816", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Senior Media Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460816/senior-media-systems-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "* BS/BA in Computer Science/Engineering or equivalent is preferred\n* Equivalent or relevant field experience acceptable"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "10+ years of broadcast, streaming, and/or production/post-production experienceAbility to work collaboratively with multiple cross-functional teams to understand requirements and engineer highly performant implementationsAbility to summarize concepts and ideas into succinct, captivating proposals and documentationDeep understanding of media systems (cloud and data center infrastructure, networking, centralized storage, multi-OS platforms, etc.)Deep understanding of IP video and audio protocols and codecs such as SMPTE ST-2110, JPEG XS, SRT, NDI, Dante, Zixi, etc.Expert knowledge in developing, deploying, and scaling centralized and global media systemsExpert knowledge of video and audio signal flows, workflows, protocols, and codecsExperience in both hardware and software systemsExperience in cloud, data center , and facility design and development* BS/BA in Computer Science/Engineering or equivalent is preferred\n* Equivalent or relevant field experience acceptable", "jobDescription": "The Apple Media Products (AMP) Video team is searching for an experienced senior media systems engineer to help build large-scale systems and integrations, with a strong focus on scalability, performance, reliability, and resilience. You will join a hardworking and hands-on live streaming engineering team that fosters inclusivity, creativity, and pragmatism. We deliver highly available and performant solutions that power our best-in-class live streaming experiences across the Apple TV App ecosystem."}, "200450568": {"jobID": "200450568", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Performance Control Software Engineer - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450568/performance-control-software-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. in Computer Science or Electrical and Computer Engineering. M.S. preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Academic or practical experience with operating system design and implementationKernel software development experience in C or C++Knowledge of computer architecture and hardware performance monitoring instrumentation is desirable.Userland software development experience in environments such as C, C++ or Python is a plus.B.S. in Computer Science or Electrical and Computer Engineering.B.S. in Computer Science or Electrical and Computer Engineering. M.S. preferred", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people who work here have reinvented entire industries with all Apple Hardware products.  The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our multifaceted group, you will have the unique and phenomenal opportunity to craft upcoming products that will delight and inspire millions of Apple's customers every single day.\n\nPlatform Architecture is looking for a Performance Control Software Engineer to measure, analyze and control the relationship between power and performance in Apple’s most advanced systems. In this position, you will study the execution of workloads on Apple silicon across all Apple platforms and leverage that understanding to invent new operating system performance control features. You will design and conduct performance experiments, create instrumentation and data visualizations, prototype innovative in-kernel performance control algorithms, collaborate with teams ranging from the core operating system through user-facing applications, and productize the software that controls the performance of every workload executed on hundreds of millions of Apple products around the world."}, "200464588": {"jobID": "200464588", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Sr. RFIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464588/sr-rfic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Strong knowledge of RFIC circuit design. Direct tape-out experience with one or more of the following blocks: RF front-end circuits, PA, LNA, mixer, oscillator, PLL, LO, VGA, filter, ADC/DAC, TIA or other baseband analog blocks in deep sub-micron CMOS technology.Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability, and other analog impairments.Knowledge of CMOS device physics, RF device modeling, device noise parameters, inductor modeling, and circuit layout for optimum RF performance.Insights into packaging effects, supply isolation, and high frequency ESD strategies.Familiarity with various RF transceiver architectures and their trade-offs, as well as calibration methods used.Exposure with Cadence Virtuoso, Spectre RF, EMX and similar tools.Understanding of system specifications and ability to work with system architects to translate system requirement into circuit requirements at IC level.Experience in Si characterization and debug.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Wireless SoC Radio Team designs state-of-art highly energy efficient CMOS radios, from RF to bits. To deliver these radios, our team is responsible for the design of a wide range of RF, analog, and mixed-signal blocks from RF front-end amplifiers to data converters, including baseband filters, baseband and RF phase-locked loops, crystal oscillators, and bandgap references. We are working on new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an RFIC design engineer, you will be at the center of this wireless SoC design group. You will have a critical impact on developing Apple’s state-of-the-art radios and getting them into hundreds of millions of products."}, "200442905": {"jobID": "200442905", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "Senior Cloud DevOps Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442905/senior-cloud-devops-engineer-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "At least 8+ years hands-on experience in software development for cloud or infrastructure, using DevOps principles in a senior or lead role."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 8+ years hands-on experience in software development for cloud or infrastructure, using DevOps principles in a senior or lead roleExpertise in software development: clean and reliable code, API design, refactoring, test driven development, design patterns, abstractions, writing documentation, and the complete software development life-cycle. We use Python and Go, but it’s OK if your expertise is another languageExpertise in infrastructure-as-code tools such as Terraform or Pulumi, and continuous deployment pipelinesExpertise in AWS or GCP foundations including compute, networking, storage, and securityExperience architecting Kubernetes based systemsExperience designing cloud infrastructure for robustness, security, and observabilityExperience building and evolving code in large code-bases used by hundreds of developersProficient with using and debugging: networks, DNS, HTTP, TLS, load-balancing, build systems, Linux, and DockerStrong problem solving skills, critical thinking, and team collaborationAbility to propose projects, pre-empt problems with solutions, define and measure success metrics, and plan project road-mapsAt least 8+ years hands-on experience in software development for cloud or infrastructure, using DevOps principles in a senior or lead role.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmers. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmers that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \u2028\u2028Apple benefits programmers vary by country and are subject to eligibility requirements.\u2028\u2028Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "As an engineer in the Special Projects Group, you will be part of a team building infrastructure and tools for exciting new technologies that will shape the future. You will work in a startup-like environment where our autonomous systems are still being defined and developed, giving you the chance to influence some of the core tools used by the project. You will be part of every stage of development from concept to deployment.\n\nWe are looking for a motivated individual who is passionate about joining Apple's engineering team as a Senior Cloud DevOps Engineer. We are focused on autonomous technology that spans across numerous different technology disciplines. Our team wrangles a huge amount of cloud infrastructure. Your role is to build infrastructure-as-code software and other tools providing a foundation for cloud software teams to rapidly build large scale cloud systems. We bring together the latest cloud technologies, open source, and internal Apple platforms and architect solutions allowing them to work seamlessly together.\n\nDo you obsess about building elegant APIs that simplify complicated procedures and improve developer productivity? Do you enjoy making foundational changes that increase developer productivity and robustness of systems that benefit large sections of people across an organization? Do you envision and formulate solutions to infrastructure problems while thinking like a software developer? If so, you would fit right into our team and we can't wait for you to join us and help us grow."}, "200460871": {"jobID": "200460871", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Senior Data Analyst/Scientist - Input Experience Analytics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460871/senior-data-analyst-scientist-input-experience-analytics?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced degree in Data Science, Statistics, Informatics or other technical field. At least 5 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "3+ years of industry experience building data-driven solutions to solve business problems, especially around launching of new products and services.Ability to dive into the details on product features and underlying architecture in order to help define success criteria and the ways we can measure that via metrics and other approaches. This will involve close collaboration with the engineering teams that develop those features.Project leader and multitasking experience that can continuously move multiple cross-functional projects forward.Solid foundation in statistical analysis.Strong data-querying skills (SQL and/or Splunk, etc.), solid experience with big data, and familiarity with a scripting language for data processing and development (e.g., Python).Solid experience working with Tableau or other data visualization technologies and the ability to design striking and informative dashboards and reports.Ability to work cross-functionally with other Apple organizations including Marketing, Data Analytics, User Studies, Siri and application development teams.Excellent communication and presentations skills to naturally explain difficult technical topics for business partners and leaders to comprehend easily.Experience/interest in working across different global cultures and languages. Knowledge of other languages (e.g, Chinese, Japanese, Arabic) is a plus!Advanced degree in Data Science, Statistics, Informatics or other technical field. At least 5 years of industry experience.", "jobDescription": "At Apple, our goal is to provide an effortless input experience to everyone, no matter what languages they speak, across modalities, with world-class intelligence at the core. The Input Experience organization is directly responsible for keyboard and pencil input across multiple platforms. We also work very closely with the Siri speech team to seamlessly integrate dictation into our user’s text input.\n\nWe are looking for an experienced Data Analyst/Scientist to help us develop insights into how Apple customers experience our input technologies. This includes but is not limited to:\n\n-  Accuracy of our intelligent algorithms such as autocorrection and QuickPath.\n\n-  Usage of specific features including engagement\n\n-  Soft spots in our technology stack that might contribute to user frustration\n\nThese insights will be developed via a combination of metrics, A/B testing, user studies/surveys and other data-oriented approaches."}, "200463084": {"jobID": "200463084", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Software Engineering Manager - FaceTime Large Screen Experience", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463084/software-engineering-manager-facetime-large-screen-experience?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$260,000,"}, "benefits": null, "requirements": "You care about helping others grow in their careers at Apple.You have a history of hiring and mentoring a diverse team of engineers.You prioritize building an inclusive team culture where everyone can be heard and the best ideas are the ones we pursue.You have strong planning and execution skills.You have strong communication and collaboration skills.You have strong software engineering skills and can act as an arbitrator for tough technical debates.You aspire to take an Apple-wide perspective in making decisions.You have experience with UI development, Apple’s Human Interface Guidelines, API development, threading, data structures, performance, and battery life.You have an understanding of client-server driven architecture and protocol design for communicating devices.BS in Computer Science or equivalent", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.\n\nWe’re looking for a passionate software engineering manager to lead a team of software engineers who work on FaceTime, Phone, Voicemail, Emergency SOS, and more!\n\nOur mission: create the best way to have a conversation and share an experience when you can’t physically be with the most important people in your life.\n\nThis team has a duty to shape and drive the FaceTime product with a focus on larger screens (Mac and iPad). We fulfill our duty by caring deeply, living on our software, developing defensible opinions on what to keep / what to change, and having empathy for the countless users in the world who rely on us every day."}, "200404329": {"jobID": "200404329", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AR/VR Graphics/Multimedia Processing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200404329/ar-vr-graphics-multimedia-processing-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. or higher in Computer Science, Electrical Engineering OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Programming skills and knowledge of C/C++ and/or Objective-CGood understanding and comfort with 3D math, 3D geometry, graphics, and renderingExperience with shaders for real-time 3D rendering (e.g. Metal, OpenGL, etc)Excellent communication and collaboration skillsStrong problem solving and analytical thinking skillsA strong focus on end user experienceB.S. or higher in Computer Science, Electrical Engineering OR equivalent degree OR equivalent experience-  Experience with developing state-of-the-art rendering methods is a plus-  Familiarity with 6DoF video technologies and standards (VPCC, MIV) is a plus-  Success shipping media products involving image and video processing, video capture/playback, or media processing pipeline is a plus-  Experience with video compression technologies and standards is a plus-  Familiarity with AR/VR technologies is helpful", "jobDescription": "The Technology Development Group (TDG) is working on exciting technologies, including ARKit and RealityKit to create ground-breaking new products. We are looking for a forward-thinking and skilled 3D graphics and multimedia engineer to build the next generation of multimedia technologies. Apply your passion, knowledge, and creativity to solve complex problems and architect software that powers exciting media experiences. As a member of our fast-paced group, you will have a uniquely rewarding opportunity to work with a fantastic team and create future products that will delight and inspire millions of Apple’s customers every day."}, "200449333": {"jobID": "200449333", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Wireless System Engineer – Wireless Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449333/wireless-system-engineer-wireless-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS + 3 years of relevant industry experience is required.\n\nMS in Electrical Engineering or Computer Science/PhD is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands-on experience and knowledge of wireless systems and protocols such as LTE/WiFi/Bluetooth, and networking protocols like TCP/IP.Experience with transceiver algorithm designUnderstanding of RF and channel propagationSkilled in Software languages: C++/C, PythonPreferred knowledge of event driven simulatorsFamiliarity with version control toolsBS + 3 years of relevant industry experience is required.BS + 3 years of relevant industry experience is required.\n\nMS in Electrical Engineering or Computer Science/PhD is preferred.", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! Are you ready to join our Wireless Platform Architecture team?\n\nIn this role, you will be a key member of the platform architecture team involved in the development of wireless technologies at all layers through wireless system modeling and simulations.\n\nWireless technologies have become a crucial part of all Apple devices that delight our customers. Our devices operate in radio environments with various applications, using different wireless technologies. With the latest developments in cellular, WiFi, BT, etc. we utilize a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions. We are looking for an expert wireless systems engineer who has deep understanding of wireless protocol interactions within the network, interactions across different layers of wireless protocols, such as WiFi or BT, and interactions of different technologies within the same device. You will be responsible for modeling the network protocols as well as the effect of the wireless channel and RF interactions of different wireless technologies in the simulation platform. In addition, provide reference simulations and conducting particular studies using the simulation platform."}, "200346650": {"jobID": "200346650", "origin_search": null, "posted": "Feb 18, 2022", "jobTitle": "Test and Evaluation Engineer, Autonomous Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200346650/test-and-evaluation-engineer-autonomous-systems?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S, M.S., PhD in Robotics or Computer Science, or another related field.\nRelevant professional experience to the above qualifications. \nExperience in data analytics, visualization, and statistical methods is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "3+ years developing software towards production-level software/products & experience in system test, automation and root-cause analysisExperience developing automated test sets and evaluation systems.Experience defining requirements and design docs for new tools to increase testing capabilitiesExperience in at least two of: Robotic systems (particularly autonomous systems), Data Science and Cloud infrastructure.Experience with experimental design loops for integrated SW/HW systemsFamiliarity in continuous build, integration, test and delivery systems.Proficiency in Python and modern C++ (with experience in pipelines and workflows in Python),  Experience in Git (optional: Gerrit)Ability to collaborate cross-functionally to achieve project goalsNice to have: Experience developing automated HIL test sets and evaluation systems.B.S, M.S., PhD in Robotics or Computer Science, or another related field.\nRelevant professional experience to the above qualifications. \nExperience in data analytics, visualization, and statistical methods is preferred.", "jobDescription": "Contribute towards the development of bringing autonomous systems to the real world.We are looking for adaptive and skilled software engineers that enjoys solving and pivoting in various problem areas in the task of testing and evaluating product-level autonomous systems."}, "200464880": {"jobID": "200464880", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Senior Software Engineer - Apple Distributed Storage (Object Store)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464880/senior-software-engineer-apple-distributed-storage-object-store?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS or PhD in Computer Science (MS or PhD preferred), or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "A minimum of 8 years of experience building and operating software systemA minimum of 5 years of experience building and operating distributed systemsProven track record for building, launching and operating large-scale production internet servicesKnowledge of Java (or C#) and non-blocking and thread safe programmingKnowledge of distributed Storage, Distributed Databases, or similar mass-scale Distributed SystemsBS, MS or PhD in Computer Science (MS or PhD preferred), or equivalent experience.", "jobDescription": "The Apple Object Store is a massive scale storage system that provides the foundation of data storage across Apple. Durability, availability, and performance are crucial.\n\nWe are looking for a passionate Software Engineer with experience in developing large-scale services and infrastructure to take a central role in designing and building our next version. Join our friendly, collaborative, highly-motivated team!"}, "200451992": {"jobID": "200451992", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RF SoC Automation Tool Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451992/rf-soc-automation-tool-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong software/scripting skills with background in Wireless RF systems fundamentals.Solid experience of building software tools and scripting to perform RF parametric testing such as EVM, RX sensitivity, ACPR, blocker testing, etc.Unix/Linux scripting knowledge with objected oriented programming experience such as Python is a requirement.Strong working knowledge of test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Proficiency with basic metrics for determining quality of digital communication signals measured.BS + 10 years of relevant experience. MS preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nWe invite you to join us if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position! Individuals will work with PHY, MAC, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200366902": {"jobID": "200366902", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AR/VR Accessibility Frameworks Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200366902/ar-vr-accessibility-frameworks-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree with at least 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience writing AR/VR or iOS applicationsAptitude for independently learning new technologiesExcellent cross-functional and communication skillsExcitement to build software that makes a tangible difference in peoplesʼ lives!BS / MS in Computer Science OR equivalent degree with at least 3 years of experience• Knowledge of either UIKit or AppKit APIs.• Experience with at least one of the following languages and related development tools: ObjectiveC, Swift, C++, or C• Experience with assistive technologies is nice to have, but not required.• Experience using accessibility APIs on any platform is helpful, but not required.", "jobDescription": "The Technology Development Group is looking for an Accessibility Engineer to help us explore, define, and build accessibility solutions for the next generation of interactive computing for our platform. As a member of this team, you will have a unique opportunity to work with some of Apple's most advanced technologies (AR, VR, ML, CV) to help create empowering solutions for all users, regardless of their physical abilities."}, "200450711": {"jobID": "200450711", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450711/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE w/ 2+ years experience or Ph.D in EE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "At least 2 years of relevant industry experienceStrong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsMSEE w/ 2+ years experience or Ph.D in EE", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200409167": {"jobID": "200409167", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200409167/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE w/ 2+ years experience or Ph.D in EE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 2 years of relevant industry experienceStrong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsMSEE w/ 2+ years experience or Ph.D in EE", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200302955": {"jobID": "200302955", "origin_search": null, "posted": "Oct 19, 2021", "jobTitle": "Site Reliability Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200302955/site-reliability-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science/Computer Engineering (or equivalent experience)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "3+ years in managing Site Reliability Engineering teams and supporting mission critical applications5+ years managing large fleet of *nix systems3+ years of Hybrid Cloud (data center, AWS, GCP, Azure)5+ years with configuration management tools such as Ansible or Terraform2+ years of programming experience (preferably Python)2+ years of managing Relational and NoSQL Databases2+ years of building fully automated CI-CD pipelinesYou should also be self-directed, analytical, and work well in a team environment.BS/MS in Computer Science/Computer Engineering (or equivalent experience).", "jobDescription": "The Video Computer Vision organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video. We have contributed to the FaceID and FaceKit project in the past and more recently the new LIDAR iPad sensor. We are looking for the right Site Reliability Engineer to help us take our efforts to the next level.\n\nIn this role, you will be part of the core data infrastructure team for the Video Computer Vision organization. You will be a core contributor in our SRE team to develop and maintain a modern deployment system for cloud services and applications. You will be responsible for system bringup, deployment, reliability, security and service scalability. This role is highly multi-functional and you will work very closely with various highly skilled software development / ML teams developing cutting edge algorithms."}, "200461407": {"jobID": "200461407", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Original Content Engineering Program Manager - Apple TV Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461407/original-content-engineering-program-manager-apple-tv-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "A BS/MS in Computer Science, Engineering or similar technical field is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Able to work across multiple simultaneous projects in a dynamic environmentProven experience successfully collaborating with a diverse group of teams and individuals across numerous business functionsExcellent written and verbal communication; able to cater communications based on audienceExcellent public speaking and presentation skills along with acute attention to detail for executive briefings and status reportsKeen understanding of metadata and asset management systems related to TV show, movie production, and live eventsExtensive working experience with live event scheduling systems, encoding, HLS, and Live to VOD workflowsStrong desire and skills in soliciting requirements and translating this into effective project plans with comprehensive documentationUnderstanding of complex digital supply chains as it relates to pre/physical/post production, marketing, design, legal, engineering workflowsAbility to drive projects forward autonomously, and understand when to communicate important concepts and status to peers and leadership groupsAbility to assess bold priorities, and intuition on how to drive resolutionsA BS/MS in Computer Science, Engineering or similar technical field is preferredPreferred:Software development experienceProfessional training in project managementOperator experience with media management, delivery, and live event workflows", "jobDescription": "What happens when the world’s most innovative engineers and dedicated Program Managers collaborate with the world’s most creative storytellers? TV gets reinvented! Meet the Apple TV Services team, who created and manage the Apple TV app as well as tvOS, which redefined and refined the way people watch their favorite shows, movies, and live sports, and so much more.\n\nWe manage the critically acclaimed and award-winning Apple Originals in Apple TV+. The Apple TV Services team employ talent and tools to smoothly ingest and process a wide array of media assets. They work cross-functionally to handle video flow from content ingestion, playback, transcoding, live streaming, and virtually everything else it takes to make the experience as seamless as possible.\n\nIn this role, you’ll serve as an expert on Apple’s Original Content and Live Streaming media supply chain, leading projects with Apple’s engineering teams to improve the Apple TV product, customer experience, and internal efficiencies enabling it all. Join us to see what else is possible."}, "200397096": {"jobID": "200397096", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AR/VR Graphics/Multimedia Processing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200397096/ar-vr-graphics-multimedia-processing-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. or higher in Computer Science, Electrical Engineering OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Programming skills and knowledge of C/C++ and/or Objective-CGood understanding and comfort with 3D math, 3D geometry, graphics, and renderingExperience with shaders for real-time 3D rendering (e.g. Metal, OpenGL, etc)Excellent communication and collaboration skillsStrong problem solving and analytical thinking skillsA strong focus on end user experienceB.S. or higher in Computer Science, Electrical Engineering OR equivalent degree OR equivalent experience-  Experience with developing state-of-the-art rendering methods is a plus-  Familiarity with 6DoF video technologies and standards (VPCC, MIV) is a plus-  Success shipping media products involving image and video processing, video capture/playback, or media processing pipeline is a plus-  Experience with video compression technologies and standards is a plus-  Familiarity with AR/VR technologies is helpful", "jobDescription": "The Technology Development Group (TDG) is working on exciting technologies, including ARKit and RealityKit to create ground-breaking new products. We are looking for a forward-thinking and skilled 3D graphics and multimedia engineer to build the next generation of multimedia technologies. Apply your passion, knowledge, and creativity to solve complex problems and architect software that powers exciting media experiences. As a member of our fast-paced group, you will have a uniquely rewarding opportunity to work with a fantastic team and create future products that will delight and inspire millions of Apple’s customers every day."}, "200461014": {"jobID": "200461014", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Software Engineer (AR/VR Applications)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461014/software-engineer-ar-vr-applications?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong Computer Science fundamentals.Detail-oriented approach to solving problems and building new things.Excellent verbal and written communication skills.Excitement to be part of a fast-paced and diverse organization.Optional: Experience shipping applications or user-facing features on consumer platforms (mobile/web/gaming/etc.).Optional: Experience with Apple's development frameworks and technologies (Swift, ObjC, SwiftUI, UIKit, etc).Optional: Familiarity with 3D graphics APIs or game engines.Optional: Familiarity with AR technologies.Optional: 3D math/linear algebra fundamentals.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer to help us build cutting-edge applications for our next-generation interactive computing platforms. Imagine yourself building fundamental applications on top of Apple’s most advanced technologies, while developing your expertise in Augmented and Virtual Reality (AR/VR). \n\nAs a core member of our team, you will work closely with organizations across Apple (Human Interface, Frameworks, etc.) to design, architect, and implement apps that will delight, inspire, and empower millions of users!"}, "200427540": {"jobID": "200427540", "origin_search": null, "posted": "Oct 5, 2022", "jobTitle": "Frontend/ UI Engineer - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200427540/frontend-ui-engineer-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA in Computer Science/Engineering or equivalent is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "3+ years of experience in a professional software development positionProficient in JavaScript, Typescript, HTML, CSSExperience with a JavaScript framework like Angular, React, Vue, Backbone, Ember or equivalentExperience in front-end designStrong computer science fundamentals in design, data structures, and problem solvingPassion for building a rich and innovative user experienceStrong interpersonal and written communication skillsBS/BA in Computer Science/Engineering or equivalent is preferred.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple's long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a substantial scale, meeting Apple's high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\n\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple's outstanding integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep dedication to strengthening Apple's privacy policy, one of Apple's core values.\n\nAlthough services are a bigger part of Apple's business than ever before, these teams remain small, flexible, and cross-functional, offering greater exposure to the array of opportunities here. We are looking for an outstanding software engineer to join the Apple Universal Media team and help us build the next generation products that change the way millions of users consume video. As a Software Engineer at Apple, you will be owning key modules of the product and be responsible for delivering industry grade quality solutions. \n\nReady to make a difference?"}, "200381311": {"jobID": "200381311", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Design for Manufacturing (DFM) Engineer - PCBA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200381311/design-for-manufacturing-dfm-engineer-pcba?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A degree in an engineering discipline (mechanical, chemical, electrical or materials science) is desired and a strong, directly applicable background will be considered as well."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$190,000,"}, "benefits": null, "requirements": "The PCBA DFM Engineer or Technologist will have a deep level of creativity and curiosity about materials science and electronics packaging at all levels.2+ years of research or process development experience in an applicable field.Familiarity with the properties and process used in microelectronics fabrication and PCBA assembly.Aptitude to work with a multi-functional team to define requirements and suitable metrics for the performance of new products and process.Proven ability to self-manage and deliver results in a pure development role.Capability and willingness to travel frequently, i.e. >20%.A degree in an engineering discipline (mechanical, chemical, electrical or materials science) is desired and a strong, directly applicable background will be considered as well.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.   \n\nThe people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.  \n\nApple products are as beautiful on the inside as they are on the outside. Inside every one of our products, are some of the world's most challenging consumer PCBA and Flex designs. Imagine yourself as a select member of the team that brings these assemblies from concept to high volume manufacturing."}, "200466989": {"jobID": "200466989", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Director of Kernel Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466989/director-of-kernel-technologies?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS or greater in Computer Science or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$266,000", "max": "$425,000,"}, "benefits": null, "requirements": "10 years experience leading large, distributed teamsDeep understanding of systems software developmentPerformance and security emphasisStrong understanding of hardware design as it relates to operating systemsConsistent track record of successful and timely product deliveryEvidence of driving technical innovation-  BS or greater in Computer Science or equivalent experience/skills", "jobDescription": "The Core Darwin team in Software Engineering is looking for an exceptional experienced leader to drive our kernel teams at Apple. Our xnu kernel forms the foundation for all of Apple’s operating systems including iOS, macOS, watchOS, and tvOS. The kernel is key to the success of iPhone, iPad, Mac, watch, and home products lines. Our responsibilities include scaling from low power small core count wearables to high performance computing. We are the gatekeeper for system resources, the kernel’s security is paramount and pushes the envelope in industry consumer systems."}, "200458018": {"jobID": "200458018", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Health Studies Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458018/health-studies-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Experience as an Engineering Program Manager/Project Manager or Systems Engineering (integration) roleDirect experience developing, iterating, and tracking project plans with software-engineering teamsDirect experience collecting and organizing system requirements and translating to system integration/implementation requirementsUnderstands and deals well with rapid development cycles; remains flexible and calm in the face of uncertainty.Excellent communication, organizational and leadership skills; and detailed oriented mindset.Experience working and collaborating with internal hardware and software teams, driving contract negotiations, and troubleshooting legal hurdles.Self-motivated and enthusiastic with proven creative and critical thinking capabilities.Experienced in driving vendor negotiations, procurement and project execution.Well-versed in agile project management methodologies.Ability to grasp complex technical topics. Abstract key issues and risks into an actionable format for team members and executivesBS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products!\n\nApple is looking for an experienced Engineering Program Managers to work on Health Sensing initiatives. We are looking for Program Managers who can thrive in a dynamic workplace where both individual drive and team collaboration are the keys to success. This role includes working in multi-functional teams to define, schedule, track and communicate status of all work taking place within those teams. Facilitating communication between groups is essential!"}, "200352785": {"jobID": "200352785", "origin_search": null, "posted": "Mar 9, 2022", "jobTitle": "WiFi Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200352785/wifi-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Bachelor's degree in Computer Science or equivalent.Masters Degree is preferred.BA/BS in Computer Engineering, Computer Science, or equivalent experience.Solid knowledge of data structures and their applicationsExperience developing software using C/C+, Objective-C, or JavaStrong competence and experience in Layer 2, Layer 3 networking, QoSStrong analytical and problem-solving skills.Excellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while driving multiple projects across teamsObsessively passionate and inquisitive, and seek to tackle everyday problems in innovative waysPreferred Qualifications:Knowledge and experience of different LAN and WAN technologiesKnowledge of IEEE 802.11/WiFi Protocols.Experience developing software using embedded SDKs, frameworks and/or BSPs.Linux / Unix kernel networking stack knowledge and understanding of operating system fundamentals.Solid understanding of OO design principles and design patterns.Experience with hands-on development and troubleshooting on embedded targets. e.g., GDB, shell scripting, packet tracing (tcpdump, wireshark)Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred.", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience.\nAs part of the WiFi software development team, we make decisions that influence the connectivity experience on products people use every single day, across the world. Are you a software development enthusiast? Are you passionate about internet-enabled devices and networking protocols? Do you want to learn more about WiFi and other wireless technologies? If your answer is yes, we may have the job for you."}, "200435255": {"jobID": "200435255", "origin_search": null, "posted": "Oct 24, 2022", "jobTitle": "Core OS Display Driver Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435255/core-os-display-driver-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with writing and debugging complex drivers and related frameworksExperience with device driver developmentKnowledge of C and C++Demonstrated creative, critical thinking and troubleshooting skillsHighly professional, with the ability to deliver solid work on tight schedulesExcellent collaborative skillsStrong written and verbal communication skillsExperience with logic analyzers and oscilloscopesBS in Computer Science/Computer Engineering or equivalent experience/skillsAdditional Preferred Requirements (not required):AV technologies such as HDMI, DisplayPort, VGA, HDCP etcRemote control technologies such as Infrared(IR) and Consumer Electronics Control (CEC)Development experience in IOKit/macOS", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, integrated user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices!\n\nThe Core AV team in Core OS is responsible for device drivers and firmware for DP and HDMI displays. We are looking for talented individuals who enjoy creating device drives and working with FW."}, "200451117": {"jobID": "200451117", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "SoC Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451117/soc-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine, CA", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "We are looking for extensive technical background in one or more of the following:Strong embedded SW fundamentals, including knowledge of design and development flows, real-time constraints, concurrency, and multi-processor systems, caching and virtual memory.Familiarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management.Experience with configuration and release management, continuous integration, and regression testing.Strong understanding of design strategies for maintainability, scalability, and code reuse.Excellent communications skills – both written and oral.Bachelors Degree\n10 years of industry experiencePreferred Qualifications:Deep understanding of wireless systems, PHY layer operations, digital signal processing, Tx/Rx performance metrics.Experience in Wireless SoC firmware developmentExperience with WiFi, Bluetooth, or similar wireless technologies.", "jobDescription": "As a firmware engineer in the Wireless Connectivity Silicon team, we will be responsible for the design, development, and bringup of innovative wireless silicon for application in Apple’s products!"}, "200451097": {"jobID": "200451097", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "SoC Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451097/soc-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree \nMinimum 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "We are looking for an extensive technical background in one or more of the following:Strong embedded SW fundamentals, including knowledge of design and development flows, real-time constraints, concurrency, and multi-processor systems, caching and virtual memory.Familiarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management.Experience with configuration and release management, continuous integration, and regression testing.Strong understanding of design strategies for maintainability, scalability, and code reuse.Excellent communications skills – both written and oral.Bachelor's Degree \nMinimum 10 years of experiencePreferred Qualifications:Deep understanding of wireless systems, PHY layer operations, digital signal processing, Tx/Rx performance metrics.Experience in Wireless SoC firmware developmentExperience with WiFi, Bluetooth, or similar wireless technologies.", "jobDescription": "As a firmware engineer in the Wireless Connectivity Silicon team, we will be responsible for the design, development, and bringup of innovative wireless silicon for application in Apple’s products!"}, "200446350": {"jobID": "200446350", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "SoC Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446350/soc-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE \nMinimum of 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for an extensive technical background in one or more of the following:Strong embedded SW fundamentals, including knowledge of design and development flows, real-time constraints, concurrency, and multi-processor systems, caching and virtual memory.Familiarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management.Experience with configuration and release management, continuous integration, and regression testing.Strong understanding of design strategies for maintainability, scalability, and code reuse.Excellent communication skills – both written and oral.BSEE \nMinimum of 10 years of industry experiencePreferred Qualifications:Deep understanding of wireless systems, PHY layer operations, digital signal processing, Tx/Rx performance metrics.Experience in Wireless SoC firmware developmentExperience with WiFi, Bluetooth, or similar wireless technologies.", "jobDescription": "As a firmware engineer in the Wireless Connectivity Silicon team, we will be responsible for the design, development, and bringup of innovative wireless silicon for application in Apple’s products!"}, "200438062": {"jobID": "200438062", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "CoreOS Darwin Evolution Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438062/coreos-darwin-evolution-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent knowledge and experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Passion for low-level system technologiesFluency in the C programming languageExperience with UNIX-like systemsStrong understanding of operating systems architecture and systems programming fundamentalsExcellent collaborative skills, with the ability to work with a team to design system architectureFamiliarity with security principles and secure programming best practicesBS/MS in Computer Science or equivalent knowledge and experienceSuccessful candidates might also be:-  Knowledgable of Swift or Objective-C-  Experienced with system daemon or library development-  Skilled at interface and/or API design-  Fluent in a scripting language (e.g. python)-  Involved in open source technologies and development communities such as Darwin, FreeBSD, Linux, etc-  Familiar with OS-level packaging, distribution or build systems-  Familiar with Trusted Execution Environments or Confidential Computing", "jobDescription": "The Darwin Evolution team in Core OS is looking for enthusiastic engineers interested in developing system software for Apple’s operating systems. Darwin is the UNIX-like foundation at the heart of all Apple’s operating systems, stretching from the kernel up through low-level user components. The Darwin Evolution team is responsible for ensuring this foundation is adaptable for use in new products and environments. By creating an ecosystem of technologies used by a range of Apple’s product teams, the Darwin Evolution team has a critical role in enabling new products and experiences throughout Apple.\n\nThe ideal candidate should be self-motivated and effective in operating independently, with a desire to learn and develop technical leadership. Team members are welcome and encouraged to participate in design discussions, code reviews, and development across multiple technologies. The team is actively involved in defining OS architecture and design of cross-functional features that capitalize on Darwin technologies. Our environment fosters technical innovation, meaningful technology ownership, and a liberating amount of autonomy!"}, "200456371": {"jobID": "200456371", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Software Developer in Test - Storage Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456371/software-developer-in-test-storage-technologies?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Engineering/Computer Science/Electrical Engineering or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong hands on experience with QA methodologies, or prior QA experience.Experience with Python or ability to demonstrate that you can code in python based on your experience in other scripting languages.Knowledge of NAND flash and/or other non-volatile storage technologies or low level embedded technologies.Experience setting up Continuous Integration systems that support multiple projects.Strong analytical and problem solving skills with a meticulous attention to detail.Self learner, excellent interpersonal skills and ability to deliver work on tight deadline.Experience reporting and tracking bugs, solving complex problems & triaging issues (both hardware and software).Understanding of storage technologies like APFS or interfaces like PCIe, NVMe, SCSI etc is a plus.BS in Computer Engineering/Computer Science/Electrical Engineering or equivalent experience/skillsBe willing to travel (infrequently) to Cupertino as and when needed.", "jobDescription": "Apple’s Core OS group ensures the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience!\n\nJoin the Storage System Quality Engineering team responsible for ensuring the highest quality for storage technology at the heart of Apple products known to surprise and delight millions of customers by working on exciting new products. \n\nThe nature of the position requires the candidate to have excellent communication skills, strong technical and debugging skills, along with a drive to make a difference. You will be working in a fast paced environment, interacting directly with software development team and other QA teams cross functionally."}, "200461465": {"jobID": "200461465", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Embedded Software Engineer - Thermal Management", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461465/embedded-software-engineer-thermal-management?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent experience in related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proven experience in writing complex system software and embedded firmwarePassionate about designing effective algorithms, inspired by the analysis of big dataDemonstrated innovative, critical thinking and troubleshooting skillsHighly professional, with the ability to deliver solid work on tight schedulesExcellent collaborative skillsOutstanding written and verbal communicationKnowledge of C and C++BS/MS in Computer Science or equivalent experience in related field", "jobDescription": "What would it feel like to keep Apple products cool? Join the CoreOS Thermal Management team to find out! The Core OS Thermal Management Software Technologies group is looking for a hardworking software engineer to join the team designing and implementing thermal management control algorithms across all iOS, macOS, WatchOS and Apple TV products. Our environment fosters innovation and rapid product iteration within a creative solution space and the product of your work will have direct customer impact on the next generation of Apple products. If this describes you, we would love to hear from you! Our systems are ever more powerful and our industrial design requires our products to be controlled under extremely tight and state of the art thermal management. In this unique and highly visible role, working closely with system architecture teams, product design, system software, field diagnostics, and several other technology groups at Apple, you will develop and productize novel thermal management monitoring and control algorithms in embedded firmware and high level OS system software; seeking to invent a roadmap of scalable system thermal solutions with the amazing customer experience always in mind."}, "200393557": {"jobID": "200393557", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Media Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200393557/media-integrity-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Technical B.S. or equivalent professional experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$76,000", "max": "$146,900"}, "benefits": null, "requirements": "Strong interpersonal skillsProcess and detail orientedExceptional analytical skillsClear technical writerTechnical B.S. or equivalent professional experience", "jobDescription": "Audio and Media Technologies (AMT) is looking for a hardworking and detail oriented engineer to design and utilize processes for root cause investigations, debugging, and performance monitoring. Our team creates the technology that powers real-time audio and video communications features such as Group FaceTime, FaceTime, SideCar, Phone Continuity, HomeKit IP Cameras, Wifi-Calling / VoLTE, and RTT. We support iOS, macOS, watchOS, and tvOS."}, "200457325": {"jobID": "200457325", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Pixel Development Engineer - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457325/pixel-development-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. in Electrical or computer engineering or a similar discipline is required, M.S. or Ph.D. is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "You will have 5+ years of relevant experience in image sensor pixel and sensor development, sensor characterization, sensor bring up and debug, or wafer level testingFamiliar with image sensor technology, image sensor performance metrics, image sensor usage, and integration into camera systems.You will also be aware of general industry trends and technical challenges.Knowledgeable enough in all aspects of sensor usage that you can productively work with and support the camera team.Hands-on experience with silicon bringup, sensor characterization and issue debug. Ability to innovate and build new and unique solutions.Proficiency with data analysis tools (JMP, MATLAB, Excel, etc)Excellent written and verbal communication skills and solid teamwork and leadership skillsB.S. in Electrical or computer engineering or a similar discipline is required, M.S. or Ph.D. is preferred", "jobDescription": "Why Apple?\n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.\n\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\nThe Camera Hardware Engineering group is responsible for all research, design, development, test, and qualification of camera hardware for Apple products. As a key member of the Core Sensing Devices team, you will be responsible for image sensor evaluation from global suppliers, development of new image sensors for different applications, general problem solving, and implementation of new features. In this role, you will be at the center of image sensor development effort, and you will work with cross functional teams in many aspects of your daily activities."}, "200437686": {"jobID": "200437686", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "HID-Mac Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437686/hid-mac-quality-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Engineering, Computer Science, or Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "1+ years of QE experienceStrong knowledge of validation strategiesExcellent written and verbal communication skillsStrong attention to detail and proven skill in bug finding and regression testingExperience using hardware debugging tools (dev boards, oscilloscopes, logic analyzers, multimeters)Experience with test automation using Python, Bash, Swift, or other scripting languagesExperience with and knowledge of embedded software/firmware architectureExperience with signal processing and data analysis in Matlab or other numerical computing environmentsExperience developing and deploying test automation tools and frameworksBS/MS in Computer Engineering, Computer Science, or Electrical Engineering", "jobDescription": "We are looking for a motivated, technical, and passionate Quality Engineer to test and validate firmware, software, and algorithms for the industry-leading Force Touch trackpad and Magic Keyboard in next generation MacBooks. Quality Engineers at Apple play a direct role in upholding our standard for having the highest quality products in the world. Work collaboratively with firmware and software developers who are sensing and haptics experts in a fast-paced, dynamic team that never compromises when it comes to delivering a world class experience to millions of customers around the world."}, "200241149": {"jobID": "200241149", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch Sensing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200241149/iphone-touch-sensing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. in Electrical Engineering +10 years of industry experience \nM.S. in Electrical Engineering + 13 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Fundamental knowledge of sensor physics, analog analysis, circuit design, linear algebra and statistics.Experience with sensor and systems integration preferred.Hands-on experience in system-level design, architecture, characterization and validation.Attention to detail with proven collaboration and leadership skills.Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams.Proficiency in MATLAB, SPICE, or similar simulation and modeling tools.Excellent written and verbal communication skills and solid teamwork.Experience with high-volume mass production is a plus.Ph.D. in Electrical Engineering +10 years of industry experience \nM.S. in Electrical Engineering + 13 years of industry experience.", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including EE, Math, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200241152": {"jobID": "200241152", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch Sensing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200241152/iphone-touch-sensing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Ph.D. in Electrical Engineering or equivalent experience, Masters degree in Electrical Engineering + 3 years of industry experience or, Bachelors degree in Electrical Engineering + 5 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Fundamental knowledge of sensor physics, analog analysis, circuit design, linear algebra and statistics.Experience with sensor and systems integration preferred.Hands-on experience in system-level design, architecture, characterization and validation.Attention to detail with proven collaboration and leadership skills.Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams.Proficiency in MATLAB, SPICE, or similar simulation and modeling tools.Excellent written and verbal communication skills and solid teamwork.Experience with high-volume mass production is a plus.Ph.D. in Electrical Engineering or equivalent experience, Masters degree in Electrical Engineering + 3 years of industry experience or, Bachelors degree in Electrical Engineering + 5 years of industry experience.", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including EE, Math, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200241151": {"jobID": "200241151", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch Sensing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200241151/iphone-touch-sensing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Ph.D. in Electrical Engineering or equivalent experience, Masters degree in Electrical Engineering + 3 years of industry experience or, Bachelors degree in Electrical Engineering + 5 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Fundamental knowledge of sensor physics, analog analysis, circuit design, linear algebra and statistics.Experience with sensor and systems integration preferred.Hands-on experience in system-level design, architecture, characterization and validation.Attention to detail with proven collaboration and leadership skills.Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams.Proficiency in MATLAB, SPICE, or similar simulation and modeling tools.Excellent written and verbal communication skills and solid teamwork.Experience with high-volume mass production is a plus.Ph.D. in Electrical Engineering or equivalent experience, Masters degree in Electrical Engineering + 3 years of industry experience or, Bachelors degree in Electrical Engineering + 5 years of industry experience.", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including EE, Math, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200213021": {"jobID": "200213021", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200213021/ar-vr-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "At least 2 years of relevant industry experience with the following:Programming skills and knowledge of C++Proficient in mathematics for 3D games (linear algebra)Excellent communication and collaboration skillsBS/MS in Computer Science OR equivalent degree OR equivalent experience-  iOS CPU/GPU architecture-  Experience writing optimized code using e.g. profiling tools, assembly, SIMD, compute, etc-  Familiarity with macOS and UnixApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programmes vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR Software Development Engineer to help us push the limits on the next generation of interactive experiences on our platform. This team is working with some of Apple’s most advanced technologies including augmented reality (AR) and virtual reality (VR) offered in ARKit and Metal 2. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day."}, "200451039": {"jobID": "200451039", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451039/silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS+ 3 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in the areas of system validation and ASIC design validation.Proven experience with design, simulation, debug, and performance analysis of high-speed digital ICs.Strong bringup and debugging skills and hands-on lab work. Experience with complex test equipment setups.Expertise in software automation skills in Python.Strong technical background in FPGA prototype emulation, and debug.Silicon validation, failure analysis and debug expertise.Design with RTL coding in Verilog is a must.Good knowledge of validating system level designs based on embedded processors and peripherals, such as; SPI, I2C, UART, JTAG, PCIe.Prior hands-on automation script development and optimization (using C, Python).Well versed in the usage of advanced lab equipment (scopes, BERTs, programmable power supplies, spectrum analyzer, etc).Shown analytical and problem-solving abilities.Knowledge and experience in embedded firmware development is big plus.Knowledge of one or more of wireless technologies like Thread, WLAN, UWB, Bluetooth is desirable.BS+ 3 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nApple is looking for qualified, motivated silicon validation engineers. You will be working as part of a team doing pre/post-silicon bring- up, debug, and validation of wireless sub-systems.\n\nThis position is for a senior engineer with experience in system validation, who understands that the tight interaction between pre-silicon design and post-silicon validation is the key to shipping quality products. In this role, you will work closely with both IC design teams, FPGA emulation teams as well as firmware and system teams within Apple as we drive execution from first silicon through to mass-production release. \n\nYou will be expected to participate in all levels of this process, including the definition of custom board-level hardware for IC bring-up and test, defining and executing validation plans, and working with module and system teams to support their design integration and debug of system-level issues."}, "200422226": {"jobID": "200422226", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Partner Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200422226/partner-engineering?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Computer science fundamentals, specifically with operating systemsProgramming language skills (pointers, memory management, algorithms) or language skills C, Objective C, or C++Good practical experience in debugging and debugging toolsExcellent interpersonal skills are a requirement due to the high level of interaction with internal and external engineering teams & managementCreative thinker and problem solver with meticulous attention to detailHardworking, inquisitive, and seeks to tackle everyday problems in innovative ways-  Experience in macOS or iOS programming at the application and framework levels a strong plus-  Experience with platform-specific debugging tools (lldb, dtrace, etc.) a plus-  Interest or experience in understanding power & performance problems a plus", "jobDescription": "Do you flourish with variety, collaboration, and facilitating solutions to hard software engineering challenges? Are you looking to continually apply the standard processes of your craft with peers from multiple areas of Software Development across multiple internal and external partners? Partner Engineering is a role passionate about improving our software ecosystem. Some of the ways it may be improved is by working closely with our partner external software developers, to help them land technology transitions and stay modern with platform standard processes. You will listen to their requirements, goals and enhancement requests then translate those into improvements in our own APIs or features when applicable. You will work with our internal teams to understand what’s needed of our external partners as we develop new technologies and products, and then work with those partners to find the most efficient way to meet those needs. Most meaningfully, you will learn on the job from the most creative, adding your own intensity as you grow with the team."}, "200438208": {"jobID": "200438208", "origin_search": null, "posted": "Oct 26, 2022", "jobTitle": "Cellular Software Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438208/cellular-software-engineering-program-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE/CS/CE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "At least 5+ years of program management experience in wireless software, system and platform's development.Good Understanding of cellular communications technologies (5G-NR/4G LTE/ UMTS/GSM/CDMA) is a significant plus.Driving multi-functional efforts across major technical fields: SW, HW, Silicon, and QA.Outstanding communication and presentation skills to engineers, managers, and execs.Identifying risks, developing mitigation strategies, and facilitating resolutions.Sound technical foundation and a highly motivated self-starter.Knowledge of software engineering standard methodologies and related dependencies.Strong leadership skills and ability to inspire team members.BS/MS EE/CS/CE or equivalent", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are targeting will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.   As a Software EPM, you will get a front row seat to deliver the best experience to our users. You will need experience with software development fundamentals, proven leadership capabilities, excellent communication skills, and a desire to work with an amazing engineering team to develop ground-breaking initiatives in the cellular software space.  If you relish responsibility and are excited by the opportunity to build products that delight millions of customers then we want to hear from you - please apply!"}, "200441447": {"jobID": "200441447", "origin_search": null, "posted": "Nov 2, 2022", "jobTitle": "Cellular Software Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441447/cellular-software-engineering-program-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "At least 5+ years of program management experience in wireless software, system and platform's development.Good Understanding of cellular communications technologies (5G-NR/4G LTE/ UMTS/GSM/CDMA) is a significant plus.Driving multi-functional efforts across major technical fields: SW, HW, Silicon, and QA.Outstanding communication and presentation skills to engineers, managers, and execs.Identifying risks, developing mitigation strategies, and facilitating resolutions.Sound technical foundation and a highly motivated self-starter.Knowledge of software engineering standard methodologies and related dependencies.Strong leadership skills and ability to inspire team members.BS in Computer Science or related field, preferred.", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are targeting will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. As a Software EPM, you will get a front row seat to deliver the best experience to our users. You will need experience with software development fundamentals, proven leadership capabilities, excellent communication skills, and a desire to work with an amazing engineering team to develop ground-breaking initiatives in the cellular software space. If you relish responsibility and are excited by the opportunity to build products that delight millions of customers then we want to hear from you - please apply!"}, "200342085": {"jobID": "200342085", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "System Engineering Program Manager (EPM) - Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200342085/system-engineering-program-manager-epm-technology-development-group-tdg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "EducationBS/MS CE/EE/ME or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Understanding of consumer electronics system architecture.Demonstrated ability to work through system-level development tradeoffs.Developed skills for planning and executing development in advanced consumer electronics products - both prototype build events and overall product planning.Strong technical background in Electrical, Mechanical, or Software Engineering.7+ yrs of relevant hardware engineering experience in consumer electronics.5+ yrs of project management experience.Proactive and highly self-motivated; good critical thinking capabilities and strong attention to detail.Ability to operate well in an environment with rapid development cycles and constant change.Experience as primary point of contact with vendors and CM partners to establish a daily build plan, provide clear direction and guidance to meet the program and build objectives.Willingness to travel internationally to support development builds.EducationBS/MS CE/EE/ME or equivalent work experience", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for an experienced, highly technical EPM to join the team driving definition and development of a new product category. If you have broad experience across various key hardware technologies (e.g displays, cameras, RF, custom silicon), a strong product/customer focus, experience guiding complex programs through the development process, and the ability to distill tradeoffs down to key factors and drive critical product decisions we’d love to hear from you!!!"}}