{"200446431": {"jobID": "200446431", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "AIML - Head of Data Engineering, Data & Machine Learning Innovation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446431/aiml-head-of-data-engineering-data-machine-learning-innovation?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors or Master in CS, Engineering, Math, Statistics, or a related field, or equivalent practical experience in engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$229,000", "max": "$378,000,"}, "benefits": null, "requirements": "10 years in a managerial role, growing and scaling organizationsExperience in multiple large-scale data processing systems, data telemetry, data-driven performance and reliability improvement across platforms and products, the data foundation for advanced machine learning problems, and data/analytics.Demonstrated passion and leadership in data engineering, data-informed product development, building and shaping data cultureProven ability to proactively drive a data engineering agenda and prioritize work based on impact and strategic investmentExperience with modern data engineering stack, processing technologies, data, and analytic pipelines, including batch (Spark, others), streaming systems (Flink, etc.), and scalable query engines (e.g. Trino, Druid, Pinot, etc.)Solid understanding of both relational and NoSQL database technologies and experience in engineering datasets and metrics out of massive and complex dataExpertise in data engineering partnering with analytics and ML teams (comprised of data scientists and statisticians) to enable horizontal and vertical use casesDemonstrated ability to establish strong partnerships and drive processes across organizations, e.g. to manage the creation, processing, and use of instrumentation to enable using data impactfully in developing productsOutstanding communication and presentation skills, written and verbal, to all levels of an organizationBachelors or Master in CS, Engineering, Math, Statistics, or a related field, or equivalent practical experience in engineering", "jobDescription": "Are you passionate about data, data quality, efficiency, and scale?  Would you like to play a critical part in accelerating data-informed product development to drive innovations and amazing user experiences?\n\nAs the Head of Data Engineering, you and your team will be responsible for the crucial role of designing, operating, and supporting the increasingly complex environments that power modern data analytics and machine learning use cases for Apple products such as Siri, Dictation, Translations, Apple Search and others.\n\nYou will partner closely with cross-functional teams and be responsible for the planning, execution, and success of technical projects as well as help drive scalable practices to accelerate the evolution of our products. You will lead existing data resources, build new datasets and data pipelines, and implement new technologies and tools to enable rigorous scalable science and analytics, and data-informed product development. Your team and vision will enable data to inform product engineering teams at scale, with the ultimate purpose of improving the product experience for Apple users across hardware, software, and services, while preserving Apple’s privacy values. You will drive a strong culture of data excellence!"}, "200355128": {"jobID": "200355128", "origin_search": null, "posted": "Mar 15, 2022", "jobTitle": "Neural Rendering ML Engineer, Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200355128/neural-rendering-ml-engineer-technology-development-group-tdg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS or PhD in computer vision, machine learning, computer science, computer engineering or 2+ years of relevant industry experience with a track record of successful projects"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong experience in Python and science libraries like Numpy, Pandas, Matplotlib.Strong experience in 3D computer vision and rendering algorithms including shading and lighting.Experience with one or more deep learning framework such as Tensorflow, PyTorch or Keras.Expert knowledge of the principles, algorithms, and tools of deep learning, including models, training strategies, training dataset building, cost functions, quality metrics, etc.Experience in applying machine learning towards rendering, preferably multiple projects with different techniques.Publication record in ML conferences is a plus.Experience rendering photo-real digital humans is a plus.Excellent communication and collaboration skills.Excellent problem solving and analytical thinking skills.Track record of successfully building and shipping products or open source projects.Creativity and curiosity for solving highly complex problems.BS, MS or PhD in computer vision, machine learning, computer science, computer engineering or 2+ years of relevant industry experience with a track record of successful projects", "jobDescription": "Do you want to push the limits of the best Augmented Reality platform in the world? Apple's Technology Development Group (TDG) delivers algorithms that drive revolutionary Apple products, including the augmented reality (AR) platform ARKit to create ground-breaking new products. In this position, you will have the opportunity to be part of our extraordinary team of computer vision and deep learning researchers and engineers to discover and build solutions to previously-unsolved challenges and push the state of the art in AR algorithms that will change the way people experience the world! \n\nAs part of Apple’s Technology Development Group (TDG), the Neural Rendering ML Engineer will work in a small and dynamic team to solve 3D rendering problems for AR applications. As a member of a fast-paced team, you have the unique and rewarding opportunity to work on upcoming releases of Apple products that delight and inspire millions of people every day! We invite you to contribute to our current Augmented Reality platform and craft the future of this technology.\n\nTo succeed within this role, you should have shown experience in several of the following areas:"}, "200433746": {"jobID": "200433746", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Data Collection/Machine Learning Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200433746/data-collection-machine-learning-lead?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in Computer Science, Computer Engineering, or equivalent practical experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "To succeed within this role, you should have shown experience in several of the following areas:Ability to define/design/develop data collection efforts that focus on the end-to-end user experience, including anticipating potential failure modes, edge cases, and anomaliesHave skills in finding patterns in data, identifying targets for performance, and applying modern statistical and ML-based methods to model data distributions for reducing redundancy and detecting and addressing out-of-distribution samplesYou are self-motivated and curious with demonstrated creative and critical thinking capabilities and an innate drive to improve how things workYou have a high tolerance for ambiguity. You find a way through. You anticipate. You connect and synthesize!Excellent verbal and written communications skills and experience in influencing decisions with informationExtensive knowledge in machine learning and deep learning techniquesProficiency in programming languages including Python, C++, or similarProficiency in at least one major machine learning framework such as PyTorch, Jax, or TensorflowPrior experience with large data sets using technologies like Hadoop, Hive, and Spark is a plusPrior experience with analytical tools  is a plusM.S. or Ph.D. in Computer Science, Computer Engineering, or equivalent practical experience", "jobDescription": "Apple's Video Engineering team (VE) delivers CVML based algorithms for ground breaking features such as augmented reality (AR), Cinematic Video, RoomPlan, FaceID and Animoji. All of these features depend on high quality data collection, data understanding, and data curation. In this position, you will use modern techniques in Deep Learning to enable such high-quality on-device algorithms.  You will work on the design of data collection protocols, analysis and curation of collected data, creation of ML-based Core Datasets, and closing the feedback loop between trained model performance and new dataset requirements.  Your goal is to help bridge the gap from “it works” to “it's magical”.  As a member of the fast-paced algorithm development team, you will have the rewarding opportunity to shape upcoming products that will delight and inspire millions of people every day."}, "200389050": {"jobID": "200389050", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Machine Learning / AI Internship", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200389050/machine-learning-ai-internship?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We typically look for talent with a background in computer science, engineering, applied mathematics, or major equivalentExpertise with Machine Learning or Natural Language Processing (NLP), ideally in one or more of these areas: Natural Language Understanding (NLU), Natural Language Generation (NLG), Structured Prediction, Unsupervised Learning & Representation Learning, Text-to-Speech (TTS) or Question AnsweringPythonML libraries like TensorFlow, PyTorch, etc.Our aim is to create an experience that allows you to learn without pressure, gain practical skills, build real world experience, develop a greater understanding of our industry and form valuable connections.You will join an extraordinary team, including world-class software engineers and leading machine learning practitioners who are all passionate about applying groundbreaking techniques to AI.We will partner you with a dedicated mentor who is an authority in your specialist area. You and your mentor will collaborate to design and implement an innovative solution for an ML or NLP problem that is meaningful. At the end of your internship, you will have the opportunity to meet and present your work to the AIML leadership. Where appropriate, there may be the ability to submit your work for publication at a suitable conference.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "As part of Apple's Artificial Intelligence and Machine Learning (AIML) team, we transform every Apple product and because we fully integrate hardware and software, we can collaborate to deliver amazing experiences while protecting user data. \nWe are offering amazing internship opportunities to work directly with our R&D teams in the AIML organization including:\n\t- Siri\n\t- Platform Technology\n\t- Research\n\t- Data\n        - Program Management\n\nCollaborate with some of the best in the business and see how we create the world's most innovative products and experiences."}, "200438130": {"jobID": "200438130", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Senior Software Engineer - Device and Software Analytics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438130/senior-software-engineer-device-and-software-analytics?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor of Science in Computer Science or relevant work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in designing and building OS level software with its concomittant contraints and requirements.Expert level experience with one of the following languages and related development tools: C++, Objective-C, Swift.Excellent communication skills and ability to collaborate effectively across multiple business and technical teams.Excellent problem solving, critical thinking, and interpersonal skillsProven ability to work under pressure while maintaining a high level of quality and professionalism.Bachelor of Science in Computer Science or relevant work experienceStrong systems software design skillsExperience mentoring junior engineers", "jobDescription": "How are Apple devices used and how can they be improved? What kinds of problems do our users experience? These are the kinds of questions the Software Engineering Data Analytics org answers. We are looking for an Senior Software Engineer to join us in developing our OS data collection tools, daemons and services.  The ideal candidate will be someone experienced in developing embedded systems software with an interest in data collection techniques. \n\nSWE Data Analytics collects, stores, and analyzes diagnostics and usage data from Apple devices across the world, always keeping user privacy at the forefront. Our data is used to generate insights that inform and drive product strategies across all of software and hardware development.\n\nWe develop and operate a variety of on device software and Big Data products and applications in support of these goals. These systems process multiple petabytes and tens of billions of messages per day across many different data types."}, "200356668": {"jobID": "200356668", "origin_search": null, "posted": "Mar 15, 2022", "jobTitle": "ML Optimization and Infrastructure Engineer, Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200356668/ml-optimization-and-infrastructure-engineer-technology-development-group-tdg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS or PhD in computer vision, machine learning, computer science, computer engineering or 2+ years of relevant industry experience with a track record of successful projects"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience of ML model deployment on resource constrained HWProficient in one or more ML frameworks, such as Tensorflow or PytorchExperience with ML training platform and infrastructure developmentStrong software engineering skills in software design, development, and shipping production quality codeProficiency in C/C++Familiarity with PythonFamiliarity with ML HW acceleratorsFamiliarity with software benchmarking, performance analysisBS, MS or PhD in computer vision, machine learning, computer science, computer engineering or 2+ years of relevant industry experience with a track record of successful projects", "jobDescription": "Do you want to push the limits of the best Augmented Reality platform in the world? Apple's Technology Development Group (TDG) delivers algorithms that drive revolutionary Apple products, including the augmented reality (AR) platform ARKit to create ground-breaking new products. In this position, you will have the opportunity to be part of our extraordinary team of computer vision and deep learning researchers and engineers to discover and build solutions to previously-unsolved challenges and push the state of the art in AR algorithms that will change the way people experience the world! \n\nAs part of Apple’s Technology Development Group (TDG), the ML Optimization and Infrastructure Engineer will work in a dynamic team to design infrastructure to optimize ML algorithms and implement them into software frameworks. As a member of a fast-paced team, you have the unique and rewarding opportunity to work on upcoming releases of Apple products that delight and inspire millions of people every day! We invite you to contribute to our current Augmented Reality platform and craft the future of this technology.\n\nTo succeed within this role, you should have shown experience in several of the following areas:"}, "200418064": {"jobID": "200418064", "origin_search": null, "posted": "Sep 1, 2022", "jobTitle": "Machine Learning Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200418064/machine-learning-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "-  MS or Ph.D in computer vision, machine learning, computer science or equivalent proven experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Excellent knowledge and good practical skills in ML and CV algorithms.Skilled in deep learning fields, such as image classification, recognition, object detection, segmentation, OCR.Knowledge and experience on processing sequential data, such as audio and video.Practical understanding of the mathematics behind modern machine learning, linear algebra, and statistics.Good publication record in machine learning/deep learning/computer vision desirable.Knowledge and experience with popular deep learning frameworks (e.g. Pytorch, Tensorflow, Keras, Caffe).Strong programming and debugging skills in: Python, C/C++, or equivalent.Experience in collaborating with infrastructure engineers to deliver final products or services.You have confirmed understanding on infrastructure, database, and ML services.You bring passion and dedication to your job and are committed to our vision.-  MS or Ph.D in computer vision, machine learning, computer science or equivalent proven experience.-  5 years ML related work experience with MS degree; 3 years ML related work experience with Ph.D degree.", "jobDescription": "Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to build a career. We invite you to join our mission in building and redefining Music/Podcasts/Movies/TV Shows. Apple is critically invested in the success of its mobile ecosystem. Music/Podcasts/Movies/TV Shows is a core asset that is at the crux of this ecosystem.\n\n Our team operates at the intersection of building highly scalable applications, analytics to understand data content and big data machine learning to improve the quality of the ecosystem. Be ready to make something phenomenal when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. \n\nThe same passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join the Apple data platform team if you want to help deliver the next amazing Apple product. Although services are a bigger part of Apple’s business than ever before, these teams remain small, forward-thinking, and multi-functional, offering greater exposure to the array of opportunities here."}, "200457329": {"jobID": "200457329", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "AR/VR Software Engineer - Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457329/ar-vr-software-engineer-technology-development-group-tdg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "M.Sc. or B.Sc. degree in Computer Science or similar, alternatively a comparable industry career with a consistent track record of successful projects."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Passionate about Augmented RealityPassionate about working with hardware architecturesGreat interest or background in Computer Vision and/or Machine LearningSolid fundamentals in Linear AlgebraStrong proficiency in C/C++Performance and optimization orientedSelf-motivated and great teammateM.Sc. or B.Sc. degree in Computer Science or similar, alternatively a comparable industry career with a consistent track record of successful projects.", "jobDescription": "The Technology Development Group (TDG) is looking for help to drive breakthrough developments in machine learning and computer vision problems. We are on the lookout for people who are experienced in working on shipping products to help power future revolutionary Apple devices. Now is a great opportunity for you to get into computer vision using state of the art techniques, demonstrating your knowledge profiling performance and optimizing applications in the Apple ecosystem. Your role will be as a driven and dedicated applied algorithms engineer with a technical skillset in computer graphics and/or vision. Come help with hands-on work in a small innovative team and be part of building the next big thing."}, "200464508": {"jobID": "200464508", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "AIML - Machine Learning Engineer, Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464508/aiml-machine-learning-engineer-siri-and-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "- Masters/PhD in Machine learning, NLP, Statistics, Computer Science or related field with a strong academic track record OR - Bachelors in Computer Science or related field with a strong academic track record and 2+ years of industry experience working on Applied ML/NLP/Search Ranking problems."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "* Academic / Proven experience in NLP and Machine Learning, or similar experience in developing language technologies for shipping products.* Strong coding and software engineering skills in a mainstream programming language, such as Python, Go, C/C++.* Familiarity with NLP/ML tools and packages like TensorFlow, pyTorch etc.* Practical experience building production quality applications related to natural language processing and machine learning.* In-depth knowledge of machine learning algorithms and ability to apply them in data driven natural language processing systems.* Ability to quickly prototype ideas / solutions, perform critical analysis, and use creative approaches for solving complex problems.* Ability to collaborate closely with multi-functional teams* Clear oral and written communication- Masters/PhD in Machine learning, NLP, Statistics, Computer Science or related field with a strong academic track record OR - Bachelors in Computer Science or related field with a strong academic track record and 2+ years of industry experience working on Applied ML/NLP/Search Ranking problems.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "We are looking for engineers with a passion for using machine learning to create intelligent applications. In this highly accomplished, deeply technical and close-knit team machine learning specialists, software engineers and infra experts, you will create products that are used by millions of people. You will design and implement new machine learning algorithms and techniques and collaborate with the most innovative product development teams in the world. Our team researches new machine learning algorithms, models and techniques that will power amazingly intelligent user experiences. We want new ambitious team members to join our research ML group. In this role, we create new models and algorithms for some of the most results-oriented problems in NLP and machine learning. We build groundbreaking natural language understanding technologies and deploy them on a global scale. You will also have the opportunity to contribute to cool projects around Apple, and use your data science, machine learning and analytical skills to transfer your ideas into solutions for some of the most challenging technical problems in the next generation of products that will delight millions of people."}, "200442575": {"jobID": "200442575", "origin_search": null, "posted": "Nov 10, 2022", "jobTitle": "Synthetic Data Content Producer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442575/synthetic-data-content-producer-simulation?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree and minimum of 10 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "10+ years of experience working on game development, computer graphics, visual effects projectsExperience working with art vendors; establishing requirements, guiding delivery, and evaluating creative workProficiency with 3D design tools such as Maya and BlenderProficiency with software scripting tools to automate common computer graphics workflowsExperience with Unreal Engine, Unity, or another common game engineExcellent written and oral skills; highly organized and detail orientedExcellent multi-functional collaboration skills: demonstrated ability to work across an organization with algorithm designs, verification engineers, and other technical departments.Bachelor’s Degree and minimum of 10 years of relevant industry experience.", "jobDescription": "Apple’s Special Project Group is seeking a Synthetic Data Content Producer to help advance state-of-the-art simulation for autonomous technologies. You will directly play a role in integrating 3D content into the core of our simulation efforts. Your work will advance our ability to develop, test, and verify mobile autonomous systems."}, "200425943": {"jobID": "200425943", "origin_search": null, "posted": "Sep 16, 2022", "jobTitle": "Robotics Software Engineer, Autonomous Systems - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425943/robotics-software-engineer-autonomous-systems-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.Sc., or Ph.D. in computer science, engineering, or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Background in any of the following areas: behavior planning/decision-making, predictions, machine learning, motion planning (sampling, search based planning, optimization), estimation, control, and/or high-performance real-time algorithms.Experience programming autonomous robots, modeling multi-agent systems, and developing algorithms for them.Strong C++ and/or Python development skills.Solid understanding of advanced algorithms and data structures.2+ years of professional or equivalent experience.You must be hands-on, eager, curious and never satisfied with the status quo.You must love learning and being challenged.M.Sc., or Ph.D. in computer science, engineering, or equivalent professional experience.Preferred Experience:• Designed one or more machine-learned approaches to solve a robotics problem.• Experience with cloud-based tools to automate experiments and analysis at scale.• Familiarity with real-time, multi-process, multi-threaded coding.• Comfort using the command line in Linux.• Experience with 3D geometric math.• Comfortable with collaboration tools for programming", "jobDescription": "Apple SPG (Special Projects Group) is looking for talented robotics and software engineers to join our team to push the boundaries of autonomous planning algorithms (behavior, predictions, motion planning, and architecture)."}, "200405959": {"jobID": "200405959", "origin_search": null, "posted": "Jul 26, 2022", "jobTitle": "NLP Core Technology, ML Engineer - Safety AI", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200405959/nlp-core-technology-ml-engineer-safety-ai?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or PhD in Electrical Engineering/Computer Science or a related field (mathematics, physics or computer engineering), with a focus on computer vision and/or machine learning or comparable professional experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong ML and NLP fundamentalsHands-on experience with building NLP applicationsExpertise in text processing and analysisProficiency in using ML toolkits, e.g., PyTorch, TensorflowStrong programming skills in C, C++ and PythonStrong analytical and problem solving skillsYou're aware of the challenges associated to the transition of a prototype into a final productYou're familiar with the challenges of developing algorithms that run efficiently on resource constrained platformsYou've demonstrated leadership in both applied research and developmentExcellent written and verbal communications skills, be comfortable presenting research to large audiences, and have the ability to work hands-on in multi-functional teamsYou are passionate about building technology to help keep children safeM.S. or PhD in Electrical Engineering/Computer Science or a related field (mathematics, physics or computer engineering), with a focus on computer vision and/or machine learning or comparable professional experiencePrevious experience working in the domain of child safety is a plus", "jobDescription": "Are you interested in making an extensive and impactful contribution to safety in Apple user experiences using natural language processing and machine learning? We are looking for an exceptional talent with a strong foundation in machine learning, domain expertise in NLP, and the ability to turn ideas into action.\n\nWe are an applied R&D team that develops core technologies to keep children safe on Apple’s devices and services.\n\nOur team has a great mix of talent across NLP, software engineering and Machine Learning. We love to share our knowledge within our team, stay abreast of state-of-the-art and deliver outstanding products for our users. We also have a strong culture of multi-functional collaboration across teams at Apple.\n\nFor more details, please visit: https://www.apple.com/child-safety/"}, "200376497": {"jobID": "200376497", "origin_search": null, "posted": "", "jobTitle": "Machine Learning Engineer - Apple Media Products (AMP)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200376497/machine-learning-engineer-apple-media-products-amp?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200460100": {"jobID": "200460100", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Machine Learning Engineer - Apple Media Products (AMP)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460100/machine-learning-engineer-apple-media-products-amp?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD or Master’s degree in Machine Learning, Computer Science, Computer Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5 - 7+ years of ML-related engineering experienceExpert in Java/Scala or Python, proficient in other languages is a plusExperience in implementing Machine Learning based applicationsExperience with developing large-scale ML infrastructure, such as services, frameworks or toolingSolid understanding of Machine Learning algorithms, models and experience with deep learning frameworks is desiredProficiency in Spark, and experience with Hadoop or other big data processing technologiesStrong object-oriented design skills, coupled with a proven understanding of data structures and algorithmsExcellent communication skills for requirement gathering and clarificationKeen ability to lead with a high level of autonomy, versatility, and influence to drive key projects to completionPhD or Master’s degree in Machine Learning, Computer Science, Computer Engineering, or equivalent experience.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with dedication to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep dedication to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and multi-functional, offering greater exposure to the array of opportunities here. \n\nWe are seeking an extraordinary Machine Learning Engineer to join our team, innovate and craft the foundation of ML engineering to make our ML solutions secure, private, performant and scalable. Our team is geographically diverse. We’re looking for someone whose \"people skills\" complement their technical skills, someone who loves improving things as much as building things, and someone who is passionate about discovering new ways to accelerate the rate at which we can improve our products. \n\nIf this sounds like you, join our team!"}, "200463573": {"jobID": "200463573", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "AIML - Speech Synthesis Machine Learning Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463573/aiml-speech-synthesis-machine-learning-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Ph.D. degree in CS (preferred) with 3 years of experience, or other STEM fields such as EE, or Statistics."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of professional work experience developing systems for text to speech, speech synthesis, and natural language understandingStrong background in Deep Learning and classical Machine Learning, including but not limited to CNN/RNN architectures, GAN, active learning, k-shot learning and model complexity reduction techniques.Track record of coming up with new ML ideas, as shown by publications, patents or open-source projectsExperience with one or more Deep Learning packages including but not limited to TensorFlow and PyTorchExperience with signal processingProficiency in Python programmingPh.D. degree in CS (preferred) with 3 years of experience, or other STEM fields such as EE, or Statistics.Experience with audio or video processing and/or audio or video synthesisExperience with Natural Language Processing (NLP) or Natural Language Understanding (NLU)Familiarity with C++ or Objective-C programmingExperience processing large-scale data sets using Mesos, Spark, or HadoopPast experience in creating high-performance implementations of deep learning algorithms", "jobDescription": "We’re looking for someone who can build a system that would generate realistic human speech audio clips for use in measuring and evaluating the effectiveness of Apple’s speech recognition systems in Siri. A large, labeled dataset of human voice already exists. The idea is to create an ML model that takes text as input, then generates audio clips of synthetic human voice uttering that text. The ability to mimic regional accents and many spoken languages is ideal, but the system may be limited to US English in its first iteration."}, "200425945": {"jobID": "200425945", "origin_search": null, "posted": "Sep 16, 2022", "jobTitle": "Sr. Robotics Software Engineer, Autonomous Systems - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425945/sr-robotics-software-engineer-autonomous-systems-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.Sc., or Ph.D. in computer science, engineering, or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expertise in one or more of the following areas: behavior planning/decision-making, predictions, machine learning, motion planning (sampling, search based planning, optimization), estimation, control, and/or high-performance real-time algorithms.Experience programming autonomous robots, modeling multi-agent systems, and developing algorithms for them.Excellent C++ and/or Python development skills.Solid and fluent understanding of advanced algorithms and data structures.Experience analyzing results of simulations and field tests.5+ years of professional or equivalent experience.You must be hands-on, eager, curious and never satisfied with the status quo.You must love learning and being challenged.M.Sc., or Ph.D. in computer science, engineering, or equivalent professional experience.Preferred Experience:• Experience with building production code.• Designed one or more machine-learned approaches to solve a robotics problem.• Experience with cloud-based tools to automate experiments and analysis at scale.• Familiarity with real-time, multi-process, multi-threaded coding.• Comfort using the command line in Linux.• Experience with 3D geometric math.• Comfortable with collaboration tools for programming", "jobDescription": "Apple SPG (Special Projects Group) is looking for experienced robotics and software engineers to join our team to push the boundaries of autonomous planning algorithms (behavior, predictions, motion planning, and architecture)."}, "200360547": {"jobID": "200360547", "origin_search": null, "posted": "Mar 25, 2022", "jobTitle": "Senior AR Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200360547/senior-ar-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$269,000,"}, "benefits": null, "requirements": "5+ years of experience in software development.Attention to detail, creativity and passion.Proficiency in a programming language such as C, C++, C#, Objective-C, Swift, etc.Experience doing rapid prototyping.Good intuition in making time vs. complexity tradeoffs.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceExperience developing 3D or AR/VR applications or games.Experience with iOS frameworks such as ARKit, UIKit, Metal, Core Motion, etc.Familiarity with other AR SDKs such as ARCore, Vuforia or similar tools.Proficiency with Unity, Unreal, or similar 3D engines.Familiarity with game or peer-to-peer networking.Experience working with 3D content and content creation tools like Maya, 3ds Max, Blender, etc.Excellent understanding of the practical applications of 3D math and linear algebra", "jobDescription": "The Technology Development Group (TDG) is looking for a Senior AR Applications Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV).  As a senior member of our organization you will drive exploration of future products that will delight, inspire and empower millions of people."}, "200299694": {"jobID": "200299694", "origin_search": null, "posted": "Oct 27, 2021", "jobTitle": "Senior AR Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200299694/senior-ar-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of experience in software development.Attention to detail, creativity and passion.Proficiency in a programming language such as C, C++, C#, Objective-C, Swift, etc.Experience doing rapid prototyping.Good intuition in making time vs. complexity tradeoffs.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceExperience developing 3D or AR/VR applications or games.Experience with iOS frameworks such as ARKit, UIKit, Metal, Core Motion, etc.Familiarity with other AR SDKs such as ARCore, Vuforia or similar tools.Proficiency with Unity, Unreal, or similar 3D engines.Familiarity with game or peer-to-peer networking.Experience working with 3D content and content creation tools like Maya, 3ds Max, Blender, etc.Excellent understanding of the practical applications of 3D math and linear algebra", "jobDescription": "The Technology Development Group (TDG) is looking for a Senior AR Applications Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV).  As a senior member of our organization you will drive exploration of future products that will delight, inspire and empower millions of people."}, "200341515": {"jobID": "200341515", "origin_search": null, "posted": "Feb 5, 2022", "jobTitle": "3D Perception/Computer Vision Algorithm Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200341515/3d-perception-computer-vision-algorithm-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD in computer vision, robotics or machine learning; alternatively a comparable industry career, with significant experience on delivering products using state-of-the-art computer vision, machine learning and robotics technologies."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Solid foundation in computer vision; key areas of interest include object detection, tracking and recognition; multiple view geometry, 3D computer vision and SfM/SLAM; activity recognitionDeep understanding of machine learning technology and experience on turning machine learning technologies into practical, state-of-the-art systemsSolid C/C++ and system building skillsPassion on cutting edge computer vision/machine learning technologies and product deliverySelf motivatedExcellent problem solving skillsExcellent communication skillsPhD in computer vision, robotics or machine learning; alternatively a comparable industry career, with significant experience on delivering products using state-of-the-art computer vision, machine learning and robotics technologies.", "jobDescription": "The Video Computer Vision organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video. We have contributed to the FaceID and FaceKit project in the past and more recently the new LIDAR iPad sensor. We are looking for the right Engineer to help us take our efforts to the next level.\n\nIn this role, you will work together with similar minds in a unique development team where your skills and expertise will be put into the Apple products. This role is highly multi-functional and you will work very closely with various highly skilled software development / ML teams developing groundbreaking algorithms."}, "200452000": {"jobID": "200452000", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "HID Algorithm Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452000/hid-algorithm-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. (or M.S.) in EE, CS, Physics, Statistics, Mathematics, or another engineering or technical field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You should have experience with the following:Algorithm design and development for classification, filtering, noise modeling, signal processing, or controlProcessing and analyzing complex data, e.g. for machine learning, signal processing, or statisticsBuilding mathematical models in Python, MATLAB, R, or a similar high-level languageStrong theoretical knowledge of fundamental DSP concepts such as Adaptive filtering, linear algebra, and statisticsExcellent communication, presentation, and documentation skillsPh.D. (or M.S.) in EE, CS, Physics, Statistics, Mathematics, or another engineering or technical fieldWe would appreciate additional experience with:Working with embedded or resource-constrained systems, and with C or C++Control systems, optimization, or other applied mathematical techniquesFamiliarity with Python or other high-level languagesExperience with object-oriented programming and common design patternsExperience with content management systems, especially GitElectrical engineering and hardware design experience", "jobDescription": "Join the innovative engineering team crafting the next generation of human interfaces for Mac, iPhone, iPad, Pencil, Watch, and exciting new products. We are looking for a hardworking algorithm engineer who could work well in cross-disciplinary teams over a full product cycle. Our team comes from diverse backgrounds in signal and image processing, statistics, machine learning, controls, physics, firmware and software development, neuroscience, human factors, and more dedicated to inventing new ways of interacting with Apple products and shipping amazing products to millions of users every year. \n\nHID operates at the intersection of hardware, software, and design. This means that the wide variety of problems you will solve have many interesting facets and you will get to work with specialists from all across Apple."}, "200353151": {"jobID": "200353151", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Speech Scientist / Engineer (Interspeech 2022)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200353151/speech-scientist-engineer-interspeech-2022?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "PhD, MS, or BS in Machine Learning, Computer Science, or related fields."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong machine learning background in speech and/or language/text/dialogue processing fieldIn-depth hands-on experience in deep learningStrong software engineering abilities, ideally C++, Java, and/or PythonPassion for building research demo prototypes and turning them into production quality design/implementationExperience with deep learning toolkits, e.g. Tensorflow, PyTorchExperience with speaker recognition and related technologiesCurious about new technologies and passionate about exploring new use casesPhD, MS, or BS in Machine Learning, Computer Science, or related fields.", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Combining groundbreaking machine learning techniques with next-generation hardware, our teams take user experiences to the next level.\n\nThis posting is for attendees of Interspeech 2022 who are interested in full-time opportunities at Apple."}, "200387074": {"jobID": "200387074", "origin_search": null, "posted": "Jun 3, 2022", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200387074/ar-vr-software-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Key QualificationsAt least 3 years of relevant experience.Advanced algorithmic experience in either 3D geometry deformation, animation, ML, simulation or rendering.Extensive experience with 3D software like Maya, Blender, Houdini etc.Good understanding and comfort with 3D math (linear algebra).Demonstrable & notable public work in the areas of visual effects, video games or CG research.Proven experience developing systems for high fidelity content.Strong ability for writing high performance code in C or C++.A strong drive to solve novel and challenging problems.", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR Software Development Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV). As a member of our organization you will assist us in exploring future products that will delight, inspire and empower millions of people."}, "200461010": {"jobID": "200461010", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Machine Learning Software Engineer-Photos Algorithms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461010/machine-learning-software-engineer-photos-algorithms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.S or Ph.D. degree in Computer Science, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Exceptional problem-solving and interpersonal skills5+ years experience in building machine learning and deep learning algorithms end to end in a production settingDeep expertise in one or more of the following areas - Search, Recommendations, Ranking, and Knowledge GraphsRobust applied software methodology, process, and quality skillsProven ability to excel in a fast-paced development teamM.S or Ph.D. degree in Computer Science, Electrical Engineering, or equivalent experienceExperience writing Swift/Objective-C applications for iOS or macOSExperience optimizing ML and Deep Learning algorithms for embedded systems", "jobDescription": "Do you have a passion for building the best photo app experience in the world? iPhone is the most popular camera in the world! Seamless integration of software and hardware has delivered magnificent experiences like Photos Memories and Portrait Mode. The Camera & Photos team develops privacy-respecting machine learning technologies to ship emotional experiences to hundreds of millions of users worldwide. We are looking for an experienced Machine Learning Engineer to join our team to be part of this mission."}, "200455443": {"jobID": "200455443", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "AIML - Software Engineer in Test, Machine Learning Platform Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455443/aiml-software-engineer-in-test-machine-learning-platform-technologies?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Engineering/Computer Science/related fields or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "2+ years professional software test automation or tools experienceDesign and automate test cases to validate large-scale, sophisticated software systems, and develop test toolsExcellent programming skills in Java, Go or Python ExperienceKnowledge of testing in CI/CD contextStrong sense of ownership, vitality, and driveBS/MS in Computer Engineering/Computer Science/related fields or equivalent work experience.Preferred: ability to deal well with ambiguous problems, and proceed with good judgment", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. Apple's AIML Information Intelligence team is seeking an upbeat and meticulous Software Engineer in Test who will play a central role in the test and delivery of extensive search-based Internet services. We are looking for people with the experience and desire to design and build better and more efficient ways to ship code at Apple’s extremely high standard of quality."}, "200466997": {"jobID": "200466997", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Machine Learning Video Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466997/machine-learning-video-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/Ph.D. in Computer Science, Electrical Engineering, or closely related fields\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expert knowledge in ML and specifically deep learning: principles, model prototyping and architecture design, training procedures, visualization and debugging methodology, objective function design, and so onStrong familiarity with the latest ML and CV innovationsProven track record of success in deep learning, with publications in top ML/CV venuesExcellent software skills in common ML tools such as Python, PyTorch or TensorFlow; experience implementing custom ops in CUDA is a plusExcellent written and oral communication skillsExperience with one of the following is a big plus: generative modeling, optical flow, perceptual quality, ML for video or data compressionExperience in designing practical ML implementations and having ML experience in industry is a plus5+ years of hands-on experience in ML research is a mustMS/Ph.D. in Computer Science, Electrical Engineering, or closely related fields\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Video is at the core of nearly all Apple products, and as an engineer on our team, you will research practical ML algorithms and build with us the next generation of video technology. We are looking for a highly ambitious individual, who will flourish working on technically meaningful problems at the frontier of deep learning and compression research. Your work will redefine the video experience for billions of users."}, "200377424": {"jobID": "200377424", "origin_search": null, "posted": "May 9, 2022", "jobTitle": "Web UI Software Engineer, 3D Graphics - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200377424/web-ui-software-engineer-3d-graphics-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience shipping interactive 3D applications.Data-oriented approach to solving problems and building new things.Comfortable developing applications with React or Angular.Experience using data visualization libraries like D3.js or Kepler.gl.Excellent verbal and written communication skills.Excitement to be part of a diverse organization.", "jobDescription": "Apple’s Special Projects Group is looking for a 3D visualization engineer to help us build interactive web applications for autonomous systems.\n\nOur team develops data visualization that shapes the future of artificial intelligence and product development. We foster a startup-like environment where you will have the opportunity to be part of every stage of development from ideation to architecture design and deployment. Our team values iteration in a fast-paced environment, and we’re passionate about learning new technologies and knowledge sharing. If you enjoy delivering widely-used platforms and being a core member of a compact team, then please reach out to us!"}, "200422203": {"jobID": "200422203", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Senior Safety Test Engineer, Autonomous Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200422203/senior-safety-test-engineer-autonomous-systems?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Degree in Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years of relevant work experience with testing safety critical systems (2+ years in robotics preferred)Experience leading complex, fast-paced initiatives across multiple teams with conflicting priorities and schedules.Demonstrated ability to build consensus across multiple functions (engineering, operations, etc.) to create safety critical processes and systems.Experience identifying safety hazards and developing operational safety requirements for complex systems.Solid understanding of verification and validation processes for complex systems.Ability to quickly adapt to changing priorities within a Research & Development environment.Experience with human subject experiments and related ethics.A strong passion and dedication to create and enforce a culture of safety in principle and in practice.Degree in Engineering or related fieldProgram/project management experience.Experience working with autonomous systems or machine learning.3+ years experience in Confluence and JIRA.", "jobDescription": "The Apple Special Projects Group is looking for a safety champion with experience in human performance, requirements engineering, and hazard and risk analysis on safety critical systems. In this role, you will work cross-functionally to perform safety analysis, design and execute protocols to mitigate risks, and produce safety requirements for activities within the Systems Integrity organization. You will collaborate closely with Product, Engineering, and Operations teams to ensure that the implementation, verification, and validation of technologies are executed following strict safety requirements."}, "200457645": {"jobID": "200457645", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Photos - Apps and User Experience Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457645/photos-apps-and-user-experience-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree in Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You have on-device software development experience.A strong interest in systems engineering (examples could include projects that involve any of c/c++/assembler/operating systems/compilers/IPC/media transformations etc.)Bachelor's Degree in Computer Science or equivalent.Knowledge in any of the following would also be looked upon favorably:-  Developing and testing embedded software-  Experience building APIs or frameworks-  A background in relational databases (SQLite, PostgreSQL, SQL, Core Data, etc.)-  Performance tuning optimizing memory, scheduling, IO, networking protocols or databases-  Media database experience", "jobDescription": "iPhone is the most popular camera in the world. The seamless integration of software and hardware has led to features like Memories and Portrait Mode which deliver magical experiences. The Camera & Photos team focuses on user experience by using computer vision and image processing. Our team works hard on products that ship to millions of people, and we are looking for people who want to do the same. The Photos Infrastructure team is responsible for building innovative on-device and cloud services to improve the user’s photo and video experiences. We shape the next generation of media for Apple and contribute to a product that is redefining the Camera and Photos experience for the iPhone, iPad, Mac, Apple TV, and Apple Watch."}, "200388561": {"jobID": "200388561", "origin_search": null, "posted": "Jun 6, 2022", "jobTitle": "Senior AR Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200388561/senior-ar-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Burbank", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "5+ years of experience in software development.Attention to detail, creativity and passion.Proficiency in a programming language such as C, C++, C#, Objective-C, Swift, etc.Experience doing rapid prototyping.Good intuition in making time vs. complexity tradeoffs.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceExperience developing 3D or AR/VR applications or games.Experience with iOS frameworks such as ARKit, UIKit, Metal, Core Motion, etc.Familiarity with other AR SDKs such as ARCore, Vuforia or similar tools.Proficiency with Unity, Unreal, or similar 3D engines.Familiarity with game or peer-to-peer networking.Experience working with 3D content and content creation tools like Maya, 3ds Max, Blender, etc.Excellent understanding of the practical applications of 3D math and linear algebra", "jobDescription": "The Technology Development Group (TDG) is looking for a Senior AR Applications Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV).  As a senior member of our organization you will drive exploration of future products that will delight, inspire and empower millions of people."}, "200449164": {"jobID": "200449164", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "SLT Systems Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449164/slt-systems-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "At least 10 years of experience in systems software design and developmentExcellent programming (C++/C/ C#) and scripting skills (Python)Proficiency with developing large, complex system softwareAbility to work under tight schedule and deliver on timeExperience software development on windows/ Mac OS/ Linux OS.Good understanding of network technologies, protocolsBS and a minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!   \n\nThe SLT team engages in multi-disciplinary effort to design, develop and maintain our current and next generation system level test platform solutions. As the number of SOC’s keeps increasing, we are growing our team to meet the scope and complexities required to deliver outstanding SOC test platform solutions. We are looking for system software engineer to architect, build and maintain system software that powers our current and next generation of system level test equipment. The ideal candidate will have a strong mix of education and practical experience with a real passion for solving diverse engineering challenges. A successful candidate in this role will demonstrate deep knowledge in sophisticated software design and development."}, "200395727": {"jobID": "200395727", "origin_search": null, "posted": "Jun 25, 2022", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200395727/ar-vr-software-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "2+ years of relevant industry experience with a track record of successful projects.\nBS, MS or PhD in computer vision, machine learning, computer science, computer engineering or equivalent field or just somebody awesome and very motivated."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent coding skills in C/C++ and/or Objective-CExperience in fast pace software development on embedded platformsExcellent software prototyping, problem solving and debugging skills with performance-oriented mindset.Excellent communication and teamwork skills.Experience in 3D computer vision and image processing is a plus.GPU programming skill is a plus.2+ years of relevant industry experience with a track record of successful projects.\nBS, MS or PhD in computer vision, machine learning, computer science, computer engineering or equivalent field or just somebody awesome and very motivated.", "jobDescription": "Do you want to push the limits of the best Augmented Reality platform in the world? Apple's Technology Development Group (TDG) delivers algorithms that drive revolutionary Apple products, including the augmented reality (AR) platform ARKit to create ground-breaking new products. In this position, you will have the opportunity to be part of our extraordinary team of computer vision and machine learning researchers and engineers to discover and build solutions to previously-unsolved challenges and push the state of the art in AR algorithms that will change the way people experience the world!\n\nWe are looking for a driven and dedicated AR/VR Software Engineer to join our team. As a member of the Technology Development Group (Algorithm Dev), you have the unique and rewarding opportunity to work on upcoming releases of Apple products that delight and inspire millions of people every day! We invite you to contribute to our current Augmented Reality software platform and craft the future of Apple! As a member of a fast-paced team, you have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of people every day.\n\nTo succeed within this role, you should have shown experience in several of the following areas:"}, "200447739": {"jobID": "200447739", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Senior 3D Pipeline Engineer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447739/senior-3d-pipeline-engineer-simulation?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree and minimum of 5 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong experience with C++ and Python, software fundamentals and experience debugging complex software5+ years of experience working with 3D data in real time, animation, or visual effects film pipelinesBonus points for familiarity with computer graphics systems and game engines (e.g. Unreal, Unity, etc); 3D design tools (Blender, Maya)Proficient in software development practices including design, estimation, code reviews, and automated testing.Excellent multi-functional collaboration skills: demonstrated ability to work across an organization with algorithm designs, verification engineers, and other technical departments.Bachelor’s Degree and minimum of 5 years of relevant industry experience.", "jobDescription": "Apple’s Special Project Group is seeking a Senior 3D Pipeline Engineer to help advance innovative simulation for autonomous technologies. You will directly play a role developing and maintaining tooling for our 3D content creation pipeline core to our simulation efforts. Your work will advance our ability to develop, test, and verify mobile autonomous systems."}, "200440796": {"jobID": "200440796", "origin_search": null, "posted": "Nov 11, 2022", "jobTitle": "Camera Prototyping Engineer - ML & Computational Imaging/Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440796/camera-prototyping-engineer-ml-computational-imaging-simulation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS, or PhD in computer science, optical engineering, electrical engineering, physics, image science, or related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong Machine Learning and deep neural network fundamentals, and hands-on experience developing and training ML models.Experience with ML explainability and performance assessment.Strong software development skills - Fluent in Python and Matlab.Experience with at least one of the major machine learning frameworks, preferably TensorFlow or PyTorch.Excellent communication and presentation skills.Ability to learn and adapt quickly and become familiar with several different technology areas.Ability to independently excel in an open and uncertain solution space environment.MS, or PhD in computer science, optical engineering, electrical engineering, physics, image science, or related field.Highly Preferred:Expertise in computational imaging and computer vision.Experience with end-to-end camera system modeling.", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\n\nThe Camera Technology Exploration Team identifies feature opportunities, develops new approaches, proposes innovative concepts & use case experiences, and adapts those across our products needs. The outcome of our prototyping efforts help define roadmaps for future sensing and imaging systems across our product line. The final goal for all of our investigations is to improve our products and bring up new features for our customers.\n\nApple is seeking an energetic and highly motivated, world class Machine Learning Expert to help drive future camera and sensing hardware requirements to meet our product vision. \n\nThe ideal candidate also has the capability to contribute to the assessments and prototyping of new technologies and features for our customers."}, "200207319": {"jobID": "200207319", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "GPU Developer Tools Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200207319/gpu-developer-tools-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Technical BS/MS degree / Equivalent Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "We are looking for a manager with a strong engineering background who is excited to work with engineers and other leaders at Apple to build exciting new GPU focused developer tools. This manager has the interpersonal skills, the diligence to drive, and the perseverance to ship products.Technical leadership or software engineering management experienceStrong focus and interest for designing and implementing excellent workflows and user interfacesStrong organizational skills and adaptive approach to problem solvingProven programming skills and knowledge of C/C++Knowledge of GPU APIs such as Metal, Direct3D, Vulkan & OpenGLExcellent software design, problem solving and debugging skillsKnowledge of GPU hardware and software architecture a major plusTechnical BS/MS degree / Equivalent ExperienceExperience designing developer workflows and user interfaces a plusExperience developing graphics performance and profiling tools a plusExperience with performance optimizations a plusSystems engineering experience or low-level hardware experience a plusDevelopment experience on iOS, tvOS or macOS a plusDevelopment experience with Cocoa and Objective C or Swift a plus", "jobDescription": "Apple’s GPU, Graphics and Displays Software team provides the graphics software foundation across all of our innovative products including iPhone, iPad, Apple TV, Mac, and Apple Watch. Our responsibilities encompass the frameworks, developer tools, and hardware drivers for the GPU and Display devices on all of Apple’s hardware. \n\nThe team is now seeking an outstanding, driven, and dedicated leader to manage our GPU Developer Technologies High Level Tools team. This team is responsible for designing and building the Metal frame debugger, shader debugger, shader profiler, counter profiler and other GPU developer tools provided to developers in Xcode and the iOS, tvOS and macOS SDKs."}, "200441485": {"jobID": "200441485", "origin_search": null, "posted": "Nov 10, 2022", "jobTitle": "Proactive Intelligence, Applied ML Research Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441485/proactive-intelligence-applied-ml-research-scientist?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. degree in CS (preferred), or other STEM fields such as EE or Statistics with 3 years of proven experience or M.S. in CS with 5 years of demonstrated ability in research and development of machine learning algorithms."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong background in Deep Learning and classical Machine Learning, including one or more of the following areas of expertise: sequence modeling/NLP, program synthesis, generative models, processing structured data such as relational graphs, privacy-preserving machine learning, and distributed algorithms.Track record of coming up with new ML ideas, as shown by publications, patents or open-source projectsExperience with one or more Deep Learning packages including but not limited to TensorFlow and PyTorchProficiency in Python programmingBackground that fuses research, engineering, and product thinking, as demonstrated by practical experience of shipping algorithms for measurement, evaluation, control and processing to improve products.Ph.D. degree in CS (preferred), or other STEM fields such as EE or Statistics with 3 years of proven experience or M.S. in CS with 5 years of demonstrated ability in research and development of machine learning algorithms.", "jobDescription": "At Apple, novel research ideas have a way of becoming extraordinary products, services, and customer experiences quickly. Here is your opportunity to be part of an incredible research and engineering team building the next-generation of sophisticated algorithms for the iPhone, Mac, Apple Watch, iPad and more. \n\nThe vision for the Proactive Intelligence organization is to improve Apple platforms by better understanding, anticipating, and adapting to user behavior by using machine learning to build phenomenal features that are built right into Apple platforms. We are looking for inquisitive and creative applied research scientists with expertise in ML and a particular focus on Natural Language Processing (NLP), Program Synthesis, Sequence Modeling, Privacy-Preserving ML (PPML), and Distributed Machine Learning. Working knowledge of large-scale data processing especially with structured data, probabilistic modeling, statistics and embedded programming will broaden your role and effectiveness in this position."}, "200348846": {"jobID": "200348846", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "CVML Researcher- Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200348846/cvml-researcher-technology-development-group-tdg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Ph.D./M.S in computer vision, machine learning, computer science or 5+ years of equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong experience in 3D Computer Vision algorithmsExperience in machine learning, preferably in 3D computer vision applicationsSolid foundation in 3D geometry and linear algebraStrong experience in Python and science libraries like Numpy, Pandas, MatplotlibStrong experience in C++Experience in deep learning frameworks like PyTorch or TensorFlowExperience in 3D meshes and geometry is a plusExcellent communication and collaboration skillsExcellent problem solving and analytical thinking skillsTrack record of successfully building and shipping products or open source projectsCreativity and curiosity for solving highly complex problemsPh.D./M.S in computer vision, machine learning, computer science or 5+ years of equivalent industry experience", "jobDescription": "Do you want to push the limits of the best Augmented Reality platform in the world? Apple's Technology Development Group (TDG) delivers algorithms that drive revolutionary Apple products, including the augmented reality (AR) platform ARKit to create ground-breaking new products. In this position, you will have the opportunity to be part of our extraordinary team of computer vision and machine learning researchers and engineers to discover and build solutions to previously-unsolved challenges and push the state of the art in AR algorithms that will change the way people experience the world!\n\nWe are looking for a driven and dedicated computer vision/machine learning engineer, optimally with experience in object detection, pose estimation, or tracking algorithms. As a member of a fast-paced team, you have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of people every day.\n\nTo succeed within this role, you should have shown experience in several of the following areas:"}, "200376256": {"jobID": "200376256", "origin_search": null, "posted": "Oct 14, 2022", "jobTitle": "ML Systems & Performance Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200376256/ml-systems-performance-engineer-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years of professional software development experience.Familiarity with modern Machine Learning frameworks like PyTorch.Familiarity with optimization techniques like Quantization, sparsity and/or pruning.Experience in architecting and implementing large-scale cloud pipelines., e.g using spark, kafka, kubeflow, postgresHigh proficiency in Python, C++ and/or CUDA.Passion for optimizations and efficient implementations.High software engineering standards: desire to write clean, well-tested and well-structured code.Track record of collaborations across teams, including requirement specifications and successful project delivery.Excellent communication and presentation skills.Curiosity to learn new things and push the boundary towards new approaches without fear of changing existing paradigms.", "jobDescription": "The key to successful Machine Learning Teams is an efficient, robust, flexible and scalable architectural foundation. The Apple Special Projects Group on Autonomous Systems is looking for a talented, dedicated and result oriented software engineer to help build and improve our Machine Learning Systems. This fundamental and highly impactful work enables us to architect, train, evaluate and deploy state of the art machine learning models for Autonomous Systems.\n\nYou will be part of a world class team with a highly diverse skillsets. From implementing CUDA kernels, optimizing cache coherency of complex algorithms, reducing memory footprints all the way to optimizing distributed training setups and implementing efficient large scale cloud compute schedules, ML Systems & Performance engineers are taking a holistic view at the whole stack to eliminate bottlenecks resulting in a lean and optimally efficient implementation."}, "200425949": {"jobID": "200425949", "origin_search": null, "posted": "Sep 16, 2022", "jobTitle": "Sr. Machine Learning Engineer, Trajectory Prediction - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425949/sr-machine-learning-engineer-trajectory-prediction-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A minimum of a Bachelor’s degree in Machine Learning, Robotics, Statistics, Computer Science or a related field.\n\nIf this is you, we'd love to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expertise in Python and/or C++ with a minimum of 5+ years using these languages in a machine learning (ML) research capacity5+ years experience in ML and deep learning (DL)3+ years of experience using ML technologies, such as PyTorchExpert in researching current DL literature and the math of machine learning: optimization methods, common types of models and layers, etc.Understanding of modern machine learning concepts and state of the art deep learning frameworksStrong software engineering skills to create scalable and robust infrastructure for deep learning data, modeling, and evaluation systemsProven ability to train and debug deep learning systems: Define metrics and datasets, performing error analysis, training models in a modern DL frameworkPassionate about building extraordinary autonomous systemsCreative, collaborative, and project focusedExcellent communication skills — you collaborate effectively with other teams and communicate clearly about your workExperience with CNNs, GNNs, Transformers, RNNs, LSTMsA minimum of a Bachelor’s degree in Machine Learning, Robotics, Statistics, Computer Science or a related field.\n\nIf this is you, we'd love to hear from you.Preferred Experience:• Experience in applying deep learning to robotics problems and predicting multimodal behaviors for agents• Experience with hardware specific optimization of ML models and deployment", "jobDescription": "Apple is looking for world-class qualified ML/Deep Learning engineers to develop and integrate machine learning technologies within our Special Projects Team, focusing on autonomous technologies in a real world robotics application."}, "200384519": {"jobID": "200384519", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "AIML - Sr Product Manager, Data Apps & Metrics Platform", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200384519/aiml-sr-product-manager-data-apps-metrics-platform?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/Ph.D. EE/CS/CE, preferably Computer Science Degree, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$177,000", "max": "$269,000,"}, "benefits": null, "requirements": "5+ years in a product management role that includes responsibilities for both strategy and executionTrack record of successful product deliveryAbility to synthesize information and distill it down to a clear message or planExcellent communication skills, written and oral, able to tailor to and engage different audiencesAdept at managing and prioritizing across many partnersPassionate about delivering the best user experience to internal users by actively understanding user needs and translating requirements into the product roadmapAble to use data and metrics to back up assumptions, make recommendations and drive actionsSelf-motivated, independent, and proactiveCreative and critical thinkerAbility to quickly triage, prioritize, and drive consensusAn unwavering focus and track record for improving team quality, performance, agility, and efficiencyBS/MS/Ph.D. EE/CS/CE, preferably Computer Science Degree, or equivalent.~ Experience building data products and driving adoption of those products across organizations is a plus~ Data and Machine Learning product experience~ Successful past experience partnering with data scientists and infrastructure owners to implement internet scale tooling and products.", "jobDescription": "As a senior product manager in AIML Data, responsible for our apps and metrics platform, you will shape the future of Data at Apple. You will define and drive the products that enable Apple to use data as the voice of the customer, leading to the highest quality user experiences, with the strongest privacy guarantees in the industry, for Apple's customers. You will work with world-class engineering, data science, and product teams. \n\nYou will define, lead, and execute on the roadmap for Apple AIML’s Data Apps and Metrics Platform. You will partner with our engineers, product managers, and data scientists, to get data into the hands of Apple product teams working on Siri, Search, and more. Your work will be instrumental to Apple’s product decisions. \n\nDo you thrive in fast-paced environments and drive focus and clear direction? Are you adept at aligning stakeholders across organizations and functions? Do you build trust and work for the success of the team? If so, we can’t wait to meet you."}, "200348870": {"jobID": "200348870", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "CVML Engineer- Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200348870/cvml-engineer-technology-development-group-tdg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD in computer vision, machine learning, computer science or 5+ years of equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong experience in 3D Computer Vision algorithmsStrong experience in machine learning, preferably in 3D computer vision applicationsSolid foundation in 3D geometry and linear algebraStrong experience in Python and science libraries like Numpy, Pandas, MatplotlibExperience in C++Experience in deep learning frameworks like PyTorch or TensorFlowA plus for experience in sensor fusion or real-time systemsExcellent communication and collaboration skillsExcellent problem solving and analytical thinking skillsTrack record of successfully building and shipping products or open source projectsCreativity and curiosity for solving highly complex problemsPhD in computer vision, machine learning, computer science or 5+ years of equivalent industry experience", "jobDescription": "Do you want to push the limits of the best Augmented Reality platform in the world? Apple's Technology Development Group (TDG) delivers algorithms that drive revolutionary Apple products, including the augmented reality (AR) platform ARKit to create ground-breaking new products. In this position, you will have the opportunity to be part of our extraordinary team of computer vision and deep learning researchers to discover and build solutions to previously-unsolved challenges and push the state of the art in AR algorithms that will change the way people experience their own reality! \n\nWe are looking for a driven and dedicated computer vision/machine learning engineer, optimally with experience in object detection, pose estimation, SLAM, sensor fusion, or tracking algorithms. As a member of a fast-paced team, you have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of people every day.\n\nTo succeed within this role, you should have shown experience in several of the following areas:"}, "200341466": {"jobID": "200341466", "origin_search": null, "posted": "May 3, 2022", "jobTitle": "Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200341466/software-engineer?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's or Master's degree in Computer Science or a related technology field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Shown ability to design and implement modern Web applicationsValidated experience in developing desktop and mobile applicationsExperience with common software development stacks and UI frameworksDatabase design and SQL development experience working with structured and unstructured dataExperience with products and technologies such as Oracle database, PostgreSQL, Hadoop, Spark, MongoDB, Hive, HBaseFull stack development experience and expertise in one or more languages such as Java, Python, GoBachelor's or Master's degree in Computer Science or a related technology field.-  Experience in designing and building microservices-  Experience in distributed and cloud native applications-  Experience crafting data and analytics applications at scale-  Experience with data warehouse and MPP solutions such as Teradata, Vertica, BigQuery, Snowflake-  Experience with one or more cloud platforms-  Test and deployment automation experience-  Agile software development experience", "jobDescription": "As a Software Engineer on the ISDS Cloud Analytics team you will design and build modern applications that enable business critical functions such as data warehousing and enterprise analytics for Apple. You will work with the latest technologies and development tools while using agile and lean software development methods!"}, "200462010": {"jobID": "200462010", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462010/qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS CS/CE/EE (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$109,500", "max": "$171,000,"}, "benefits": null, "requirements": "3+ years experience as a Software QA EngineerPassion for quality, exceptional attention to detailProven hands on experience with manual testingStrong knowledge of software development lifecycle, testing methodologies, QA terminology and processesExcellent written and verbal communication skills, be able to describe and document clearlyAbility to multi-task and manage tasks with varying prioritiesAbility to work cross-functionally with other teams and groupsExperience with developing, running, and triaging automated test suitesExperience in implementing initiatives across teamsAbility to investigate, debug and triage difficult problems and independently work towards resultsExperience in maintaining/enhancing test framework in scripting languages (e.g. Python)Experience with computer vision/machine learning algorithms preferredBS or MS CS/CE/EE (or equivalent)Experience in test automation frameworks that involve HW & SW subsystemExperience with macOS, iOS and Xcode", "jobDescription": "The Technology Development team is looking for a QA Engineer to enhance our capabilities to track and improve the quality for new and exciting technologies. We’re seeking an excellent communicator and problem solver who can help evaluate and uphold our software testing processes to ensure the highest quality and best practices towards delivering the algorithms that will shape the future of AR. You would be instrumental in helping us maintain Apple’s high quality and attention to detail for future products by ensuring the code we write is well tested and integrated. As a member of our fast-paced group, you will have the unique and rewarding opportunity to be part of and shape upcoming products that will delight and inspire millions of Apple’s customers every day. \n\nIf you are a highly motivated engineer with passion for quality and exceptional attention to detail who wants to make an impact across teams at Apple that is crafting the future of augmented reality technology in Apple product platforms, we want to hear from you!"}, "200450029": {"jobID": "200450029", "origin_search": null, "posted": "Jan 29, 2023", "jobTitle": "Sr Engineering Manager, Product ML Systems Evaluation Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450029/sr-engineering-manager-product-ml-systems-evaluation-engineering?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in Computer Science, Machine Learning or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$343,500,"}, "benefits": null, "requirements": "10+ years of professional work experience in SW development.Proven success in developing a long-term vision, and executing strategies at scale.Experience managing an engineering team, and managing managers.The ideal candidate has experience with large scale test infrastructure, evaluation of ML based products, and system integration testing.Working experience with different logging and analytics frameworks, and experience with interpreting pre- and post-release product metrics at large scaleExperience with statistical analysis applications in testing, ML/AI, or manufacturing processesExperience with server backend services, especially at the API or protocol level.Strong organizational skills and experience working on large multi-functional teams.Thrives on working in a fast-paced environment with constantly evolving priorities.MS/PhD in Computer Science, Machine Learning or related field", "jobDescription": "Are you passionate about innovation that matters? Would you like to play a part in shipping groundbreaking technology for large scale systems, natural language, and artificial intelligence? We interact with various engineering teams to identify issues, test requirements, drive the quality of Siri features and create frameworks that support evaluation and qualification. You will work with the people who craft the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri ML Systems Evaluation Engineering (MLSEE) team at Apple.\n\nAs a Siri ML SEE Sr. Engineering Manager, you will own evaluation and testing tools and frameworks development, ensuring our quality measurement of Siri and ML products pre-release is predictive of real-life user experience. This role is responsible for developing the approach, tools, and testing for component level testing as well as for systems integration (client/server and data/server), reliability, and consistency measurements. As Siri evolves, testing methodology and tools must respond to the new complexities: delivering such alignment is a key requirement for this role. A meaningful deliverable of the role is a significant improvement in failure action ability, combined with identifying systemic issues, and with failures prioritization. This is a fast-paced role with high visibility, impact, and helps to build the most advanced systems in the industry. This role will focus on the right design, architecture and reliability for evaluation frameworks."}, "200463843": {"jobID": "200463843", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Cellular Platform Software Engineer, Embedded Analytics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463843/cellular-platform-software-engineer-embedded-analytics?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor Or Master in Software Engineering, Electrical Engineering, Wireless Communications or equivalent majors."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "5+ years of experience in embedded software development.Strong experience in C programming and framework design.Excellent software developing and debugging skills (LLDB or GDB) on embedded real time operating systems.Outstanding verbal and written communication skills.Experience with Cellular standards, an added advantage.Experience with Machine Learning on Embedded systems an added advantage.Experience with Analytics or rules based expert systems an added advantage.Bachelor Or Master in Software Engineering, Electrical Engineering, Wireless Communications or equivalent majors.", "jobDescription": "Join the Wireless Technology and Ecosystems (WTE) organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. \n\nBe ready to make something extraordinary when you come here. Multifaceted, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200458008": {"jobID": "200458008", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "Sr. Autonomy Integrity Engineer, Validation - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458008/sr-autonomy-integrity-engineer-validation-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Computer Science, Engineering, Robotics or a related field\nMinimum of 5 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience with analysis or validation of complex robotics systems, preferably in autonomous applications.Experience using rigorous scientific methods for trade studies, testing, and problem solving.Experience with statistics, data analysis, or modeling.Ability to rapid prototype using Python and SQL skillsHistory of delivering results through innovation and detailed execution.Experience working on unsolved problems and defining technical strategy.MS or PhD in Computer Science, Engineering, Robotics or a related field\nMinimum of 5 years of relevant industry experience", "jobDescription": "How do you verify an AI? Join a team of talented engineers who are defining verification and validation for safe autonomous technology.\n\nThe Special Projects Group at Apple is seeking an accomplished systems engineer to serve as an Senior Autonomy Integrity Engineer. In this role, you will help inform the design of complex hardware and software systems and develop methods and tools to enable their analysis and validation. You will need to think broadly, connecting ideas across multiple technical domains: software design and development, machine learning, data science, control systems, and simulation – to name a few. You will be expected to view problems from multiple perspectives and at different levels of abstraction, and to tackle them from multiple directions. We expect successful candidates to demonstrate an ability to solve such problems efficiently, and to communicate about them effectively with a variety of audiences."}, "200446445": {"jobID": "200446445", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "Data Scientist - Batteries", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446445/data-scientist-batteries?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS plus 3 years of relevant industry experience. Advanced degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proven working knowledge of statistical and data mining for causal analysis.Strong expertise in processing and visualizing and analyzing big data as well as automating processes using a scripting language (Python, R, etc.).Solid understanding of Python, JMP, SQL, and Tableau.Experience in machine learning algorithms including ensemble-based approaches, probability networks, association rules, clustering, regression, and neural networks.Strong problem-solving skills to address ad-hoc analytics requests with a sense of urgency by using engineering knowledge and analytics/ML skills based on different data sources, including time series dataset.Experience in anomaly detection based on time series or other datasets.Self-starter to interact with other functions, shown creativity to go beyond current tools to deliver the best solution to the problem.Effective interpersonal skills to articulate difficult technical topics, especially causal inference, to collaborators including peer data scientists, design engineers, and business partners.Strong analytics, statistical, and ML skills. Battery experience is preferred.BS plus 3 years of relevant industry experience. Advanced degree preferred.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Battery Engineering group, you’ll help craft creative battery solutions that deliver more energy in smaller spaces than ever before! We work across subject areas to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new battery technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, we push the industry boundaries of what batteries can do and improve the product experience for our customers across the world! This position works within a multi-functional team supporting the entire Battery Department to identify trends, mine data, and help the battery team improve performance."}, "200446291": {"jobID": "200446291", "origin_search": null, "posted": "Dec 1, 2022", "jobTitle": "Machine Learning Engineer, Sense Maps - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446291/machine-learning-engineer-sense-maps-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "• Masters or PhD in Computer Science, Machine Learning, Engineering or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience developing machine learning systems. Define and create datasets and metrics, train models using modern deep learning frameworks (e.g. PyTorch, TensorFlow), perform error analysis and triage.Familiarity with the theory and current literature of machine learning: optimization methods, common models etc.Strong background in Python development with Linux. Ability to understand and contribute to a C++ codebase is a plus.Excellent communication: strong interpersonal, verbal and written skillsExperience working with multiple sensor modalities or large scale mapping systems are a plus.• Masters or PhD in Computer Science, Machine Learning, Engineering or equivalent professional experience.", "jobDescription": "The Sense Maps team develops machine learning solutions for maps in Apple’s Special Projects Group (SPG). The team is responsible for developing state of the art deep learning models for critical on-device mapping tasks. Our system operates in challenging real-world environments, leveraging multiple sensor modalities in a real-time setting.\n\nBy joining the Sense Maps team, you will play a key role in our development. You will have responsibilities ranging from model design, implementation and evaluation. You will join a team of highly talented machine learning researchers and engineers, and work with multiple cross-functional teams. The work you do will have a direct and measurable impact on our deep learning performance and capabilities."}, "200235249": {"jobID": "200235249", "origin_search": null, "posted": "Mar 29, 2022", "jobTitle": "Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200235249/software-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS EE/CE/CS required. MS EE/CE/CS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum 3+ years of Software, instrumentation, or test development experienceExperience in software development using C/C++, Python, or similar object oriented programmingExcellent written and verbal communication skillsExcellent problem-solving skills to debug and perform failure analysis across a variety of engineering domainsExperience in design of experiment (DOE) and other problem-solving processesAble to understand and perform statistical data analysisFamiliarity with electronics debugging tools (DMM, Oscilloscopes) and circuit & electrical engineering fundamentalsAble to make international travel to Asia up to 25% of the timeBS EE/CE/CS required. MS EE/CE/CS preferredPreferred Qualifications:5+ years of relevant industry experience in systems engineering, software development orExperience with digital signal processing or image processingExperience with Objective C or SwiftExperience in firmware development (knowledge of I2C, SPI, and other protocols) in data acquisition & measurement systemExperience working in high-volume consumer electronics projectsBackground with Touch or Sensing Technology", "jobDescription": "The Instrumentation and Test technology team architects and designs best-in-class Test and Measurement Instruments. The team is a collaborative group of creative and smart people developing highly complex and sophisticated Test and Measurement equipment to support the testing of sensors in our world-class products.\nThis individual will play a key role in defining, architecting, specifying, designing, validating, and developing Test and Measurement Instruments to support our consumer product bring up, characterization, ramp, and production."}, "200464077": {"jobID": "200464077", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Human Interaction Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464077/human-interaction-engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in computer vision and machine learning or equivalent industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "2+ years of experience in managing teams productizing Computer Vision or AI/Machine Learning technologies from conception to end.8+ years of experience in computer vision and machine learning algorithm development8+ years of experience in software development. Experience with end-to-end ownership of projects (including academic projects) and confidence to make key decisions independentlyDemonstrated experience in recruiting and managing technical teams, including performance management.Experience in working across many disciplines, driving best practices, and mentoring team members.Clear and effective communicator that can communicate complex technical concepts to non-technical stakeholders.Creative problem solver and a thoughtful decision maker with the ability to work under pressure and tight deadlines.[Preferred] having prior experience or degree in human computer interactionPhD or MS in computer vision and machine learning or equivalent industry experience.", "jobDescription": "Ever wanted to ship amazing experiences in Apple products? Be part of the team in the Video Computer Vision (VCV) organization that focuses on people understanding real-time video streams and building higher-level reasoning algorithms. VCV delivers products such as FaceID, ARKit, and RealityKit. We are looking for exceptional leaders to help us to help us create next generation interaction technologies. Many teams are coming together to enable this vision. We are working on tracking hand, gaze, body, and objects and their interactions through machine learning, computer vision and sensor fusion."}, "200441171": {"jobID": "200441171", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "AIML - Platform Engineering Manager, MLPT", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441171/aiml-platform-engineering-manager-mlpt?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in Computer Science, related field or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$269,000,"}, "benefits": null, "requirements": "3+ years of as tech lead or engineering manager8+ years of experience developing and maintaining data intensive systemsProven track record of delivering high impact projects through partnership across organization boundaries with product, design and infrastructure teamsExperience of mentoring and coaching software engineersDeep knowledge in backend (GraphQL, SQL/NoSQL databases, ElasticSearch, Kafka etc) and cloud (AWS, GCP, Azure, K8s etc) technologiesAbility to clearly and concisely communicate about technical and architectural problems and work with key partners to iteratively solve the problemsBachelors in Computer Science, related field or equivalent experienceExperience in machine learning is plus but not required", "jobDescription": "Join us and help build Machine Learning experimentation platform that enables the next generation of intelligent experiences in Apple’s products and services. Work with some of the best ML and distributed system engineers to take MLOps at Apple to the next level.\n\nWe are looking for an engineering manager in platform engineering who is experienced in leading teams and building scalable cloud platform and services. The ideal candidate has solid backend and cloud infrastructure domain knowledge, passion in designing and developing highly scalable and available systems, and a track record of managing and mentoring other engineers. You will lead a team of world-class software engineers and play a crucial role building and evolving our experimentation platform."}, "200403439": {"jobID": "200403439", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Vision Framework Engineer - SIML, ISE", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200403439/vision-framework-engineer-siml-ise?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors or graduated degree in Computer Science, Computer Engineering, Machine Learning, Electrical Engineering, or equivalent work experience.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant (https://www.eeoc.gov/sites/default/files/migrated_files/employers/eeoc_self_print_poster.pdf)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of industry experience is desiredStrong C, or C++ /Objective-C is a mustStrong coding skills in general software engineering, preferably across multiple platforms and languages and for a variety of different solutions, is highly desirableDomain experience in computer vision or a related field (computer graphics, image processing, multimedia, etc.) is preferredProven ability to design and implement solutions using modern architectural concepts and processes is requiredKnowledge of concurrency and its use in application and/or framework development is requiredPassion for quality software configuration management processes such as unit tests, code reviews and working with continuous integration is requiredBachelors or graduated degree in Computer Science, Computer Engineering, Machine Learning, Electrical Engineering, or equivalent work experience.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant (https://www.eeoc.gov/sites/default/files/migrated_files/employers/eeoc_self_print_poster.pdf)• Experience with macOS and/or iOS development and familiarity with UNIX-based systems is a major plus• Experience with shipping products is highly desired", "jobDescription": "Do you think Computer Vision and Machine Learning can change the world? Do you think it can transform the way millions of people capture, discover and share the most special moments of their lives? We truly believe it can, and we are looking for an enthusiastic engineer who can lead the software development necessary to make these exciting technologies available and drive widespread adoption.\n\nThe Vision Framework team within the System Intelligence and Machine Learning (SIML) group, as part of the ISE organization in Apple, is responsible for imaging, computer vision and machine learning for Apple's image and video products. This team provides the building blocks for a diverse array of technologies, including new exciting features such as Live Text and Photos Memories on macOS and iOS. The group combines research and development in a fast-paced environment. We are looking for an experienced software engineer. The position involves integrating advanced computer vision technology into products that improve the daily experience for millions of users."}, "200457303": {"jobID": "200457303", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Senior Machine Learning Research Engineer - SIML, ISE", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457303/senior-machine-learning-research-engineer-siml-ise?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or PhD in Electrical Engineering, Computer Science or a related field (mathematics, physics or computer engineering); or equivalent experience.\n\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands-on experience with theory and practice of deep learning and other relevant machine learning approachesHands-on experience with deep learning toolkits, such as PyTorch & TensorFlowStrong analytical and problem solving skillsStrong programming skills in PythonFamiliarity with C++, with the ability/willingness to ramp up as neededExperience collaborating on large ML software projects, with sound s/w development practices applied to building and maintaining ML modeling code-baseExperience deploying ML in productsAwareness of concepts of algorithmic complexity, GPU/CPU utilization, I/O bandwidth, and optimization methods to ensure efficiency of ML solutionsAbility to provide technical leadership on ML projects from start to finishExcellent written and verbal communications skills, be comfortable presenting research to large audiencesAbility to work independently as well as collaborate with team members of different backgroundsM.S. or PhD in Electrical Engineering, Computer Science or a related field (mathematics, physics or computer engineering); or equivalent experience.\n\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.Experience with OS X and iOS development tools is desired.", "jobDescription": "Can Computer Vision and Machine Learning change the world and transform the way people interact with devices? Can it revolutionize how we think about fundamental applications such as communication, photography, health and fitness, home security, digital payments, voice assistants, and many more? \n\nWe truly believe it can! And we are looking for an exceptional talent with a strong foundation in machine learning, domain expertise in computer vision, and the motivation to turn ideas into action. An ideal candidate has the ability to translate high-level product goals into ML requirements, rapidly explore a wide range of approaches, be informed but not limited by published literature, and deliver production-quality ML solutions. Since the role is highly cross-functional, strong inter-personal and leadership skills would be a great asset.\n\nWe are the Human and Object Understanding (HOUr) team within the System Intelligent and Machine Learning (SIML) group. We are an applied R&D team that develops core technologies for perception and reasoning of humans that power various applications across the Apple eco-system. Real-time always-on object detection (Center Stage, Cinematic Mode), facial attributes (Photographic Styles), end-end system-wide person recognition (Photos, HomeKit, Memojis, Apple Pay), spoof detection (IDs in Wallet), text ROI detection (Live Text), fine-grained breed classification (Visual Lookup), and image in-painting (Photos Edit) are just some of the core technologies the team has developed that have contributed to some of Apple’s most beloved features recently!"}, "200451627": {"jobID": "200451627", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Senior Software Engineer - Body Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451627/senior-software-engineer-body-technologies?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science or similar; and 5+ years of industry experience. If this is you, we'd love to hear from you!"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Fluency in C++ is required, Objective-C/ Swift is a big plusProfessional system design and SW architecture skillsTrack record of shipped libraries, frameworks or SW systemsIn-depth understanding of data structures and algorithms in the standard library, memory system, and cachingBest practices for writing fast, efficient, and testable codeProfiling and optimizationStrong sense of responsibility and an obsession with quality and detailsBS or MS in Computer Science or similar; and 5+ years of industry experience. If this is you, we'd love to hear from you!* Experience with Apple's frameworks (e.g. ARKit, CoreML, Accelerate, SceneKit, Metal).* Background in computer vision, image processing, machine learning, computer graphics and/or animation.", "jobDescription": "Are you passionate about designing simple software solutions to tackle complex tasks? Do you thrive on collaboration and enjoy pushing the boundaries of what is possible today! Do you want to move into developing production quality algorithm software using Computer Vision and Machine Learning. We are looking for a creative software engineer to build our algorithmic pipeline and software libraries that ships with Apple operating systems. You will work closely with internal clients fo fulfill their requirements and create prototype applications throughout the release process. Some of the exciting use cases that we are focussing are in Fitness and Heath domain. We develop state of the art algorithms in the field of action recognition, repetition counting, posture correction, meditation, exercise assessment etc."}, "200359984": {"jobID": "200359984", "origin_search": null, "posted": "Aug 9, 2022", "jobTitle": "Imaging and Sensing Incubation - Systems Hardware Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200359984/imaging-and-sensing-incubation-systems-hardware-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MS with 5+ years—or BS with 7+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experienced, dedicated engineer with great initiative and a proven track record of developing sophisticated systems from initial definition throughout the project life cycleAbility to quickly pick up and own new concepts and to contribute with innovative solutionsComfortable working through ambiguityDemonstrates deep understanding of system-level impact of design choices and good judgment in negotiating tradeoffsEmploys guaranteed-by-design methodology for high performance system designsStrong troubleshooting and analytical skillsThorough, disciplined, methodical approach, with good documentation habitsStandout colleague with exceptional conversational & written communication, negotiation & presentation skillsExperience integrating cameras into system electronic and mechanical architecture, with an understanding of optics/sensor/image pipeline preferred.MS with 5+ years—or BS with 7+ years of relevant industry experience", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nImaging and Sensing Incubation has a growing team that develops ideas and design solutions for user experience and new technologies for Apple products, including the iPhone, iPad, Apple Watch, MacBooks, and more. Our team plays a key role in creating ideas and mechanical hardware for early systems that integrate new technology for demo, experience development, data collection and feature development. New challenges arise every day that require the sharp analytical skills of talented and smart individuals. We have a collaborative, inclusive, and hands-on environment that cultivates engineering excellence, creativity, and innovation. You will contribute your own unique talents by working with engineers, designers, and scientists to realize prototype concepts that synthesize electrical, mechanical and software components. Come, join us in crafting best-in-class solutions!"}, "200462499": {"jobID": "200462499", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Deep Learning Camera Incubation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462499/deep-learning-camera-incubation-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Deep learning principles, architectures, and expert hands-on programming experience (high preference for PyTorch).State-of-art computer vision approaches, and hands-on programming in C++/OpenCV, Matlab.Strong theoretical foundation in fundamental signal processing, stochastic processesSome experience in prototyping new technologies or systems.Ability to learn quickly and become familiar with different technology areas.Joint design of imaging HW and the digital processing leveraging deep learning to create computational imaging systems.Integrated processing of different sensing modalities including depth sensingCamera architectures and processing pipelines.", "jobDescription": "Apple is looking for a world-class prototyping engineer to join a multi-disciplinary team to create ideas and concepts for future Apple camera products and customer experiences.\nOur Camera Incubation Team is responsible for looking down the road and explore and prototype novel camera experiences, architectures and technologies. We collaborate with design and product teams to bring new features across the Apple product line. We would love you to join our team to tackle these challenges!\nThis team is seeking a computational imaging and vision expert with excellent theoretical and practical knowledge of deep learning, as well as hands-on prototyping skills. As a member of the Camera Incubation team you will be part of a dynamic, fast-paced environment that requires excellent collaborative skills, as well as passion and dedication to demonstrate your ideas with concept prototypes.\nA successful candidate has significant experience with the broader application of machine learning for exploration of new capabilities in the visual processing space, is comfortable with state of the art deep learning architectures and techniques, and has a good understanding of the image formation process from photons to professionally looking images, or to facilitating machine-vision applications. We are looking for an individual with a rapid prototyping mindset, able to adjust to changes in project directions based on insights obtained from experimental or simulated data. The candidate should be able to clearly articulate what motivates a particular approach, and its pros and cons as well as risks."}, "200432581": {"jobID": "200432581", "origin_search": null, "posted": "Oct 12, 2022", "jobTitle": "Machine Learning Engineer - DI Optimization - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432581/machine-learning-engineer-di-optimization-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Background in computer science, mathematics, or similar quantitative field with a minimum of 6 years professional experience. Graduate degrees in these fields a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "6+ years of recent experience in a data science or machine learning engineering role. Preferably experience in the digital advertising industry or related field.Programming skills in Python and SQL, and familiarity with packages like sk-learn, xgboost, PyTorch, JAX, etc highly desirable.Comfortable with hybrid cloud technologies such as Hadoop, AWS, Snowflake, Spark and PySpark. Familarity with job orchestration frameworks like Airflow also desireable.Experience in quantitative analysis including regression, classification, clustering, and time-series analyses. Experience in geospatial analysis, deep learning, and / or natural language processing preferred.Ability to communicate the results of analyses in a clear and effective manner with product and leadership teams to influence the overall strategy of the productAbility to partner with engineering, meet the data needs of the business, finding creative analytical solutions and develop initial prototypes to address messy business problems.Experience with end-to-end implementation of a model prototype specifically training, processing, feature engineering, evaluating model outputs, and putting models into productionAbility to operate comfortably and effectively in a fast-paced, multi-functional, rapidly changing environment.Background in computer science, mathematics, or similar quantitative field with a minimum of 6 years professional experience. Graduate degrees in these fields a plus.", "jobDescription": "At Apple, we work every single day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily discover informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in the App Store and Apple News. Our platforms are highly performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy.\n \nThe Ad Platforms Data Insights team is seeking a machine learning engineer to join in developing the next generation of analytical solutions working with Engineering, Product, Sales, Marketing, and Finance. In this role you will work as a key member of a data-centric team to drive the exploration, analysis, development, execution, and measurement of analytical solutions that are essential to running and growing the business. \n \nResponsibilities include turning the huge amounts of data generated by user searches, app content, and App Store context into business insights that improve the customer experience for the end-user as well as drive discovery and productivity for app developers. Do you have experience in applied research with expertise in pattern mining, anomaly detection, text analytics, predictive modeling, classification, and optimization? This role requires both a broad knowledge of existing data mining algorithms and creativity to invent and customize when necessary. You'll dig in and get into the details. The theory behind the techniques are just the beginning. You'll be working on projects where practical applications of these approaches get applied in real-world scenarios. \n \nSuccessful analytics teams involve data scientists and data engineers working hand in hand to build insightful and efficient solutions. In your role, you will be a key player in a multi-functional team that delivers insights that have direct and measurable impact. We're looking for a smart, collaborative, and passionate person to join this amazing team."}, "200436474": {"jobID": "200436474", "origin_search": null, "posted": "Oct 17, 2022", "jobTitle": "Computer Vision Acceleration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436474/computer-vision-acceleration-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Master’s degree or Bachelors degree with in Computer Science or equivalent experience with a focus on machine learning and computer vision."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ year experience in the area of hardware/software acceleration of video or image processing (computer vision, codec etc)5+ year experience of embedded system programming, familiar with low level device driver programming, system performance monitoring and tuning etcFamiliar with computer architecture, inter process communication and data streaming modelStrong C++/C programming and problem solving skillsStrong communication skills; great work ethic and teamworkExperience with DSP programming or computer vision experience is a big plusMaster’s degree or Bachelors degree with in Computer Science or equivalent experience with a focus on machine learning and computer vision.", "jobDescription": "We're looking for a computer vision acceperation engineer to help build next generation computer vision technologies and emerging innovations. The ideal candidate will have strong passion to work with an engineering team to deliver high quality products and solve challenging technical real world problems. You work with cross functional teams including CV algorithm, HW design and driver teams in Cupertino and other locations to optimize, define and implement new generation of computer vision technology."}, "200357160": {"jobID": "200357160", "origin_search": null, "posted": "Sep 16, 2022", "jobTitle": "Machine Learning Engineer, Trajectory Prediction - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200357160/machine-learning-engineer-trajectory-prediction-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A minimum of a Bachelor’s degree in Machine Learning, Robotics, Statistics, Computer Science or a related field.\n\nIf this is you, we'd love to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in Python and/or C++ with a minimum of 3+ years using these languages in a machine learning (ML) research capacity3+ years experience in ML and deep learning (DL)1+ years of experience using ML technologies, such as PyTorchExperience researching current DL literature and the math of machine learning: optimization methods, common types of models and layers, etc.Understanding of modern machine learning concepts and state of the art deep learning frameworksStrong software engineering skills to create scalable and robust infrastructure for deep learning data, modeling, and evaluation systemsProven ability to train and debug deep learning systems: Define metrics and datasets, performing error analysis, training models in a modern DL frameworkPassionate about building extraordinary autonomous systemsCreative, collaborative, and project focusedExcellent communication skills — you collaborate effectively with other teams and communicate clearly about your workExperience with CNNs, GNNs, Transformers, RNNs, LSTMsA minimum of a Bachelor’s degree in Machine Learning, Robotics, Statistics, Computer Science or a related field.\n\nIf this is you, we'd love to hear from you.Preferred Experience:• Experience in applying deep learning to robotics problems and predicting multimodal behaviors for agents• Experience with hardware specific optimization of ML models and deployment", "jobDescription": "Apple is looking for world-class qualified ML/Deep Learning engineers to develop and integrate machine learning technologies within our Special Projects Team, focusing on autonomous technologies in a real world robotics application."}, "200374121": {"jobID": "200374121", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200374121/systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS EE/CE/CS required. MS EE/CE/CS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum 3+ years of Software, instrumentation, or test development experienceMust have: Experience in software development using C/C++Excellent written and verbal communication skillsExcellent problem-solving skills to debug and perform failure analysis across a variety of engineering domainsExperience in design of experiment (DOE) and other problem-solving processesAble to understand and perform statistical data analysisFamiliarity with electronics debugging tools (DMM, Oscilloscopes) and circuit & electrical engineering fundamentalsBS EE/CE/CS required. MS EE/CE/CS preferredNice to have:5+ years of relevant industry experience in systems engineering, software development orExperience with digital signal processing or image processingExperience with Objective C or SwiftExperience in firmware development (knowledge of I2C, SPI, and other protocols) in data acquisition & measurement systemExperience working in high-volume consumer electronics projectsBackground with Touch or Sensing Technology", "jobDescription": "The Instrumentation and Test technology team architects and designs best-in-class Test and Measurement Instruments. The team is a collaborative group of creative and smart people developing highly complex and sophisticated Test and Measurement equipment to support the testing of sensors in our world-class products.\nThis individual will play a key role in defining, architecting, specifying, designing, validating, and developing Test and Measurement Instruments to support our consumer product bring up, characterization, ramp, and production."}, "200211554": {"jobID": "200211554", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "AIML - Data Infrastructure Engineer, Machine Learning Platform and Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200211554/aiml-data-infrastructure-engineer-machine-learning-platform-and-technologies?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S., M.S., or PhD in Computer Science, Computer Engineering, or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Experience managing Kubernetes clusters, or run distributed applications in Kubernetes environment.Familiar with AWS technologies such as EC2, S3, RDS and IAM.Fluency in Python, Java, or scripting language.Ability to debug complex issues in large scale distributed systems.Passion for building infrastructure that is reliable, easy to use and easy to maintainExcellent communication and collaboration skillsExperience with distributed system such as Spark/Flink/Kafka/Cassandra is helpful but not requiredB.S., M.S., or PhD in Computer Science, Computer Engineering, or equivalent industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "The Data Infrastructure team within the AI/ML organization powers analytics, experimentation and ML feature engineering to power Siri and our Apple devices. The mission of the Data Infrastructure org is to provide cutting edge, reliable and easy to use infrastructure for ingesting, storing, processing and interacting with data and help the teams that build data intensive applications be successful.\n\nThe Data Infrastructure team is looking for engineers who want to bring their passion for infrastructure to build world class infrastructure products. You will build and lead our data infrastructure team and help the members of your team grow both technically and professionally. You will work with many cross functional teams and lead the planning, execution and success of technical projects with the ultimate purpose of improving the experience for Apple customers."}, "200425055": {"jobID": "200425055", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "ML and Data Infrastructure Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425055/ml-and-data-infrastructure-engineer-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You have hands-on experience in building distributed systems, including real-time streaming and batch data processingYou are proficient in multiple programming languages relevant for such systems (e.g. Python, C++, Go, Java)You know what it takes to deploy and operate high availability production systems in the cloudYou have experience designing service-oriented architectures and leveraging various data stores technologies (blob, NoSQL, and relational)You have experience with cloud computing platform like AWS, GCP and Azure", "jobDescription": "As an engineer in the Special Projects Group, you will be part of a team building infrastructure and tools for exciting new technologies that will shape the future. You will work in a startup-like environment where products are still being defined and developed, giving you the chance to influence some of the core tools used by the project. You will be part of every stage of development from concept to deployment.\n\nWe are looking for an senior engineer to architect, build and scale a robust ecosystem for data processing and distributed computation. Specifically you will develop solutions that will orchestrate and support the seamless transitioning of petabytes of data through various stages like ingestion, indexing/mining, transformation, machine learning and algorithm validation."}, "200423347": {"jobID": "200423347", "origin_search": null, "posted": "Nov 17, 2022", "jobTitle": "AR/VR Frameworks Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200423347/ar-vr-frameworks-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "We are looking for someone with a track record of API and framework developmentYou have strong object-oriented programming skills in Objective-C and SwiftYou demonstrate strong communication, collaboration, and social skillsYou have proven expertise in building and shipping high quality softwareYou’re self-directed and can solve problems independentlyBS/MS in Computer Science or equivalent experienceAn interest and passion for AR/VR technologiesExperience with iOS development is a plusExperience in 3D graphics, real time graphics, or 3D math is a plus", "jobDescription": "Apple's Technology Development Group is seeking a Software Engineer to help architect and implement networking frameworks and APIs for our next-generation interactive computing platforms. This engineer will enhance the capabilities and performance of AR/VR systems through the development of distributed systems, and a broad range of applications, including machine learning, computer vision, and multimedia processing. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day."}, "200456030": {"jobID": "200456030", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "AIML - Machine Learning Engineer, Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456030/aiml-machine-learning-engineer-siri-and-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S., M.S. or Ph.D. in Computer Science, Electrical Engineering, Statistics, Applied Math, Physics or related fields."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "7+ years of professional work experience applying machine learning to real-world problems, and crafting scalable and effective data solutions.Strong domain knowledge in at least one of the following: NLP, information retrieval, data mining, speech recognitionExcellent programming skills in PythonGood experience with applying Big Data tools (MapReduce, Hadoop, Hive and/or Pig, Spark) to large quantities of textual dataExcellent data analytical skills. Strong attention to detail. Proven ability to dive into data to discover hidden patterns and conduct error/deviation analysisExcellent problem solving, critical thinking, and communication skills.Domain knowledge in applied statistics and experimental design is big plus!Enthusiasm for continuing to learn state-of-the-art techniques in machine learning/data scienceB.S., M.S. or Ph.D. in Computer Science, Electrical Engineering, Statistics, Applied Math, Physics or related fields.Strong background in A/B testing procedure, causal analysis, and cohort analysis.Exposure to model interpretability techniques and their real-world advantages/drawbacksGood Conversational AI domain knowledgeExperience working with end-to-end pipelines and/or crowd-sourced data labeling", "jobDescription": "Do you want to leverage your ML skills and NLP domain knowledge to play an important role in the next revolution of Natural Language Understanding/Conversational AI? Would you like to join the team that’s creating groundbreaking conversational assistant technologies that already helps millions of people get things done on daily bases? Join the Siri team at Apple! \n\nAs a Machine Learning Engineer within Siri team, you will define new approaches for evaluating ML based systems, conversational AI, and model interpretability. You will run experiments, statistically interpret data with a mind on causation, data visualization, plus designing, building, and evaluating models. You will work with large amounts of real-world data to analyze and propose changes to Siri user experience. You will ensure data quality throughout all stages of acquisition and processing, data wrangling, etc. Your expertise in defining and measuring the online and offline end-to-end metrics will help communicate, evaluate, and iterate on state-of-the-art deployed models and predictors."}, "200463889": {"jobID": "200463889", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463889/qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS CS/CE/EE (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$190,000,"}, "benefits": null, "requirements": "3+ years experience as a Software QA EngineerPassion for quality, exceptional attention to detailProven hands on experience with manual testingStrong knowledge of software development lifecycle, testing methodologies, QA terminology and processesExcellent written and verbal communication skills, be able to describe and document clearlyAbility to multi-task and manage tasks with varying prioritiesAbility to work cross-functionally with other teams and groupsExperience with developing, running, and triaging automated test suites.Experience in implementing initiatives across teams.Ability to investigate, debug and triage difficult problems and independently work towards results.Experience in maintaining/enhancing test framework in scripting languages (e.g. Python)Experience with computer vision/machine learning algorithms preferredBS or MS CS/CE/EE (or equivalent)Experience in test automation frameworks that involve HW & SW subsystem.Experience with macOS, iOS and Xcode.", "jobDescription": "The Technology Development team is looking for a QA Engineer to enhance our capabilities to track and improve the quality for new and exciting technologies. We’re seeking an excellent communicator and problem solver who can help evaluate and uphold our software testing processes to ensure the highest quality and best practices towards delivering the algorithms that will shape the future of AR. You would be instrumental in helping us maintain Apple’s high quality and attention to detail for future products by ensuring the code we write is well tested and integrated. As a member of our fast-paced group, you will have the unique and rewarding opportunity to be part of and shape upcoming products that will delight and inspire millions of Apple’s customers every day. \n\nIf you are a highly motivated engineer with passion for quality and exceptional attention to detail who wants to make an impact across teams at Apple that is crafting the future of augmented reality technology in Apple product platforms, we want to hear from you!"}, "200355888": {"jobID": "200355888", "origin_search": null, "posted": "Mar 11, 2022", "jobTitle": "State Estimation Engineer — World Representation / Localization", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200355888/state-estimation-engineer-world-representation-localization?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Masters or PhD in Computer Science, Robotics, Machine Learning, Engineering or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience developing and integrating state estimation algorithms for localization, calibration, mapping, or SLAM applications in robotic systems.Experience developing algorithms which fuse many sensor modalities is a plus.Very strong background in C++ development for Linux. Ability to understand and prototype in a python codebase is a plus.Excellent communication: strong interpersonal, verbal and written skills.Experience with machine learning and recent literature is a plus.Masters or PhD in Computer Science, Robotics, Machine Learning, Engineering or equivalent professional experience.", "jobDescription": "Apple is looking for passionate, talented, and results-oriented robotics / state-estimation engineers to join our team and work on exciting technologies for autonomous systems. In this position, you will have the opportunity to work with a cross-functional team on innovative hardware/software technologies, enabled by the systems you build.\n\nJoining our team, you will get to work with a fantastic group of talented and dedicated engineers and researchers. We hope you’re excited about the values that drive us: \n• Passion for the mission:  we’re here to make something great. We take on whatever work is right for the mission and strive for the best possible results. \n• Humility:  the right answer is more important than being right. We search for solutions as a team and value clear-eyed feedback. \n• Lean habits:  you can’t grow without limits. Time constraints and big goals encourage us to sharpen our focus and learn to make great decisions."}, "200323237": {"jobID": "200323237", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200323237/performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE or equivalent experience is expected."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "In-depth knowledge of tools and techniques for analyzing and benchmarking of operating systems, application/algorithm performanceVery good systems programming in C, C++Experience troubleshooting latency-critical softwareExcellent written and verbal interpersonal skillsBS or MS in CS/CE or equivalent experience is expected.Familiarity with Metal or OpenGL or DirectXFamiliarity with iOS, Xcode, CPU/GPU ArchitectureFamiliarity with Computer Vision, algorithms, Machine LearningFamiliarity with GPU performance tuning techniques, GPU performanceApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group is working on exciting new technologies. We are looking for a driven and dedicated performance engineer. This team is building the core foundational platform for some of Apple's most advanced technologies including the augmented reality (AR) and virtual reality (VR) support offered in ARKit and Metal. As part of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every day."}, "200218116": {"jobID": "200218116", "origin_search": null, "posted": "Nov 9, 2021", "jobTitle": "Product Manager, TV App Sports", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200218116/product-manager-tv-app-sports?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "BA, MS or Ph.D or equivalent "}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Excellent presentation and communication skills in presenting strategies and features, pitching to leadership and gaining support across the company from teams in engineering, design, privacy and R&D.5+ years of product management or experience building working products in machine learning, personalization, recommendation or similar.Deep understanding about privacy, particularly around personalization.Drive to innovate experience driven algorithmic products.Understanding of complex data management problems, and related machine learning techniques.Analytical skills in product analysis, insights and performance metrics from data.Deep understanding of the opportunities and limitations of machine learning.A strong interest in digital media products and services.Ability to influence diverse teams to adopt best practices and models, working towards the delivery of long-term strategy.Self-motivated and proactive, with demonstrated creative and critical thinking capabilities.BA, MS or Ph.D or equivalent ", "jobDescription": "The Apple Media Products team creates services and experiences across video, music, books, podcasts and news products spaces. We are seeking a product manager to work on our personalization program, work closely with engineering teams to develop new strategies and techniques to personalize the experience of our customers both within services and across the Apple ecosystem.\n\nAs part of a wider Services Platform team, you would be working with teams across the company to develop personalization efforts that work across services. This will feed into long-term strategic plans and help drive the next generations of our features and product lines. We face unique challenges, dealing with 100M+ films, TV shows, songs, podcast episodes, books, and news articles, which impacts the experience of over 1 Billion customers. \n\nCome be part of a team innovating and collaborating closely with teams across Apple!"}, "200461563": {"jobID": "200461563", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "AIML - Sr iOS Engineer, Global Accuracy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461563/aiml-sr-ios-engineer-global-accuracy?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master’s in Computer Science or equivalent (industry) experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "10+ years of industry experience as a full stack software engineering with a focus on iOS Track record as a software architect focused on iOS experiences that are accurate, performant and scalable.Strong analytical skills to partner with data science teams to identify projects that will improve the quality of Siri experiences.Proactive communicator, with experience guiding strong results via cross-functional partnerships and leadership skills.Master’s in Computer Science or equivalent (industry) experience.", "jobDescription": "Do you love the convergence between machine learning and languages? Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, big data, and artificial intelligence. And work with the people who built the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri team at Apple. The Siri team is looking for an outstanding senior iOS engineer to build and lead a team of the team responsible for driving quality initiatives across all experience components and languages that power Siri."}, "200449166": {"jobID": "200449166", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "SLT Systems Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449166/slt-systems-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "At least 3 years of experience in systems software design and developmentExcellent programming (C++/C/ C#) and scripting skills (Python)Proficiency with developing large, complex system softwareAbility to work under tight schedule and deliver on timeExperience software development on windows/ Mac OS/ Linux OS.Good understanding of network technologies, protocolsBS and a minimum of 3+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!   \n\nThe SLT team engages in multi-disciplinary effort to design, develop and maintain our current and next generation system level test platform solutions. As the number of SOC’s keeps increasing, we are growing our team to meet the scope and complexities required to deliver outstanding SOC test platform solutions. We are looking for system software engineer to architect, build and maintain system software that powers our current and next generation of system level test equipment. The ideal candidate will have a strong mix of education and practical experience with a real passion for solving diverse engineering challenges. A successful candidate in this role will demonstrate deep knowledge in sophisticated software design and development."}, "200443402": {"jobID": "200443402", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Machine Learning Software Engineer-Photos Algorithms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443402/machine-learning-software-engineer-photos-algorithms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.S or Ph.D. degree in Computer Science, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Exceptional problem-solving and interpersonal skills5+ years experience in building machine learning and deep learning algorithms end to end in a production settingDeep expertise in one or more of the following areas - Search, Recommendations, Ranking, and Knowledge GraphsRobust applied software methodology, process, and quality skillsProven ability to excel in a fast-paced development teamM.S or Ph.D. degree in Computer Science, Electrical Engineering, or equivalent experienceExperience writing Swift/Objective-C applications for iOS or macOSExperience optimizing ML and Deep Learning algorithms for embedded systems", "jobDescription": "Do you have a passion for building the best photo app experience in the world? iPhone is the most popular camera in the world! Seamless integration of software and hardware has delivered magnificent experiences like Photos Memories and Portrait Mode. The Camera & Photos team develops privacy-respecting machine learning technologies to ship emotional experiences to hundreds of millions of users worldwide. We are looking for an experienced Machine Learning Engineer to join our team to be part of this mission."}, "200460922": {"jobID": "200460922", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Software Engineer - Photos Storytelling", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460922/software-engineer-photos-storytelling?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. / M.Sc. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent analytical, problem solving, interpersonal and communication skillsExperience with Apple system level APIs and frameworksExpert knowledge of data structures, algorithms, and object-oriented programmingFirm grasp of asynchronous programming conceptsExperience developing mobile software productsInterest in applying machine learning algorithms to productAbility to develop and optimize code to run on a constrained environmentFamiliarities with Knowledge Graph and Traversal AlgorithmsDemonstrated expertise with Objective-C / C++ / SwiftB.S. / M.Sc. in Computer Science or equivalent experience", "jobDescription": "Do you have a passion for building the best photo library in the world?\n\niPhone is the most popular camera in the world. Detailed integration of software and hardware has delivered magical experiences like Photos Lock Screen, Photos Memories, Cinematic Video, and Portrait Mode. The Camera & Photos team creates privacy-respecting machine learning technologies to ship emotional experiences to hundreds of millions of users worldwide.\n\nWe are looking for an outstanding senior software engineer to architect and develop innovative algorithms and infrastructure for the next generation of thoughtful and personal products we deliver. If you thrive on problems at the intersection of algorithms, applied machine learning, and user experience, this position will excite and inspire you."}, "200355010": {"jobID": "200355010", "origin_search": null, "posted": "Mar 10, 2022", "jobTitle": "Machine Learning Engineer, Framework - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200355010/machine-learning-engineer-framework-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors, Masters, or PhD Degree in Computer Science or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong programming background, with extensive experiences in Python. Experience with C++ is a plus.Background in building distributed systems, data pipelines, working with various cloud technologies.Experience with developing large scale machine learning, reinforcement learning infrastructure is a plus.Past experience in developing production DL models and familiarity with common DL frameworks is a plus.A strong desire to learn new things and to become an expert at what you do.Bachelors, Masters, or PhD Degree in Computer Science or equivalent professional experience.", "jobDescription": "Apple is looking for Machine Learning engineers to develop ML frameworks for various robotics applications. Your work will directly enable researchers and engineers to build state-of-the-art ML models tackling extremely complex problems that can be deployed into the physical world.\n\nWhat you’ll do:\n• Develop highly scalable, efficient, and flexible machine learning frameworks that can perform supervised/reinforcement learning on a massive scale.\n• Address short-comings and develop new features in our framework by directly working with and contributing to multiple production ML projects.\n• Build tools, pipelines or workflows to help facilitate the analysis, evaluation and the eventual deployment of highly complex ML models."}, "200446274": {"jobID": "200446274", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Back End Engineer - Video Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446274/back-end-engineer-video-engineering?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "+2 years of Python+2 years of Django Framework+1 year of front end experience HTML/CSS/JS+1 Years experience with a major cloud platform e.g. AWSGood verbal and written communication skillsMature engineering practices, attention to detail and testingComfortable with Git, REST API’s, GraphQL, SQL and NoSQL databases.Comfortable dealing with big data over a petabyte in sizeBS/MS in Computer Science or equivalent experience", "jobDescription": "Why Apple? \n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nVideo Engineering Data Infrastructure team is working on technologies for future Apple products. We're looking for the right Full Stack Developer to join our team to help develop our next generation systems. In this role, you'll work on a highly dynamic team that designs and implements data management systems for powering computer vision and deep learning real time video products like FaceID, RoomScan, SLAM/VIO and ARKit. You will be working with experts in machine learning to develop tools, automation and data pipelines to collect, manage and validate massive amounts of data."}, "200457255": {"jobID": "200457255", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Data Scientist - Paid Media", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457255/data-scientist-paid-media?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/BA degree required; MS degree a plus - ideally in an analytical field such as Economics, Statistics, Mathematics, Software Engineering, Finance, Applied Sciences, etc."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "5+ years of experience in Applied Science or Data Scientist role, with emphasis on digital paid media metricsThorough understanding of digital media metrics, both from a brand and direct response perspective - digital subscription business experience is a plusA track record of developing concise and significant analytic objectives from general business goalsStrong proficiency in statistical analysis and programming - SQL, Python or R.Strong proficiency with databases including SQL queries and visualization tools (e.g.Tableau)Experience with standard marketing data science analysis to include experimental design, linear regression, survival analysis, clustering, classification, and forecastingAbility to employ relevant statistical and machine learning methods for building predictive modelsAbility to develop A/B test experimentation design and analysis as well as multi-variate testingMeticulous attention to detail, an ability to collaborate effectively between business and data groupsExcellent data visualization and storytelling skillsExcellent written and verbal communication skills and a keen ability to synthesize complex data pointsBS/BA degree required; MS degree a plus - ideally in an analytical field such as Economics, Statistics, Mathematics, Software Engineering, Finance, Applied Sciences, etc.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe Services Advertising team at Apple is responsible for cultivating awareness, building product education, and driving new customer acquisition across Apple’s full suite of first party services through a variety of marketing channels. We are looking for an experienced Data scientist to help identify key drivers of business metrics and optimize our campaigns in partnership with our in house activation team."}, "200441509": {"jobID": "200441509", "origin_search": null, "posted": "Dec 18, 2022", "jobTitle": "Computer Vision HW Optimization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441509/computer-vision-hw-optimization-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Master’s degree or Bachelors degree with in Computer Science or equivalent experience with a focus on machine learning and computer vision."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ year experience in the area of hardware acceleration of computer vision, image processing or video 5+ year experience of shipping SoC IP blocks, involved in SoC definition, SoC bring up, validation, low level programming and shippingFamiliar with hardware architecture, cache utilization, data streaming modelStrong communication skills; great work ethic and teamworkExperience with DSP programming or computer vision experience is a big plusMaster’s degree or Bachelors degree with in Computer Science or equivalent experience with a focus on machine learning and computer vision.", "jobDescription": "We're looking for a computer vision acceperation engineer to help build next generation computer vision technologies and emerging innovations. The ideal candidate will have strong passion to work with an engineering team to deliver high quality products and solve challenging technical real world problems. You work with cross functional teams including CV algorithm, HW design and driver teams in Cupertino and other locations to optimize, define and implement new generation of computer vision technology."}, "200400004": {"jobID": "200400004", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "AIML - Analytics Engineer, Data & ML Innovation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200400004/aiml-analytics-engineer-data-ml-innovation?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or related"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "You are a polyglot programmer who has experience with full-stack, data-oriented application development (we are fans of Python and Clojure). Experience with iOS development (Swift, Objective C, Xcode) is a plus.Designed and developed schematized instrumentation of the user experience in complex software system (e.g. protobuf, thrift)Know how to engineer data from robust pipelines and have a keen eye for how to scale and how to automate (e.g. Kafka, Spark, Elasticsearch).Statistical thinker: you care about distributions more than averages; you can find and investigate sources of variance; you ensure you can measure effect sizes from changes in the user experience.Self-motivated, curious with demonstrated creative and critical thinking capabilities and an innate drive to improve how things work!Track record of working well with constraints. You are creative in finding solutions that work within these constraints but courageous when you recognize constraints that must evolve.You have a high tolerance for ambiguity. You find a way through. You anticipate. You connect and synthesize.Can influence decisions with excellent verbal and written communication skills.BS/MS in Computer Science or related", "jobDescription": "Would you like to play a part in the next revolution in human-computer interaction? Create groundbreaking technology for large-scale systems, spoken language, big data, and artificial intelligence? And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking? The vision for the Siri Data organization is to improve Siri by using data as the voice of our customers. As an Analytics Engineer on the team, you will design, implement the generation of, and analyze data that informs the development of new classes of AIML-driven Siri experiences!\n\nTo succeed in this role, you must be a proactive and determined problem solver with a proven ability to work across multiple codebases, teams, and organizations. You must enjoy crafting compelling experiences, writing elegant code, and applying innovative new technologies in the service of human-centered design."}, "200461210": {"jobID": "200461210", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Java Backend Engineer, Universal Media", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461210/java-backend-engineer-universal-media?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Computer Science and Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proven experience programming in JavaStrong object oriented design and analysis skills coupled with a deep understanding of data structures and algorithms.Ability to communicate effectively, demonstrating problem-solving skills and a learning attitudeExperience in relational and/or NoSQL database systems such as Oracle DB, Postgres, MySQL, Cassandra, MongoDB, Amazon DynamoDB, etc.Experience in designing and implementing RESTful APIsBachelor’s degree in Computer Science and Engineering or related fieldUnderstanding of dependency injection systems, i.e. Spring and GuiceExperience and deep understanding with distributed data stores like Kafka, Redis, Solr, Lucene, etc is a plusFamiliar with micro-services architecture and server-side technologies", "jobDescription": "The Apple Media Products (AMP) Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\n\nWhat happens when the world's most innovative engineers collaborate with the world's most creative storytellers? TV gets reinvented. Meet the reinventors: The AMP Video Services teams created and manage the Apple TV app, which redefined and refined the way people watch their favorite shows, movies and so much more — including everything we love from the major subscription services.\n\nToday, these teams also manage one of the most exciting new realms at Apple: They bring viewers the critically acclaimed and award winning Apple Originals in Apple TV+. And they've engineered it so it can be enjoyed not only on Apple devices, but also directly on many new televisions and third-party streaming devices. To deliver Apple-level quality on a global scale, these engineers employ talent and tools to smoothly ingest and process a wide array of data. They work cross-functionally to handle video flow from content ingestion, store services, playback, and virtually everything else it takes to make the experience as seamless as possible. \n\nJoin them to see what else is there."}, "200432572": {"jobID": "200432572", "origin_search": null, "posted": "Oct 8, 2022", "jobTitle": "Machine Learning Engineer - DI Optimization - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432572/machine-learning-engineer-di-optimization-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Background in computer science, mathematics, or similar quantitative field with a minimum of 6 years professional experience. Graduate degrees in these fields a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "6+ years of recent experience in a data science or machine learning engineering role. Preferably experience in the digital advertising industry or related field.Programming skills in Python and SQL, and familiarity with packages like sk-learn, xgboost, PyTorch, JAX, etc highly desirable.Comfortable with hybrid cloud technologies such as Hadoop, AWS, Snowflake, Spark and PySpark. Familarity with job orchestration frameworks like Airflow also desireable.Experience in quantitative analysis including regression, classification, clustering, and time-series analyses. Experience in geospatial analysis, deep learning, and / or natural language processing preferred.Ability to communicate the results of analyses in a clear and effective manner with product and leadership teams to influence the overall strategy of the productAbility to partner with engineering, meet the data needs of the business, finding creative analytical solutions and develop initial prototypes to address messy business problems.Experience with end-to-end implementation of a model prototype specifically training, processing, feature engineering, evaluating model outputs, and putting models into productionAbility to operate comfortably and effectively in a fast-paced, multi-functional, rapidly changing environment.Background in computer science, mathematics, or similar quantitative field with a minimum of 6 years professional experience. Graduate degrees in these fields a plus.", "jobDescription": "At Apple, we work every single day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily discover informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in the App Store and Apple News. Our platforms are highly performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy.\n \nThe Ad Platforms Data Insights team is seeking a machine learning engineer to join in developing the next generation of analytical solutions working with Engineering, Product, Sales, Marketing, and Finance. In this role you will work as a key member of a data-centric team to drive the exploration, analysis, development, execution, and measurement of analytical solutions that are essential to running and growing the business. \n \nResponsibilities include turning the huge amounts of data generated by user searches, app content, and App Store context into business insights that improve the customer experience for the end-user as well as drive discovery and productivity for app developers. Do you have experience in applied research with expertise in pattern mining, anomaly detection, text analytics, predictive modeling, classification, and optimization? This role requires both a broad knowledge of existing data mining algorithms and creativity to invent and customize when necessary. You'll dig in and get into the details. The theory behind the techniques are just the beginning. You'll be working on projects where practical applications of these approaches get applied in real-world scenarios. \n \nSuccessful analytics teams involve data scientists and data engineers working hand in hand to build insightful and efficient solutions. In your role, you will be a key player in a multi-functional team that delivers insights that have direct and measurable impact. We're looking for a smart, collaborative, and passionate person to join this amazing team."}, "200460466": {"jobID": "200460466", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "HID - Embedded Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460466/hid-embedded-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Electrical or Computer Engineering, Computer Science, Mechatronics, or related field\n3+ years of related work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proficiency in C or C++ for Embedded SystemsExperience with multithreaded programmingExperience developing complex architectures in RTOS environmentsExperience optimizing for memory and execution time in resource constrained applicationsProven capability to apply software best practices to firmware designsStrong communication and collaboration skillsExperience working with analog and digital sensorsExperience with unit testing, static analysis and continuous integrationBS in Electrical or Computer Engineering, Computer Science, Mechatronics, or related field\n3+ years of related work experienceAs a HID firmware engineer, it’s also helpful to have experience in:• Be an active participant in the design process, presenting your new designs and the data to back them up, as well as accepting feedback from internal and external partners• Architect, implement and maintain complex firmware/software designs• Write clean, easy to understand, robust, testable, and balanced code tailored for embedded systems• Quickly debug and optimally close out system issues related to the product firmware, software, and systems• Participate in the definition and bring up of new sensing chipsets, ASIC’s, and SOC’s• Specify and document communication protocols, system states, and feature requirements in partnership with other firmware and software teams• Help select microcontrollers, define power management strategies, and review schematics with hardware teams• Collaborate with Quality Engineering teams to inform and craft their white-box testing• Collaborate with the Continuous Integration team to implement and maintain new automated testing strategies", "jobDescription": "The Human Interface Device group is looking for motivated engineers to join the multi-touch embedded development team. We develop touch and force interfaces for applications ranging from the smallest surfaces like the AirPods Pro to large surfaces like the iPad Pro. As a HID firmware engineer, you’ll get involved in early concept product discussions, crafting the sensing and software architecture, then shepherding that design through prototyping and eventually mass production. You’ll get to work with high-performance sensing technologies, write code for custom chips and Apple SOCs, and get to use next-generation Apple products before they’re announced!\n\nAs our products ship to millions of customers, our team’s impact is felt around the world! If you join our team, you will have immediate exposure to shipping products and will help craft our future roadmap, exploring new architectures and technologies."}, "200445504": {"jobID": "200445504", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "AIML - Distinguished Engineer, ML Platform & Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445504/aiml-distinguished-engineer-ml-platform-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or Ph.D. in Computer Science, Machine Learning, or a related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$266,000", "max": "$425,000,"}, "benefits": null, "requirements": "Excellent problem-solving (e.g. via building forward-looking prototype systems), critical thinking, strong communication, and collaboration skillsSolid understanding of state-of-the-art DNN acceleration architectures and their key performance (compute/memory) tradeoffsUnderstand, investigate, and formulate technical roadmaps for critical areas of interest for the companyProven programming skills using standard ML tools such as Python, PyTorch, Tensorflow, CUDA, Metal, and C/C++Strong applied experience with compiler technology to work with CPU, GPU, and ML acceleratorsMinimum of 10+ years of tech lead software engineering/ML experienceMS or Ph.D. in Computer Science, Machine Learning, or a related field", "jobDescription": "At Apple, our group is responsible for accelerating the creation of amazing on-device ML experience, and we are looking for a senior software architect. We want to future-proof software architecture for Apple’s on-device ML stack to embrace the heterogeneity of hardware and software and protect individual users’ privacy simultaneously. If you love crafting elegant solutions to technically challenging problems and building an important big-picture vision, we should talk.\n\nOur team collaborates with functional experts across Apple to design technologies that work in unison, influence the development of Apple’s state-of-the-art system-on-a-chip architecture, as well as build software development tools that find adoption by Apple’s AIML community (1P and 3P). We help ML developers (100s of 1P ML models, 1000s of 3P models) innovate and ship enriching experiences on Apple devices with high performance and privacy guarantees."}, "200257391": {"jobID": "200257391", "origin_search": null, "posted": "Oct 13, 2022", "jobTitle": "C++ SWE (Machine Learning Acceleration: Infrastructure and Frameworks)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200257391/c-swe-machine-learning-acceleration-infrastructure-and-frameworks?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Masters's degree or higher in Computer Science or equivalent field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "2+ years of experience developing ML frameworks and software solutions in industry or academia.Experience using modern machine learning frameworks like TensorFlow or PyTorch.Experience with modern IR for ML workloads (MLIR).Strong fundamentals in problem solving and algorithm designPassion for software architecture, API and development tool designAbility to write flawless, readable and maintainable code in C++Strong communication skills, and ability to present deep technical ideas to audience with different skillsets.Collaborative team player who can work well across multiple teams and organizations.Understanding of compiler developmentUnderstanding of hardware acceleration for ML workloadsMasters's degree or higher in Computer Science or equivalent field.", "jobDescription": "The SSP team is looking for an exceptional software engineer to help foster a vibrant ecosystem for machine learning development tools. In this highly collaborative role, you will be at the center of multiple efforts to make machine learning an accessible and powerful tool for all developers. \n\nWe are looking for applied machine learning engineers with a passion for developing  the infrastructure to use ML algorithms seamlessly. You will create ML infrastructure used across Apple, that power magical experiences for millions of Apple users and developers."}, "200441081": {"jobID": "200441081", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AIML - Machine Learning Engineer, Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441081/aiml-machine-learning-engineer-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS in Computer Science, Mathematics, Statistics, or a related field, or equivalent industry experience. Masters/PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Experience in natural language processing, machine learning or deep learningMastery of one of following languages: Python Go Java C++, demonstrating strong background in algorithms and data structuresExcellent interpersonal skills ability to work independently as well as in a teamExcellent knowledge and good practical skills in major machine learning algorithmsBS in Computer Science, Mathematics, Statistics, or a related field, or equivalent industry experience. Masters/PhD preferred.", "jobDescription": "Do you want to make Siri and Apple products smarter for our users? The Web Answers team is redefining how hundreds of millions of people use their devices to get their questions answered. We are an R&D team pushing the limits of question answering technologies, responsible for a production service powering part of Siri. We are part of a wider effort to power search and answers across a variety of Apple products – including Siri, Spotlight, Safari, Messages, and more. \n\nAs part of our team, you will be leveraging and improving upon the latest deep learning models in order to understand queries, rank documents, and find useful answers to users’ questions. Our team is responsible for deploying these models at scale, using the latest advances in model compression and inference-optimized hardware."}, "200436964": {"jobID": "200436964", "origin_search": null, "posted": "Oct 18, 2022", "jobTitle": "Senior Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436964/senior-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE or equivalent experience is expected"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of experience working on automation framework, app development, or iOS development.Solid Python programming skills and Python system building experience.Solid knowledge and experience in developing cloud computing and distributed systems to process large scale data, and in creating and maintaining evaluation platforms for the algorithms.Solid problem solving and debugging skills to analyze and investigate failures, driving issues to completionExcellent written and verbal communication skills are needed to facilitate close interaction with development teams, management, and other organizations within Apple.BS or MS in CS/CE or equivalent experience is expectedDemonstrated ability in increasing functional test coverage (UI, API).Demonstrated ability in enhancing test frameworks (scalability, reliability).", "jobDescription": "The Algorithm Analysis team is looking for a Senior Automation Engineer to enhance our data analysis capabilities for new and exciting technologies. As a member of our fast-paced group, you will have the unique and rewarding opportunity to be part of and shape upcoming products that will delight and inspire millions of Apple’s customers every day."}, "200464722": {"jobID": "200464722", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "HID - Algorithm Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464722/hid-algorithm-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in EE, CS, ME, mathematics, physics, or another engineering or technical field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Algorithm design for classification, filtering, signal processing or controlAnalyzing and presenting complex dataWorking with an embedded or resource-constrained system, and with C or C++Electrical engineering and hardware designMachine learningM.S. or Ph.D. in EE, CS, ME, mathematics, physics, or another engineering or technical field", "jobDescription": "Ever wanted to ship amazing experiences in Apple products? Be part of the engineering team that uses sensor signal processing to produce the next generation of human interfaces for iPhone, iPad, AirPods, Macs and more! Our group comes from a diverse set of backgrounds in signal and image processing, statistics, machine learning, controls, physics, neuroscience and human factors. We seek a manager to lead a small group of hardworking engineers, and work across the company with a wide range of others over a full product cycle. You will be responsible for the day-to-day management of the development process, and for delivering key product features on time and with high quality. To lead the team optimally, you will draw deeply on your technical background. To represent the team well, you will also need sufficient engineering breadth to have productive conversations with firmware and software teams, hardware technology teams, mechanical engineers, designers, and many other specialists."}, "200442585": {"jobID": "200442585", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "State Estimation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442585/state-estimation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS or have equivalent industry experience in a relevant subfield (robotics, computer vision, artificial intelligence, machine learning, computer science, mechanical engineering, electrical engineering, computer engineering)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "You have deep experience in some of the following areas: perception; 3D computer vision; machine learning; sensor fusion; state estimation; and object detection, classification, and trackingYou have a breadth of experience on at least one robotic platform (industrial manufacturing, manipulation platforms, autonomous vehicles, surgical, drones, etc) and understand how these systems are architectedYou can think at a \"system level\" about how all the pieces fit together, versus being solely focusing on a single module.You are a versatile software developer with experience developing and deploying perception algorithms and robotic systemsYou are a skilled software architect in the design and optimization of real time systemsBonus if you have iOS or other Apple software experiencePhD or MS or have equivalent industry experience in a relevant subfield (robotics, computer vision, artificial intelligence, machine learning, computer science, mechanical engineering, electrical engineering, computer engineering)", "jobDescription": "We're looking for a versatile state estimation engineer to join our team. You'll be working on building software architecture designs, state estimation algorithms, and validation strategies on products that will ship to millions of people."}, "200460739": {"jobID": "200460739", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460739/ar-vr-software-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or related field with 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Extensive track record of building and shipping complex applications or user facing systems on consumer platformsStrong command of object-oriented programming (C / C++ / Obj-C / Swift preferred)Extensive knowledge of application software design principlesDemonstrated technical leadership in building and shipping high quality softwareDemonstrated ability to communication and collaborate across team boundariesBS/MS in Computer Science or related field with 3+ years of relevant industry experienceReleased API based on modern design principles to other engineering teams (preferred)Experience with recommendation systems is a plusExperience with computer vision frameworks and multi-modal ML systems is a plus", "jobDescription": "Apps and experiences are at the core of unleashing the potential of AR/VR on Apple’s platforms. As a member of our team, you will be at the forefront of ideating, developing, and shipping groundbreaking experiences that build on top of the unique capabilities of AR and VR across a variety of areas. Our applications engineering team is uniquely positioned at the intersection of design, frameworks, operating systems, and low-level software — by joining us you will work closely with peers across these functions to deliver life-changing products to our customers. This team is working with some of Apple’s most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML), and computer vision (CV)."}, "200456022": {"jobID": "200456022", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "AIML - Senior Machine Learning Engineer, Text To Speech (TTS), Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456022/aiml-senior-machine-learning-engineer-text-to-speech-tts-siri-and-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S., M.S. or Ph.D. in Computer Science, Electrical Engineering or elated field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of professional work experience developing systems for text to speech, , speech synthesis, and natural language understandingExcellent programming skills in PythonExtensive experience with machine learning frameworks like Tensorflow, PyTorchGood experience with large-scale data processing and distributed systemsExcellent problem solving, critical thinking, and communication skills.Excellent data analytical skills. Strong attention to detail. Proven track record to dive into data to discover hidden patterns and conduct error/deviation analysisB.S., M.S. or Ph.D. in Computer Science, Electrical Engineering or elated field.", "jobDescription": "Do you want to maximize your ML skills and text-to-speech domain knowledge to play a meaningful role in the next revolution of Natural Language Understanding/Conversational AI? The Siri team is looking for a high caliber Machine Learning Engineer to define innovative approaches for evaluating text-to-speech systems. You will run experiments, statistically interpret data with a mind on causation, data visualization, plus designing, building, and evaluating models. Join the team that’s building groundbreaking conversational assistant technologies that already helps millions of people get things done on daily bases."}, "200438132": {"jobID": "200438132", "origin_search": null, "posted": "Oct 20, 2022", "jobTitle": "VIO/SLAM Algorithm Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438132/vio-slam-algorithm-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD in computer vision, robotics or machine learning; alternatively a comparable industry career, with significant experience on delivering products using state-of-the-art computer vision, machine learning and robotics technologies"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Multi-view geometrySLAM - Simultaneous Localization and Mapping experienceTraditional ML or deep learning domain knowledge for the above areas is a plusUnderstanding of visual inertial sensor fusion / or general sensor fusion is a plusSolid programming skills with c/c++Passion on cutting edge computer vision/machine learning technologies and product deliveryAbility to communicate the results of analyses in a clear and effective mannerPhD in computer vision, robotics or machine learning; alternatively a comparable industry career, with significant experience on delivering products using state-of-the-art computer vision, machine learning and robotics technologies", "jobDescription": "The Video Computer Vision organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video. We have contributed to the FaceID and FaceKit project in the past and more recently the new LIDAR iPad sensor. We are looking for the right Engineer to help us take our efforts to the next level.\n\nIn this role, you will work together with similar minds in a unique development team where your skills and expertise will be put into the Apple products. This role is highly multi-functional and you will work very closely with various highly skilled software development / ML teams developing groundbreaking algorithms."}, "200204847": {"jobID": "200204847", "origin_search": null, "posted": "Nov 3, 2020", "jobTitle": "Computer Vision Algorithm Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200204847/computer-vision-algorithm-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD in computer vision, robotics or machine learning; alternatively a comparable industry career, with significant experience on delivering products using state-of-the-art computer vision, machine learning and robotics technologies"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Multi-view geometrySLAM - Simultaneous Localization and Mapping experienceTraditional ML or deep learning domain knowledge for the above areas is a plusUnderstanding of visual inertial sensor fusion / or general sensor fusion is a plusSolid programming skills with c/c++Passion on cutting edge computer vision/machine learning technologies and product deliveryAbility to communicate the results of analyses in a clear and effective mannerPhD in computer vision, robotics or machine learning; alternatively a comparable industry career, with significant experience on delivering products using state-of-the-art computer vision, machine learning and robotics technologies", "jobDescription": "The Video Computer Vision organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video. We have contributed to the FaceID and FaceKit project in the past and more recently the new LIDAR iPad sensor. We are looking for the right Engineer to help us take our efforts to the next level.\n\nIn this role, you will work together with similar minds in a unique development team where your skills and expertise will be put into the Apple products. This role is highly multi-functional and you will work very closely with various highly skilled software development / ML teams developing groundbreaking algorithms."}, "200279438": {"jobID": "200279438", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "AIML - Software Engineer, Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200279438/aiml-software-engineer-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS, Ph.D. in a related field , or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$309,500,"}, "benefits": null, "requirements": "Strong coding skills and solid understanding of algorithms and data structures.Expert knowledge and experience in one or more languages such as Go, Python, Java, C++.Excellent interpersonal skills able to work independently as well as in a team.Solid understanding of the software development process, including unit testing and release management.Strong software architecture and design skills.MS, Ph.D. in a related field , or equivalent experienceExperience with Large Scale Distributed Systems is a plus.Experience in Machine learning and/or Natural Language Processing is a plus.", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. Do you want to make Siri and Apple products smarter for our users? \n\nThe Information Intelligence teams are building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Our universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. \n\nAs part of this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every single day."}, "200444666": {"jobID": "200444666", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "AIML- Sr Data Scientist, AIML Data", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444666/aiml-sr-data-scientist-aiml-data?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced degree in a quantitative field such as Statistics, Operational Research, Bioinformatics, Economics, Psychology, Computer Science, Sociology, Mathematics, Physics, or similar quantitative field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficiency in data science, machine learning, and analytics, including statistical data analysis and A/B testing. Experience crafting, conducting, analyzing, and interpreting experiments and investigations.Experience articulating and translating business questions and using statistical techniques to arrive at an answer using available data.Capable of driving projects of varying sizes and scopes - some will take months and some weeks — and you will need to know when to dive deep.Strong communication skills and the ability to naturally explain difficult technical topics (especially causal topics) to everyone from data scientists to engineers to business partners.Strong programming skills, including data-querying skills (SQL and/or Spark, etc.) and experience with a scripting language for data processing and development (e.g., Python, R, or Scala).5 years of relevant work experience.Advanced degree in a quantitative field such as Statistics, Operational Research, Bioinformatics, Economics, Psychology, Computer Science, Sociology, Mathematics, Physics, or similar quantitative field.", "jobDescription": "Do you get excited by driving product impact via measurement and evaluation, for products and services used by hundreds of millions of people globally? \n\nThe vision for the AIML Data organization is to improve products by using data as the voice of our customers. Within this organization the mission of the Search Analytics team is to inform product evolution through measurement, evaluation, and analysis of the user experience.\n\nYou will partner with Search engineering teams to improve search quality and guide feature development with data, to deliver amazing search experiences across iPhone, iPad, HomePod, Mac, Watch, tv, across dozens of languages."}, "200442337": {"jobID": "200442337", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "AIML- iOS Engineer, Machine Learning Platform and Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442337/aiml-ios-engineer-machine-learning-platform-and-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or related field, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Expertise with async processing and managing object lifecycle in ObjC or SwiftExperience with network and storage/persistenceStrong grasp of Apple development toolsExperience delivering iOS production grade softwareUnderstanding of client/server architectures and crafting Swift API’sUnderstanding of Swift Standard LibraryExperience with multi-threading in SwiftExcellent interpersonal skills able to work independently as well as in a teamStrong coding skillsBS degree in Computer Science or related field, or equivalent work experience", "jobDescription": "Do you want to make Siri and Apple products smarter for our users? The Siri Search & Knowledge teams are building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Siri’s universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. As part of this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every single day."}, "200358944": {"jobID": "200358944", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "AIML - iOS Engineer, Machine Learning Platform & Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200358944/aiml-ios-engineer-machine-learning-platform-infrastructure?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or related field, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years experience with crafting iOS/macOS apps in ObjC/Swift3+ years of experience with concurrency patterns in ObjC/SwiftExperience with Apple development toolsComfort with large codebases and practical solutionsUnderstanding of software patterns that allow for testingUnderstanding of client/server architecturesExcellent interpersonal skills; able to work independently as well as in a teamBS degree in Computer Science or related field, or equivalent work experience", "jobDescription": "Do you want to make Siri and Apple products smarter for our users? The Siri Search & Knowledge teams are building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Siri’s universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. As part of this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every single day."}, "200463040": {"jobID": "200463040", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Software Development Engineer in Test — Thermal Control Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463040/software-development-engineer-in-test-thermal-control-systems?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Master's Degree in Computer Science / Electrical Engineering or a related field or Bachelor's degree plus 5 years experience OR equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "3+ years of experience as a SDET Engineer.Excellent knowledge of software development lifecycle, testing methodologies, and testing tools.Hands on experience testing consumer products in lab environment, thermal control systems related experience is a plus.Experience developing and understanding test automation frameworks and libraries using scripting or other languages: Python, Perl, Ruby, JavaScript, Objective C, etc.Experience in developing test plan, assessing risk, filing appropriate defects, and providing relevant data for test reporting.Ability to make data driven decisions on a regular basisAbility to work cross-functionally, with strong organizational and communication skills- Master's Degree in Computer Science / Electrical Engineering or a related field or Bachelor's degree plus 5 years experience OR equivalent experience.Nice to have but not required:-  Understanding of Cellular Radio Technologies (5G NR, LTE etc)-  Exposure to commercial test systems like Keysight, R&S callboxes etc for lab validation.-  Experience with visualization tools to analyze large data sets", "jobDescription": "Would you like to join a key team helping to drive and improve the quality of future Apple products? \n\nWe are the Thermal SQA Team, and we are looking for highly motivated and experienced QA Engineer to develop test plans, test cases, run tests and analyze results to validate Thermal Control Systems on Apple products! You should have a strong interest for learning new technologies, crafting and running well thought out tests and experiments and effectively analyzing data produced. \n\nYou will be contributing to automated test development, collaborating with many different teams within Apple to further improve the quality of our products. \n\nCome join our team!"}, "200435762": {"jobID": "200435762", "origin_search": null, "posted": "Oct 14, 2022", "jobTitle": "Engineering Lab Manager - IT", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435762/engineering-lab-manager-it?team=CORSV", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science/Computer Engineering, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "3+ yrs of Linux system administration2+ years of experience in lab management, contractor management and the improvement of processes across these domainsExperience interpreting designs and assembling data center equipment: Servers, Networking, Power, RacksExperience procuring and keeping inventory of electronic parts, tools, and laboratory consumablesExperience running macOS machines at scale, in a data center or lab environmentMastery of lab safetyFlexibility and comfort working in a quickly changing environmentMeticulous organizational skillsYou have strong written and verbal interpersonal skillsBS/MS in Computer Science/Computer Engineering, or equivalent", "jobDescription": "The Hardware Technology organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video, including the support of product features like faceID and LIDAR. The Video Engineering Data Infrastructure (VEDI) Team is looking for an energetic and highly motivated engineering lab manager to assist in supporting and expanding multiple engineering lab spaces.\n\nThis role will support and report directly to VEDI's Labs team lead, as well as work closely with other technicians, engineers, and team leads, along with the opportunity to partner with some of Apple's best software development and machine learning teams."}, "200438044": {"jobID": "200438044", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "AIML - Sr Data Scientist, AIML Data", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438044/aiml-sr-data-scientist-aiml-data?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced degree in a quantitative field such as Statistics, Operational Research, Bioinformatics, Economics, Psychology, Computer Science, Sociology, Mathematics, Physics, or similar quantitative field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proficiency in data science, machine learning, and analytics, including statistical data analysis and A/B testing. Experience crafting, conducting, analyzing, and interpreting experiments and investigations.Experience articulating and translating business questions and using statistical techniques to arrive at an answer using available data.Capable of driving projects of varying sizes and scopes - some will take months and some weeks — and you will need to know when to dive deep.Strong communication skills and the ability to naturally explain difficult technical topics (especially causal topics) to everyone from data scientists to engineers to business partners.Strong programming skills, including data-querying skills (SQL and/or Spark, etc.) and experience with a scripting language for data processing and development (e.g., Python, R, or Scala).5 years of relevant work experience.Advanced degree in a quantitative field such as Statistics, Operational Research, Bioinformatics, Economics, Psychology, Computer Science, Sociology, Mathematics, Physics, or similar quantitative field.", "jobDescription": "Do you get excited by driving product impact via measurement and evaluation, for products and services used by hundreds of millions of people globally? \n\nThe vision for the AIML Data organization is to improve products by using data as the voice of our customers. Within this organization the mission of the Search Analytics team is to inform product evolution through measurement, evaluation, and analysis of the user experience.\n\nYou will partner with Search engineering teams to improve search quality and guide feature development with data, to deliver amazing search experiences across iPhone, iPad, HomePod, Mac, Watch, tv, across dozens of languages."}, "200455019": {"jobID": "200455019", "origin_search": null, "posted": "Jan 7, 2023", "jobTitle": "GPU Software Engineering Opportunities at Apple", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455019/gpu-software-engineering-opportunities-at-apple?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Some of the relevant degrees include:    Computer Science, Computer/Software Engineering or related degrees or experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are seeking results-oriented, upbeat and focused individuals with a strong passion for learning and developing new technologiesAbility to work efficiently across organizational boundariesExcellent organizational skills and attention to detailAttention to detail and the ability to reason about complex interactions between different componentsSome of the relevant degrees include:    Computer Science, Computer/Software Engineering or related degrees or experience.", "jobDescription": "Apple is a place where people from all backgrounds get together to do their life's best work.   Come join us.\n\nAt Apple, great ideas have a way of becoming great products, services and customer experiences very quickly.   Bring your passion to your job and there's no telling what you can accomplish.  Apple offers a collaborative work environment that fosters creativity and innovation.     \n\nEvery new product, service or feature we invent is the result of people working together to make each other's ideas stronger.  That happens here because every one of us strive towards a common goal - creating the best customer experiences.\n\nApple's GPU, Graphics, and Display Software team provide developers access to harness the power of the GPU across all of Apple's innovative products, from iPhone, iPad, Apple TV, Apple Watch to our Mac product line.  Join this team, and you’ll collaborate with engineers across Apple to develop tools and APIs to enable developers to create cutting-edge applications for graphics, machine learning, and compute."}, "200327520": {"jobID": "200327520", "origin_search": null, "posted": "Dec 22, 2021", "jobTitle": "Data Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200327520/data-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Masters in Computer Science or relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "A curious mindAn obsession for qualityBackground in Data science,  Data mining, Multivariate statistics, Computer vision, Machine learningExperience working with large scale data setsSolid programming skills including:PythonC/C++Experience with data visualization and presentation, familiar with data analysis tools such as TableauExcellent problem solving and communication skillsMasters in Computer Science or relevant experience", "jobDescription": "As part of our Video Engineering group, you’ll help deliver creative solutions to various problems that could impact the people all over the world. \n\nThis Data Engineer will work closely with other members of the Video Engineering group to mine data, implement model evaluation pipeline, analyze large scale data, visualize data, and ensure the delivery is of the highest quality. This position will also require strong coding skills, presentation skills, and collaborating with multiple teams (ex: machine learning, cloud infrastructure support)."}, "200323233": {"jobID": "200323233", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AR/VR Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200323233/ar-vr-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree and at least 3 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid knowledge and experience with C++Good understanding and comfort with 3D math (linear algebra).BS / MS in Computer Science OR equivalent degree and at least 3 years of experience.- Background in 3D rendering is a plus- Deep experience with at least one of Apple’s Rendering Frameworks (Core Animation, Core Graphics, Core Text, etc)Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR Software Development Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV). As a member of our organization you will assist us in exploring future products that will delight, inspire and empower millions of people."}}