{"200417977": {"jobID": "200417977", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "iOS Software Engineer (MSO)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200417977/ios-software-engineer-mso?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS CE/CS or equivalent experience required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Strong coding skills in one or more object-oriented language such as Swift, Objective-C, C++, or JavaStrong problem solving skillsExcellent performance and debugging skillsStrong system level understandingExcellent spoken and written communication skillsBS CE/CS or equivalent experience required-  Experience with Swift and Cocoa Objective-C & other similar frameworks-  Experience working on and shipping iOS applications-  Solid understanding and experience with iOS Frameworks and back-end integration-  Passion for digital health-  Background in health and healthcare a plusApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics.", "jobDescription": "AC Wellness Network LLC is a subsidiary of Apple Inc. and is the dedicated management services organization (MSO) for AC Wellness, a dedicated independent medical group that serves Apple Wellness Centers. Our mission is to deliver the world’s best healthcare experiences for Apple employees.\n\nThere is a tremendous opportunity to improve how people manage their health. Our MSO team is looking for outstanding engineers to help deliver amazing experiences that will address this need in meaningful ways."}, "200332455": {"jobID": "200332455", "origin_search": null, "posted": "Jun 14, 2022", "jobTitle": "iOS Frameworks Engineer - SensorKit", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200332455/ios-frameworks-engineer-sensorkit?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in designing, building, and shipping softwareExperience in Objective-C OR Swift OR CDeep understanding of multi-threaded programming and synchronization as well as multi-process IPC mechanismsExperience in systems programming and middlewareExperience working on developer-facing frameworks or librariesKnowledge of iOS programmingSolid understanding of fundamental computer science conceptsLaser-focus on the smallest details that are significant to our customersBachelors Degree in Computer Science or equivalent experience.Familiarity with iOS or macOS useful", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. We're looking for people who are passionate about building technology that will make a difference. We are looking for a highly motivated software engineer with technical fundamentals in Computer Science to work on our exciting products including the Apple Watch and iPhone. Be ready to make something extraordinary when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it. You should join the Apple Location Frameworks team if you want to help deliver the next amazing Apple product.\n\nBe ready to make something phenomenal when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join the Apple Location Framework team if you want to help deliver the next amazing Apple product."}, "200452097": {"jobID": "200452097", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Design Validation Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452097/wireless-design-validation-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 3+ years relevant experience required. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong Wireless RF background and familiarity with RF systems fundamentals.Solid experience of RF parametric testing such as IP3, NF, ACPR, phase noise, etc.Knowledge of loadpull testing is desirable.Characterized/Debugged RF PCB and chip issues within a test and script development.Strong working knowledge of RF test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Unix scripting knowledge is a requirement (objected oriented programming experience such as Python is highly desirable).Proficiency with basic metrics for determining quality of digital communication signals measured.BS with 3+ years relevant experience required. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\n\nWe invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200449778": {"jobID": "200449778", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Sr. RF PHY Test Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449778/sr-rf-phy-test-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "A minimum of 5+ years’ experience in a lab environment. Proficiency with basic metrics for determining quality of digital communication signals measured.Strong Wireless RF background and familiarity with RF systems fundamentals.Solid experience of RF parametric testing such as EVM, rx sensitivity, ACPR, blocker testing, etc.Knowledge of loadpull testing is desirable.Characterized/Debugged RF PCB and chip issues within a test and script development.Strong working knowledge of RF test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Unix scripting knowledge is a requirement (objected oriented programming experience such as Python is highly desirable).BS + 10 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with Phy, Mac, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200458858": {"jobID": "200458858", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Staff Software Engineer — Setup, Settings, and Essentials", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458858/staff-software-engineer-setup-settings-and-essentials?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor of Computer Science or equivalent skills and work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Stellar engineering quality & output — you separate concerns and define well-abstracted interfaces, delivering performant, well-tested, maintainable code with reasonable failure modesPlatform API design — you’re proficient at designing, building, and supporting a platform, understanding customer needs and constraintsTechnical leadership — you exemplify “what good looks like” in code, in documentation, making and delivering on commitments, and prioritizationCustomer focus — you make high-quality, user-centric product decisionsMentorship — you make everyone around you smarter and purposefully invest in the growth of your peers — especially junior engineersCritical thinking with influence — you systematically evaluate the tradeoffs associated with each potential solution to a problem, make an informed decision, and articulate these things well to influence others, driving impactTrack record of success — you have 10+ years of software engineering experience with impact to show for itBachelor of Computer Science or equivalent skills and work experience", "jobDescription": "Apple devices have revolutionized how people live, connect, and work. It’s not by chance! By thoughtfully blending beautiful, premium hardware with intuitive, innovative system software, we design and build a uniquely impactful user experience. As the System Experience team, we lead the charge in building this delightful experience.\n\nCome help define and build the essential pieces that shape Apple’s system experience—spanning iOS, iPadOS, macOS, and more. Work with an energetic, hard-working, fun team of managers, engineers, cross-functional teams, and world-class designers to deliver the best system experiences on the planet!"}, "200460176": {"jobID": "200460176", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "AR/VR Software Engineer, Server Development", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460176/ar-vr-software-engineer-server-development?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science/Engineering or related technical field, equivalent practical experience will be considered."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in server software programming languages such as JavaExperience with distributed systems design and developmentExperience with web services, RESTful APIExperience with test-driven developmentBS or MS in Computer Science/Engineering or related technical field, equivalent practical experience will be considered.BONUS QUALIFICATIONSExperience or interest in AR/VR applicationsExperience/knowledge of security and cryptographyExperience/knowledge of reactive programmingExperience with iOS / macOS development", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it.\n\nThe Technology Development Group is seeking a software engineer to help define and implement user experience paradigms for various compute environments across our platforms. This engineer will help architect and build the foundation of novel user experiences. Being successful in this area will result in a delightful experience for all users of our products. Are you passionate about building massively scalable services that surprise and delight? If you are passionate about solving challenging problems and enthusiastic about innovative and cool ideas, we want to hear from you."}, "200439592": {"jobID": "200439592", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Data Scientist- Sales Operations / Tableau", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439592/data-scientist-sales-operations-tableau?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in data science, statistics, economics, computer science or other quantitative field. Advanced degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  record of solving sophisticated analytical problems and positively influencing business outcomes-  3+ years of experience in developing optimized, complex SQL queries across large volumes of data in both relational and multifaceted data sources such as Hadoop, Snowflake or related-  3+ years of experience in applying Tableau to develop robust, interactive and visually impactful dashboards-  Experience to automate and scale analyzes and dashboards-  Outstanding written and verbal communication skills with experience building stories and narratives out of data-  Excellent research, project management, and interpersonal skillsBS in data science, statistics, economics, computer science or other quantitative field. Advanced degree preferred.Experience with advertising, measurement, and/or digital analyticsApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple dedicated to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "jobDescription": "JOB SUMMARY\nAt Apple, we work every day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. Launched in 2016, it is an easy, efficient and fast-growing platform for app discovery. With over 65% of all app downloads resulting directly from a search in the App Store, Search Ads is quickly becoming the app promotion platform of choice for iOS developers. We are looking for a hard-working and hardworking Data Scientist to support our growing advertising business. In this role, you will work within our Sales Operations team to support and empower the sales organization by building impactful analyses and insights. You’ll help us architect sophisticated but practical insights, establish strategies/priorities based on empirical observations and measure success."}, "200459779": {"jobID": "200459779", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "iPhone/iPad System Design Engineer - Power Modeling", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459779/iphone-ipad-system-design-engineer-power-modeling?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE Required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong EE/CS fundamentals with relevant experience in consumer hardware or electronics industries.Knowledgeable in complex system architecture power and performance metrics for SoC, wireless technologies, battery powered devices, and power electronics.Hands-on EE lab experience with DMM, digital scope, logic analyzer, ADC / amplifier circuits, control loops, and prototype rework.Proficient in programming and scripting (e.g. Matlab or Python) is expected. Able to process and analyze large data sets as power modeling inputs.Familiar with lithium ion battery management concepts such as capacity estimation, charging algorithms, and impedance analysis.Strong communication and people skills. Able to work with cross functional environment in a regular basis.Enthusiastic and self motivated. Good at problem solving. Fast learner.BS/MS EE RequiredPosition may require some international travel", "jobDescription": "The iPhone/iPad Hardware System Design Team is seeking an enthusiastic Electrical Engineer. You will work as part of a team that drives and influences future iPhone innovation. In this role, you will be at the center of iPhone product development, with a critical impact on overall design."}, "200428888": {"jobID": "200428888", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Display Electrical Architecture Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200428888/display-electrical-architecture-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS/PH.D. EE degree or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proficient electrical engineering background, especially in analog or mixed- signal circuit designExperience with simulation tools, for example, Matlab or Cadence  Hands-on lab experienceExcellent written and verbal communication skillBS/MS/PH.D. EE degree or equivalent", "jobDescription": "Apple is looking for an extraordinary Display Electrical Architecture Engineer to join the Display team. Display Electrical Architect must be out-of-box problem solver and will define the next generation display electrical architecture. A successful candidate will define the future display roadmap, help design qualification and be responsible for high quality engineering specification, analysis, verification and validation along the way. This position demands deep technical strengths in mixed-signal circuit design."}, "200448276": {"jobID": "200448276", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Wireless Systems Validation Engineer – WLAN, BT, UWB, Thread", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448276/wireless-systems-validation-engineer-wlan-bt-uwb-thread?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 10+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Practical knowledge of at least one Connectivity Wireless technology including WLAN, BT, UWB or ThreadPractical knowledge of at least one connectivity industry standards including 802.11, Bluetooth SIG, 802.15 requirements, compliance requirements and required testing methodologiesKnowledge of system level RF parametrics and its sources in RF component characteristics and behaviorHands-on experience with bench-level wireless testing, debug at the module, reference board or system-levelExperience with using RF lab test equipmentDebug-level experience on connectivity radio systems at the conducted level is a plusStrong written and verbal communication skillsBS with 10+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF System Engineering team is looking for a passionate, self-motivated individual to work on integration of WLAN, Bluetooth (BT), Ultra Wideband (UWB) and Thread technologies into Apple’s wireless products."}, "200447709": {"jobID": "200447709", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Wireless Systems Validation Engineer – WLAN, BT, UWB, Thread", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447709/wireless-systems-validation-engineer-wlan-bt-uwb-thread?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Practical knowledge of at least one Connectivity Wireless technology including WLAN, BT, UWB or ThreadPractical knowledge of at least one connectivity industry standards including 802.11, Bluetooth SIG, 802.15 requirements, compliance requirements and required testing methodologiesKnowledge of system level RF parametrics and its sources in RF component characteristics and behaviorHands-on experience with bench-level wireless testing, debug at the module, reference board or system-levelExperience with using RF lab test equipmentDebug-level experience on connectivity radio systems at the conducted level is a plusStrong written and verbal communication skillsBS required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF System Engineering team is looking for a passionate, self-motivated individual to work on integration of WLAN, Bluetooth (BT), Ultra Wideband (UWB) and Thread technologies into Apple’s wireless products."}, "200462502": {"jobID": "200462502", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Silicon Validation Tools Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462502/silicon-validation-tools-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to see how to make processes more efficient and automatic.Familiarity with computer / system / SoC architectureTechnical experience in silicon and pre-silicon validationBasic knowledge of RTL coding in VerilogBackground in hands-on automation script development and optimization (using Python, Perl and C).Proven analytical and problem-solving abilitiesGood understanding of embedded firmware/software development processesExperience with revision control systems including Perforce and gitUnderstanding of hardware/software interactionOrganized and detail oriented.Strong verbal and written communication skills.Bachelor's degree and a minimum of 3 years relevant industry experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nAs a Silicon Validation Tools Engineer, you will be part of the Silicon team, developing high performance Silicon. You will be a key member of the silicon validation team responsible for ensuring that we deliver high-quality silicon to customers.  As part of the silicon validation team, you will be responsible for ensuring system software configuration meets design specification.  You will improve validation and production software quality via innovations in processes, tools and automation."}, "200459943": {"jobID": "200459943", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Pro Workflow Innovation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459943/pro-workflow-innovation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree in CS or similar work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of application development, 3+ years of UIKit development.A proven track record of writing clear, efficient code in Objective-C and/or Swift.A desire to collaborate on the design and implementation of high performance, beautifully designed custom applications using Apple frameworks to be shared with the wider Apple development community.Passion and interest to be hands on and influence the design of future Apple products including Mac, iPad, and iPhone.Bachelor’s Degree in CS or similar work experienceFamiliar with:Apple’s ARKit and/or RealityKit, Pixar’s USD (Universal Scene Description) open source project, Python, Command line toolsInterest in:Collaborating directly with creative users of your applications, integrating feedback to quickly add features/fix bugs/re-scope features, AR, VR, and ML", "jobDescription": "Join a unique and highly niche team of creatives and engineers within Apple tasked with shaping the future of the Mac, iPad, and iPhone. Apple’s Pro Workflow team (part of the hardware division) is seeking an experienced iOS/iPadOS developer to join a small team designing, prototyping and building innovative new applications in the service of Pro Workflows. Our team is comprised of award-winning 3D/VFX, Video, Photography, and Audio creatives as well as highly specialized engineers and system architects. This individual will collaborate with a senior engineer and work multi-functionally to determine the best Apple technologies to bring to bear to help design and implement innovative new solutions to aid in the creative process."}, "200448517": {"jobID": "200448517", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Optical Sensing HW - Optical Characterization Engineer / Lab Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448517/optical-sensing-hw-optical-characterization-engineer-lab-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "• B.S in Optics, Physics, Electrical Engineering, or equivalent\n• 2-7 years industry or lab managing experience strongly preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Deep experience in optics lab instrument development, management, maintenance, and calibrationSolid practical understanding of optical systems and electronicsExperience using Python and/or Matlab to automate lab equipment control and data collectionExtensive hands-on experience with typical optics/electronics lab equipment (spectrometers, power meters, cameras/detectors, light source, optical stages/mounts, oscilloscopes, current/voltage sources, etc.) including using instrumentation to calibrate and characterize systemsTeam player with excellent written and verbal communication skillsHands-on micro assembly, soldering, electronics troubleshooting skills• B.S in Optics, Physics, Electrical Engineering, or equivalent\n• 2-7 years industry or lab managing experience strongly preferred", "jobDescription": "Design, develop, and launch next-generation optical-sensing technologies. \nBring devices to life and enable them interact with users and the environment in ways never imagined before. The optical sensing team integrates optical sensors across a variety of Apple products such as iPhones, iPads and Macs. The optical sensing team is looking for someone who is a self-driven go- getter. Strong experience with optics lab instrument development and management. Join us in crafting solutions the world doesn't know of yet."}, "200451432": {"jobID": "200451432", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Memory Subsystem Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451432/memory-subsystem-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Experience with digital logic design, CPU and SOC architecture/micro-architecture and memory subsystem is preferredStrong programming (C/C++, Verilog, Scripting), software optimization, and performance improvement skillsExperience in unit and full chip level test benchesExperience in developing testplans, assertions, and developing stimulusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designExperience with emulation and developing synthesizable transactors is a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all subject areas, with a critical impact on getting functional products to millions of customers quickly."}, "200359707": {"jobID": "200359707", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "iOS Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200359707/ios-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE/CS/CE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Software development experienceDevelopment experience with iOS system frameworksFull stack web developmentStrong Object-oriented programming and design skills in C++ and/or Objective-C and PythonProven debugging skillsExcellent communication and collaboration skillsExperience working remotely across time zonesSelf-motivated, fast learner, detail-orientedBS/MS EE/CS/CE or equivalent", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nThe Wireless Technologies team is looking for a highly motivated software engineer to help deliver our next generation of iOS and watchOS products. As a key member of the team, you will work cross-functionally with other software engineering, project management, and QA teams to develop and deliver the software that allows iOS/watchOS devices to work on carrier networks worldwide. This role requires excellent problem-solving and interpersonal skills, strong operating system fundamentals, proven programming skills, and a passion to make the best products possible. Must thrive in a multifaceted, fast-paced environment."}, "200463506": {"jobID": "200463506", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463506/engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Most of our engineers have advanced degrees such as MS or MBA in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Prior experience leading program management or engineering design of rapid development productsKnowledge of computer architecture and system development; familiarity with software development processExperience collaborating across multi disciplinary teams; ideally including Systems Engineering and Silicon DesignResilience and flexibility when faced with uncertainty and changes in directionSelf motivated with strong critical thinking capabilitiesMeticulous attention to detail and ability to simplify complexitiesExcellent communication, organization and leadership skills with ability to inspire and align team members; ability to filter and distill relevant information and package for the right audienceMost of our engineers have advanced degrees such as MS or MBA in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you.", "jobDescription": "Our team is responsible for the technical management of engineering development projects within Apple’s System Performance Architecture and Professional Workflows (SPA-PWF) organization. \n\nWe drive alignment across multiple teams to define system performance targets and lead the multi-year validation process across Apple devices spanning Mac, iPad, and iPhone product lines. By joining us in this role, you will be involved in developing workflows and assessing performance and usability of the Apple ecosystem (hardware, software, 3rd party) to inform system architecture decisions and software functionality to enable our most demanding professional users. \n\nThe ideal candidate will have a unique combination of computer architecture understanding and experience enabling large multi disciplinary teams to deliver consumer electronic systems quickly and with high quality. They will understand the who, what and how of hardware development, create and coordinate the program plan, and successfully drive it while balancing multiple objectives and priorities."}, "200370030": {"jobID": "200370030", "origin_search": null, "posted": "May 19, 2022", "jobTitle": "Opto- Mechanical Process Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200370030/opto-mechanical-process-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Mechanical Engineering or Equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Optomechanical background with strong working knowledge of high precision alignment process development of imaging optical assemblies.8+ years of experience designing and deploying high precision assembly tools and processes for optical/imaging devicesExperience in design of high precision alignment mechanisms, motion control systems, automated dispensing.Knowledge of image processing, MTF, contrast, geometric distortion, etc.Experience working with equipment vendors and contract manufacturersExperience in designing for low particle environments/cleanroomsBS or MS in Mechanical Engineering or Equivalent-  Travel is required ~25%", "jobDescription": "Apple is looking for optomechanical process engineer to join Panel Process and Optics (PPO) module team.  Engineers in the PPO-module team are responsible to develop new innovative manufacturing process technologies and equipment system designs to solve complex design challenges that have direct impact to future product, quality, and delivery of Apple Displays & Touch. This will be a technical lead role where the individual in this role will work closely with product design engineers, optical design engineers, software developers, project managers, validation engineers, operations, and suppliers to develop methods / stations / tools to support display module assembly and calibration from the concept/architecture definition stage through product engineering validation builds. We work at a fast pace and require everyone to be highly self-motivated. The individual should demonstrate strong ability to continuously develop personal knowledge and expertise in new technology for optical device calibration, assembly process design, manufacturing, and scalability."}, "200370702": {"jobID": "200370702", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "AIML - iOS Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200370702/aiml-ios-software-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S or M.S in Computer Science, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "2+ years of iOS development experience at the application level in Objective-C OR Swift AND C++Knowledge of Apple’s development APIs (Cocoa Touch, Cocoa, CoreFoundation)Proven experience leading cross-functional teams delivering software productsOutstanding communication and presentation skillsB.S or M.S in Computer Science, or equivalent experience", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. \n\nThe Siri iOS team is looking for exceptional engineers passionate about delighting customer’s experience, by producing cutting edge applications and technologies. We are a robust team looking for engineers excited about changing the future of speech technology."}, "200452515": {"jobID": "200452515", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Next Generation Wireless Prototype Infrastructure Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452515/next-generation-wireless-prototype-infrastructure-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proven track record in design and prototyping of at least one of: wireless systems, networking products, GPU/video processing and AI/ML hardwareExperience with prototyping or emulation using a multi-FPGA systemExperience with multi-gigabit transceivers in FPGA’s and deploying different protocolsExperience with power delivery and clock net definition for FPGA systemsExperience with resource utilization analysis and power analysisExperience with high-speed interface protocols including MIPI, PCIe, EthernetExperience with DDR3/LPDDR3, USB, Flash and other peripheralsExperience with chip-to-chip protocols like Interlaken and Aurora is a plusExperience in architecting low-latency data links is a plusBS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Smart people and inspiring, innovative technologies are the norm here. Are you ready to be part of a team transforming wireless technology? Come and work on challenges that no one has solved yet! We invite you to join us to help deliver the next groundbreaking Apple product."}, "200459388": {"jobID": "200459388", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Hardware Systems Design Electrical Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459388/hardware-systems-design-electrical-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS Electrical/Computer Engineering or equivalent required; MS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong electrical engineering fundamentals including analog and digital designExperience working with dynamic multi-functional teamsExcellent verbal, written and presentation skillsExperience in several of the following areas:-- High speed digital design-- Schematic capture and PCB layout-- Hands-on lab experience with hardware bring-up and debug-- Fundamentals of signal and power integrity-- Understanding of low voltage power regulation solutions-- Integration of hardware into multi-functional systems-- Use of scripting languages to assist with hardware development-- Familiarity with the challenges of taking a product from design through to productionBS Electrical/Computer Engineering or equivalent required; MS preferredPosition will require some international travel", "jobDescription": "Do you have a feeling of deep happiness when a design decision that YOU were responsible for is showcased in a newly released product?  Do you just beam at the thought of “I made that!”?  Would you like to have that same feeling again, and again? \n\nThe iPhone team is looking for expert Hardware Design Engineers who are motivated by the chance to define design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives!\n\nOur team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!"}, "200449016": {"jobID": "200449016", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "GPU Cache Hierarchy Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449016/gpu-cache-hierarchy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong knowledge of computer and cache architectureExperience with memory/cache sub-system micro-architecture, which could include multiple levels of cache, coherent interconnects, MMUs or related blocksExpertise in creating software solutions utilizing object oriented programming concepts, preferably with SystemVerilogExpertise with a verification methodology such as UVM/OVM, and experience with Verilog/VHDLExperience with HDL simulators and waveform viewersExpertise defining coverage space, writing coverage models, and analyzing resultsDemonstrated success working under strict schedule deadlines with the ability to manage multiple prioritiesExcellent interpersonal skills and ability to collaborateGPU experience, especially in the cache/memory hierarchy area, is a plusBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices. \n\nThe GPU Cache Design Verification Engineer is responsible for the pre-silicon RTL verification of cache hierarchy and related units in a low power GPU design. This includes deep understanding of the micro-architectural details of these units, interactions between the units, and the connection of the uarch to the larger architectural intent of the GPU. A strong computer architecture background, experience in cache and memory subsystem verification, software engineering skills, and a proven foundation in verification methodology will be used to close testing coverage with high confidence."}, "200460435": {"jobID": "200460435", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "System Modeling and Performance Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460435/system-modeling-and-performance-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Masters or PhD in electrical engineering with focus in signal processing, communication and controls\nExcellent documentation and presentation skills\nExperience with hardware/software interaction and hardware bring-up and debug, a plus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Model development: Programming skills in C, MATLAB, Python, JMP (or other predictive analytics tools)Digital signal processing: filter design, fixed-point implementations, embedded architectures and firmware, complex-baseband algorithms (a plus)Statistics: Linear regression, monte-carlo simulations, design of experiments and ANOVA (nice to have)Masters or PhD in electrical engineering with focus in signal processing, communication and controls\nExcellent documentation and presentation skills\nExperience with hardware/software interaction and hardware bring-up and debug, a plus", "jobDescription": "The Wireless Power Technology team is pioneering new ways of charging your devices. Our flagship product’s name, the MagSafe charger, says it all. It is magnetic, it charges fast, and above all, it is safe! Bringing all these aspects together requires careful orchestration of electromagnetism, passive and active electronics, state-of-the-art safety algorithms, communication over inductive links, and, of course, an appealing product design.\nOur products touch millions of lives each day… with consistency and dependability. Ever wonder how we achieve this? We rely on rigorous models that help predict the performance of various features across a range of products. We are looking for a system modeling and performance architect who is proficient in hardware/software interface. The candidate will help design and maintain models that are crucial to ensuring that our products perform consistently and dependably, well after they leave our hands. This role will have broad exposure to a variety of features that span a number of our products, and will collaborate with subject-matter experts from multiple domains.\nThe successful candidate will be fluent in tools required to develop and maintain models. You will be responsible for developing system-level understanding of various aspects of wireless charging (although expertise in wireless power is not a prerequisite for this position) – power delivery, foreign-object detection, and communication and control. You will map this understanding into reproducible, predictive models. The models will provide quantitative insights to guide design improvements, and predict failure modes in factory builds, and during in-field operation. Your models will be used to strike optimal performance versus complexity and cost trade-offs."}, "200451207": {"jobID": "200451207", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "SoC Power Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451207/soc-power-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for applicants with phenomenal programming skills and understanding of low-power digital design and power fundamentals, including:Expertise on C/Assembly programming and associated tool chains.Use of basic lab equipment such as multi-meter units, oscilloscopes, etc.Calculations for dynamic and static power in CMOS.Strong communication skills and ability to work as a team.BS and a minimum of 10 years relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "As part of our Silicon Engineering group, you will take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you will help design products that bring to our customers experiences they’ve never before envisioned!\n\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Validation Engineers. \n\nThe SoC hardware development team is looking for a motivated engineer to fill a full-time position. The primary role is to engage in power hardware validation and analysis of typical SoC workloads. The analysis of the workloads and their power dissipation will help drive the power optimization efforts to achieve best-in-class power/performance."}, "200431732": {"jobID": "200431732", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Camera Systems Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431732/camera-systems-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS, or PhD in Physics, Engineering, Computer Science, Imaging Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong communication, persuasion and negotiation skills in addition to being comfortable with working through ambiguities.Good understanding of imaging systems & module design, including aspects of image sensors, optics, mechanics, assembly processes, etc.Familiarity with basic image processing pipeline, including HDR, image fusion, multi-camera registration, etc.Working knowledge of imaging system simulations and evaluation of simulation results.Good understanding of image quality metrics and image quality evaluation.Excellent written skills for clear reporting of data analysis and conclusions.MS, or PhD in Physics, Engineering, Computer Science, Imaging Science or equivalent.2 years of camera/optical system related industry experience is highly preferred", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\nThe camera system architecture team initiates & fosters deep collaboration between all cross functional teams involved in delivering final camera performance and features. This is true for any Apple product, from the hardware level through to the user facing applications. The end goal is to successfully tie in highly optimized camera hardware solutions with state of the art software providing market leading imaging experiences. \n\nApple is seeking an energetic and highly motivated Camera System Architect to drive future camera hardware requirements. The ideal candidate would have the capabilities required to perform detailed system analysis and tradeoff evaluations while pushing boundaries in this wide technology space with the goal of arriving at the most optimal solution."}, "200432370": {"jobID": "200432370", "origin_search": null, "posted": "Oct 4, 2022", "jobTitle": "Product Design FEA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432370/product-design-fea-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS in Mechanical Engineering, Applied Mechanics, or similar, MS/PhD preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Thorough knowledge of Solid Mechanics and Strength of MaterialsPassion for creating innovative, high quality productsOutstanding written and verbal communication skillsDesire to work in a fast-paced environmentBS in Mechanical Engineering, Applied Mechanics, or similar, MS/PhD preferredAdditional Experience in any or all of the following areas would be preferred:- Static and dynamic finite element analysis (ideally in handheld/portable/wearable electronic products)- FEA software such as Abaqus or similar- Good modeling practices including model validation techniques- Failure modeling of different classes of materials- Testing including methods using Digital Image Correlation, Universal Testing Machines, and Dynamic Mechanical Analysis", "jobDescription": "Help Apple grow the product structural analysis team for iPad, iPhone, Mac, Watch, and many other Apple products. We are responsible for FEA modeling, engineering analysis, & material characterization, along with verification and validation of mechanical simulation models."}, "200459971": {"jobID": "200459971", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Depth Module Characterization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459971/depth-module-characterization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Masters or PhD degree in Optics, Physics or Electrical Engineering\n2+(PhD) or 5+(MS) years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Extensive lab experience in designing and characterizing hardware systems such as depth sensors, cameras, or compact imaging optical systemsExperience in development of custom characterization setups involving optical, laser, mechanical and electrical hardwareExperience with laser optical lab equipment – imaging sensors, lasers, power measurement, metrology tools, electronics hardware, and opto-mechanical hardware.Knowledge of display components, design and performanceExperience using Matlab, Python, C/C++, JMP for automation, data acquisition, and statistical analysisExperience with image processing and quantitative analysis is a plusExperience with 3D CAD mechanical design is a plusExperience with board level circuit build and debug is a plusExperience supporting volume manufacturing and flow (IQC, OQC, DVT to PVT) is a plusMasters or PhD degree in Optics, Physics or Electrical Engineering\n2+(PhD) or 5+(MS) years of industry experience", "jobDescription": "The Camera Hardware group at Apple develops depth-sensing hardware such as the revolutionary TrueDepth camera that powers FaceID, and the breakthrough LiDAR scanner.  This multi-disciplinary group of engineers is responsible for architecture, research, and manufacturing development of these highly complex sensing systems for Apple products.  The Depth Hardware team is seeking a laser-optical and display characterization engineer to support R&D and characterization depth sensors for future products."}, "200425239": {"jobID": "200425239", "origin_search": null, "posted": "Sep 15, 2022", "jobTitle": "SW Engineer - Media Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425239/sw-engineer-media-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong object-oriented programming and design skillsExperience with Cocoa and the iOS SDKExperience crafting and maintaining frameworks consumed by other applicationsStrong problem solving and critical thinking skillsPassion for quality and attention to detailExperience in defining and building APIsBS in Computer Science or equivalent industry experience.", "jobDescription": "Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Apple Media Services team is looking for a proactive, diligent and hard working software engineer to join the growing shared frameworks team. You will help define and build system APIs and user interfaces that will delight users across all of Apple’s media products on Apple platforms (iOS, tvOS, watchOS and macOS) and media devices, including HomePod and smart TVs.\n\nDevelop new and improve existing parts of the shared frameworks that power all of Apple's services products. Architect and build new APIs, and work with design to help define and implement user interfaces."}, "200448344": {"jobID": "200448344", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Power Analysis & Optimization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448344/graphics-power-analysis-optimization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Knowledge of digital logic design principles including power and timing implicationsUnderstanding of VLSI power fundamentals (dynamic & leakage)Understanding of low power design concepts (clock gating, data-gating, etc)Working knowledge with Verilog/System-VerilogProficient in Python or similar contemporary scripting languagesExcellent communication skills, self-motivated and well organizedMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions. Joining this group means you’ll be crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices! We are looking for a talented and creative engineer to support the power activity of Apple best-in-class GPU development."}, "200452650": {"jobID": "200452650", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "PHY Systems Engineer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452650/phy-systems-engineer-simulation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep knowledge of communication system theory and PHY signal processingValidated track-record in SW and link/system level simulator design in C/C++, including experience with simulator frameworks and configuration management.In-depth knowledge of wireless communication systems with hands-on experience in 4G/5G PHY design, pre-silicon verification and critical metric testing.Experience with Matlab, C/C++ and/or Python including significant knowledge of algorithms and data structures, memory and runtime profiling as well as code optimization techniques.Solid knowledge of current cellular communication standards: 5G (NR) and 4G (LTE).Work experience related to RAN1/RAN4 submissions is a good plusStrong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, debugging and fixing of defects, …).BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200452638": {"jobID": "200452638", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "PHY Systems Engineer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452638/phy-systems-engineer-simulation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Deep knowledge of communication system theory and PHY signal processingValidated track-record in SW and link/system level simulator design in C/C++, including experience with simulator frameworks and configuration management.In-depth knowledge of wireless communication systems with hands-on experience in 4G/5G PHY design, pre-silicon verification and critical metric testing.Experience with Matlab, C/C++ and/or Python including significant knowledge of algorithms and data structures, memory and runtime profiling as well as code optimization techniques.Solid knowledge of current cellular communication standards: 5G (NR) and 4G (LTE).Work experience related to RAN1/RAN4 submissions is a good plusStrong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, debugging and fixing of defects, …).BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200452054": {"jobID": "200452054", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "PHY Systems Engineer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452054/phy-systems-engineer-simulation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep knowledge of communication system theory and PHY signal processingValidated track-record in SW and link/system level simulator design in C/C++, including experience with simulator frameworks and configuration management.In-depth knowledge of wireless communication systems with hands-on experience in 4G/5G PHY design, pre-silicon verification and critical metric testing.Experience with Matlab, C/C++ and/or Python including significant knowledge of algorithms and data structures, memory and runtime profiling as well as code optimization techniques.Solid knowledge of current cellular communication standards: 5G (NR) and 4G (LTE).Work experience related to RAN1/RAN4 submissions is a good plusStrong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, debugging and fixing of defects, …).BS and 3+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200452042": {"jobID": "200452042", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "PHY Systems Engineer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452042/phy-systems-engineer-simulation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Deep knowledge of communication system theory and PHY signal processingValidated track-record in SW and link/system level simulator design in C/C++, including experience with simulator frameworks and configuration management.In-depth knowledge of wireless communication systems with hands-on experience in 4G/5G PHY design, pre-silicon verification and critical metric testing.Experience with Matlab, C/C++ and/or Python including significant knowledge of algorithms and data structures, memory and runtime profiling as well as code optimization techniques.Solid knowledge of current cellular communication standards: 5G (NR) and 4G (LTE).Work experience related to RAN1/RAN4 submissions is a good plusStrong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, debugging and fixing of defects, …).BS and 3+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200450272": {"jobID": "200450272", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Wireless RF OTA MIMO Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450272/wireless-rf-ota-mimo-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Working experience with MIMO/UWB characteristics (at a system level), antenna design and requirements for modern wireless communication systems such as UWB, LTE, WiFi, 802.11ad and mmWave systemsWorking experience with wireless protocols, antennas, and radio propagation.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW), channel emulators.Familiarity with regulatory requirements and certification process for CTIA and 3GPP.Excellent communication skills required, both written & verbal.BS degree in technical discipline.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System team is looking for an engineer to work on system performance characterization across different wireless technologies for Apple’s wireless products"}, "200450258": {"jobID": "200450258", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless RF OTA Cellular Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450258/wireless-rf-ota-cellular-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You have working experience with antenna design/tests, antenna and wave propagation, anechoic chambers, and radiation performance evaluation like TRP & TIS.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW/ UXM/ 8960), channel emulators, etc.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is a plus.Experience with carrier/ industry conformance radiated performance requirements like 3GPP, PTCRB, CTIA, ETSI, etc.Excellent communication skills required, both written & verbal.Programming skills in C, C++ would be a plus.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System Engineering team is looking for an engineer to work on radiated system characterization across different cellular technologies for Apple’s wireless products"}, "200450262": {"jobID": "200450262", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless RF OTA MIMO Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450262/wireless-rf-ota-mimo-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Working experience with MIMO/UWB characteristics (at a system level), antenna design and requirements for modern wireless communication systems such as UWB, LTE, WiFi, 802.11ad and mmWave systemsWorking experience with wireless protocols, antennas, and radio propagation.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW), channel emulators.Familiarity with regulatory requirements and certification process for CTIA and 3GPP.Excellent communication skills required, both written & verbal.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System team is looking for an engineer to work on system performance characterization across different wireless technologies for Apple’s wireless products"}, "200449156": {"jobID": "200449156", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Engineering Project Manager - Software Delivery", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449156/engineering-project-manager-software-delivery?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Strong background in the services infrastructure space.Fluent in software development processes (SDLC)Experience with infrastructure-focused projects (i.e. networks, services, APIs, etc.)Outstanding written and verbal communication skills.Proven ability to work effectively with multiple stakeholders across a variety of business units.Self-motivated and proactive with demonstrated creative and critical thinking capabilitiesAbility to organize and participate in requirements or design brainstorming sessionsExperience managing multiple complex projects simultaneouslyAlso desirable• Background in infrastructure security.• Demonstrated ability to organize and manage rapid co-ordinated response efforts.• Great attention to detail", "jobDescription": "Apple’s Software Engineering group is renowned for its work in user experience, integration, functionality and lifestyle. It's a critical component of Apple's ecosystem and one that continues to break new ground every day! This kind of success has been the result of very skilled people working in an environment which fosters creativity, cooperation and the solving of old problems in new ways. If that sounds like the kind of place that you find intriguing, then this may be the place for you."}, "200449373": {"jobID": "200449373", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449373/cpu-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceFamiliarity with high performance microprocessor architectureKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture and implementation techniquesYou have design experience in deep sub-micron technologies and basic device physicsExperience using synthesis & place-route toolsExperience with scripting in Perl or TCLMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level implementation."}, "200449361": {"jobID": "200449361", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449361/cpu-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceFamiliarity with high performance microprocessor architectureKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture and implementation techniquesYou have design experience in deep sub-micron technologies and basic device physicsExperience using synthesis & place-route toolsExperience with scripting in Perl or TCLMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level implementation."}, "200451978": {"jobID": "200451978", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Senior Wireless SoC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451978/senior-wireless-soc-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "This position requires thorough knowledge of the ASIC design flowStrong experience in complex ASIC design and IP integration, with a focus on high performance, low area, and low powerSuccessful tape-outs of multiple complex, high-volume SoCs in advanced design nodesProficient in design methodologies and EDA tools for Lint, DFT, CDC, Synthesis & STAUnderstanding of UPF and low-power design & implementation techniquesExpert knowledge of SoC Architecture and HDL languages like VerilogProficiency in one or more of the following highly desirable: PCIe, AXI/AHB bus fabric, ARM-based processor sub-systemsPrevious leadership experience is a plusBS + 10 years of relevant experience. MS preferred.", "jobDescription": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. All of this is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply."}, "200451516": {"jobID": "200451516", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer – Design Verification Flows and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451516/cad-engineer-design-verification-flows-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Familiarity with Verilog and SystemVerilog is a plus.Familiarity with Xcelium or Modelsim or Synopsys VCS is required.Good communication skills are required and prior customer support experience is a plus.Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.Familiarity with Verdi, Indago and/or SimView is a plus.Scripting/coding abilities in Python/Perl is a plus.Knowledge of C/C++ or any other OOP programming language is a plus.Minimum requirement of BS + 3 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world."}, "200451088": {"jobID": "200451088", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Design Engineer Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451088/analog-design-engineer-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS+10 Years of Relevant Industry Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "BS+10 Years of Relevant Industry Experience,Experience leading analog and mixed-signal silicon for complex system designsSolid understanding of analog design fundamentals, design tools and methodologies. Demonstrated industry-leading design expertise required.Experience taking projects from the concept phase to Mass Production including: chip architecture, micro-architecture, writing electrical specifications, process technology selection, die size estimation, running schedules, IC design, analog layout, parasitic extraction, verification, DFT, DRCs, LVS, LVL, mask and wafer fabrication monitoring, silicon characterization, hands-on lab evaluation, release to production, yield improvement, and failure analysis support.System applications include PMIC, Audio Codecs, Audio Amplifiers, Wireless, Connectivity, Security and Video.In depth expert design experience of analog building blocks: multi-phase buck and boost converters, LDOs, battery chargers, temperature sensors, voltage monitors, bias, bandgap, amplifiers, audio Class AB and Class D, data converters DACs and ADCs.Design knowledge of board level considerations, including component selection, PCB layout, packaging technologies and thermal analysis.Design knowledge of IC process technologies, reliability design rules, ESD and latch-up testing.Knowledge about industrial standards and practices in appropriate technologies.Work experience with high volume manufacturing strongly preferred.Design management experience preferred.BS+10 Years of Relevant Industry ExperienceSome Travel Required.", "jobDescription": "Are you a leader? Do you want to use your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively to deliver on a predictable and dynamic schedule? We have an extraordinary opportunity for senior level silicon design engineers to drive and lead technical engagements between Apple and silicon suppliers working on groundbreaking technologies! The Apple Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, Apple Watch and AppleTV! We are looking for a remarkable Analog Design Lead to work together with multi-functional teams and external vendors to define, develop and productize the next generation of custom silicon solutions."}, "200449057": {"jobID": "200449057", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Performance and Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449057/graphics-performance-and-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We prefer to you have the following knowledge and skills.Strong C++ coding skillsKnowledge of computer architectureExperience in functionality modeling and/or performance modeling (event driven or cycle driven)Understanding of GPU micro-architecture is a big plusUnderstanding of Computer Graphics principles and modern Graphics APIs (e.g. DirectX, OpenGL, Vulkan, Metal) is a plusExperience in GPU Software development is a plusWe prefer that you exhibit excellent communication skills, demonstrate a sense of motivation and show a high level of organizationWe like people who are fast learners and are eager to solve technical challengesWe expect you to show leadership skills to be successful to own and drive complex tasks in a cross-functional environmentBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Hardware Technologies organization, you’ll help design our next-generation, high-performance, power-efficient graphics processor unit (GPU) and system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nIn this role, you are responsible for delivering high-quality functionality and performance model for GPUs under aggressive product schedule. You are also expected to provide feedbacks to the design, triage problems and recommend solutions. To achieve this, you will work closely with cross-functional teams in architecture, micro-architecture, validation and GPU software."}, "200461213": {"jobID": "200461213", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Senior Infrastructure SRE Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461213/senior-infrastructure-sre-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "• BS in Computer Science or related field, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$183,500", "max": "$334,500,"}, "benefits": null, "requirements": "Strong emphasis on SRE as an engineering discipline with a focus on reliably scaling and deploying distributed systems and foundational infrastructure.Superb interpersonal and communication skills, you should be capable of working with multiple teams at once at varying seniority levels driving requirements around business, security, and developer productivity and balancing those requests.Capable of writing detailed solution specs, diagrams, best practices & standards documentation, technical designs, operating procedures, test plans/test reports, etc.Experience supporting infrastructure and services ranging from on-premises *nix to ephemeral cloud environments.Ability to identify and troubleshoot instability in distributed systems and drive operational excellence.Experience leading a technical team with strongly held opinions; you’re willing to dig into the technical details, evaluate the optimal path forward given all variables and work teams to guide them towards these decisions.• BS in Computer Science or related field, or equivalent experience.", "jobDescription": "Software Delivery's Systems and Infrastructure team is looking for hardworking and passionate people to help craft the future of how we build and maintain our services which enable thousands of Apple engineers to develop the software products that delight millions of Apple customers. As a Systems & Infrastructure SRE Manager you will have the technical skills to go deep, yet retain the ability to consider higher-level business needs and to lead fellow engineers."}, "200467469": {"jobID": "200467469", "origin_search": null, "posted": "Mar 4, 2023", "jobTitle": "Post Production Systems Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467469/post-production-systems-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Newport Beach, CA", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA Degree or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$51.20", "max": "$96.87/hr,"}, "benefits": null, "requirements": "Deep expertise in technically supporting high-end audio-visual content creation facilities, specifically with offline and online editorial, color, audio, and VFX capabilitiesHands-on experience with scripting and automation, including but not limited to Python, but also collaborating with developers on plugin and tool developmentBackground in support of PC and Mac infrastructures and render farms, focusing on VFX and video processing pipelinesComfortable working on and supporting a fast-paced, deadline-oriented team that is responsible for multiple projects simultaneouslyStrong communication skills, written and verbal, focusing on developing technical documentation and crafting executive level reports and proposalsBA Degree or equivalent experience.-  Experience supporting teams utilizing Nuke, Resolve, Deadline, and Adobe Creative Cloud-  Ability to partner with technical teams to amplify and focus impact to the team’s capabilities-  Passion for working with a team on the cutting edge of technology to drive the best possible creative experience", "jobDescription": "Our fast-growing creative and technical team is looking for a Post Production Systems Lead to support our creation of audio-visual content and evolve our team’s technical capabilities as we grow. This role would be responsible for working with internal teams and resources to provide daily hands-on support to our team as well as representing the team’s needs in future expansion. They will be expected to help optimize existing hardware, software and workflows at the outset but take the lead on crafting plans, benchmarking for justification and proposing technical upgrades that will create more efficiency, stability and create more capacity as our team’s needs expand. This is a key role in shaping the future of our team and work, so if innovation and all the challenges that come along with it is exciting rather than daunting, this role could be a fit for you."}, "200456969": {"jobID": "200456969", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456969/engineering-program-manager?team=CUST", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Degree in Computer Science, Electronics Engineering, Industrial Engineering, or related field and 5+ years of experience in related occupation. \nIn the alternative, the employer will accept a Bachelor’s degree or foreign equivalent in Computer Science, Electronics Engineering, Industrial Engineering, or related field and 7 years of progressive, post-baccalaureate experience in related occupation."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years in Hardware and Software Project ManagementSoftware engineering skillsExperience in coordinating programs end to end from design to releaseUnderstanding of operating systems; (iOS, MacOS, iPadOS)Detailed knowledge and understanding of product development processesNegotiation and risk management skillsMechanical engineering experience with test station fixtures is desiredDegree in Computer Science, Electronics Engineering, Industrial Engineering, or related field and 5+ years of experience in related occupation. \nIn the alternative, the employer will accept a Bachelor’s degree or foreign equivalent in Computer Science, Electronics Engineering, Industrial Engineering, or related field and 7 years of progressive, post-baccalaureate experience in related occupation.", "jobDescription": "In AppleCare, we believe in providing world class support to our customers for the devices that they have purchased. We are looking for a highly motivated and self driven individual who will be responsible for driving multi-functional repair programs. The scope of this role will be spanning factory, hardware and software development. This individual will have to drive the overall schedule of repair projects from conceptualization to design to execution to deployment. You will be responsible for recognizing and communicating cross-functional issues and risks. You will have to work with engineering teams to develop requirements, drive implementation schedules, coordinate and drive fixes for software issues, repair systems related issues as well as present the potential issues and their impact to repair lines and other impacted teams."}, "200384884": {"jobID": "200384884", "origin_search": null, "posted": "Jun 14, 2022", "jobTitle": "Cellular Platform Software Engineer- CoreBSP Enablement Team", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200384884/cellular-platform-software-engineer-corebsp-enablement-team?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor, Master degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Deep understanding of (or the abilities to deeply understand) CPU processors, SoC architectures and RTOS kernelsExtensive development experience with strong assembly/C/C++ coding skillsIn-depth debug skills with gdb/lldb, JTAG/ETM, ram dump on both FPGAs and hardware platformsExperience with Pre-Silicon & Post-silicon SW bring-up, SW validation, as well as debugging and development of Hardware Dependent Software (Board Support Package: BSP)Proven track record to work in a dynamic, multi-tasked environment;Excellent written and verbal communication skills with an ability to collaboratively work with many varied teamsStrong communication skills, strong social skills, self-starter and strong initiative skills.Bachelor, Master degree in Electrical Engineering, Computer Engineering, Computer Science or equivalentFamiliar with cellular protocol stack will be a plus.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Smart people and inspiring, innovative technologies are the norms here. Do you love working on challenges that no one has solved yet? Are you ready to be part of a team transforming wireless technology? Join us to help deliver the next groundbreaking Apple product. \n\nWireless Technologies team is looking for a highly motivated and strong technical lead to work on our next-generation products. The duties of this position will lead a team to design, develop, debug baseband platform software, and work with HW & SW multi-functional teams to deliver the features into next-generation products. CoreBSP Enablement team mainly responsible for CoreBSP SW enablement and handling of CoreBSP system-level issues that can bridge the gap between HW & SW Teams. This group deals with common HW&SW platform infra enablement for Pre-silicon and Post-Silicon SW enablement across all platforms and unblocking SW teams."}, "200459630": {"jobID": "200459630", "origin_search": null, "posted": "Jan 28, 2023", "jobTitle": "Cellular Platform Software Engineer - CoreBSP Enablement Team", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459630/cellular-platform-software-engineer-corebsp-enablement-team?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor, Master degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Deep understanding of (or the abilities to deeply understand) CPU processors, SoC architectures and RTOS kernelsExtensive development experience with strong assembly/C/C++ coding skillsIn-depth debug skills with gdb/lldb, JTAG/ETM, ram dump on both FPGAs and hardware platformsExperience with Pre-Silicon & Post-silicon SW bring-up, SW validation, as well as debugging and development of Hardware Dependent Software (Board Support Package: BSP)Proven track record to work in a dynamic, multi-tasked environment;Excellent written and verbal communication skills with an ability to collaboratively work with many varied teamsStrong communication skills, strong social skills, self-starter and strong initiative skills.Bachelor, Master degree in Electrical Engineering, Computer Engineering, Computer Science or equivalentFamiliar with cellular protocol stack will be a plus.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Smart people and inspiring, innovative technologies are the norms here. Do you love working on challenges that no one has solved yet? Are you ready to be part of a team transforming wireless technology? Join us to help deliver the next groundbreaking Apple product. \n\nWireless Technologies and Ecosystems team is looking for a highly motivated and strong technical lead to work on our next-generation products. The duties of this position will lead a team to design, develop, debug baseband platform software, and work with HW & SW multi-functional teams to deliver the features into next-generation products. CoreBSP Enablement team mainly responsible for CoreBSP SW enablement and handling of CoreBSP system-level issues that can bridge the gap between HW & SW Teams. This group deals with common HW&SW platform infra enablement for Pre-silicon and Post-Silicon SW enablement across all platforms and unblocking SW teams."}, "200463380": {"jobID": "200463380", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463380/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE or MSEE / Higher, or equivalent education \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Knowledge of EM or RF hardware or antenna designKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into products.Knowledge of RF schematic and PCB layout practices and guidelinesKnowledge of electromagnetic simulation toolsHands-on experience with RF lab instrumentationAbility to debug Desense issues and characterize noise sourcesExperience with production environment and statistical analysisExcellent interpersonal skillsBSEE or MSEE / Higher, or equivalent education \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits.", "jobDescription": "At Apple, you will have a once-in-a-lifetime opportunity to deliver outstanding performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for innovative products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products. \n\nWe’re looking for dedicated and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration, & wireless communications."}, "200463308": {"jobID": "200463308", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463308/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE or MSEE / Higher, or equivalent education \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Knowledge of EM or RF hardware or antenna designKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into products.Knowledge of RF schematic and PCB layout practices and guidelinesKnowledge of electromagnetic simulation toolsHands-on experience with RF lab instrumentationAbility to debug Desense issues and characterize noise sourcesExperience with production environment and statistical analysisExcellent interpersonal skillsBSEE or MSEE / Higher, or equivalent education \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits", "jobDescription": "At Apple, you will have a once-in-a-lifetime opportunity to deliver outstanding performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for innovative products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products.   \n\nWe’re looking for dedicated and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration & wireless communications."}, "200452268": {"jobID": "200452268", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452268/wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine, CA", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 3+ years of relevant experience required. MS and PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience in crafting signal processing and wireless communications systems.Working knowledge of wireless communication systems (e.g., OFDM/MIMO, etc.) and hands-on experience with lab testing and characterization will be necessary.Strong understanding of communication theory & signal processing-related algorithm design (such as timing recovery, signal estimation and detection, MIMO signal estimation and detection, automatic gain control, channel estimation, equalization, coding theory, beamforming, etc.)Deep understanding of components/modules within wireless communication systems, and the possible impairments from those components, and the corresponding calibration and impairment reduction methods/algorithms, digital pre-distortion, PAPR reduction algorithms, Tx power control, etc.Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.Experience in modem architecture, microprocessor architecture, hardware and software control are a plus.Experience on low power algorithm design for power critical application is a plus.Experience with multi-radio coexistence management is a plus.Experience and knowledge on High Level Synthesis (HLS), silicon prototyping, emulation systems, and virtual platforms will be a plus.Experience on bring up of real silicon in lab and being able to efficiently use lab equipment (such as spectrum analyzer, signal generator, power meter, etc.) is helpful.Knowledge in existing wireless communication protocols; such as 5G/LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLEBS and 3+ years of relevant experience required. MS and PhD preferred.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our Wireless Silicon Design group, you will have the unique and rewarding opportunity to build upcoming products that will delight and encourage millions of Apple’s customers every single day!\n\nIn this technical role, you will be at the center of our silicon design group responsible for the wireless system design of our innovative wireless SoC products. You will have the chance to create algorithms and architectures of wireless communication systems, as well as collaborate with extraordinary RF/analog, HW, SW designers and architects to implement, verify, validate and bring up SoC products to production quality, providing them to millions of Apple customers!"}, "200449023": {"jobID": "200449023", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Graphics Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449023/graphics-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven expertise and knowledge of graphics rendering algorithms and/or computer architecturesExperience with GPU APIs, OpenGL/DirectX, OpenCL/CUDA, MetalExcellent C/C++ programming skillsCache and memory hierarchy understanding is a strong plusGPU modeling experience, no matter function or performance, is a strong plusExperience with graphics device drivers is idealExperience with scripting, DPI, Verilog/VHDL, Specman/System Verilog, design verification methodology and tools a plusTeam leadership experience a plusExcellent interpersonal skills and ability to collaborate under bold schedulesBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We are seeking a Graphics Modeling Engineer will deliver high-quality GPU function and/or performance models to meet the needs of GPU hardware development. This includes writing models for functional development and verification of a GPU design, performance exploration, performance validation, and power estimation. You will collaborate closely with the architecture team, hardware design team, design and verification teams."}, "200452276": {"jobID": "200452276", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CAD Engineer - IP QA Methodology and Applications", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452276/cad-engineer-ip-qa-methodology-and-applications?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Support and Software development experience within an ASIC CAD environmentAble to demonstrate the fundamentals of IP analysis - timing, noise, physical verification, electrical analysisWorking knowledge of IP collateral delivered by design teams such as Liberty, UPF, LEF, GDS or VerilogProficiency in Python and/or Perl is required. Additional languages are a plus.Working knowledge of software unit test and regressionWorking knowledge of version control software like GIT or PerforceWorking knowledge of Unix and Shell scriptingWorking knowledge of job scheduling systems in a high performance compute environmentExperience with testing IP collateral is a plusFamiliarity with EDA tools used to analyze and QA IP is a plusFamiliarity with dependency aware flow control tools is a plusMinimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nIn the IP QA methodology and applications role you will help define, implement and support scalable solutions to verify the quality of IP design collateral used to construct our world class SoCs. You will be tasked to improve the quality of the IP releases and the productivity of the design teams. This role fits a self-motivated, dedicated problem solver with strong automation and communication skills with the ability to collaborate among cross-functional teams. Your accomplishments will be impacting a wide range of chips used across Apple’s world-class products (iPhone, iPad, Mac, Apple Watch, AirPods…)"}, "200463862": {"jobID": "200463862", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Software Development Engineer in Test, Safari", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463862/software-development-engineer-in-test-safari?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proficiency in functional or object oriented languages like Python, Java, SwiftStrong understanding of Quality Engineering methodologies and practicesProven knowledge of web fundamentalsDemonstrated ability to drive an automated testing projectFlexibility and ability to adapt to constantly evolving requirementsAbility to identify and triage test issues effectivelyStrong analytical, problem solving and creative thinking skillsWorking knowledge of iOS and macOS is preferredWorking knowledge of Swift, C/C++ or Objective-C is an extra plusBS/MS in Computer Science or equivalent", "jobDescription": "Browsers have a profound impact and significance in the world. It is the gateway to the vast wealth of information and opportunities that the internet has to offer. Safari is a secure, fast and private browser that empowers our customers to browse the web safely. Maintaining that standard of quality and privacy requires solving incredibly complex problems around quality. We are looking for a highly skilled and motivated Software Development Engineer in Test to join our fast-paced, dynamic software engineering team."}, "200448112": {"jobID": "200448112", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "IC Packaging Characterization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448112/ic-packaging-characterization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Proficiency with major mechanical design CAD tools, such as Siemens NX, AutoCAD, SpaceClaim, SolidWorks, etc.Proven capability of setting up equipment and data acquisition systems.Hands-on experience of major material analysis and failure analysis tools (e.g., SEM, EDX, FIB, CSAM, etc.) is helpful.Knowledge of the Integrated Circuit packaging process, reliability, qualification requirements, and key materials is a plus.Excellent written and verbal communication skills with ability to present ideas, data, and plans with high confidence at team meetings.- BS and 3+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for precision to work towards an extraordinary result? We are looking for a dedicated and hardworking IC Packaging Characterization Engineer to join our team.\n\nAs part of the Packaging team, you will focus on the characterization of Integrated Circuits (IC) packages and related materials. You will also be responsible for developing methodologies of IC packaging characterization, and trouble-shooting IC packaging-related yield and reliability issues."}, "200450575": {"jobID": "200450575", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Software Compatibility Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450575/software-compatibility-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS/BA in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Strong programming language skills (pointers, memory management, algorithms) and language skills C, Objective C, or C++Excellent foundation in operating system architecture and system-level programmingStrong knowledge of at least one debugging or dynamic analysis tool (LLDB, GDB, Instruments, Visual Studio debugger, Valgrind, etc.)Understanding of and experience with the software development cycleExcellent interpersonal skills are a requirement due to the high level of interaction with engineering teams, management, and other organizations within AppleCreative thinker and problem solver with meticulous attention to detailPassionate, inquisitive, and seeks to take on everyday problems in innovative waysMinimum of BS/BA in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experienceExperience in macOS or iOS programming is a strong plusExperience with x86 assembly is a plusExperience in automation and framework developmentExperience in performance analysis and reporting is a plusFamiliarity with Perl, Ruby, Python, or Unix shell scriptingKnowledge of web development including PHP, SQL, Javascript, and HTML", "jobDescription": "When you see an application with a cool feature, is your first instinct to hop into the debugger and figure out how a resourceful developer implemented the functionality? Are you passionate about the idea of exploring the mind of another engineer, stepping through the code to paint an overall picture of what is happening and why? If so, the Software Compatibility Engineer team will be an excellent match for you! \n\nApple's Software Compatibility team is looking for a curious and driven engineer who doesn't settle for letting mysteries remain unsolved. We need a tenacious individual with strong debugging and development skills to ensure that third-party applications continue to work on future macOS, iOS, tvOS, and watchOS releases. Strong technical skills are important but most critical is a desire to understand how an app fits into Apple's frameworks and operating systems."}, "200443816": {"jobID": "200443816", "origin_search": null, "posted": "Dec 18, 2022", "jobTitle": "PHY Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443816/phy-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be essential for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc..Knowledge of cellular communication standards: 5GNR, 4G LTE, 3G (HSPA), 2G GSM.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? We are searching for a talented engineer with years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200450142": {"jobID": "200450142", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "RFIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450142/rfic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience in the area of Analog / Mixed-Signal IC design with advanced CMOS technology nodes.Direct tape out experience with one or more of the following blocks: on-chip LNAs and Pas, PLL/VCO/DCO/LOGEN blocks, mixers, baseband filters and amplifiers in deep sub-micron CMOS technology.Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability and other analog impairments.Deep understanding of CMOS device physics, RF device modeling, device noise parameters and inductor modeling.Familiarity with packaging effects, supply isolations, high frequency ESD structures, and circuit layout for optimum RF performance.Familiarity with various RF transceiver architectures and their trade-offs, as well as calibration methods used for different transceiver architectures.Understanding of system specifications and ability to work with system architects to translate system requirements into circuit requirements at IC level.Open to work with digital design group for an optimum partition between digital and analog domain.Familiarity with the integration flows and integration challenges of wireless SoCs.Familiarity with mixed-signal mode verification methodology (SystemVerilog, AMS, Nanotime).Knowledge of desense issues and able to work closely with board RF/HW/Antenna teams to optimize board layouts for desense mitigation. Experience with desense mitigation with integrated PMUs/DSPs (i.e. substrate isolation, return loops, package isolation, frequency planning, etc.)Familiarity with Cadence Virtuoso, Spectre RF, Matlab, EM simulation (EMX, HFSS) and similar tools.Experience in Si characterization and debug.Ability to drive strong production test/QA methodologies.BS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an RFIC design engineer, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200449836": {"jobID": "200449836", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Design Timing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449836/cpu-design-timing-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceThe ideal candidate will have implementation experience on high performance CPU designs including at least one project that includes ownership of timing analysisWorking knowledge of CPU microarchitecture including common critical loops for timing and understanding of low power microarchitecture and implementation techniques for CPUsDeep knowledge of static timing tools and flows including how to handle multiple clock and power domains and other complex scenariosPhysical design knowledge of device physics and in particular aspects which impact timing (cross talk, noise, OCV etc.)Prior experience owning the timing flow on a major CPU or similar projectGood understanding of physical design tools and methodology including but not limited to physically aware synthesis and place & route tools and flows, extraction, STA, and other analysis flows, and physical design verification (LEC, DVS, etc.)Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nIn this role, you will be responsible for all aspects of timing including working with the implementation and RTL teams on timing changes, helping with constructing and modify timing flows, timing analysis, and timing closure."}, "200429948": {"jobID": "200429948", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Software Development Engineer in Test - AR Applications", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200429948/software-development-engineer-in-test-ar-applications?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS in Computer Science/Engineering or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Minimum of 5 years of industry experienceExperience in automating tests for Applications at both the UI and non-UI levels.Demonstrated productivity writing & maintaining automation frameworks, tests, tools & scripts.Strong objective oriented programming skills preferably in Python, Swift.Excellent knowledge and experience with test methodologies (integration/performance/feature testing).Creative problem solver with a knack for building scalable automation in a collaborative space while re-using existing solutions when possible.Strong passion for quality assurance in software, including developing, extending and understanding test frameworks and libraries.Ability to proactively triage and investigate difficult problems independently.Highly organized with strong planning skills to estimate, update and communicate progress.Knowledge of Dashboards, Apple Platform development using Xcode, XCUITest, and Swift preferred but not required.BA/BS in Computer Science/Engineering or equivalent professional experience.", "jobDescription": "At Apple, we strive to build the best products and experiences that enrich people’s lives. Apple’s Technology Development Group (TDG) is working with some of Apple's most advanced technologies including the Augmented Reality (AR) support offered in ARKit. This position requires strong technical ownership and attention to detail. As a valued member of our dynamic organization, you will have the rare and rewarding opportunity to craft new products and experiences that will delight and inspire millions of people every single day!"}, "200459158": {"jobID": "200459158", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Software Engineer: CPU Power, Clocks, and Time", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459158/software-engineer-cpu-power-clocks-and-time?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 3 years relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience with low-level CPU hardware/software interfaces, cycle- and time-sensitive programmingDeep understanding of CPU structure, pipeline flow and clock hierarchyExperience using low-power optimization design features and use of dynamic frequency and voltage controlsLow-level (assembly and C language) programming experienceOn-Chip Debug (JTAG-level debugging)Oscilloscope /instrument setup and reading schematics diagramsDeveloped rigor in identifying high quality validation scenarios, coverage gaps, and effective use of debugging toolsAbility to work well on a team, yet responsible and self-driven in planning and executionBachelor's degree and a minimum of 3 years relevant experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. We are looking for a device-level software engineer to develop test code to drive the CPU Power, Clocks and Time functions with the goal of post-silicon validation and identifying design issues."}, "200459156": {"jobID": "200459156", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Software Engineer: CPU Power, Clocks, and Time", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459156/software-engineer-cpu-power-clocks-and-time?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 3 years relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with low-level CPU hardware/software interfaces, cycle- and time-sensitive programmingDeep understanding of CPU structure, pipeline flow and clock hierarchyExperience using low-power optimization design features and use of dynamic frequency and voltage controlsLow-level (assembly and C language) programming experienceOn-Chip Debug (JTAG-level debugging)Oscilloscope /instrument setup and reading schematics diagramsDeveloped rigor in identifying high quality validation scenarios, coverage gaps, and effective use of debugging toolsAbility to work well on a team, yet responsible and self-driven in planning and executionBachelor's degree and a minimum of 3 years relevant experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. We are looking for a device-level software engineer to develop test code to drive the CPU Power, Clocks and Time functions with the goal of post-silicon validation and identifying design issues."}, "200284921": {"jobID": "200284921", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Mechanical Design Engineer - Sensing Product Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200284921/mechanical-design-engineer-sensing-product-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Bachelor/MS/PhD degree in engineering\nMinimum of 2 years of relevant industry experience or PhD degree in related area."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "2+ years of hands-on experience designing mechanical components or systems for a production environment.Proficiency in 2D drafting, 3D conceptual modeling (NX preferred), tolerance analysis, and design trade-offs.Strong mechanical engineering analytical skills. Experience using FEA to drive design decisions is strongly preferred.Ability to collect and use data to inform decisions and fuel debate in an open and intellectually honest manner.Clear and concise communication skills  with ability to adapt written and verbal messaging for a variety of audiences.Cross-disciplinary approach to design; collaborates with a diverse team as well as external vendors to solve complex problems and achieve project goals.Demonstrated ability to drive failure analysis to determine root cause and develop effective corrective actions.Nice-to-Have Skills:Consumer electronics knowledge is preferred; familiarity with capacitive sensing technology is a strong plusKnowledge of basic engineering materials (plastics and adhesives) and manufacturing processes, specifically in high-volume mass productionDetail oriented and capable of handling multiple assignments at onceCurious, willing to learn new skills, and share knowledgeWorking experience or academic training in:Sensors, electrical circuit design, thin film technologiesProgramming and scripting (MATLAB or Python preferred)Tolerance analysis and process capability analysisStatistical and regression analysis, response surface modeling (JMP or Minitab)Finite Element Analysis (FEA) of mechanical, thermal, static/dynamic environment (Ansys, Abaqus, Comsol)Nonlinear material characterizationBachelor/MS/PhD degree in engineering\nMinimum of 2 years of relevant industry experience or PhD degree in related area.", "jobDescription": "The Sensing Product Design team is looking for a talented mechanical engineer to build great\nexperiences and bring Apple products to life. We are the team developing many of the sensors\nthat changed the way people interact with their technology. Touch redefined the phone and\ntablet, TouchID seamlessly secured them, and the heart rate monitor let you keep tabs on\nyourself.\n\nIn this role, you will be responsible for specifying, developing, characterizing and validating touch sensing systems.  You should be familiar with sensor technologies, along with related product integration and manufacturing technologies."}, "200439397": {"jobID": "200439397", "origin_search": null, "posted": "Dec 1, 2022", "jobTitle": "Audio Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439397/audio-engineering-program-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS (EE/CS/CE a plus)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years of Project Management in a high-tech environment, or equivalent technical management role.Proven leadership on major, cross-functional projects.Experience with software development and/or system planning for new audio products.Proven ability to quickly understand technical concepts in a wide range of fields.Demonstrated ability to provide succinct, accurate executive summaries of complicated situations.Excellent written and verbal communication skills.BS/MS (EE/CS/CE a plus)", "jobDescription": "Why Apple?\n\nAdvanced audio technology is at the heart of Apple’s products. The Interactive Media Group (IMG) is looking for an Engineering Project Manager to help lead software work in this area. You’ll be responsible for defining and running processes that move several teams from idea through shipping amazing new features and products. IMG provides the media and graphics software foundation across all of Apple's innovative products, from iPhone, iPad, and Apple Watch, to Apple TV, iTunes, Beats, and Mac. As a key link between developers and our hardware, IMG drives Apple’s audio playback, processing and recording experiences through several APIs, including CoreAudio."}, "200445693": {"jobID": "200445693", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iOS Home Application Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445693/ios-home-application-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Engineering, Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Strong programming skills, preferably with Swift and Objective-C5+ years iOS user-interface programming experienceExcellent communication and collaborative skillsExcellent understanding of optimization and performance issues across OS software layersObsessively passionate and inquisitive, and seek to tackle everyday problems in innovative waysLaser-focused on the smallest details that are important to our customersBachelor's degree in Computer Engineering, Computer Science or equivalent experience.", "jobDescription": "The iOS Home is the center for an entire ecosystem of secure and intelligent home connectivity.  We are developing technologies and crafting experiences that revolutionize the way people interact with their homes. The team is seeking an expert engineer to help build the integrated Home experience on the iOS platform."}, "200442237": {"jobID": "200442237", "origin_search": null, "posted": "Nov 9, 2022", "jobTitle": "Product Design Engineering Program Manager- iPad", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442237/product-design-engineering-program-manager-ipad?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS ME degree required, MS or MBA desired"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Prior experience (ideally 2-5+ years) leading program management or mechanical engineering design of rapid development products comprising multiple materials of high aesthetic quality.Strong technical background with knowledge of manufacturing processes and mechanical engineering fundamentals; prior experience with metal stamping, forging, machining (CNC), die casting, plastic injection and compression molding, metal injection molding (MIM) is highly desirableResilience and flexibility when faced with uncertainty and changes in directionSelf motivated with strong critical thinking capabilitiesInsane attention to detail and ability to effectively handle complexityExcellent communication, organization and leadership skills with ability to inspire team members; ability to filter and distill relevant information for the right audienceExperience collaborating across disparate multi-functional teams spanning Mechanical Engineering and Design, Systems Engineering, Reliability, Operations, and MarketingBS ME degree required, MS or MBA desiredApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "The PD Engineering Program Manager is responsible for the technical management of engineering development projects within Apple’s Product Design organization. The ideal candidate will have a consistent track record of enabling large multi-functional teams to deliver complex mechanically integrated consumer electronic systems quickly and with high quality. They will understand the who, what and how of hardware development, create and manage the program plan, and successfully implement it while balancing several contending objectives and bold deliverable timelines."}, "200458505": {"jobID": "200458505", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Wireless PHY Systems & Simulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458505/wireless-phy-systems-simulation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS +3 years of relevant experience. Focus on Dig. Comm’s & Signal Proc., or equivalent is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Expertise in Digital Signal Processing, Wireless Communications, and wireless chip development.Proven grasp of complex wireless systems with strong capability to comprehend dependencies between system components and protocol layers and their interactions.Extensive hands-on SW programming skills for modeling and simulation of sophisticated systems from RF/PHY layer signals and channel modeling. All the way to MAC protocol/networking simulations; corresponding proficiency with Matlab/C/C++ required.Experience with fixed-point design and RTL vector generation is a plus.Experience with handling and processing large amounts of field and simulation data, including user-friendly visualization of complex test setups and simulation results, including measurement accuracies, system latencies, etc.Some familiarity with common analog/RF impairments encountered in wireless systems.Experience with and/or knowledge of industry standards such as Bluetooth, Ultra-Wideband, GPS, and/or other wireless protocols.Experience in lab FPGA/silicon bring-up, PHY/RF/MAC testing and debugging and usage of lab equipment is preferred.BS +3 years of relevant experience. Focus on Dig. Comm’s & Signal Proc., or equivalent is preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "As a Wireless PHY Systems & Simulation Engineer, you will be a core member of our highly innovative and visible Wireless System-on-Chip (SoC) design team. What does that mean? You will be help define modem architectures, develop physical-layer algorithms, and invent embedded DSP algorithms for chips enabling exciting new wireless applications! One emphasis of your specific role will be end-to-end simulation of sophisticated systems, modeling components from a multitude of signal processing fields. Including but not limited to propagation channel modeling, RF/antenna abstractions, PHY & MAC protocols and algorithms, and sensor fusion schemes to fuse wireless and non-wireless metrics. Application areas include ultra-wideband sensing and specialized wireless audio; products enabled or enhanced by our team’s SoC’s include specialized audio headsets (such as AirPods) and iPhones!"}, "200297470": {"jobID": "200297470", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Display Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200297470/display-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD or ME in Physics, Optics, EE, ME.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong EE fundamentals (analog/digital design, signal/power integrity, etc.)In-depth knowledge of OLED/LCD display technology is preferredEstablish electro-optical performance metrics and requirements through measurement and modelingExperience in prototype bring-up and debugging, functional verification and manufacturing support is helpfulExcellent project management, written, verbal and communication skills are required.PhD or ME in Physics, Optics, EE, ME.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Apple is looking for a Display Module Engineer to own the development and qualification activities to design and build innovative display modules used in next generation applications."}, "200449021": {"jobID": "200449021", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Graphics Verification Engineer - Shader Core", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449021/graphics-verification-engineer-shader-core?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We would like you to have minimum of 3 years of relevant experience including:Strong background in verification of sophisticated hardware at system or unit levelDeep knowledge of computer architecture and memory sub-system µ-architectureStrong fundamental software development skills, expertise in OO design principlesExperience with common verification tools such as SystemVerilog, UVM, OVM, etc. is desiredExperience with HDL simulators and waveform viewersExperience working under strict schedule deadlines with the ability to manage multiple prioritiesExcellent communication skills and ability to collaborateExperience with Python, Ruby, Perl or similar scripting languages is a plusGraphics architecture knowledge is a plusBS + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices. \n\nThe Graphics Verification Team is looking for talented engineers to help build complex, large-scale GPU products. In this role you will partner with our graphics architecture, µ-architecture, design, software and hardware performance teams to help define and deliver cutting-edge features for our Unified Shader Core (USC)."}, "200449092": {"jobID": "200449092", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "IC Packaging Characterization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449092/ic-packaging-characterization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Proficiency with major mechanical design CAD tools, such as Siemens NX, AutoCAD, SpaceClaim, SolidWorks, etc.Proven capability of setting up equipment and data acquisition systems.Hands-on experience of major material analysis and failure analysis tools (e.g., SEM, EDX, FIB, CSAM, etc.) is helpful.Knowledge of the Integrated Circuit packaging process, reliability, qualification requirements, and key materials is a plus.Excellent written and verbal communication skills with ability to present ideas, data, and plans with high confidence at team meetings.- BS and 3+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for precision to work towards an extraordinary result? We are looking for a dedicated and hardworking IC Packaging Characterization Engineer to join our team.\n\nAs part of the Packaging team, you will focus on the characterization of Integrated Circuits (IC) packages and related materials. You will also be responsible for developing methodologies of IC packaging characterization, and trouble-shooting IC packaging-related yield and reliability issues."}, "200460690": {"jobID": "200460690", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Front-End CAD Methodology Engineer - Design/DV Interface", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460690/front-end-cad-methodology-engineer-design-dv-interface?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for a strong engineer with experience in the following areas:Experience in silicon / chip development industryGood understanding of Front-End ASIC workflowsProficiency in programming languages, such as Perl, PythonExperience with RTL analysis Tools & Methodologies, such as Lint/CDC/RDC and connectivity is a plusExperience in FE infrastructure such as sanity, regression frameworks and IP release is a plusExperience with RTL simulators is a plusProficiency with meeting with FE customers, defining and implementing system workflowsStrong communication skills both oral and writtenGreat teammate with strong written and verbal interpersonal skills, and a service and support mentalityKnowledge of different source control tools like perforce, Git is a plusAbility to document requirements and specificationsCollaborative, innovative, creative and problem solving attitudeMinimum requirements of BS + 10 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help to ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions.\n\nThe Front-End Methodology CAD engineer plays a major role in promoting a reliable work environment and ensuring that common methodology is followed through across the different RTL Designers and Verification engineers across the Hardware Technology teams."}, "200367356": {"jobID": "200367356", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Sr. iPhone Hardware System Design Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200367356/sr-iphone-hardware-system-design-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS Electrical/Computer Engineering or equivalent required; MS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years strong electrical engineering fundamentals including analog and high speed digital designBroad experience across different applications and technologiesExposure to solving unwanted coupling and interference between subsystemsDesign of sophisticated system architecturesAbility to analyze solutions and make system design trade-offsStrong desire to dive deep into system level issues and drive problems to closure in a team-based environment with a proactive attitudeExcellent verbal, written, and presentation skillsExperience in many of the following areas:-- Proven record of leading multifaceted multi-functional teams-- Familiarity with the challenges of taking a product from early architecture through to production-- Hands on experience with lab test equipment to debug difficult/intermittent hardware issues-- Schematic capture and rigid/flexible PCB layout-- Fundamentals of Signal and Power Integrity-- Low voltage power regulation and delivery-- Prototype design and validation with custom silicon-- Use of scripting languages to assist with hw developmentBS Electrical/Computer Engineering or equivalent required; MS preferred", "jobDescription": "Do you have a feeling of deep happiness when a design decision that YOU were responsible for is showcased in a newly released product ? Do you just beam at the thought of “I made that!” ?  Would you like to have that same feeling again, and again? \n\nThe iPhone team is looking for expert Hardware Design Engineers who are motivated by the chance to define design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives!\n\nOur team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!"}, "200300969": {"jobID": "200300969", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Camera Mechanical Engineer - FEA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200300969/camera-mechanical-engineer-fea?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in Mechanical Engineering, Aerospace Engineering, Material Science or similar concentration"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of experience running non-linear static and dynamic Finite Element Analysis using AbaqusRigorous knowledge of Solid Mechanics and Strength of MaterialsStructural and thermo-structural focus; additional analyses may include electromagnetic, heat transfer, and CFDPassion for creating innovative, high quality productsDesire to work in fast-paced environmentOutstanding written and verbal communication skills; ability to interact with cross-functional teams, management, and external vendorsExperience with calibration, verification, and validation of models through physical testingPreferred experience in modeling of different classes of materials including polymers, elastomers, soft adhesives, and brittle materialsPreferred experience in testing including methods using Digital Image Correlations, Universal Testing Machines, and Dynamic Mechanical AnalysisExperience coupling FEA results to optical simulations tools such as Zemax or CODE V is a plusProficiency in Matlab, Python, and Abaqus User Subroutines is a plusBS/MS/PhD in Mechanical Engineering, Aerospace Engineering, Material Science or similar concentrationOccasional travel to manufacturing partners is requiredApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics.", "jobDescription": "The Camera Hardware Engineering Team is responsible for all research, design, development, test, and qualification of camera hardware for Apple products. We are seeking an extraordinary Mechanical Engineer (FEA) to evaluate and work on camera hardware modules and component parts."}, "200451917": {"jobID": "200451917", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Sr. RF PHY Test Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451917/sr-rf-phy-test-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficiency with basic metrics for determining quality of digital communication signals measured.Strong Wireless RF background and familiarity with RF systems fundamentals.Solid experience of RF parametric testing such as EVM, rx sensitivity, ACPR, blocker testing, etc.Knowledge of loadpull testing is desirable.Characterized/Debugged RF PCB and chip issues within a test and script development.Strong working knowledge of RF test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Unix scripting knowledge is a requirement (objected oriented programming experience such as Python is highly desirable).BS + 10 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with Phy, Mac, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200452102": {"jobID": "200452102", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Design Validation Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452102/wireless-design-validation-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 3+ years relevant experience required. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong Wireless RF background and familiarity with RF systems fundamentals.Solid experience of RF parametric testing such as IP3, NF, ACPR, phase noise, etc.Knowledge of loadpull testing is desirable.Characterized/Debugged RF PCB and chip issues within a test and script development.Strong working knowledge of RF test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Unix scripting knowledge is a requirement (objected oriented programming experience such as Python is highly desirable).Proficiency with basic metrics for determining quality of digital communication signals measured.BS with 3+ years relevant experience required. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\n\nWe invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200452106": {"jobID": "200452106", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Design Validation Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452106/wireless-design-validation-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong Wireless RF background and familiarity with RF systems fundamentals.Solid experience of RF parametric testing such as IP3, NF, ACPR, phase noise, etc.Knowledge of loadpull testing is desirable.Characterized/Debugged RF PCB and chip issues within a test and script development.Strong working knowledge of RF test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Unix scripting knowledge is a requirement (objected oriented programming experience such as Python is highly desirable).Proficiency with basic metrics for determining quality of digital communication signals measured.BS + 10 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\n\nWe invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200452100": {"jobID": "200452100", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Design Validation Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452100/wireless-design-validation-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong Wireless RF background and familiarity with RF systems fundamentals.Solid experience of RF parametric testing such as IP3, NF, ACPR, phase noise, etc.Knowledge of loadpull testing is desirable.Characterized/Debugged RF PCB and chip issues within a test and script development.Strong working knowledge of RF test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Unix scripting knowledge is a requirement (objected oriented programming experience such as Python is highly desirable).Proficiency with basic metrics for determining quality of digital communication signals measured.BS + 10 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\n\nWe invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200458117": {"jobID": "200458117", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Cellular Modem Firmware Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458117/cellular-modem-firmware-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Demonstrated ability working in the development or verification of cellular baseband modem firmware / algorithms.Understanding of end to end system involving the UE and network is desired.Good knowledge of wireless communications (OFDM/MIMO, etc.).Experience in wireless standards a significant plus (5G-NR/4G LTE/ UMTS/GSM/CDMA).Experience in High tech industry with a track record of hands-on product development, program management, project management, or engineering management.Experience in leading Layer 1 / RF Firmware development and/or verification.Good understanding of cellular modem baseband building blocks.Extraordinary teammate and creative problem solver with ability to lead technical teams and multi-functional groups against plans.Excellent written and verbal communication.BS and 10+ years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nApple seeks a technical leader to program manage our groundbreaking cellular baseband modems to meet performance, quality and schedule requirements for Apple products. You will be responsible for multi-functional team coordination, communication and representation across the cellular engineering ecosystem from concept to production. Technical background in embedded firmware engineering will be key to your success in this role. Ideally, you will also have validated project management experience in some aspect of RF Firmware / Layer 1 development, integration and/or verification towards production. You will work in a dynamic engineering environment, using sophisticated multi-tasking skills and real-time crisis management are all desired strengths for this position."}, "200453780": {"jobID": "200453780", "origin_search": null, "posted": "", "jobTitle": "Senior Graphics Verification Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453780/senior-graphics-verification-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200448217": {"jobID": "200448217", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "GPU Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448217/gpu-performance-analysis-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Strong hardware and software debug skillsGPU hardware and architectural knowledgeKnowledge of graphics rendering algorithmsExperience with one or more graphics APIs: OpenGL, Metal, or DirectXScripting and programming experienceExperience with RTL - System Verilog or VHDLWaveform analysisExcellent written and verbal communication, excellent organization skills, and highly self-motivatedAbility to work well in a team and be productive under aggressive schedulesMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nIn this role, you will be responsible for performance analysis, tuning, and debug of Apple’s GPU products. As a member of our Hardware design team, you will collaborate closely with other GPU Design and Software Engineers to study, debug and improve the performance of Apple’s mobile GPUs."}, "200448346": {"jobID": "200448346", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Power Analysis & Optimization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448346/graphics-power-analysis-optimization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Knowledge of logic design principles including power and timing implicationsKnowledge of low power microarchitecture and implementation techniquesExperience in PowerArtist, PTPX or similar power analysis toolsExperience in writing, simulating and debugging RTL designsProficient in Python or similar contemporary scripting languagesKnowledge in GPU pipeline is a plus but not requiredExcellent communication skills, self-motivated and well organizedBS + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions. Joining this group means you’ll be crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices! We are looking for a talented and creative engineer to support the power activity of Apple best-in-class GPU development."}, "200448348": {"jobID": "200448348", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Power Analysis & Optimization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448348/graphics-power-analysis-optimization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Knowledge of low power ASIC design and implementation techniquesExperience in product level power budgeting and projectionExperience in PowerArtist, PTPX or similar power analysis toolsExperience in data mining applications to power modeling & triageExperience in power use-case definition and analysisExperience in post-silicon power correlation is a plusExperience in power management techniques is a plusExcellent communication skills, self-motivated and well organizedBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions. Joining this group means you’ll be crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices! We are looking for a talented and creative engineer to support the power activity of Apple best-in-class GPU development."}, "200467502": {"jobID": "200467502", "origin_search": null, "posted": "Mar 4, 2023", "jobTitle": "Web Services Engineer - Localization Automation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467502/web-services-engineer-localization-automation?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor’s or Master’s Degree in Computer Science (or equivalent experience)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Strong object-oriented programming and design skillsStrong analytical and problem solving skillsExperience with back-end frameworks (e.g. Ruby on Rails, Django)Experience with databases and indexing (e.g. Cassandra, SQL, Solr)A technical background in UNIX commands in TerminalExcellent written and verbal communication skills- Bachelor’s or Master’s Degree in Computer Science (or equivalent experience)Preferred Skills- Experience designing reusable API- Interest and background in translation, internationalization, localization, and international markets- Native level foreign language skills in reading, writing and speaking- Familiarity with Swift- Familiarity with version control systems such as subversion or git- A track record of shipping products", "jobDescription": "The Localization Automation Team is responsible for developing tools and technologies that allow Apple to localize and ship products such as iPhone, iPad, Apple Watch, Mac, Apple TV, and more across the world.\nWe are looking for a talented Software Engineer to take our localization process to the next level. You will be in charge of a crucial process that impacts every product with the objective of making it even better. You will also develop new tools and applications to enhance Apple's localization technologies."}, "200450136": {"jobID": "200450136", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "RFIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450136/rfic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience in the area of Analog / Mixed-Signal IC design with advanced CMOS technology nodes.Direct tape out experience with one or more of the following blocks: on-chip LNAs and Pas, PLL/VCO/DCO/LOGEN blocks, mixers, baseband filters and amplifiers in deep sub-micron CMOS technology.Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability and other analog impairments.Deep understanding of CMOS device physics, RF device modeling, device noise parameters and inductor modeling.Familiarity with packaging effects, supply isolations, high frequency ESD structures, and circuit layout for optimum RF performance.Familiarity with various RF transceiver architectures and their trade-offs, as well as calibration methods used for different transceiver architectures.Understanding of system specifications and ability to work with system architects to translate system requirements into circuit requirements at IC level.Open to work with digital design group for an optimum partition between digital and analog domain.Familiarity with the integration flows and integration challenges of wireless SoCs.Familiarity with mixed-signal mode verification methodology (SystemVerilog, AMS, Nanotime).Knowledge of desense issues and able to work closely with board RF/HW/Antenna teams to optimize board layouts for desense mitigation. Experience with desense mitigation with integrated PMUs/DSPs (i.e. substrate isolation, return loops, package isolation, frequency planning, etc.)Familiarity with Cadence Virtuoso, Spectre RF, Matlab, EM simulation (EMX, HFSS) and similar tools.Experience in Si characterization and debug.Ability to drive strong production test/QA methodologies.BS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an RFIC design engineer, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200456589": {"jobID": "200456589", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Apple Services Reporting Analyst", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456589/apple-services-reporting-analyst?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of a Bachelors degree in Computer Science, Statistics, Mathematics, Engineering, Economics or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven professional experience in analytics, data science and/or reporting, preferably for a mobile app business or e-commerce platform that offers a subscription product.Mastery in SQL-based languages and proficiency in large-scale data languages, with experience in data visualization tools for full-stack data analysis and presentation.Experience with reporting as a product, including building roadmaps, writing technical specifications, and user acceptance testing.Excellent communication and presentation skills with meticulous attention to detail and the ability to interact effectively with both internal and external teams.Minimum of a Bachelors degree in Computer Science, Statistics, Mathematics, Engineering, Economics or related field", "jobDescription": "Services at Apple help hundreds of millions of customers get the most out of the devices they love through amazing apps, award-winning shows and movies, immersive music in spatial audio, world-class workouts and meditations, super fun games and more.\nWe are currently seeking an experienced and ambitious Reporting Analyst to help evaluate and optimize reporting to Apple’s Services partners, including retail channel partners and content partners related to the growth of our Services across verticals including App Store, Apple Music, Apple TV, and Apple Arcade among others. As our Services continue to grow and bring amazing experiences to more customers, partnerships are an increasingly important driver.\nAs a key member of our diverse and dynamic organization, you'll have the rare and rewarding opportunity to work with datasets of unique magnitude, richness, and dedication to customer privacy that will frequently require innovative approaches. You'll work collaboratively with partners across Data Science, Business, Marketing, Product, Ops, Engineering, Editorial, as well as external partners to deliver material customer and business value."}, "200336736": {"jobID": "200336736", "origin_search": null, "posted": "Jun 1, 2022", "jobTitle": "Software Quality Engineer, Apple Pay", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200336736/software-quality-engineer-apple-pay?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Thrives while developing UI automation test cases using SwiftKnowledgeable about overcoming UI automation limitationsAble to apply creativity and analytical thinking to all kinds of problems, such as test case design and building robust automationExpertise communicating clearly and conciselyStrong organizational skills enabling both independent and team workNice to Have:- Proficiency in writing automation in Javascript and/or Python", "jobDescription": "At Apple, new ideas become extraordinary products, services, and customer experiences. Imagine the possibilities when your passion is applied to enriching the lives of your friends, family, and Apple Pay users around the world. Your life's best work could be an interview away.\n\nThe Apple Pay Quality Engineering team is looking for a creative and motivated UI Automation Engineer with excellent problem solving and interpersonal skills. Join a dynamic team who pride themselves in qualifying the best-in-class contactless experience for accessing vehicles, homes, schools, hotels, and resorts. We have the rare and rewarding opportunity to shape upcoming products that will delight millions of users every day."}, "200460191": {"jobID": "200460191", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Engineering Program Manager - Input Device Product Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460191/engineering-program-manager-input-device-product-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Prior experience (ideally 3+ years) leading program management or mechanical engineering design of product developmentExcellent communication, organizational, presentation and leadership skillsSelf motivated and proactive with demonstrated creative and critical thinking capabilitiesUnderstands and deals well with rapid development cycles; remains flexible when faced with uncertainty and changes in directionKnowledge of product development processes as well as an understanding of manufacturing processes, mechanical engineering fundamentals; prior experience with metal stamping, forging, machining (CNC), die casting, plastic injection and metal injection molding (MIM) is highly desirableStrong attention to detail and ability to effectively manage complex design strategiesParticipated in delivering products comprised of multiple materials and high esthetic qualityExperience interfacing with cross functional teams including Mechanical Engineering and Design, Systems Engineering, Reliability, Operations, and Marketing.BS degreeApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.  Apple benefits programs vary by country and are subject to eligibility requirements.  Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "As a Product Design Engineering Program Manager you will be responsible for the technical management of the development and implementation process for the mechanical components of one of our Input Devices product development teams.  In this role you will drive the day-to-day activities to meet the overall program objectives focusing on engineering, development planning and validation cycles.  This involves engaging with large cross functional teams to balance several competing objectives and meet aggressive deliverable timelines."}, "200420680": {"jobID": "200420680", "origin_search": null, "posted": "Sep 1, 2022", "jobTitle": "Software Engineer - Windows Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420680/software-engineer-windows-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in CS or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "You’ve built projects using Windows SDK, C, C++You’ve deep understanding of object oriented design, memory management, and performance optimization.You’ve had to deal with debugging performance problems, and you’re comfortable rooting out performance bottle-necks.You have experience writing multi-threaded, asynchronous code. If you haven’t used GCD, you can learn it here. If you have, we’d like to hear from you.You enjoy paying attention to details almost as much as the big technical wins. You've a consistent record of completing projects on-time and to specification.You’re used to communicating with a diverse team, with both experts and novices, in technical and non-technical roles.We appreciate any experience with popular JavaScript tools, frameworks and design principals, and a curiosity to stay up to date with the changing JavaScript ecosystem landscape.BS in CS or equivalent experienceApple is an equal opportunity employer that is committed to inclusion and diversity. Visit jobs.apple.com to learn more. If you do not consent to Apple storing your information in our system for Recruiting purposes, please reply to this email requesting deletion. For more information on Apple’s privacy policy please visit https://www.apple.com/legal/privacy/.", "jobDescription": "What happens when the world’s most innovative engineers collaborate with the world’s most creative storytellers? TV gets reinvented! The Apple TV app team created and manage the Apple TV app on iOS, macOS and tvOS platforms, which redefined and refined the way people watch their favorite shows, movies, and so much more — including everything they love from the major subscription services. Today, the team also manage one of the most exciting new realms at Apple: we bring viewers the critically acclaimed and award-winning Apple Originals in Apple TV+. The Apple TV App makes it possible for people around the world to easily access content from multiple video providers on their devices while helping those video providers promote and monetize their work. The group is responsible for delivering innovative features and managing the app on iOS, tvOS and macOS platforms. Apple TV app also integrates with platform features to enrich the experience outside the app, for example TV app Widget on iOS and iPad, Siri (queries like New Movies, Filter by Actor etc.), iOS Spotlight, tvOS Top Shelf, and many more."}, "200314032": {"jobID": "200314032", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded Systems Video Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200314032/embedded-systems-video-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.S preferred, B.E/B.S/PhD in Electrical Engineering, Computer Science or related majors."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Excellent software design, problem solving and debugging skillsSolid programming skills- C/C++ coding abilitiesExperience in embedded real time multitasking software systemMinimum of 3 years direct related experience in embedded software developmentGood written and oral interpersonal skillsM.S preferred, B.E/B.S/PhD in Electrical Engineering, Computer Science or related majors.", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped craft almost daily. At Apple, you will have the opportunity to work on products that are always leaders in the industry and occasionally, change the world! The Video Engineering group at Apple is responsible for creating the image/video core technologies used in almost all Apple products and services. In this role, you will develop embedded software for image and video compression/processing, implementing features for applications such as the iPhone/iPad Camera capture, Live Photo, AirPlay, FaceTime, Cinematic Mode, iMovie and many more on a vast variety of devices! As an embedded software engineer, you will work on the video/image subsystem, including new video compression/processing feature development, performance and power optimization.  The applicant will be an extraordinary teammate and have a consistent track record of development for large volume product shipment."}, "200443043": {"jobID": "200443043", "origin_search": null, "posted": "Nov 18, 2022", "jobTitle": "Tools Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443043/tools-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor in Computer Science or Equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "Strong coding skills (preferably, but not necessarily in Swift)Desire to design, build, and support tools and services for testing software at scaleFamiliarity with git or other source control systems.Knowledge of Computer Science concepts (e.g. using efficient data structures and algorithms, memory management)Familiarity with basic operating system concepts (e.g. manipulating files, managing processes)Bachelor in Computer Science or Equivalent experience", "jobDescription": "The Tools Productivity team is developing tooling and services to ensure Apple's OS platforms and Apps are amazing to use on iPhone, iPad, Mac, Watch, TV, and beyond. Our tools are a crucial part of Apple's development workflow and our services enable running tests at an extensive scale as part of the At-desk and CI workflows of Apple's engineers. This team is growing the scope and scale of testing that is possible at Apple by building tools and solutions for physical and virtual workflows and is looking for people excited by that goal."}, "200466710": {"jobID": "200466710", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Human Interface Guidelines Writer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466710/human-interface-guidelines-writer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "-  Degree or equivalent experience in Interaction Design/HCI or Computer Science."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$88,100", "max": "$146,900,"}, "benefits": null, "requirements": "5+ years applied experience in iOS and/or macOS design and developmentThe ability to distill complex topics into clear, simplified proseA critical eye for design and superb attention to detailOutstanding written and verbal communication skillsSelf-motivated with the ability to work independentlyExcellent collaborative skills-  Degree or equivalent experience in Interaction Design/HCI or Computer Science.", "jobDescription": "Apple seeks a skilled, motivated writer to leverage software design and development expertise and help craft our Human Interface Guidelines.\n\nThis role offers the opportunity to impact apps and games used by people everywhere. As a member of the Developer Content team in Developer Publications, you’ll work closely with a range of groups across Apple to identify and concisely document app design guidance. Viewed by millions of designers and developers, this documentation aids in the design of beautiful, usable iOS, macOS, tvOS, and watchOS apps."}, "200318905": {"jobID": "200318905", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Video Processing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200318905/video-processing-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science, Electrical Engineering or related majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with Video Processing and GPU programmingExperience with HDR pipelineColor Science a huge plusExcellent software design, problem solving and debugging skillsValidated programming skills and C/C++ coding abilitiesExperience in embedded real time multitasking software systemMinimum of 3 years direct related experience in software developmentGood written and oral interpersonal skillsBS/MS in Computer Science, Electrical Engineering or related majorsApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped build almost daily. At Apple, you will have the opportunity to work on products that are always leaders in the industry and occasionally, change the world! The Video Engineering group at Apple is responsible for developing image/video core technologies used in almost all Apple products and services.  In this role, you will develop frameworks for image and video compression/processing, implementing features for HDR playback on iPhone/iPad/Mac /AppleTV for applications like AppleTV+, Netflix, Amazon Prime, YouTube, Hulu, Disney+ and HBOMax.  As an embedded software engineer, you will work on the video/image subsystem, including new video compression/processing feature development, performance, and power optimization. The ideal candidate would be an extraordinary teammate and have a proven track record of development for large volume product shipment."}}