{"200449027": {"jobID": "200449027", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics (GPU) Performance Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449027/graphics-gpu-performance-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We would prefer that you have the following skills:Strong C++ coding skillsExperience with performance modeling both cycle accurate and queueing modelsUnderstanding of CPU micro architecture with GPU knowledge a plusExperience with VHDL or VerilogExperience with scripting languagesWe prefer candidates who exhibit excellent communications skills, demonstrate a sense of motivation and show a high level of organizationWe like people who are fast learners and are eager to tackle technical challenges using innovationBS + minimum of 3 years of experience", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nIn this role, you will be passionate about writing code for performance modeling for GPUs and the performance model infrastructure. This includes working with architects and designers to understand the units being modeled."}, "200446346": {"jobID": "200446346", "origin_search": null, "posted": "", "jobTitle": "SerDes Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446346/serdes-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200446343": {"jobID": "200446343", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "SerDes Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446343/serdes-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with 10+ years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate should have deep understanding of analog mixed-signal design with experience in high-speed serial links.Solid understanding and experience of designing analog mixed signal circuit blocks including Bandgap, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, Oscillators, FiltersIn-depth knowledge of analog mixed-signal concepts like mismatch mitigation, linearity, stability, low-power and low-noise techniquesExperience with Tx/Rx equalization techniques and circuits like de-emphasis, CTLE, DFEExperience with high speed digital circuits (e.g., serializer, deserializer, counters, dividers, etc.)Familiarity with CDR architectures and implementationsDesign experience in advanced CMOS technologies, design with FinFet technologyHands-on experience with AMS IC development from definition to high-volume production including layout supervision, bench evaluation, correlation, and characterizationExperience in lab testing of high-speed serial linksKnowledge of common high-speed SerDes protocols (e.g., PCIe, USB, SATA, etc.)EXPERIENCE IN THE FOLLOWING AREAS IS DESIRABLE:Static timing analysis tools (e.g., Nanotime, Primetime, etc.)Modeling of digitally assisted analog adaptive loops (using C, Matlab or Python, etc.)Able to build VerilogA/AMS behavioral modelsAble to analyze and lead characterization data from lab and volume testingKnowledge of ESD requirementsBSEE with 10+ years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "In this role, you will actively work within Analog-Mixed/Signal design team and participate in bring-up of embedded circuits; collaborating with many disciplines to enable the world’s premiere products. You will closely work with a talented group of Analog-Mixed/Signal designers working diligently to deliver hard IPs to Apple’s products while exceeding the highest expectations of quality, innovation and efficiency.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. And in doing so face challenges as SOC/PHY design complexity.\n\nIf you have strong fundamentals and a track record of tackling technical challenges. If you are passionate about learning new skills and improving the value of your work. If you like to be tuned to the bigger-picture while diving deeply into the details to innovate and tackle problems!\n\nWe have an opportunity for a forward-thinking and especially hardworking analog mixed signal engineer with background in high speed serial links circuit blocks. As a member of our team with multifaceted strengths, you will have the rare and exciting opportunity to work on upcoming products that will surprise and delight millions of Apple’s customers.\n\nAnd all of this while enjoying a strong culture where you own your career!"}, "200466975": {"jobID": "200466975", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466975/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Lenox Square", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200463122": {"jobID": "200463122", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463122/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Danbury Fair Mall", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200463768": {"jobID": "200463768", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463768/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "American Dream", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200447490": {"jobID": "200447490", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447490/cellular-4g-5g-firmware-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10 + years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10 + years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP physical layer and protocol stackprocedures and configurationsExperience with firmware test case planning, design, and development for the4G/5G functional and performance scenariosStrong understanding of automation tools and scripting languages such as Python,C/C++, Java (a plus)Strong validated understanding of multiple 4G/5G signaling and physical layertest equipment along with their automation interfacesStrong analysis and debugging capabilities to be able to define issues and workwith firmware development and systems design teams to close these issuesDeep understanding of software engineering principles, and core computerscience fundamentalsFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, andvirtual platforms a plusMinimum BS and 10 + years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of a world class modem team, we'll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We'll work across fields to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a Cellular 5G/4G Firmware Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multifaceted multi- functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200463283": {"jobID": "200463283", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Senior Site Reliability Engineer (SRE)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463283/senior-site-reliability-engineer-sre?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Networks, Computers, Electronics and Software have been your hobby since you were in grade school\n\nTechnical engineering BS would be nice though not required\n\nMS in CS, CE or EE is even better."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in a DevOPS or SRE roleExperience with modern web-scale services including servers, VIPs, load balancers, proxiesAble to write software needed to build and operate a large scale platform 24x7 including the development and staging platforms.Proficient in at least one of these languages: Python, Golang, Rust, C++Familiar with bare metal bootstrap, provisioning, configuration and orchestrationHighly experienced with one of these: Puppet, Chef, Saltstack, AnsibleYou're comfortable testing and rolling new kernels, drivers, libraries, OS changes, config sync and building the systems to keep servers at an appropriate level and functionality.You're knowledgable running systems for containerized services(docker) and managing how they interact with network & system resourcesYou've implemented and utilized your own metrics (TSDB) and logging platform with a front end such as GrafanaYou've implemented a monitoring system such as Sensu, Zabbix or Nagios even better if you've written your ownYou're comfortable building and operating infrastructure that employs a Chaos Monkey. Bonus: You've written that Chaos Monkey serviceYou enjoy analyzing performance, end to end service experience and overall system health. You dig and dig at what initially seems like a small oddity until you determine the root cause, and drive it to resolution if it's a potential issue (regardless of whose problem it is)Flexibility and comfort working on a dynamic, fast-growing effort with minimal documentation and process in a small team environment. Quick learner. Aptitude to deal with ambiguity, and enthusiasm to help solve difficult issuesBonus: Native Kubernetes implementation including CNI, Kafka, etcd experienceBonus: You're familiar with distributed orchestration systemsBonus: Experience with Cisco, Juniper, or Arista routing and switching hardware (+OS), including wirelessNetworks, Computers, Electronics and Software have been your hobby since you were in grade school\n\nTechnical engineering BS would be nice though not required\n\nMS in CS, CE or EE is even better.", "jobDescription": "Apple is looking for a Senior SRE with automation tooling experience to drive and be part of a team that is building, monitoring, and maintaining large scale highly resilient systems. You'll be contributing to bare metal, OS stack, platform and network infrastructure for a critical and unique customer-facing Apple service. This is a rare opportunity to design, build and control the entire @scale end to end infrastructure, along with all supporting components such as provisioning, logging, metrics, monitoring, deployment and SW development platform, from the beginning within a team with a no-ops culture."}, "200269995": {"jobID": "200269995", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Hardware System Integration Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200269995/hardware-system-integration-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS Electrical/Computer Engineering or equivalent required; MS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "2+ years EE fundamentals including analog and high speed digital designBroad experience across different applications and technologiesExposure to solving unwanted coupling and interference between subsystemsDesign of sophisticated system architecturesAbility to analyze solutions and make system design trade-offsStrong desire to dive deep into system level issues and drive problems to closure in a team-based environment with a proactive attitudeExcellent verbal, written, and presentation skillsExperience in many of the following areas:- Proven track record of leading dynamic multi-functional teams- Familiarity with the challenges of taking a product from early architecture through to production- Hands on experience with lab test equipment to debug difficult/intermittent hardware issues- Schematic capture and rigid/flexible PCB layout- Fundamentals of Signal and Power Integrity- Low voltage power regulation and delivery- Prototype design and validation with custom silicon- Use of scripting languages to assist with hw developmentBS Electrical/Computer Engineering or equivalent required; MS preferred", "jobDescription": "The iPhone team is looking for expert Hardware Design Engineers who are motivated by the chance to create design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives! Our team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!"}, "200443582": {"jobID": "200443582", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "SerDes Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443582/serdes-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with 10+ years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "The ideal candidate should have deep understanding of analog mixed-signal design with experience in high-speed serial links.Solid understanding and experience of designing analog mixed signal circuit blocks including Bandgap, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, Oscillators, FiltersIn-depth knowledge of analog mixed-signal concepts like mismatch mitigation, linearity, stability, low-power and low-noise techniquesExperience with Tx/Rx equalization techniques and circuits like de-emphasis, CTLE, DFEExperience with high speed digital circuits (e.g., serializer, deserializer, counters, dividers, etc.)Familiarity with CDR architectures and implementationsDesign experience in advanced CMOS technologies, design with FinFet technologyHands-on experience with AMS IC development from definition to high-volume production including layout supervision, bench evaluation, correlation, and characterizationExperience in lab testing of high-speed serial linksKnowledge of common high-speed SerDes protocols (e.g., PCIe, USB, SATA, etc.)EXPERIENCE IN THE FOLLOWING AREAS IS DESIRABLE:Static timing analysis tools (e.g., Nanotime, Primetime, etc.)Modeling of digitally assisted analog adaptive loops (using C, Matlab or Python, etc.)Able to build VerilogA/AMS behavioral modelsAble to analyze and lead characterization data from lab and volume testingKnowledge of ESD requirementsBSEE with 10+ years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "In this role, you will actively work within Analog-Mixed/Signal design team and participate in bring-up of embedded circuits; collaborating with many disciplines to enable the world’s premiere products. You will closely work with a talented group of Analog-Mixed/Signal designers working diligently to deliver hard IPs to Apple’s products while exceeding the highest expectations of quality, innovation and efficiency.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. And in doing so face challenges as SOC/PHY design complexity.\n\nIf you have strong fundamentals and a track record of tackling technical challenges. If you are passionate about learning new skills and improving the value of your work. If you like to be tuned to the bigger-picture while diving deeply into the details to innovate and tackle problems!\n\nWe have an opportunity for a forward-thinking and especially hardworking analog mixed signal engineer with background in high speed serial links circuit blocks. As a member of our team with multifaceted strengths, you will have the rare and exciting opportunity to work on upcoming products that will surprise and delight millions of Apple’s customers.\n\nAnd all of this while enjoying a strong culture where you own your career!"}, "200451114": {"jobID": "200451114", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Health Sensing HW - Sensor ASIC Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451114/health-sensing-hw-sensor-asic-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. in Electrical Engineering or Physics.\nM.S. in Electrical Engineering plus a minimum of 3 years experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Strong electrical engineering background and hands-on experience in electrical design, both with IC and board-level circuitsA track record of successful ASIC architecture - beyond block-level design of specific on-chip functionsFundamental understanding of limitations and trade-offs of electrical circuits and semiconductor processesExcellent written and verbal communication skills, as well as solid teamwork and leadership skillsProficiency in MATLAB, SPICE, or similar simulation and modeling toolsExperience in opto-electronics, optics and digital signal processing are a plusPh.D. in Electrical Engineering or Physics.\nM.S. in Electrical Engineering plus a minimum of 3 years experience.", "jobDescription": "Design, develop, and launch next-generation Sensor Technologies in Apple products.\n\nThe Sensor Hardware team develops Sensor solutions and technologies for Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the Sensor Technology team is to enable the world’s best user-experience. New challenges arise everyday that require the sharp problem-solving skills of passionate and hard-working individuals. The team features a collaborative and hands-on environment that cultivates engineering excellence, creativity, and innovation. \n\nWe are looking for Sensor ASIC Architects to help develop ASICS for new Sensors and Sensing Systems for future Apple products. We have openings for Analog as well as Digital ASIC Architects."}, "200391911": {"jobID": "200391911", "origin_search": null, "posted": "Jun 17, 2022", "jobTitle": "Software QA Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200391911/software-qa-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS, Computer Science/Engineering or relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$153,500", "max": "$231,000,"}, "benefits": null, "requirements": "Expertise: Proven capabilities in leading interactive software product testing teams, ideally for experiential products that integrate software and hardware.Customer-Focused: Passionate about the customer experience and delivering experiential products that inspire, surprise, and delight.Team Player: Excellent cross-functional communication and influencing skills.Team Builder: Proven track record demonstrating the ability to attract, hire, motivate and develop the best quality-minded individuals.Priority Driven: Comfortable working in a continually changing and dynamic environment and driving top issues to resolution.Technically Agile: Proven ability to drive QA success via integrated cross-functional teams involving deep collaboration with engineering and design.BS/MS, Computer Science/Engineering or relevant industry experience", "jobDescription": "Thereʼs the typical job. Then thereʼs a career at Apple. Where we'll challenge you to defy routine. To explore the far reaches of the possible. To travel unchartered paths. And to be a part of something far bigger than yourself. Because around here, changing the world just comes with the job description. \n\nAs the QA Manager, you will be building and managing a team of QA Testers who work as integrated members of a cross-functional software team. You will lead them in the design and execution of QA strategies and methods to deliver creative experiential software products that surprise and delight our customers.\n\nYou should possess excellent communication and interpersonal skills, attention to detail, patience, and a real passion for testing and quality.\n\nWe are seeking a QA Manager with a strong foundation in software engineering QA methodologies and proven experience leading teams to deliver successful creative interactive entertainment software experiences."}, "200442584": {"jobID": "200442584", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensing Hardware Lab Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442584/sensing-hardware-lab-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "3-5 years of relevant experience is required. The ideal candidate will have a technical Bachelors degree or its equivalent in technical or vocational training. Equivalent experience in lieu of education will be considered (minimum 8-10 years)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.19", "max": "$67.78/hr,"}, "benefits": null, "requirements": "The ideal candidate is a capable technical generalist with relevant experience with most of the following:Prior Lab Management experienceProven track record of lab setup, organization, management, and continuous improvementFamiliarity with industrial health and safety risk assessments and safety protocol enforcementSolid understanding of MacOS and Windows configurationHands on experience with mechanical/environmental test equipment (thermal test chambers, small industrial robots/actuators etc.)Hands on experience with basic electrical test tools (power supplies, multimeters, oscilloscopes, DAQs, function generators, etc.)Hands on experience with sensors and metrology equipment (microscopes, thermocouples, accelerometers, pressure sensors, etc.)Hands on experience with basic fabrication tools (hand tools, drill press, band saw, etc); designing, assembling, and documenting basic test fixturesFamiliarity with industrial facilities and with basic equipment troubleshootingExperience with Apple product or other electronics disassembly / repair is a plusScripting skills (Python preferred) are a plusAbility to prioritize and multi-task in a very busy, sometimes chaotic environment; go getter attitude and willingness to go the extra mile to get the job doneEffective written and interpersonal communication skills, proven ability to work cross-functionally, harness the power of teamwork, and relate to technical partners.Ability to travel to Cupertino, CA periodically (est 5% travel)3-5 years of relevant experience is required. The ideal candidate will have a technical Bachelors degree or its equivalent in technical or vocational training. Equivalent experience in lieu of education will be considered (minimum 8-10 years)", "jobDescription": "Apple’s Imaging & Sensing Hardware engineering team is looking for a passionate, self-motivated, electro-mechanical generalist Lab Manager. As part of the Lab Management team you will be directly responsible for supporting the Motion Sensing, Touch Hardware, and TouchID engineering teams along with the care and upkeep of multiple engineering lab spaces. Your responsibilities will include equipment purchase, organization, maintenance, calibration, and support. You will help train engineers on specialized equipment usage and safe working practices within the lab environment. Other areas of responsibility include Mac/PC host management, basic test fixture fabrication, and leading the continued organization, cleanliness, and industrial health and safety compliance of lab spaces. You will also coordinate project work with internal and external facilities and equipment vendors, author laboratory documentation, and clearly and concisely communicate updates to the larger team.\nWe’re looking for a talented professional and leader who enjoys tackling tough challenges, taking initiative, and enabling world-class hardware engineering in a fast-paced and demanding product development climate."}, "200441763": {"jobID": "200441763", "origin_search": null, "posted": "Nov 10, 2022", "jobTitle": "Core BringUp Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441763/core-bringup-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master’s (preferred) or Bachelor’s degree or equivalent experience in computer science or a related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "A genuine passion for embedded developmentHighly proficient in C/C++Experience with JTAG and other debuggersPrevious experience writing embedded device driversPrevious experience with platform bring-up or porting of operating systemsPrevious exposure to hardware and processor simulationKnowledge of hardware platforms & processor architecturesProven creative, critical thinking and troubleshooting skillsHighly professional, with the ability to deliver proven work on tight schedulesExcellent collaborative skillsOutstanding written and verbal communicationMaster’s (preferred) or Bachelor’s degree or equivalent experience in computer science or a related field.", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. \n\nThe Core Platform Bring-up team within Apple's CoreOS organization is looking for an extraordinary software engineer to work on state-of-the art technology, debug, and bring-up of next generation iOS devices. We work on a core technology for Apple. In this role you will have the chance to make a major impact in the way that Apple develops and ships iOS based products. Our working environment fosters product innovation, rapid product iteration, and a liberating amount of autonomy."}, "200461778": {"jobID": "200461778", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Core BringUp Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461778/core-bringup-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master’s (preferred) or Bachelor’s degree or equivalent experience in computer science or a related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "A genuine passion for embedded developmentHighly proficient in C/C++Experience with JTAG and other debuggersPrevious experience writing embedded device driversPrevious experience with platform bring-up or porting of operating systemsPrevious exposure to hardware and processor simulationKnowledge of hardware platforms & processor architecturesProven creative, critical thinking and troubleshooting skillsHighly professional, with the ability to deliver proven work on tight schedulesExcellent collaborative skillsOutstanding written and verbal communicationMaster’s (preferred) or Bachelor’s degree or equivalent experience in computer science or a related field.", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. \n\nThe Core Platform Bring-up team within Apple's CoreOS organization is looking for an extraordinary software engineer to work on state-of-the art technology, debug, and bring-up of next generation iOS devices. We work on a core technology for Apple. In this role you will have the chance to make a major impact in the way that Apple develops and ships iOS based products. Our working environment fosters product innovation, rapid product iteration, and a liberating amount of autonomy."}, "200458246": {"jobID": "200458246", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Environmental Health and Safety Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458246/environmental-health-and-safety-engineer?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA or BS program in a relevant EHS field\n\nCertified Industrial Hygienist (CIH), or qualified to become a CIH"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$188,000,"}, "benefits": null, "requirements": "Industrial hygiene, chemistry background or environmental management experience in a microelectronic or biotechnology setting.8 or more years' experience in the development, implementation and operation of:Chemical review and approval processesChemical safety and management programsIndustrial hygiene qualitative and quantitative exposure assessmentsExposure assessment and hazard control practicesCority industrial hygiene databasePersonal Protective Equipment program, including the Respiratory Protection ProgramIncident response and investigationHazardous Materials Emergency Response ProgramFire and gas life safety system managementDEA/DHS regulated substance managementPosses the skills and ability to:Develop and implement EHS programsMaintain and monitor EHS permitting and regulatory complianceConduct and track workplace safety and compliance inspectionsHandle computer based EHS training development and deliveryBA or BS program in a relevant EHS field\n\nCertified Industrial Hygienist (CIH), or qualified to become a CIHAdditional skills and experience in the following areas are desirable:-  Establishing positive relationships with Federal, State, and Local regulatory agencies-  Handling incident reports, investigations and tracking-  Building relationships with peers, partners and Apple internal customers-  Assessing EHS risks in high hazard R&D environments-  Willingness to be on a 24-hour emergency response on-call rotation-  Supporting and implementing Corporate EHS initiatives including COVID-19 controls, Smarter Chemistry Workgroups, Corporate EHS Programs (i.e., Hazard Communication & Chemical Hygiene Plan), and Global Industrial Hygiene Program initiatives-  Assist in the development and implementation of the environmental, health & safety programs at emerging global research labs and Technology Centers.", "jobDescription": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The EHS team at Apple is growing, and we need upbeat, dedicated and flexible professionals to join a dynamic team committed to protecting the environment, health, and safety of our employees, customers and the global communities where we operate, while supporting our team members in their mission to develop amazing products.\n\nApple is looking for an experienced Environmental Health and Safety (EHS) Professional to join the Global Labs and Technology Centers EHS team. This role supports a fast paced environment and assists in the development, implementation and management of Apple’s EHS programs."}, "200450658": {"jobID": "200450658", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Radio Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450658/radio-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.This position requires thorough knowledge of the ASIC design flow, synthesis, static timing analysis, scripting, and netlist generation.Relevant design experience in SoC and/or radio/transceiver, PLL ControllerExperience with Digital Mixed Signal digital designExtraordinary leadership skills and ability to inspire team members with an innate ability to see the bigger picturePassion for owning and driving design schedules using well-defined metricsExperience working in a high-energy multi-disciplined engineering environment, strong at multi-tasking, and real-time crisis managementAbility to understand and extract action plans from complex technical discussions and translate into succinct messaging for multi-functional and executive status reportingExcellent debugging skills. Shown ability to drive resolution of critical problemsBS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture, and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We encourage you to apply if you enjoy a fast-paced and challenging environment, collaborating with people across different functional areas, and thriving during crisis times."}, "200459788": {"jobID": "200459788", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Hardware Systems Design Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459788/hardware-systems-design-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE is required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong EE fundamentals including analog and high speed digital designBroad experience across different applications and technologiesExposure to solving unwanted coupling and interference between subsystemsDesign of sophisticated system architecturesAbility to analyze solutions and make system design trade-offsStrong desire to dive deep into system level issues and drive problems to closure in a team-based environment with a proactive attitudeExcellent verbal, written, and presentation skillsExperience in many of the following areas:-  Proven track record of leading dynamic multi-functional teams-  Familiarity with the challenges of taking a product from early architecture through to production-  Hands on experience with lab test equipment to debug difficult/intermittent hardware issues-  Schematic capture and rigid/flexible PCB layout-  Fundamentals of Signal and Power Integrity-  Low voltage power regulation and delivery-  Prototype design and validation with custom silicon-  Use of scripting languages to assist with hw developmentBS/MS EE is requiredPosition will require some international travel", "jobDescription": "The iPhone team is looking for expert Hardware Design Engineers who are motivated by the chance to create design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives! Our team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!"}, "200463330": {"jobID": "200463330", "origin_search": null, "posted": "Feb 18, 2023", "jobTitle": "SOC Performance & Power Engineer - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463330/soc-performance-power-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. and 10+ years of relevant industry experience. Masters or PhD in EE, CS, or related field preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Great written and verbal communication skills.Proficient in C++ and one or more scripting languages, ideally Python.Strong computer architecture fundamentals and understanding of how HW and SW interact in a complex system.Computer system performance modeling experience of some kind.Ability and enthusiasm to work with experts in architecture, design, post-silicon analysis, software, and more.B.S. and 10+ years of relevant industry experience.B.S. and 10+ years of relevant industry experience. Masters or PhD in EE, CS, or related field preferred.", "jobDescription": "Do you love crafting elegant solutions to complex problems? Do you enjoy learning how systems work from the big picture down to the smallest detail? As part of the SoC Performance group, you’ll work with a diverse set of cross-functional teams to help architect, optimize, and ship our industry-leading SoCs powering Apple products from iPhone to Apple Watch, iPad, Macs, and more! You’ll join a team of performance architects who deeply analyze the way our SoCs are used in the real world, in order to ensure that software can harness the full power of our chips and to improve the design of future SoCs. We’re looking for experienced, passionate, and highly motivated individuals to help us set the standard on the performance, efficiency, and hardware/software integration of Apple’s products!\n\nYou will enjoy this role if:\n\n-  You're interested in hardware design, hardware/software co-design, hardware/software optimization, and power/performance tradeoffs.\n\n-  You derive satisfaction from not only writing code and analyzing its behavior, but in using that analysis to influence the direction of the organization.\n\n-  You know that a performance model is only as good as the stimulus (workloads) and analysis infrastructure around it, and are motivated to use your skills to work with others to build up all the parts of this ecosystem.\n\n-  You imagine, and/or measure, how the code you write will execute on the target hardware."}, "200291488": {"jobID": "200291488", "origin_search": null, "posted": "Nov 29, 2022", "jobTitle": "DDR Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200291488/ddr-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logicLogic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking RTL Design Engineer. As a member of our dynamic group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  You will join the DDR PHY design team. We provide outstanding PHY designs for high-performance, low power applications. As a logic design engineer, you will be involved in all phases of the design, from concept study, architecture definition, design and verification, to silicon bring-up and characterization."}, "200451771": {"jobID": "200451771", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "DDR RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451771/ddr-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logicLogic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.  You will join the DDR PHY design team. We provide best-in-class PHY designs for high-performance, low power applications. \n\nAs a DDR design engineer, you will be involved in all phases of the design, from concept study, architecture definition, design and verification, to silicon bring-up and characterization."}, "200456192": {"jobID": "200456192", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Systems Software Engineer, Special Projects Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456192/systems-software-engineer-special-projects-group?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or higher in Computer Science or related field; or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong programming skills with C or C++Some exposure to multithreaded programmingProgramming for embedded systemsExcellent communication and collaborative skillsBS or higher in Computer Science or related field; or equivalent experience", "jobDescription": "The Special Projects Group at Apple is looking for a software engineer to join our team to work on Embedded Systems Frameworks supporting a sensors, algorithms, and controls pipeline. The team is responsible for design, implementation, verification, and debugging of features written in C and C++ code. We work cross-functionally with teams across the project to provide an efficient framework on a real-time OS, and cross-platform tools to support its use."}, "200439261": {"jobID": "200439261", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "Software Engineering, Input UI Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439261/software-engineering-input-ui-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor of Computer Engineering or Computer Science, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$260,000,"}, "benefits": null, "requirements": "Extensive experience with UI development and design iteration.Deep passion for the field of Keyboard & Text Input.Experience in shipping high quality software products on iOS or macOS.Experience leading technical projects cross-functionally.Ability to manage and grow a team of talented engineers (experience is a plus).Ability to work in a fast-paced environment where the product definition can change over the course of the development cycle.Ability to collaboratively drive multiple projects across many teams. Clear communication is a must.Understanding of the challenges encountered in making a global product that needs to work for customers all around the world who use different languages and customs.Bachelor of Computer Engineering or Computer Science, or equivalent experience.", "jobDescription": "With billions of messages typed everyday, the keyboard is among the most frequently used software applications on the planet! Our team makes that happen! The Input team is responsible for the text input experience across iPhone, iPad, Mac, Watch, and Apple TV. We are constantly exploring new innovations to make the text input experience better and also reach all our customers around the world who use many different languages.\n\nWe’re looking for an exceptional software engineering manager for the Input Software User Interface team. The ideal candidate wants to tackle big problems and cares about getting the little details right."}, "200442842": {"jobID": "200442842", "origin_search": null, "posted": "Dec 18, 2022", "jobTitle": "PHY Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442842/phy-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be essential for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc..Knowledge of cellular communication standards: 5GNR, 4G LTE, 3G (HSPA), 2G GSM.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? We are searching for a talented engineer with years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200462111": {"jobID": "200462111", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Cellular 4G/5G Firmware Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462111/cellular-4g-5g-firmware-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Basic understanding of 5G and 4G 3GPP physical layer and protocol stack procedures and configurationsExposure to firmware test case planning, design, and development for the 4G/5G functional or performance or RF scenariosStrong understanding of automation tools and scripting languages such as Python, C/C++, JavaUnderstanding of 4G/5G signaling and physical layer test equipment along with their automation interfacesStrong analysis and debugging capabilities to be able to root cause issues and work on solutions with firmware development and physical layer system design teamsDeep understanding of software engineering principles, and core computer science fundamentalsFundamental familiarity with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms is a plusMinimum BS", "jobDescription": "Do you have a passion for invention and self-challenge? As part of a world class modem team, we'll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We'll work across fields to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a Cellular 5G/4G Firmware Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200455324": {"jobID": "200455324", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455324/soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 0 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "-  Knowledge of computer architecture and digital design fundamentals-  Knowledge of Verilog or SystemVerilog, digital simulation and debug-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to take on diverse challengesMinimum of BS + 0 years relevant industry experience", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200455329": {"jobID": "200455329", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455329/soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 0 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "-  Knowledge of computer architecture and digital design fundamentals-  Knowledge of Verilog or SystemVerilog, digital simulation and debug-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to take on diverse challengesMinimum of BS + 0 years relevant industry experience", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200452462": {"jobID": "200452462", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Wireless PHY RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452462/wireless-phy-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Good knowledge in modern design techniques and energy-efficient/low power logic design.Proven background in computer architecture.Bus fabric, especially APB/AHB/AXI.Tiered memory system.System debug architecture.Power management with multiple power domains.Integer and floating-point numeric units.High-speed data path and control units.Track record of bringing logic designs into mass production.Excellent communication skills and self-motivation/organization.Experience with FPGA and/or emulation platform desired.Ability to drive strong production test/QA methodologies a plus.BS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}, "200452457": {"jobID": "200452457", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Wireless PHY RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452457/wireless-phy-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Good knowledge in modern design techniques and energy-efficient/low power logic design.Proven background in computer architecture.Bus fabric, especially APB/AHB/AXI.Tiered memory system.System debug architecture.Power management with multiple power domains.Integer and floating-point numeric units.High-speed data path and control units.Track record of bringing logic designs into mass production.Excellent communication skills and self-motivation/organization.Experience with FPGA and/or emulation platform desired.Ability to drive strong production test/QA methodologies a plus.BS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}, "200415798": {"jobID": "200415798", "origin_search": null, "posted": "Oct 24, 2022", "jobTitle": "Senior iOS Engineer, Creativity Apps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200415798/senior-ios-engineer-creativity-apps?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree in Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "8+ years proven experience shipping user-facing applications on Apple platforms preferredExperience delivering high quality software at scaleProficiency in iOS development using Swift or Objective-CExperience as a technical lead; demonstrating strong communication, collaboration, and project management skillsWilling to take responsibility and ownership of features and drive key architectural decisionsCommitted to encouraging an open and inclusive work environmentAbility to communicate effectively, collaborate, and build long-term relationships across the organizationAbility and desire to mentor others in achieving engineering excellence and to be a catalyst on the teamBachelor's Degree in Computer Science or equivalent experience.", "jobDescription": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly.\n\nThe Creativity Apps team needs your help shaping the next generation of creative editing tools by working on state-of-the-art technologies to surprise and delight creative pros and enthusiasts alike. You’ll be working with the world-class teams behind Final Cut Pro, Logic Pro, iMovie, and GarageBand to create next-generation tools for creators! \n\nReady to join us? As a Senior iOS Engineer, you’ll work with world class creatives, designers, and engineers to help innovate in the creative space in ways that only Apple can. This is a highly visible, highly impactful opportunity!"}, "200447335": {"jobID": "200447335", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Strategic Design Engineering Program Manager (Electrical)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447335/strategic-design-engineering-program-manager-electrical?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in engineering (EE, ME/IE, CS) with 10+ yrs of experience or Master's degree with 8+ yrs of experience. MBA preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "Background in Electrical Engineering is preferred with a sourcing background is helpfulExperience in EE commodities and technologies including should costing and sourcing. Preferably including Display, Flex, PCB, Battery, Power and other EE components.Ability to own should costing and investigation of alternate components that meet design requirementsAbility to challenge the EE design team on requirements, specifications and suggest alternate designs.Self starter with demonstrated program management skills, attention to detail, ability to influence cross-functional teamsFundamental understanding of Design for Cost/ValueBS degree in engineering (EE, ME/IE, CS) with 10+ yrs of experience or Master's degree with 8+ yrs of experience. MBA preferred.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nThe Cost Engineering Team (CET) will partner with cross-functional product teams across Apple Home, Beats and Ecosystem to develop and introduce new products that are both innovative and cost advantaged.  Our objective is to support premium & high quality products, but to also drive Design to Cost and Design to Value to support cost sensitive products (CSP)."}, "200466151": {"jobID": "200466151", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466151/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "La Encantada", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200450662": {"jobID": "200450662", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Radio Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450662/radio-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.This position requires thorough knowledge of the ASIC design flow, synthesis, static timing analysis, scripting, and netlist generation.Relevant design experience in SoC and/or radio/transceiver, PLL ControllerExperience with Digital Mixed Signal digital designExtraordinary leadership skills and ability to inspire team members with an innate ability to see the bigger picturePassion for owning and driving design schedules using well-defined metricsExperience working in a high-energy multi-disciplined engineering environment, strong at multi-tasking, and real-time crisis managementAbility to understand and extract action plans from complex technical discussions and translate into succinct messaging for multi-functional and executive status reportingExcellent debugging skills. Shown ability to drive resolution of critical problemsBS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture, and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We encourage you to apply if you enjoy a fast-paced and challenging environment, collaborating with people across different functional areas, and thriving during crisis times."}, "200210670": {"jobID": "200210670", "origin_search": null, "posted": "Jan 3, 2023", "jobTitle": "AR/VR Software Tools Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200210670/ar-vr-software-tools-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in CS or comparable degree or relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "2-15 years of industry experience in the following areas:Developing tools for developers and content creatorsExperience with development for Apple platforms (macOS, iOS, iPadOS)Advanced knowledge of C, Objective-C and/or SwiftAbility to thrive in an agile working environmentDelivering high quality software to end usersExperience developing tools for 3D applications and/or games is a plusBS/MS in CS or comparable degree or relevant experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple's Technology Development Group works with advanced technologies, including the augmented reality (AR) platform ARKit and Metal 2, to create ground-breaking new products. Do you want to push the limits of the best Augmented Reality platform in the world? Would you like to help craft Augmented Reality experiences for millions of people? In this position, you will have the opportunity to partner with our extraordinary team of technologists, artists and designers to build new software products that will change the way people experience their own reality! Do you like to create great tools for developers so they can build revolutionary AR experiences."}, "200452350": {"jobID": "200452350", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "RF Hardware Electromagnetic Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452350/rf-hardware-electromagnetic-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. and 10+ years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong fundamental magnetic, electromagnetic and physics background related to near field communications and/or wireless power transferM.S. or PhD in mathematics, electromagnetics, or physics discipline is preferred, not requiredSkilled in the use of CAD simulation tools such as COMSOL, HFSS, CST, and MaxwellSkilled in the use of mixed-signal/RF measurement instrumentsSkilled in building and modifying prototype hardwareExperience building digital models of complex electromagnetic systemsCoding experience with Python, Matlab or other relevant language in support of modeling & simulationKnowledge of NFC communications techniquesMust be an excellent communicator, both written and oralShould be well organized and have the ability to be flexible in a changing work environmentInternational travel as needed (10%)B.S. and 10+ years of relevant experience", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before.\n\nWe have built the best RF hardware design team on the planet. We’re looking for a dedicated individual to join our team. We support WiFi, Bluetooth, NFC, GPS, and other emerging connectivity technologies. As an RF Hardware Electromagnetic Modeling Engineer at Apple, you will contribute to the architecture, design, and implementation of next generation wireless radio solutions in all product categories."}, "200459921": {"jobID": "200459921", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "US-Store Leader", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459921/us-store-leader?team=APPST", "jobLocation": {"remote": "not specified", "city": "Holyoke", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive positive customer experiences that build loyalty and deliver measurable results.Ability to manage separate business groups within a complex environment.Strong communication skills to clearly impart the Apple vision to the teams you oversee.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome — a retail background is not necessary.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You'll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Would you love to work in a complex and ever-changing work environment?  As more and more people discover Apple, they visit our stores seeking ways to incorporate our products into their lives. It’s your job, as a Store Leader, to build and manage the various teams that engage customers in this dynamic environment. In this role, you lead the people that help customers achieve ownership, learn new skills, get technical support, and find business solutions. Adaptable and flexible by nature, you’re composed and collected as you balance the diverse needs of your teams in the midst of constant change. "}, "200463112": {"jobID": "200463112", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "SerDes Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463112/serdes-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with 10+ years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "The ideal candidate should have deep understanding of AMS design with experience in high-speed serial links.Solid understanding of designing AMS circuit blocks including Bandgap, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, Oscillators, FiltersUnderstanding of analog mixed-signal concepts like mismatch mitigation, linearity, stability, low-power and low-noise techniquesDeep understanding and experience with digitally assisted analog design concepts (e.g. background calibrations, LMS based adaptive loops)Proven experience working on system and architecture teams to drive block-level and IP requirementsProven track record working with large teams and guiding junior engineersExperience with high speed digital circuits (e.g., serializer, deserializer, counters, dividers, etc.) with solid understanding of digital design conceptsExperience and proven understanding of Tx/Rx equalization techniques and circuits (e.g. CTLE, DFE, de-emphasis) for 20+ Gbps NRZ and PAM applicationsExperience with EQ adaptation methods and circuit interactions to improve PPASolid understanding of CDR architectures and implementationsExperience in Analog Mixed Signal circuit modeling and performance evaluation (e.g. SystemVerilog, Matlab, Python, VerilogAMS)Hands-on experience to drive lab testing, debug and data analysisHands-on experience in advanced CMOS technologies, design with FinFet technologyHands-on experience with AMS IC development from definition to high-volume production including layout supervision, bench evaluation, correlation, and characterizationEXPERIENCE IN THE FOLLOWING AREAS IS A PLUSConcepts of timing closure and related industry tools (e.g., Nanotime, Primetime)Concepts of IP delivery and quality checksKnowledge of common high-speed SerDes protocols (e.g., PCIe, USB, DP, MPHY) is helpfulSkills in scripting and automation to improve efficiency are highly desirableBSEE with 10+ years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "We are seeking experienced Analog Mixed-Signal designers to join our high-speed SerDes team. \n\nOur team specializes in building next generation high-performance wireline transceivers delivering intellectual-property (IP) for Apple’s world-leading system-on-chip (SOC)!\n\nIn this role, you will actively work with cross-functional Analog Mixed-Signal design teams to create state-of-the-art IPs key to Apple’s products. \n\nYou will be challenged to make the best-in-class designs to surprise and delight Apple customers. With transforming the user experience in focus, you will get an opportunity to work on designs which makes the best systems. This enables you to learn to end-to-end system while exceeding the highest expectations of quality, innovation and efficiency.\n\nIf you have strong fundamentals and a track record of tackling technical challenges, \n\nIf you are passionate about learning new skills and improving the value of your work, \n\nIf you like to be tuned to the bigger-picture while diving deeply into the details to innovate and solve problems, \n\nWe invite you to join and grow with our team!"}, "200463113": {"jobID": "200463113", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "SerDes Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463113/serdes-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with 10+ years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate should have deep understanding of AMS design with experience in high-speed serial links.Solid understanding of designing AMS circuit blocks including Bandgap, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, Oscillators, FiltersUnderstanding of analog mixed-signal concepts like mismatch mitigation, linearity, stability, low-power and low-noise techniquesDeep understanding and experience with digitally assisted analog design concepts (e.g. background calibrations, LMS based adaptive loops)Proven experience working on system and architecture teams to drive block-level and IP requirementsProven track record working with large teams and guiding junior engineersExperience with high speed digital circuits (e.g., serializer, deserializer, counters, dividers, etc.) with solid understanding of digital design conceptsExperience and proven understanding of Tx/Rx equalization techniques and circuits (e.g. CTLE, DFE, de-emphasis) for 20+ Gbps NRZ and PAM applicationsExperience with EQ adaptation methods and circuit interactions to improve PPASolid understanding of CDR architectures and implementationsExperience in Analog Mixed Signal circuit modeling and performance evaluation (e.g. SystemVerilog, Matlab, Python, VerilogAMS)Hands-on experience to drive lab testing, debug and data analysisHands-on experience in advanced CMOS technologies, design with FinFet technologyHands-on experience with AMS IC development from definition to high-volume production including layout supervision, bench evaluation, correlation, and characterizationEXPERIENCE IN THE FOLLOWING AREAS IS A PLUSConcepts of timing closure and related industry tools (e.g., Nanotime, Primetime)Concepts of IP delivery and quality checksKnowledge of common high-speed SerDes protocols (e.g., PCIe, USB, DP, MPHY) is helpfulSkills in scripting and automation to improve efficiency are highly desirableBSEE with 10+ years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "We are seeking experienced Analog Mixed-Signal designers to join our high-speed SerDes team. \n\nOur team specializes in building next generation high-performance wireline transceivers delivering intellectual-property (IP) for Apple’s world-leading system-on-chip (SOC)!\n\nIn this role, you will actively work with cross-functional Analog Mixed-Signal design teams to create state-of-the-art IPs key to Apple’s products. \n\nYou will be challenged to make the best-in-class designs to surprise and delight Apple customers. With transforming the user experience in focus, you will get an opportunity to work on designs which makes the best systems. This enables you to learn to end-to-end system while exceeding the highest expectations of quality, innovation and efficiency.\n\nIf you have strong fundamentals and a track record of tackling technical challenges, \n\nIf you are passionate about learning new skills and improving the value of your work, \n\nIf you like to be tuned to the bigger-picture while diving deeply into the details to innovate and solve problems, \n\nWe invite you to join and grow with our team!"}, "200206376": {"jobID": "200206376", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Service Warehouse Trainer, AppleCare Logistics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200206376/service-warehouse-trainer-applecare-logistics?team=CUST", "jobLocation": {"remote": "not specified", "city": "Sacramento", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "AA/AS degree or 3+ years of applicable work experience in reverse logistics, test/repair environment required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$23.00", "max": "$23.00."}, "benefits": null, "requirements": "2-3 yrs experience in depot repair operation, manufacturing or reverse logistics operationsKnowledge of warehouse operations and inventory controlDemonstrated experience as a trainer, auditor, or instructor with a deep understanding of content implementation targeting multiple learning stylesExcellent written and verbal communication skills with the ability to tailor your message for a group and individual instructionProficient working knowledge of database tools, MS Excel and word processing softwareExcellent English-language oral and written communications skillsAA/AS degree or 3+ years of applicable work experience in reverse logistics, test/repair environment required", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  The people here at Apple don’t just create products - they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts.   As a Warehouse Trainer you'll be responsible for managing and facilitating training initiatives across the AppleCare Service Operations team. This role is key to the continued growth and success of employee on-boarding and development within our service, repair and logistics teams. This is a fast-paced, dynamic environment where flexibility and adaptability are key attributes needed for success.  This is a fast-moving, dynamic environment where flexibility and adaptability are key attributes needed for success. Excellent project and time-management skills, with an ability to organize and drive critical tasks and objectives in support of our goals is something we value."}, "200449830": {"jobID": "200449830", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Wireless MAC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449830/wireless-mac-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Very strong digital logic design fundamentalsExpertise in translating functional requirements into synthesizable Verilog or SystemVerilog RTLKnowledge of digital design flows such as RTL simulation and debug, synthesis, lint, STA and LECAbility to design multi-clock-domain logic and resolve CDC problems4+ years of experience in ASIC microarchitecture and RTL designUnderstanding of wireless standards, such as IEEE 802.11, 802.15, Bluetooth or 3GPP is a plusUnderstanding of ASIC low power design techniques, e.g. multiple supply domains configuration and management, dynamic power/clock scaling and power analysis is a plusFamiliarity with power estimation (vector-less and vector-based), modeling, profiling, and post silicon power correlationUnderstanding of ASIC test methodologies, including DFT, scan insertion, memory BIST, and others is a plusExcellent organizational skillsExcellent communications skills – both written and oral.BS and 10+ years of relevant industry experience", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply."}, "200449093": {"jobID": "200449093", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Signal Integrity - RF Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449093/signal-integrity-rf-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Excellent problem solving skills in a dynamic and complex environment when boundary is not clearly defined.Strong fundamentals in microwave engineering and 2D/3D EM simulation tools.Deep knowledge on interaction between EM model and other circuit structures.Familiar with RF impairment at block and transceiver levels, including amplifier, filter, PLL, etc.Experience with RF lab equipment, such as VNA, signal generator, spectrum analyzer, real-time scope, probe station, etc.Enthusiasm in learning new technology and willingness to take risks to solve problems.Strong academic training and knowledge on fundamentals of SI and PI issues is a plus.Familiar with RFIC design and simulation flow is preferredExperience in advanced transceiver design and integration is a plusRF system modeling and link budgeting for transceiver chains.Preferred experience on RF module/board development.- BS and 3+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for precision to work towards an extraordinary result? We are looking for a hardworking and hard-working RF Integrity Engineer for Apple's IC Packaging team. \n\nRFI (RF Integrity) team develops novel methodologies to solve coupling, spur, and coexistence issues in highly integrated RF systems through simulation and lab debug. The engineering regime covers Si, package, module, PCB, and form-factor device. The working methods are constantly evolving and blurring boundaries of existing domains. As an RF Integrity Engineer, you will explore multiple aspects of RF technology and expand the boundary of innovation. The team is small and the coverage is huge due to its multidiscipline nature."}, "200384169": {"jobID": "200384169", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "HID-Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200384169/hid-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in CS/CE or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expertise in C or C++ for Embedded SystemsStrong communication and collaboration skillsExperience with multithreaded programmingExperience developing complex architectures in RTOS environmentsWorking knowledge of inter-processor communication methodologies and SOC concepts such as MMU’s, caching strategies, and ARM architecturesExperience designing and implementing communication protocolsExperience optimizing for memory and execution time in resource constrained environmentsExperience with advanced debugging in embedded environments (e.g., coredumps, traces)Deep experience working with analog and digital sensorsProven capability to apply software standard methodologies to firmware designsExperience contributing to large software projectsExperience with unit testing, static analysis, and continuous integration3+ years of relevant experience preferredBS/MS/PhD in CS/CE or related field", "jobDescription": "The Human Interface Device (HID) group is looking for motivated engineers to join the multitouch development team. Firmware delivered by HID powers the amazing sensing interfaces used on iPhone, iPad, Mac, AirPods, health sensors, and more.\n\nOur engineers are involved in all phases of product development, from the earliest concept reviews all the way through first customer ship. This includes architecture development, custom silicon design, hardware bringup with our EE partners, firmware design/implementation, and working with our Algorithm/Software/Quality partners to deliver the user experience for which Apple products are so well known.\n\nJoin our team and help shape the future of the Apple Touch experience. With millions of customers, our team’s impact is felt around the world!"}, "200447666": {"jobID": "200447666", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "SoC Constrained Performance Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447666/soc-constrained-performance-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 20+ years of relevant experience. MS or PhD in Electrical or Computer Engineering preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "The ideal candidate should possess a BS and 20+ years of relevant Power Architecture experience in addition to:Experience in high-performance and low power microprocessor architecture and design techniquesGood understanding in control system application and behaviorExpertise in high-performance SoC power delivery and thermalsExcellent modeling and simulator development skills. Able to code in C, Python and similar programming languagesBS and 20+ years of relevant experience. MS or PhD in Electrical or Computer Engineering preferred.", "jobDescription": "Do you have a desire to seek out and solve exceedingly difficult challenges rather than the easy ones? Do you grow with adversity? Do you believe that truly valuable and meaningful accomplishments are the result of pushing the limits of perseverance? Do you believe that a world-class team with relentless drive can surpass even their own high expectations? We do! But we also realize this job isn’t for everyone. What we do isn’t easy, but you don’t take the easy path!\n\nAt Apple, products are holistically designed to deliver an unrivaled customer experience. SoC hardware, Systems and Software architectures are finely co-optimized and tuned for the highest performance and operating efficiency. The world leading multi-functional team of engineers that design these products rely on groundbreaking Constrained Performance Models to analyze and refine the architecture and implementation. The Constrained Performance Model is responsible for simulating overall performance and efficiency of Apple System on Chip (SoC) in the presence of electrical, thermal and reliability constraints and control systems. In this highly visible role as a Constrained Performance Modeling Engineer, you will play the central role of driving the development of these simulators and collaborate with the multi-functional team of SoC, System and Software Architects to influence the design of future Apple products."}, "200460997": {"jobID": "200460997", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Optical Sensing PD - Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460997/optical-sensing-pd-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "-  BSME required, MSME, PhD preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands-on experience designing for a production environment. High volume, consumer electronics, or sensing experience is a plus.3D CAD experience is required.Excellent written and verbal communication skills.Able to craft clear engineering documentation.Able to effectively collaborate with diverse team members and external vendors to define and achieve project goals.-  BSME required, MSME, PhD preferred", "jobDescription": "The Optical Sensing Product Design team is seeking a hardworking mechanical engineer to build great experiences and bring Apple products to life. We develop sensors that change the way people interact with their technology.\n\nYou will play a key role in specifying, developing, characterizing, and validating the mechanical design of optical sensing systems. You should be familiar with product manufacturing technologies related to sensors.\n\nAt the end of the extraordinary team effort, your work will be in the hands of millions of people making a difference in their daily lives."}, "200451433": {"jobID": "200451433", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Memory Subsystem Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451433/memory-subsystem-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Experience with digital logic design, CPU and SOC architecture/micro-architecture and memory subsystem is preferredStrong programming (C/C++, Verilog, Scripting), software optimization, and performance improvement skillsExperience in unit and full chip level test benchesExperience in developing testplans, assertions, and developing stimulusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designExperience with emulation and developing synthesizable transactors is a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all subject areas, with a critical impact on getting functional products to millions of customers quickly."}, "200444718": {"jobID": "200444718", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Core BringUp Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444718/core-bringup-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master’s (preferred) or Bachelor’s degree or equivalent experience in computer science or a related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "A genuine passion for embedded developmentHighly proficient in C/C++Experience with JTAG and other debuggersPrevious experience writing embedded device driversPrevious experience with platform bring-up or porting of operating systemsPrevious exposure to hardware and processor simulationKnowledge of hardware platforms & processor architecturesProven creative, critical thinking and troubleshooting skillsHighly professional, with the ability to deliver proven work on tight schedulesExcellent collaborative skillsOutstanding written and verbal communicationMaster’s (preferred) or Bachelor’s degree or equivalent experience in computer science or a related field.", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. \n\nThe Core Platform Bring-up team within Apple's CoreOS organization is looking for an extraordinary software engineer to work on state-of-the art technology, debug, and bring-up of next generation iOS devices. We work on a core technology for Apple. In this role you will have the chance to make a major impact in the way that Apple develops and ships iOS based products. Our working environment fosters product innovation, rapid product iteration, and a liberating amount of autonomy."}, "200457981": {"jobID": "200457981", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Mechanical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457981/mechanical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands-on product design experience in consumer electronic products or modulesDirect fixture design experience, especially thermal fixture design, is highly preferred3D CAD experience required, NX preferredFamiliarity with printed circuit board and flex circuit technology is requiredBasic understanding of EE concepts is requiredThermal system design experience highly desired: heat sinks, heat pipes, vapor chambers; familiarity with chillers and thermoelectric headsDiscipline in GD&T practices with close attention to datum establishmentExcellent written and verbal communication skills and people skills; ability to interact with management, team members and external vendorsTeamwork: the candidate must be able to communicate well with cross-functional team members, be able to efficiently collaborate with team members to achieve project goals, and contribute positively to the engineering community.BS and a minimum of 10 years relevant industry experience", "jobDescription": "We are a small, productive team of passionate engineers building the infrastructure to validate a very wide range of Apple-designed silicon devices that power the iPhone, Apple Watch, iPad, Mac, and more. We collaborate with electronic engineers to build mechanical fixtures for cutting-edge silicon packages, including sockets, thermal stations, and robotic chip testers. Our silicon characterization infrastructure enables our silicon engineering team to produce world-class silicon on a tight schedule. We are looking for a senior Mechanical Engineer to own the design, development, and validation of test sockets, fixtures, and thermal solutions used for silicon characterization."}, "200450267": {"jobID": "200450267", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Wireless RF OTA MIMO Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450267/wireless-rf-ota-mimo-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Working experience with MIMO/UWB characteristics (at a system level), antenna design and requirements for modern wireless communication systems such as UWB, LTE, WiFi, 802.11ad and mmWave systemsWorking experience with wireless protocols, antennas, and radio propagation.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW), channel emulators.Familiarity with regulatory requirements and certification process for CTIA and 3GPP.Excellent communication skills required, both written & verbal.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System team is looking for an engineer to work on system performance characterization across different wireless technologies for Apple’s wireless products"}, "200450252": {"jobID": "200450252", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless RF Compliance Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450252/wireless-rf-compliance-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Working experience of antenna design and tests, in particular hands-on experience for compliance measurements is desirable.Working Experience with different wireless communication systems such as GSM/UMTS/LTE, 802.11xx, Bluetooth etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working Experience with regulatory requirements and certification process for wireless consumer devices, including FCC, PTCRB, CTIA, ETSI, 3GPP etc.Excellent communication skills required, both written & verbal.Experience with 5GmmWave standard and/or hands-on chamber/system level understanding is a plus.Experience with Antenna/EM simulation tools is a plus.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple SAR Engineering team is looking for an engineer to work on RF Exposure (SAR/MPE) characterization across different wireless technologies for Apple’s wireless products"}, "200450261": {"jobID": "200450261", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless RF OTA Cellular Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450261/wireless-rf-ota-cellular-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with 0 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "You have working experience with antenna design/tests, antenna and wave propagation, anechoic chambers, and radiation performance evaluation like TRP & TIS.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW/ UXM/ 8960), channel emulators, etc.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is a plus.Experience with carrier/ industry conformance radiated performance requirements like 3GPP, PTCRB, CTIA, ETSI, etc.Excellent communication skills required, both written & verbal.Programming skills in C, C++ would be a plus.BS degree in technical discipline with 0 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System Engineering team is looking for an engineer to work on radiated system characterization across different cellular technologies for Apple’s wireless products"}, "200450271": {"jobID": "200450271", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Wireless RF OTA MIMO Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450271/wireless-rf-ota-mimo-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Working experience with MIMO/UWB characteristics (at a system level), antenna design and requirements for modern wireless communication systems such as UWB, LTE, WiFi, 802.11ad and mmWave systemsWorking experience with wireless protocols, antennas, and radio propagation.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW), channel emulators.Familiarity with regulatory requirements and certification process for CTIA and 3GPP.Excellent communication skills required, both written & verbal.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System team is looking for an engineer to work on system performance characterization across different wireless technologies for Apple’s wireless products"}, "200449450": {"jobID": "200449450", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Graphics Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449450/graphics-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The ideal candidate will have minimum 3 years of relevant experience including:Experience developing test plans for advanced hardware designsExperience with SystemVerilog or expertise in object-oriented languages such as C++Knowledge of common verification methodologies such as UVM or OVMExperience with HDL simulators and waveform viewersExperience with Python, Ruby or Perl; developing tools for workflow automationExperience working under strict schedule deadlines with the ability to manage multiple prioritiesExcellent communication skills and ability to collaborateBS + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nThe Graphics Design Verification Engineer will be responsible for the unit level pre-silicon RTL verification of embedded graphics IP. This includes developing a deep understanding of the micro-architectural details of relevant units and the greater GPU design. A strong computer architecture background, and solid software skills are key attributes to contributing to the Graphics IP verification effort. Exposure to graphics concepts is a plus but not required."}, "200449028": {"jobID": "200449028", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Graphics Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449028/graphics-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "The ideal candidate will have relevant experience including:Experience with SystemVerilog or expertise in object-oriented languages such as C++Knowledge of common verification methodologies such as UVM or OVMExperience with HDL simulators and waveform viewersExperience with Python, Ruby or Perl; developing tools for workflow automationExperience working under strict schedule deadlines with the ability to manage multiple prioritiesExcellent communication skills and ability to collaborateMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nThe Graphics Design Verification Engineer will be responsible for the unit level pre-silicon RTL verification of embedded graphics IP. This includes developing a deep understanding of the micro-architectural details of relevant units and the greater GPU design. A strong computer architecture background, and solid software skills are key attributes to contributing to the Graphics IP verification effort. Exposure to graphics concepts is a plus but not required."}, "200457601": {"jobID": "200457601", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "iPad Ecosystem Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457601/ipad-ecosystem-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Engineering required, Mechanical or Electrical Engineering preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven experience in Program Management or Hardware Engineering and leading multiple teams in new product developmentDirectly led at least 2 product development cycles for a System with hardware and software integrationLeadership skills and ability to inspire team membersExcellent communication and organizational skillsSelf-starter and proactive with demonstrated critical thinking capabilitiesUnderstands and deals well with rapid development cycles and constant change; remains flexible and calm in the face of uncertaintyBS degree in Engineering required, Mechanical or Electrical Engineering preferred.", "jobDescription": "The iPad Ecosystem includes all iPads, keyboards, pencils, folios, and 2PP iPad accessories. We are looking for a Senior System EPM drive the interdependencies between all of these products in NPI execution and future roadmap planning. This is a great opportunity for cross functional leadership and visibility."}, "200296707": {"jobID": "200296707", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "CoreOS Quality Engineer - Embedded Runtimes", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200296707/coreos-quality-engineer-embedded-runtimes?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in CE or equivalent knowledge and experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience with the development and deployment of automated and manual white-box testingExperience with continuous integration frameworks (such as Jenkins) and a git-based development flowExperience with firmware, device driver, or kernel-level test developmentStrong Python 3 programming skillsFamiliarity with C and C++Hands-on approach and willingness to tackle new challengesExcellent communication and interpersonal skillsBS/MS in CE or equivalent knowledge and experienceExperience developing and validating operating system tools and featuresExperience refactoring code / projects for testabilityLab management experience", "jobDescription": "Apple’s Embedded Runtimes team is looking for an expert test development engineer to help us ensure the quality of critical System Software across Apple’s product lines. The ideal candidate is proficient with Python 3, familiar with C and C++, familiar with software development in general, system-level software in particular, and has shown a history of tight-knit collaboration with their software team.\n\nYour main focus will be test content & test framework development and deployment of tests on prototype systems using Apple’s proprietary Python-based infrastructure. We work with systems in all phases of development, from pre-silicon simulation, to sample bring-up, to already-shipping systems. As such, you’ll be developing tests that will run across simulation, FPGA, new products, and existing products. You’ll be working as a peer to the software team that maintains existing and develops new Firmware features for Apple’s line of products."}, "200448204": {"jobID": "200448204", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Cache Hierarchy Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448204/graphics-cache-hierarchy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Strong fundamentals in Computer architecture and logic design.Strong fundamental software and programming skillsExperience with verification languages such as SystemVerilog and common verification methodologies such as UVM a plusExperience with cache, memory subsystem and Graphics architecture a plus.Design verification course work a plusExperience with scripting and Makefiles a plusMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nThe Graphics Cache Hierarchy Verification Engineer will be responsible for the pre-silicon RTL verification of graphics memory subsystem units including Caches, Memory Management Unit, Interconnects and Link interface units. This includes deep understanding of the micro-architectural details of their block and how it works within the broader GPU design. A strong computer architecture background, and a solid foundation in verification methodology is required."}, "200455594": {"jobID": "200455594", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Operations Program Manager- Home", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455594/operations-program-manager-home?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor’s degree in engineering preferred. Masters or MBA are considered a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$109,000", "max": "$164,500,"}, "benefits": null, "requirements": "Experience in manufacturing, process engineering, supply chain, and/or product developmentResults oriented and attention to detailStrong interpersonal skills and ability to present to managementAbility to travel up to 30%Technical expertise and prior OEM management experienceBachelor’s degree in engineering preferred. Masters or MBA are considered a plus.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it."}, "200463924": {"jobID": "200463924", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Hardware System Integration Engineer, Accessories", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463924/hardware-system-integration-engineer-accessories?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "A Bachelor's, Master's or PhD in Electrical Engineering or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong EE fundamentals with intuitive skills and a deep understanding of why our discipline works the way it doesProduct development experience in HW designExperience with high speed design / signal integrity including hands on work with VNA / TDRHands-on lab experience in prototype bring-up and debugging, as well as functional verificationExperience with firmware / embedded systems is strongly preferredFamiliarity with various data protocols: UART, I2C, SPI, USB, Type-C, JTAG, SWD, I2S,Aspire to be a lead who drives technical initiatives in the team3+ years of relevant industry experienceSome travel will be requiredA Bachelor's, Master's or PhD in Electrical Engineering or equivalent experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, amazing people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. \n\nJoin us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unparalleled and rewarding opportunity to craft upcoming products that will delight and support millions of Apple’s customers every single day.\n\nThe people here at Apple don’t just build products, they create the kind of wonder that’s revolutionized entire industries. The people who work here have reinvented and defined entire industries with our products and services. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Be ready to make something excellent when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. \n\nWill you help us design the next generation Accessories that push the boundaries of low-power and high-speed electrical design? Our products enable countless people to fully-utilize and enjoy the Apple ecosystem. Apple Accessories Hardware Engineering team is searching for a driven, passionate electrical engineer. This is a rare and extraordinary opportunity allowing ownership from architecture definition to component selection, schematic capture and board layout to validation and manufacturing."}, "200452570": {"jobID": "200452570", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Power and Performance Hardware Technician", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452570/power-and-performance-hardware-technician?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "8+ years minimum related experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$31.75", "max": "$69.10/hr,"}, "benefits": null, "requirements": "8+ years of related experience and expert background in:Identifying, scoping and performing necessary reworks to enable fine-grained power on commercial samplesGathering power data with a focus on accuracyUnderstanding expected workload behavior as well as impacts of other system level effects like thermals8+ years minimum related experience required.Familiarity with modern consumer electronics devices and SoCsFamiliarity with best practices for device instrumentation and micro-reworks", "jobDescription": "Are you highly detailed and skilled at developing creative solutions? Do you love controlling even the smallest details to craft highly organized structures? Do you enjoy building elegant solutions to highly complex challenges? In this role, you will work with a team to provide power and performance data on shipping cellular baseband and SoC solutions and inform future direction. This work is a vital component of the quality and efficiency of Apple’s future products. Join this group, and you’ll have a direct impact on the technology that shapes Apple’s customer experiences. Together, our work will be the reason millions of customers feel they can trust their devices every single day.\n\nApple’s Platform Architecture group is looking for a motivated technician with a strong background in SoC level power and performance instrumentation, cellular RF feed point instrumentation, and analysis. Ideally, you are ambitious with initiative and passion for accurate data gathering and analysis. Additionally, you have experience in instrumenting platforms and SoCs for power and RF measurement, running experiments, and have a good understanding of basic computer system architecture."}, "200452497": {"jobID": "200452497", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Power and Performance Hardware Technician", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452497/power-and-performance-hardware-technician?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "4+ years minimum related experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$29.10", "max": "$52.90/hr,"}, "benefits": null, "requirements": "4+ years of related experience and expert background in:Identifying, scoping and performing necessary reworks to enable fine-grained power on commercial samplesGathering power data with a focus on accuracyUnderstanding expected workload behavior as well as impacts of other system level effects like thermals4+ years minimum related experience required.Familiarity with modern consumer electronics devices and SoCsFamiliarity with best practices for device instrumentation and micro-reworks", "jobDescription": "Are you highly detailed and skilled at developing creative solutions? Do you love controlling even the smallest details to craft highly organized structures? Do you enjoy building elegant solutions to highly complex challenges? In this role, you will work with a team to provide power and performance data on shipping cellular baseband and SoC solutions and inform future direction. This work is a vital component of the quality and efficiency of Apple’s future products. Join this group, and you’ll have a direct impact on the technology that shapes Apple’s customer experiences. Together, our work will be the reason millions of customers feel they can trust their devices every single day.\n\nApple’s Platform Architecture group is looking for a motivated technician with a strong background in SoC level power and performance instrumentation, cellular RF feed point instrumentation, and analysis. Ideally, you are ambitious with initiative and passion for accurate data gathering and analysis. Additionally, you have experience in instrumenting platforms and SoCs for power and RF measurement, running experiments, and have a good understanding of basic computer system architecture."}, "200465116": {"jobID": "200465116", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Product Design Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465116/product-design-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS degree in Mechanical Engineering."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Experience in mechanical design (preferably internships or working experience in consumer electronics)Demonstrated ability in plastic and metal part design including material selectionHandheld/portable device experience, a big plusPassion for making great products and solving tough design problemsExperience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing, with focus on high volume manufacturingExperience with technical graphical communication of concepts, ideas, and solutionsExperience with component modules (OLED/LCD, batteries, sensing, acoustic, camera modules, etc.) and interconnects (FPC design and interconnect bonding), a big plusIntegration of wireless antenna (Cellular, GPS, WiFi, BT) into mechanical enclosures, a big plusIntegration of electrical subsystems (OLED/LCD, sensing, microphone, speaker, receiver, camera)Design of highly cosmetic enclosures with liquid and dust ingress protection, a big plusSiemens NX fluency desirableExperience working with overseas manufacturers, a big plusMandarin language skills a benefitThe ability to travel internationally (20%+)BS or MS degree in Mechanical Engineering.", "jobDescription": "As a member of a multi-functional design team at Apple, you will help to create the next generation of the world's finest mobile devices. You will conceive, design, and bring into production products that will redefine the mobile experience. You will work closely with many different cross functional teams including Industrial Design, Hardware Engineering, Antenna, Reliability, Packaging, Safety and Marketing. You should have significant prior experience in Siemens NX and/or Pro-E, be extremely well organized and able to balance numerous program needs simultaneously. Your excellent communication and social skills will help you to quickly grasp issues, understand the details, and drive the appropriate resolution. We work in a highly dynamic environment which will require you to respond quickly to changes, manage competing demands, and find creative, dynamic solutions.  The people who work here have reinvented entire industries with the Mac, iPhone, iPad, Apple Watch, and AppleTV. We have done the same with services, including the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product."}, "200455236": {"jobID": "200455236", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Low Power DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455236/soc-low-power-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  Exposure to low power verification and low power design principles is desired.-  Experience with IEEE-1801 (UPF) or CPF based digital simulation flows is desired-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Experience with C is desired-  Excellent interpersonal skills and the dream to take on diverse challengesMinimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new insights have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200461336": {"jobID": "200461336", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Software QA Engineer, Messages", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461336/software-qa-engineer-messages?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, preferred, or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "Solid understanding of development lifecycles, testing methodologies, and QA processes.Experienced in developing test plans, building tools and test frameworks.Experienced in writing, triaging, and debugging automation scripts, as well as test harness enhancement, primarily focused on UI applications.Automation/coding experience in Python, Swift, or similar languages.Skilled at debugging, troubleshooting, and critical thinking on bug prioritization.Experience with multi-functional projects.A great teammate with the ability to act as a mentor and peer leader.Strong organizational and interpersonal skills.BS in Computer Science or related field, preferred, or equivalent work experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe Messages QA team is seeking a passionate and experienced QA engineer who is interested in helping us deliver quality releases to our customers on Apple’s platforms. Our core team (Comm Apps) designs and engineers the communication cornerstones of iOS and macOS: the Messages, FaceTime, and Phone applications. We need someone inspired to invent new ways to test, to find problems no one else could, and to build amazing products."}, "200433865": {"jobID": "200433865", "origin_search": null, "posted": "Oct 14, 2022", "jobTitle": "Wireless Bluetooth QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200433865/wireless-bluetooth-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "You have experience in testing Wireless Technologies; Bluetooth preferredProficient in one or more programming and scripting languagesExperience building through test automation based on knowledge of objectives and design of a product or solutionDeep understanding of SQA methodologies & practicesAbility to work independentlyYou demonstrate the ability to lead a complete functional area of an application or productExcellent problem solving and debugging skillsExcellent written and verbal skillsExcellent teammate who would thrive in a reciprocal environmentObsessively passionate and inquisitive, who seeks to pursue everyday problems in innovative waysLaser-focused on the smallest details that are significant to our customersBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required.", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters! We craft and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience.\nThe Bluetooth Quality team is looking for a motivated, highly-technical Bluetooth Quality Engineer with an ability to seek solutions to unusual problems with valued interpersonal skills. You will be responsible for ensuring the best customer experience and quality of Bluetooth in the latest Apple products."}, "200455600": {"jobID": "200455600", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Cellular Systems Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455600/cellular-systems-performance-analysis-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands on experience with in system engineering/system performance analysis roleDeep knowledge of 5G and LTE PHY/MAC/Protocol stack, TCP/IPStrong scripting experience (Python preferred, Perl) and debuggingSW development and system design experience is a great plus.Knowledge of IOT protocols such as IEEE 802.15.4, Bluetooth, Zigbee or Thread Mesh is a plus.Home automation experience is a plus (Bluetooth, Zigbee, z-Wave, Thread Mesh)Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP standardsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering or equivalent", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200459104": {"jobID": "200459104", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Cellular Systems Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459104/cellular-systems-performance-analysis-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Hands on experience with in system engineering/system performance analysis roleDeep knowledge of 5G and LTE PHY/MAC/Protocol stack, TCP/IPStrong scripting experience (Python preferred, Perl) and debuggingSW development and system design experience is a great plus.Knowledge of IOT protocols such as IEEE 802.15.4, Bluetooth, Zigbee or Thread Mesh is a plus.Home automation experience is a plus (Bluetooth, Zigbee, z-Wave, Thread Mesh)Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP standardsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering or equivalent", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200466722": {"jobID": "200466722", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "AR/VR Graphics Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466722/ar-vr-graphics-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent programming skills and knowledge of C++, Objective C or SwiftUnderstanding of entire graphics pipelineExperience with shader writing3D math and Linear AlgebraAbility to collaborate with designers and artists to achieve their visual targetBS / MS / PhD in Computer Science or equivalent experience• Knowledge of modern renderers and rendering techniques• Experienced with Metal API• Experienced with application performance profiling and optimization", "jobDescription": "Apple's Technology Development Group is working to solve some of the most ambitious problems in AR and computer graphics. Do you have a desire to tackle some of the biggest open questions in CG as well as reach millions of people? Here you will have the chance to work with accomplished engineers, researchers and artists from across academia and entertainment to help craft ground breaking new products that open new avenues and build significant opportunities for the world."}, "200452657": {"jobID": "200452657", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Product Design Engineer - iPad", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452657/product-design-engineer-ipad?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Mechanical Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "High degree of motivation, curiosity, passion and creativityDesign intelligence: mechanical intuition, creative problem solving, spatial reasoning, attention to detailEngineering fundamentals: statics, strength of materials, material science, statisticsExcellent communication skills: written, visual, and verbal. Ability to clearly convey design ideas and contribute to brainstorms3D CAD experience with any program. 2D drafting and GD&T a plusExperience in the design cycle from concept through manufacturing a plusExperience designing mechanical components for mass production a plus - specifically molded, formed, and machined partsInterested in traveling up to 10-20% throughout the year2+ yrs Mechanical Design industry experienceBS or MS in Mechanical Engineering or related field2+ yrs Mechanical Design industry experience", "jobDescription": "The iPad Product Design Team is a close-knit group of mechanical design engineers who work with a singular focus...to surprise and delight our customers with truly great products. At Apple, you will work alongside talented engineers & technology experts at the top of their fields while leveraging the tools, resources, and support of the world’s leading hardware company. We have a firm commitment to equity and diversity, recognizing that each employee contributes a wealth of perspectives to our culture. We seek to tap into this extraordinary resource and incorporate it into how we do business. Come join us and be empowered to generate the best and most impactful work of your life!"}, "200447445": {"jobID": "200447445", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Sr. Front End Web Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447445/sr-front-end-web-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA in Computer Science, Computer Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "7+ years professional experience building responsive, user friendly web applicationsProficient understanding of base front end development technologies including HTML5/CSS3/JavaScriptSignificant experience with JavaScript frameworks and client side state management using React.js / ReduxSolid experience using best practices when working with REST APIsBuilding reusable components and front-end libraries for future useExperience in developing secure web applications and knowledge of application vulnerabilities such as Cross Site Scripting (XSS), Cross Site Request Forgery (CSRF) etc.Good communication and personal skills: ability to communicate effectively and work well with members of other functional groups in a project team and a solid sense of project ownershipExperience with 2D visualization libraries like D3 is a plusExperience with 3D visualization tools like Three.js and WebGL is a plusBA in Computer Science, Computer Engineering or related field", "jobDescription": "The autonomous systems team is in search of a curious and innovative teammate who is passionate about using groundbreaking web technology to deliver experiences that surpass user expectations. The team works on many impactful web applications and services at Apple where quality and performance cannot be sacrificed. Join Apple and help us leave the world better than we found it!"}, "200447856": {"jobID": "200447856", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "GNSS Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447856/gnss-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and 3+ years of relevant industry experience \nMS with a focus on digital communication, signal processing and/or geomatics; or Ph.D is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong foundation in physical layer functionality for wireless systems in areas such as detection/acquisition, synchronization, parameter estimation & tracking, multipath detection, and mitigation, etc.Familiarity with Inertial Measurement Unit (IMU) sensors data processing and fusion with GNSS and other wireless signals.Proficiency with modeling in MATLAB is required.Knowledge and experiences in IC implementation and optimization, and familiarity with HDL / RTL are desirable.Knowledge and comfortability in channel coding algorithms, such as LDPC decoder, are desirable.Experience with lab bring-up of SoC designs reaching volume production is desirable.Experience in GNSS baseband signal processing is desirable.BS and 3+ years of relevant industry experience \nMS with a focus on digital communication, signal processing and/or geomatics; or Ph.D is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which are driven by an elite vertically coordinated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. As a Senior Wireless Systems Engineer, you will be a key member of our highly innovative Wireless SoC design team, defining modem architectures, driving physical-layer algorithm designs, and developing digital signal processing schemes for novel ultra-low-power wireless applications."}, "200447859": {"jobID": "200447859", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "GNSS Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447859/gnss-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and 10+ years of relevant industry experience\nMS with a focus on digital communication, signal processing and/or geomatics or Ph.D is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Great foundation in physical layer functionality for wireless systems in areas such as detection/acquisition, synchronization, parameter estimation & tracking, multipath detection, and mitigation, etc.Familiarity with Inertial Measurement Unit (IMU) sensors data processing and fusion with GNSS and other wireless signals.Proficiency with modeling in MATLAB is required.Experience with leading technical initiatives and key work.Knowledge and experiences in IC implementation and optimization, and familiarity with HDL / RTL are desirable.Experience with lab bring-up of SoC designs reaching volume production is desirable.Experience in GNSS baseband signal processing is desirable.BS and 10+ years of relevant industry experience.BS and 10+ years of relevant industry experience\nMS with a focus on digital communication, signal processing and/or geomatics or Ph.D is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which are driven by an elite vertically coordinated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. As a Senior Wireless Systems Engineer, you will be a key member of our highly innovative Wireless SoC design team, defining modem architectures, driving physical-layer algorithm designs, and developing digital signal processing schemes for novel ultra-low-power wireless applications."}, "200450260": {"jobID": "200450260", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless RF OTA Cellular Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450260/wireless-rf-ota-cellular-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "You have working experience with antenna design/tests, antenna and wave propagation, anechoic chambers, and radiation performance evaluation like TRP & TIS.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW/ UXM/ 8960), channel emulators, etc.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is a plus.Experience with carrier/ industry conformance radiated performance requirements like 3GPP, PTCRB, CTIA, ETSI, etc.Excellent communication skills required, both written & verbal.Programming skills in C, C++ would be a plus.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System Engineering team is looking for an engineer to work on radiated system characterization across different cellular technologies for Apple’s wireless products"}, "200450266": {"jobID": "200450266", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Wireless RF OTA MIMO Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450266/wireless-rf-ota-mimo-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Working experience with MIMO/UWB characteristics (at a system level), antenna design and requirements for modern wireless communication systems such as UWB, LTE, WiFi, 802.11ad and mmWave systemsWorking experience with wireless protocols, antennas, and radio propagation.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW), channel emulators.Familiarity with regulatory requirements and certification process for CTIA and 3GPP.Excellent communication skills required, both written & verbal.BS degree in technical discipline.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System team is looking for an engineer to work on system performance characterization across different wireless technologies for Apple’s wireless products"}, "200450263": {"jobID": "200450263", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless RF OTA MIMO Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450263/wireless-rf-ota-mimo-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Working experience with MIMO/UWB characteristics (at a system level), antenna design and requirements for modern wireless communication systems such as UWB, LTE, WiFi, 802.11ad and mmWave systemsWorking experience with wireless protocols, antennas, and radio propagation.Experience with different wireless communication systems such as GSM/GPRS/EDGE/LTE, 5G mmWave, etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working experience with different lab equipment: network analyzers, signal generators, signal analyzers, call boxes (i.e., CMW), channel emulators.Familiarity with regulatory requirements and certification process for CTIA and 3GPP.Excellent communication skills required, both written & verbal.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple Wireless System team is looking for an engineer to work on system performance characterization across different wireless technologies for Apple’s wireless products"}, "200448893": {"jobID": "200448893", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Verification Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448893/cellular-4g-5g-firmware-verification-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS + 10 years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP specifications with focus on physical layer, protocol stack procedures and configurations, systems design and implementationStrong experience and proven understanding of 4G/5G wireless systems design, RF interface and firmware architectureCapability of defining sophisticated verification use cases and schemes and drive system performance and define verification criteriaExperience with firmware test case planning, design, and development for the 4G/5G functional and performance scenariosStrong solid understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platformsMinimum BS + 10 years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an outstanding modem team, we'll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. Do you want to have an impact on every single Apple product? As a Cellular 5G/4G Firmware Verification Architect, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200458919": {"jobID": "200458919", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Virtuoso Custom CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458919/virtuoso-custom-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in analog and digital new product development IC CAD support using EDA toolsSome experience supporting Cadence Composer Virtuoso, Layout tools, VXL, PCELLs, and CDFsExperience in programming languages such as DFII, Skill, Perl, TclProficient with Unix / Linux OS, utilities, and scriptingStrong communication skills in both oral and written.Minimum requirements of BS + 3 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient display and image sensors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows."}, "200458519": {"jobID": "200458519", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Virtuoso Custom CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458519/virtuoso-custom-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in analog and digital new product development IC CAD support using EDA toolsSome experience supporting Cadence Composer Virtuoso, Layout tools, VXL, PCELLs, and CDFsExperience in programming languages such as DFII, Skill, Perl, TclProficient with Unix / Linux OS, utilities, and scriptingStrong communication skills in both oral and written.Minimum requirements of BS + 3 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient display and image sensors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows."}, "200458922": {"jobID": "200458922", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Virtuoso Custom CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458922/virtuoso-custom-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in analog and digital new product development IC CAD support using EDA toolsExpert in Cadence Composer Virtuoso, Layout tools, VXL, PCELLs, and CDFsDeep knowledge of programming languages such as DFII, Skill, Perl, TclProficient with Unix / Linux OS, utilities, and scriptingStrong communication skills both oral and written.Minimum requirements of BS + 10 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient display and image sensors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows."}, "200466730": {"jobID": "200466730", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "US-Store Leader", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466730/us-store-leader?team=APPST", "jobLocation": {"remote": "not specified", "city": "Boylston Street", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive positive customer experiences that build loyalty and deliver measurable results.Ability to manage separate business groups within a complex environment.Strong communication skills to clearly impart the Apple vision to the teams you oversee.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome — a retail background is not necessary.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You'll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Would you love to work in a complex and ever-changing work environment?  As more and more people discover Apple, they visit our stores seeking ways to incorporate our products into their lives. It’s your job, as a Store Leader, to build and manage the various teams that engage customers in this dynamic environment. In this role, you lead the people that help customers achieve ownership, learn new skills, get technical support, and find business solutions. Adaptable and flexible by nature, you’re composed and collected as you balance the diverse needs of your teams in the midst of constant change. "}, "200464585": {"jobID": "200464585", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Signal Integrity - RF Integrity Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464585/signal-integrity-rf-integrity-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Bachelors of Science degree and 3+ years of confirmed experience.Excellent problem solving and skills in a dynamic and complex environment when boundary is not clearly defined.Passion in learning new technology and willingness to do things differently to address problems.Broad experience with RF lab debug and characterization. Experience on bringing up sophisticated radio system and measuring all performance metrics of key sub-systems.Experience with measurement automation tools and scripting languages such as Python or Matlab, etc.Experience with lab equipment such as spectrum analyzers, vector network analyzers, signal generators, phase noise analyzers, oscilloscopes, etc.Good analytical and interpersonal skills in multi-functional groups.Experience of RF PCB board design, debug, and development is a plus.-  BS and 3+ years of relevant industry experience.", "jobDescription": "Our RFI (RF Integrity) team develops novel methodologies to tackle coupling, spur, and coexistence issues in highly coordinated RF systems through simulation and lab debug. The engineering regime covers Silicon, package, module, PCB, and form-factor device. The working methods are constantly evolving and blurring boundaries of existing domains. \n\nAs an RF Integrity Validation Engineer, you will address the isolation, shielding, coexistence, and space-saving challenges at chip, package, module, and system level through lab experiments. The team is small and the coverage is huge due to its multidiscipline nature. You will explore multiple aspects of RF technology and expand the boundary of innovation. If you like self-challenge and can thrive in an innovative and fast-pacing work environment, you might be the engineer we are looking for."}, "200205376": {"jobID": "200205376", "origin_search": null, "posted": "Oct 13, 2022", "jobTitle": "C++ SWE (Apple Neural Engine - ML Acceleration team)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200205376/c-swe-apple-neural-engine-ml-acceleration-team?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master's degree or higher in Computer Science or equivalent field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with SoC or/and GPU acceleration for AIExperience with SW/HW parallelism, and asynchronous processingExperience with embedded systems, and real time OS developmentExperience with low level OS/driver programmingExcellent programming skills of C/C++Excellent software design, problem solving and debugging skillsGood understanding of Deep Learning workloadsExcellent communication and teamwork skillsMaster's degree or higher in Computer Science or equivalent field.", "jobDescription": "Are you passionate about enabling unique user experience such as Face ID, Animoji, AR games? Imagine the countless possibilities powered by Artificial Intelligence.\n\nIn the Video Engineering team, we are dedicated in providing hardware acceleration using the new proprietary Apple Neural Engine SOC to enable real time, low power and high performance execution of Deep Learning workloads. \n\nThe Apple Neural Engine compiler team is working on exciting technologies for future Apple products. We're looking for a driven and dedicated engineer to work on the next generation of Apple products."}, "200451464": {"jobID": "200451464", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Circuit Test Chip Design & Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451464/circuit-test-chip-design-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Good understanding of Device Physics/Transistor basics.Good grasp of basic VLSI design concepts, 6T/8T memories, Reg files, Standard cells, P&R, timing and DFT.Python, TCL and/or PERL programming experience.System Verilog familiarity.JTAG protocol understanding.Preferred Skills:Knowledge of TC1500 Protocol.IEEE1687 (STAR SMS MBIST protocol).Statistical data manipulation and reporting.Experience with FPGA based systems.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you want to apply your engineering background to make big things happen? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals to bring forward-thinking ideas to the real world. \nYou will join a hardworking circuit design team which delivers custom IP for pioneering Apple product ASICs. The IPs designed by your team go into CPU, GPU, SoC, Neural Engine and other critical parts of Apple product silicon. In this highly visible role, you will be responsible to thoroughly validate and characterize the custom IPs in silicon."}, "200451777": {"jobID": "200451777", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "DDR Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451777/ddr-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logicLogic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking DDR Design Engineer. As a member of our dynamic group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nYou will join the DDR PHY design team. We provide outstanding PHY designs for high-performance, low power applications. As a logic design engineer, you will be involved in all phases of the design, from concept study, architecture definition, design and verification, to silicon bring-up and characterization."}, "200451765": {"jobID": "200451765", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "DDR Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451765/ddr-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logicLogic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented DRR Design Engineer. \n\nAs a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.  You will join the DDR PHY design team. We provide best-in-class PHY designs for high-performance, low power applications. As a logic design engineer, you will be involved in all phases of the design, from concept study, architecture definition, design and verification, to silicon bring-up and characterization."}, "200458615": {"jobID": "200458615", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458615/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of a BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for entry level applicants with an interest in circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits.Strong understanding of CMOS device characteristics and design rules.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Understanding of Timing characterization & modeling of Standard cell circuits.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.Minimum requirement of a BS degree", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200458616": {"jobID": "200458616", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458616/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of a BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.19", "max": "$67.78/hr,"}, "benefits": null, "requirements": "We are looking for entry level applicants with an interest in circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits.Strong understanding of CMOS device characteristics and design rules.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Understanding of Timing characterization & modeling of Standard cell circuits.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.Minimum requirement of a BS degree", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200448909": {"jobID": "200448909", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Hardware Systems Integration Engineer - Apple Watch", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448909/hardware-systems-integration-engineer-apple-watch?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Bachelor's, Master's or PhD of Science in Electrical Engineering or Computer Engineering required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Minimum 2-5 years of experience required.Must have excellent EE fundamentals.Proven ability to understand technology and debug problems at varying levels of abstraction from the system-level down.Must have experience designing products from beginning to end and looking after contract manufacturers.Broad experience with low power low noise designs.Experience in system integration, processor selection, various communication protocols (especially USB, SPI, I2C and UART), analog integration, audio design and measurement, sensor design and integration & low power design is helpful but not required.Experience in the following areas is a plus: Bluetooth product design, video electronics design and measurement.Prior or current coding/scripting experience in highly advantageous.Excellent written and verbal communication/presentation skills.Tools: Cadence Concept & AllegroBeyond technical capability, we prize curiosity, creativity, integrity, leadership, teamwork, and a passion for learning.Bachelor's, Master's or PhD of Science in Electrical Engineering or Computer Engineering required.", "jobDescription": "Are you ready to work on Apple's latest wearable designs? Come join the Apple Watch Hardware Product team! We are a group of electrical engineers that own Apple watch products from concept to ship. We sit at the center of Apple’s wider engineering team, working with multi-functional groups to continually innovate technology implemented into our wearable products. \n\nThe Apple Watch Hardware Product group is seeking an eager, self-starter who can chart their own path while working on a collaborative team. This is a design engineering position that entails working with sensing, RF, antenna, and physical design teams. \n\nThe ideal candidate has a consumer electronics background and has crafted high-volume, low-power, high-quality products."}, "200441547": {"jobID": "200441547", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "Display Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441547/display-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in EE or equivalent with 2+ years of experience in related field.\nB.S. in EE or equivalent with 10+ years of experience in related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Hands-on experience, technical knowledge, and proven track record in the design, development, and characterization of active matrix displaysbackground in panel design and/or digital/analog/mixed-signal IC designdeep knowledge of device physics, fabrication process and relevant technologies, device and circuit modeling, testing and validationExperience managing domestic and international vendors, include failure analysis and process qualificationStrong presentation and communication skillsStrong analytical and critical thinking and problem-solving skillsM.S. or Ph.D. in EE or equivalent with 2+ years of experience in related field.\nB.S. in EE or equivalent with 10+ years of experience in related field.", "jobDescription": "Do something different! Apple is looking for a world class engineer that can help identify and incubate new display technologies. You will work with both suppliers and internal teams at Apple to shape the display related technologies that go into Apple products.  A successful candidate will not only need to identify new tech, but also educate a broad audience of people at Apple about their benefits and tradeoffs. \n\nThis position is focusing on the identification, prototyping, and communication of display backplane technologies for future Apple products. The team features a diverse engineering roster including panel engineers, optical engineers, human perception experts, product design engineers, and experimental physicists.  We work at a fast pace and require everyone to be highly self motivated.  A successful candidate needs to be a flexible thinker who is able to problem solve outside of their respective technical area."}, "200458010": {"jobID": "200458010", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "STA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458010/sta-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree + 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Have good concepts of ASIC design timing closure flow and various methodologies.Proven experience in ASIC timing constraints generation and timing closure. Expertise in STA tools (Primetime) and flow.Have concepts of timing corners/modes, process variations and signal integrity related issues.Hands on experience in timing/SDC constraints generation and management.Exposure in scripting languages (TCL and Perl).Have background in Constraint analysis and debug, using industry standard tools such as Synopsys GCA (Galaxy Constraint Analyzer).Have experience in timing closure of various test modes such as scan shift, scan capture, atspeed and Bist testing.Self-starter and highly motivatedBachelor's Degree + 3 years of experience", "jobDescription": "Imagine what you could do here at Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next phenomenal Apple product. \n\nDo you enjoy working on challenges that no one has solved yet? As a member of our dynamic group, you will get the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Are you ready to join a team redefining hardware technology? We are searching for a hardworking engineer to join our exciting team of problem solvers. Join our team and be responsible for groundbreaking IP development and coordinating with multiple SOC teams. In this role, you will work collaboratively with various SOC teams to complete design and integration tasks for the high quality IP deliverables."}, "200452370": {"jobID": "200452370", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452370/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a Bachelor's Degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusUnderstanding of embedded software development, RTOS and/or LinuxUnderstanding of computer architecture, operating systemUnderstanding of boot code, CPU & SOC initialization, device driversGood troubleshooting skills in embedded software debuggingExperience with script language such as Python, Perl, or TclMinimum requirement of a Bachelor's Degree", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200452775": {"jobID": "200452775", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452775/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusBackground in embedded software development, bare metal, RTOS and/or LinuxSolid understanding about ARM specification, computer architecture, operating systemExperience in boot code, CPU & SOC initialization, device driversFamiliar with IO protocols: I2C, SPMI, UART, GPIOExperience in lpDDR4/5, DRAM initialization and calibration a big plusGood troubleshooting skills in silicon bring-up and embedded software debuggingExperience with script language such as Python, Perl, or TclBS and a minimum of 3 years relevant industry experience", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers with background in embedded software development to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200464317": {"jobID": "200464317", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Power Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464317/power-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in design and analysis of product power supply solutionExperience in PI/SI methodology development, PDN modeling from system to die, and lab correlation/validationUnderstanding of power supply architecture covering voltage regulator technologies, PCB and package design trends and trade-offs, and chip supply design including low-power design methodologiesSolid understanding on PCB technologies including socket integration and its electrical performance in system environmentGood knowledge in 3D/2D EM simulation tools, electromagnetic and transmission line theoryFamiliar with lab equipment including but not limited to VNA, real-time scope, spectrum analyzerAbility to work and communicate efficiently in a multi-functional team-  BS and +10 years of relevant industry experience", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for precision to work towards an outstanding result? We are looking for a dedicated and passionate Power Integrity Engineer to join our team! In this role, you will be responsible for the development, implementation, and verification of Power Integrity solutions for SoCs used in Apple devices. You will work with multi-functional teams to develop of droop targets, design and implement a power supply network solution, and verify the quality of the power supply using lab measurements."}, "200452266": {"jobID": "200452266", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452266/wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 10+ years of relevant experience required. MS and PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in crafting signal processing and wireless communications systems.Working knowledge of wireless communication systems (e.g., OFDM/MIMO, etc.) and hands-on experience with lab testing and characterization will be necessary.Strong understanding of communication theory & signal processing-related algorithm design (such as timing recovery, signal estimation and detection, MIMO signal estimation and detection, automatic gain control, channel estimation, equalization, coding theory, beamforming, etc.)Deep understanding of components/modules within wireless communication systems, and the possible impairments from those components, and the corresponding calibration and impairment reduction methods/algorithms, digital pre-distortion, PAPR reduction algorithms, Tx power control, etc.Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.Experience in modem architecture, microprocessor architecture, hardware and software control are a plus.Experience on low power algorithm design for power critical application is a plus.Experience with multi-radio coexistence management is a plus.Experience and knowledge on High Level Synthesis (HLS), silicon prototyping, emulation systems, and virtual platforms will be a plus.Experience on bring up of real silicon in lab and being able to efficiently use lab equipment (such as spectrum analyzer, signal generator, power meter, etc.) is helpful.Knowledge in existing wireless communication protocols; such as 5G/LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLEBS and 10+ years of relevant experience required. MS and PhD preferred.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our Wireless Silicon Design group, you will have the unique and rewarding opportunity to build upcoming products that will delight and encourage millions of Apple’s customers every single day!\n\nIn this technical role, you will be at the center of our silicon design group responsible for the wireless system design of our innovative wireless SoC products. You will have the chance to create algorithms and architectures of wireless communication systems, as well as collaborate with extraordinary RF/analog, HW, SW designers and architects to implement, verify, validate and bring up SoC products to production quality, providing them to millions of Apple customers!"}}