{"200447509": {"jobID": "200447509", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Analog Design Lead - Power Management", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447509/analog-design-lead-power-management?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS+10 Years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "We are looking for applicants with 10+ years of demonstrated ability of developing leading power management integrated solutions implemented in silicon for the mobile market with the following experience:BS+10 Years of relevant industry experience, advanced degree preferred.Expertise in power topologies such as buck, boost, buck-boost, charge pumps, LDOs.Deep understanding of control architectures such as current mode, voltage mode, and hysteretic mode for applications include DC/DC converters, LED drivers, battery management circuits, LDOs, temperature sensors.Strong understanding of semiconductor device physics, device safe-operating area (SOA), and power transistors used for high frequency switching. Solid understanding of DC/DC power converter modeling techniques using any of the following simulation tools such as MATLAB, Simplis, PSIM, or Spectre.Understanding of Analog IC circuit design as it relates to power conversion architecture requirements, design tools and methodologies. Circuit blocks include bandgap references, op amps, OTAs, bias circuits, comparators, oscillators, DACs, ADCs, level- shifters, switching power stages, LDOs, charge pumps, glue logic. Key parameters include voltage and current accuracy, load and line transient response, DC gain, bandwidth, phase and gain margin, slew rate, efficiency, offset, PSRR, CMRR, noise, propagation delay, input and output common mode range, supply headroom.Experience working in a team environment on mixed signal ICs that integrate power management circuits, ADCs, DACs, and digital state machines is strongly preferred with proven industry- leading design expertise required.Experience taking projects from the concept phase, through chip architecture, writing electrical specifications, process technology selection, die size estimation, managing schedules, IC design, layout supervision, layout extraction and verification, DRCs, LVS, LVL, mask and wafer fabrication monitoring, ATE lab correlation, corner lot characterization analysis, hands-on lab evaluation, release to production, yield improvement, and failure analysis support.Knowledge of board level considerations, including component selection, PCB layout, packaging technologies and thermal analysis.Knowledge of IC process technologies, reliability design rules, ESD and latch-up testing.Knowledge about industrial standards and practices in appropriate technologies.Design management experience with multi-functional preferred.BS+10 Years of relevant industry experienceSome Travel Required", "jobDescription": "Can you influence, connect, get results and communicate effectively? We have an extraordinary opportunity for senior level engineers to drive and lead technical engagements between Apple and silicon and IP suppliers working on groundbreaking technologies! The Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, iPod, and AppleTV. Apple is looking for a remarkable Power Management Analog Design Lead to work with multi-functional teams and external vendors to define, develop and productize the next generation of mobile power solutions."}, "200451932": {"jobID": "200451932", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RF PHY Test Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451932/rf-phy-test-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid verification skills in problem solving, constrained random testing, and debugging. Bring up and test wireless SoC, Perform system integration, characterization, and optimization.Work with different teams (Design, HW board teams and Firmware) within apple. Have proficiency with measurement automation tools and scripting languages such as Python and shell scripts.Experience with lab equipment such as network analyzer, spectrum analyzer, oscilloscopes, DMM’s etc.Knowledge of wireless protocols such as Bluetooth, WLAN, UWB or others Experience with MAC or PHY Verification is a plus.BS with 3+ years relevant experience required.Additional Requirements:Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with Phy, Mac, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200449825": {"jobID": "200449825", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Power Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449825/power-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-BS and 3+years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in design and analysis of product power supply solutionExperience in PI/SI methodology development, PDN modeling from system to die, and lab correlation/validationUnderstanding of power supply architecture covering voltage regulator technologies, PCB and package design trends and trade-offs, and chip supply design including low-power design methodologiesDeep understanding of Voltage Regulator design principles and electrical performance in the system environmentGood knowledge in 3D/2D EM simulation tools, electromagnetic and transmission line theoryFamiliar with lab equipment including but not limited to VNA, real-time scope, spectrum analyzerAbility to work and communicate efficiently in a multi-functional team-BS and 3+years of relevant industry experience", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for precision to work towards an outstanding result? We are looking for a dedicated and passionate Power Integrity Engineer to join our team!\n\nIn this role, you will be responsible for the development, implementation, and verification of Power Integrity solutions for SoCs used in Apple devices. You will work with multi-functional teams to develop of droop targets, design and implement a power supply network solution, and verify the quality of the power supply using lab measurements."}, "200451418": {"jobID": "200451418", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451418/cpu-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Minimum BSSolid electrical engineering fundamentals in logic design and digital circuitsBasic knowledge of CPU pipeline, and physical design concepts related to timing and powerBasic knowledge of scripting/programming acquired during coursework, internship or industry workAbility to work well in a team, self-motivated and excellent communication skillsMinimum BS", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level implementation."}, "200386629": {"jobID": "200386629", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Managing Producer, Product Design - TV", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200386629/managing-producer-product-design-tv?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$235,000,"}, "benefits": null, "requirements": "7+ years as a team lead, producer, program manager, or product manager with recent experience in software design where you managed and worked with teams of designers, product managers, & engineers to ship products and features.2+ years of people management experienceQuickly builds rapport and fosters a culture of mutual respect with cross functional partners and stakeholders. Has an authentic desire to collaborate with and learn from those around them.Comfortable presenting to and engaging with senior leadership.Ability to achieve balance in a chaotic creative environment by implementing the right amount of structure and process.Employs a proactive project management style with a keen ability to identify and mitigate risks to a project.Expert delegator that understands how to get work done through others.Keen ability to grasp complexity quickly and to focus on key issues.Ability to adapt to constant change.Excellent written and verbal communication skills.A compelling desire to deliver innovative and exceptional experiences to our customers. Interest or past experience in the TV/SVOD space is a bonus!", "jobDescription": "Apple is looking for a natural team leader and design producer to lead a strong team of Human Interface Design Producers, produce key projects, and collaborate with Design Managers to provide overall team leadership in the TV/Video vertical.\n\nThis is a role for a problem solver who thinks strategically, and task manager who wants to have their hands, mind, and heart in several things at once; who can equally build effective teams, develop direct reports, and drive detailed design tasks and deliverables across a variety of products and groups; and who can collaborate well with others.\n\nThe team is deeply involved in scaling existing video services as well as introducing new ones. Its culture is diverse, passionate, grows with debate, and is wholly customer focused. Design has always been at the heart of Apple and the work that we do. The Design Producer plays a big part in upholding these values and driving innovation and creativity though our design work.\n\nThe Producer advances design efforts by diving deeply into the issues at hand, identifying and mitigating risks to the project, handling dependencies, and leading all issues impacting deliverables and schedules. They are responsible for design projects from ideation to delivery. They guide each project through the design process and ensure forward momentum by tracking and reporting project status, seeking closure to open questions, identifying next steps and risks, and facilitating design reviews. They serve as the liaison between Design and cross-functional teams.\n\nThe Managing Producer will lead projects as well as people. This person will lock arms with leaders across Design, Product, Engineering and other groups in developing product roadmaps, project plans, and innovating on the way we work together to deliver features to our customers. They are leading vision and purpose, inspiring creativity, and overseeing the organization and planning of team-wide initiatives."}, "200459774": {"jobID": "200459774", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "DFT CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459774/dft-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "The ideal candidate will have demonstrated DFT experience, and should have been involved in DFT efforts for large processor and/or SOC designs.Knowledge about industrial standards and practices in DFT, including ATPG, JTAG and MBIST.Knowledge of Verilog and/or VHDL, and experience with simulators and waveform debugging tools preferred.Experience in debugging Compressed ATPG patterns, MBIST, and JTAG/1500 related issues.Experience with Perl or Tcl or Python scripting languages.Exposure to industry standard DFT and ATPG Tool required.Familiarity with synthesis tools preferred.Minimum requirements of BS + 10 years of industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day."}, "200452174": {"jobID": "200452174", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Ergonomics Industrial Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452174/ergonomics-industrial-lead?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "-  Degree in Human Factors and Ergonomics, Biomechanics, industrial engineering, Kinesiology, or related Engineering or Science degree \n\n-  Certification in Ergonomics is preferred (e.g., CEES, CEAS, AOEE, etc.); professional certification (e.g., CPE/CIE) is a plus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$96,500", "max": "$145,000,"}, "benefits": null, "requirements": "3 or more years experience in the performing and conducting ergonomics risk assessments in industrial and office settings.Experience providing ergonomics services to a variety of work environments (e.g., office, lab, warehouse, and manufacturing).Knowledge and understanding of biomechanics, musculoskeletal anatomy, and ergonomics engineering principles, as well as manual material handling principles.Familiarity with quantitative ergonomics risk-assessment techniques. Experience using measurement tools and use of various evaluation tools (e.g., RULA, REBA, NIOSH Lift Equation, etc.).Proven ability to prepare accurate, concise and technically correct written work products and reports.Demonstrated ability to work independently and with a team, and communicate successfully with health and safety professionals, management team and workforce.Excellent written and verbal communication, organizational, analytical, and influencing/interpersonal skills, with proven track record of initiating and sustaining productive business relationships.Excellent project management skills, including the identification and scheduling of project deliverables, achievements, tasks, and deadlinesAbility to effectively work across a broad spectrum of functions within business units.Proven presentation skills with ability to present technical information and concepts in a clear and concise manner virtually and in-person.Good problem solving skills with ability to develop new insights in order to provide innovative solutions.-  Degree in Human Factors and Ergonomics, Biomechanics, industrial engineering, Kinesiology, or related Engineering or Science degree \n\n-  Certification in Ergonomics is preferred (e.g., CEES, CEAS, AOEE, etc.); professional certification (e.g., CPE/CIE) is a plus", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Occupational Health Ergonomics team at Apple is growing, and we need upbeat, dedicated and flexible professionals to join a dynamic team committed to protecting the health and safety of our employees, customers and the global communities where we operate, while supporting our team members in their mission to develop amazing products.\n\nApple Inc. has an excellent opportunity for a full-time Ergonomics program position. As a key member of the Occupational Health team, this position will be responsible for implementing, sustaining and developing the ergonomics program and supporting health and safety initiatives at this location. Providing high quality, innovative services while working in a fast paced, high energy, team-oriented environment. The preferred candidate will have varied ergonomics experience, including industrial, lab, and office. This position reports to the Ergonomics program manager.\n\nThe candidate should demonstrate an ability to work on their own initiative, have demonstrated strong technical ergonomics skills, be capable of project management, process strong interpersonal skills and have an ability to work collaboratively with teams based at different locations."}, "200458272": {"jobID": "200458272", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Sr. EMI/PI Engineer – iPhone Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458272/sr-emi-pi-engineer-iphone-engineering?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "-  MSEE/Ph.D"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You possess experience in EE fundamentals and problems solving skillsYou have strong academic background in EM theory and coupling mechanisms.You will have experience in power and signal integrityAbility to relate electrical performance to physical layoutDeep experience in 3D EM simulations for debugging and mitigating complex EM coexistence issuesHands-on experience in EM and circuit simulation tools: Ansys HFSS/Maxwell/SIWave, CST, ADS/Spice/Spectre, Cadence/Sigrity, scripting languages (Python, Perl)Hands-on experience in hardware board-level testing, validation, and with lab equipment (near field scanning, spectrum analyzers, VNAs, scopes)-  MSEE/Ph.D", "jobDescription": "The iPhone Hardware Engineering team is seeking a hardworking electrical engineer for the position of Hardware Engineer - System Technologies. The ideal candidate will work with iPhone Hardware multi-functional teams to perform in-depth debug, modeling and simulation of sophisticated electric and magnetic effects in mobile systems design. Collaboration is key to success in this position. Come join the team!"}, "200391227": {"jobID": "200391227", "origin_search": null, "posted": "Jul 8, 2022", "jobTitle": "Hardware Development Engineer - Mac Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200391227/hardware-development-engineer-mac-systems?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BS in electrical or computer engineering required, MS preferred\n\n-  Minimum 5 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "High-volume consumer electronics system experience preferred.Lab skills: oscilloscopes, logic analyzers, electronic loadsExperience with schematic capture and PCB physical design using Cadence Concept and Allegro or similar CAD toolsDesign experience in digital logic, simulation, power conversion and deliveryFamiliarity with RF/wireless conceptsExperience with high-speed serial and memory interfaces including signal integrity design and measurement fundamentalsExcellent written and verbal communication skillsCommand line interface and scripting skillsSpecific deep expertise in several of the following areas is a plus: CPU or GPU microarchitecture, batteries, power management, analog design, audio, wireless, DisplayPort, PCIe, Thunderbolt, USB, SPI, I2C, UART, analog sensors, interconnectStatistical data analysis and visualization (ex. JMP) is a plus-  BS in electrical or computer engineering required, MS preferred\n\n-  Minimum 5 years relevant industry experience.", "jobDescription": "The Mac Division is seeking enthusiastic electrical engineers for the Mac Engineering Team! As a part of the Mac team, you will help with concept and feature development, rapid prototyping, production part selection and product integration. You’ll have the opportunity to travel to our contract manufacturing partners to support mass production builds and develop both the test development and failure analysis procedures to ensure a high level of quality for the product.\n\nOur engineers rely on skills in computer system architecture, schematic design, digital and analog circuits, power and voltage regulator integration, high speed signal integrity concepts, PCB design, bring up and system level troubleshooting to surprise and delight millions of customers."}, "200463176": {"jobID": "200463176", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Mixed Signal Modeling/Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463176/mixed-signal-modeling-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant industry experience is required. MSEE or beyond is preferred.\nCoursework emphasis on the design of analog/RF building blocks is nice to have"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong fundamentals in analog/RF circuit concepts/topologies.Expert in RNM coding in SystemVerilog.Experience working with Cadence mixed signal verification environment.Ability to read analog schematics and extract related main functionality.Experience modeling mixed signal/RF blocks including biasing networks, power regulators, bandgaps, Opamp’s, OTA’s, data converters, LNA, PA, mixers, couplers, splitters, combiners, etc…Experience modeling high frequency PLL’s is desired.BS + 10 years of relevant industry experience is required.BS + 10 years of relevant industry experience is required. MSEE or beyond is preferred.\nCoursework emphasis on the design of analog/RF building blocks is nice to have", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and support millions of Apple’s customers every single day! In this role, you will work within the analog mixed-signal design team to model complex custom circuits in order to verify system-level functionality and performance expertly. This is meaningful and rewarding cross-disciplinary position, with a high degree of collaboration and openness across multiple teams. This role will provide the opportunity to work on state of the art mixed-signal systems used in Apple’s world-leading SoCs."}, "200408927": {"jobID": "200408927", "origin_search": null, "posted": "", "jobTitle": "Senior Program Manager, App Store Commerce", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200408927/senior-program-manager-app-store-commerce?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200455840": {"jobID": "200455840", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Verification Methodology and Tool Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455840/cpu-verification-methodology-and-tool-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceThe ideal candidate should have experience in the following areas:Verification tool and verification development experienceTestbench setup and build experienceRandom regression flow and result analysis script developmentStrong in C, C++, Verilog and scripting languages.Should be a team player with excellent communication skills, be able to work independently.Knowledge of digital logic design and processor architecture.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!"}, "200125453": {"jobID": "200125453", "origin_search": null, "posted": "Mar 6, 2023", "jobTitle": "US-Business Pro", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200125453/us-business-pro?team=APPST", "jobLocation": {"remote": "not specified", "city": "Various Locations within United States", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "At least three years of success and high performance in sales of technology or business solutions, or equivalent.Proven ability to take a personalized, solution-based approach to customer needs.Advanced consultative expertise in Apple and third-party solutions, mobility adoption, and business transformation.•  You possess strong business insight, as well as general knowledge of key small business industries, technology trends in communities, and business challenges.•  You have excellent listening, influencing, negotiation, and interpersonal skills to establish positive relationships with customers, as well as within Apple and our team.•  You have extraordinary written and verbal communication skills, in person and on the phone.•  You can work effectively with business owners and executives across all organizational levels.•  You have a proven ability to connect with people, manage processes efficiently, and prioritize without sacrificing the customer experience.•  You can adapt in a dynamic, ever-changing retail environment.", "jobDescription": "Are you passionate about driving sales, building relationships, and consulting with customers on business solutions? Do you want to connect entrepreneurs and professionals with the tools they need to build success? As a Business Pro, you help customers discover how Apple products can transform the way they work — and you build loyalty by maintaining those customer relationships. In this role, you serve as both a resource and a mentor to your fellow Apple Store team members. You also partner with store leadership to find opportunities to connect customers with powerful tools and solutions that help their business thrive. "}, "200458493": {"jobID": "200458493", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Silicon Prototyping Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458493/silicon-prototyping-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 10 years relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "You have advanced knowledge of CPU & SOC architecture/design an industry standard interfacesYou have strong knowledge of FPGA tool flows; Synthesis, Partitioning, Place & Route: ProtoCompiler, Synplify, Identify, ISE, Vivado, etc.Experience in multi-FPGA partitioning and constraining of synthesis; Design optimizations with respect to FPGA limitations.You are experienced in scripting/programming - ideally Unix, Python, Perl, Tcl, Make, C/C++Strengths in Verilog, SystemVerilog, test-benches, simulation, automation and debug.Experience with cutting edge FPGA devices such as Xilinx Virtex 7/UltraScale/UltraScale+ is a plus.Hardware/System design, tools, debug, lab experience and vendor interface are a plus.Experience with Strong analytical skills, creative attitude and enthusiastic teammate.Excellent communication skills and demonstrate the desire to tackle diverse challengesBachelor's degree and a minimum of 10 years relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.   \nWe have a critical impact on getting high quality functional products to millions of customers quickly and we are hiring all levels from junior to senior engineers to join our prototyping team."}, "200403484": {"jobID": "200403484", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": " Hardware Engineer - Apple Home", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200403484/%EF%A3%BF-hardware-engineer-apple-home?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in electrical engineering or computer engineering required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Demonstrated experience working in consumer electronics, focusing on hardware system design. Role will be tailored to experience level.Strong EE fundamentals on analog circuits (DC/DC, power and signal integrity, SPICE simulations)Knowledgeable in digital communication (I2C, USB, SPI, TDM, PDM)Working experience in electrical design, including component selection, circuit design, schematic capture, component placement and PCB/flex layoutRelevant subsystem exposure in power, acoustic, sensor, display, wireless, touch and camera, integration with System-on-Chip or microcontrollersWorking knowledge of standard methodologies in PCB design, including stack up, impedance control and noise couplingStrong communication, written and verbal interpersonal skills necessary to collaborate with a variety of technical teams at AppleAbility to drive concept work independently and determine necessary figures of merit to draw conclusionsAbility to work with cross-geographic team members, using any and all forms of communication to be part of the larger teamBS in electrical engineering or computer engineering required.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "At Apple, we're passionate about designing products and delivering experiences that millions around the world have come to love. This is a place where extraordinary ideas have a way of quickly becoming extraordinary products and services. \n\nIn recent years, Apple Home devices and services have become a staple among Apple's elite product line. As we continue to push the boundaries of what's possible, Our Beats & Home organization has been hard at work continuously innovating new features and products. \n\nA key factor in this effort is our Hardware Integration Team. This team is a rapidly growing, diverse group of engineers developing technology integrations that help define how users interact with Apple Home products. To help drive this mission, we are seeking an accomplished Hardware Engineer who will own critical electrical designs from concept to productization. This person will be part of a hands-on team that specifies the product, collaborates to solidify architecture, and improves our overall design of HW systems. Does this sound like you?"}, "200455819": {"jobID": "200455819", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "PMU Hardware Electrical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455819/pmu-hardware-electrical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience with hardware development from specification to bring up and downstream support.Schematics and PCB design experience preferred.Knowledge of power integrity analysis and design.Ability to design or guide high quality PCB layouts into fabrication.Skilled at component development and selection.Familiarity with microcontroller/FPGA/logic design and programming.Resourceful in an electronics lab environment using real time oscilloscopes, analyzers, function generators, automation hardware, power supplies, and electronic loads.Coding or software development in Python.Enjoys working in a lab environment.Familiarity using Cadence Allegro for multi-layer board layout is a plus.Coordination and collaboration with team members on complex projects.BS and a minimum of 10 years of relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Are you interested in designing hardware as part of silicon development at Apple? Join our team developing custom mixed-signal integrated circuits for Apple’s next generation product lines! Our small team has already shipped hundreds of millions of chips into several Apple product lines, including new products launched this year. We are looking for a passionate engineer that is enthusiastic about embedded hardware design. You will work closely with a diverse and creative team to craft sophisticated test systems for pioneering power supplies. This role includes a broad scope of work including simulations, software, bringup, debug, extraction, and analysis, working closely to a wide range of people across functions and being a key contributor to the silicon development effort!"}, "200447290": {"jobID": "200447290", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "PMIC Product Reliability Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447290/pmic-product-reliability-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience with reliability HW setups and equipment for HTOL, HAST, THB, ESD, Latch-Up, etc.Knowledge of device physics, IC fabrication, packaging and testing method.Understanding of power topologies such as buck, boost, buck-boost, charge pumps, LDOs.Statistical analysis knowledge to assess reliability risk on abnormal materials at suppliers and at customer end.Knowledge of board level considerations, including component selection, PCB layout, packaging technologies and thermal analysis.Experience leading multi-functional team to develop robust qualification strategies.Experience applying JEDEC quality related standards, and the science behind them.Experience with reliability fail modes of packaging technologies and fail mechanisms with respect to reliability.Experience driving suppliers in the areas of packaging/assembly, test, ongoing reliability monitoring, post-production qualification.Good interpersonal skills.Some travel is required.BS and a minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nDynamic, intellectual and inspiring, people innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product."}, "200460421": {"jobID": "200460421", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "PMIC Product Reliability Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460421/pmic-product-reliability-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with reliability HW setups and equipment for HTOL, HAST, THB, ESD, Latch-Up, etc.Knowledge of device physics, IC fabrication, packaging and testing method.Understanding of power topologies such as buck, boost, buck-boost, charge pumps, LDOs.Statistical analysis knowledge to assess reliability risk on abnormal materials at suppliers and at customer end.Knowledge of board level considerations, including component selection, PCB layout, packaging technologies and thermal analysis.Experience leading multi-functional team to develop robust qualification strategies.Experience applying JEDEC quality related standards, and the science behind them.Experience with reliability fail modes of packaging technologies and fail mechanisms with respect to reliability.Experience driving suppliers in the areas of packaging/assembly, test, ongoing reliability monitoring, post-production qualification.Good interpersonal skills.Some travel is required.BS and a minimum of 3+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nDynamic, intellectual and inspiring, people innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product."}, "200448312": {"jobID": "200448312", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics (GPU) RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448312/graphics-gpu-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 minimum years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong background in GPU, CPU, or SIMD architecturesUnderstanding of GPU Schedulers, Execution Units, or CachesLogic design, including low-power techniques and timing optimizationsAbility to drive bring up and debug of complex designsProficiency with synthesis tools, timing analysis, floor planning, and understanding of the PNR flowExperience in hardware performance analysis and debugProficiency in System Verilog HDLExperience with scripting languages such as Python, Ruby, or PerlAbility to work well in a team in order to be productive under aggressive product schedulesBS + 3 minimum years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Do you love working on challenges that no one has solved yet? Join us to help deliver the next groundbreaking product containing an Apple designed GPU. \n\nAs a member of Apple’s GPU Shader Core team, you will develop power efficient, high performance 3D graphics processor microarchitectures targeted for low power mobile devices and high-performance personal computers that are used by millions of people every day."}, "200448314": {"jobID": "200448314", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics (GPU) RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448314/graphics-gpu-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 minimum years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong background in GPU, CPU, or SIMD architecturesExperience designing GPU Schedulers, Execution Units, or CachesLogic design, with expert knowledge of low-power techniques and timing optimizationsAbility to drive bring up and debug of complex designsDetailed understanding of synthesis tools, timing analysis, floor planning, and the PNR flowExperience in hardware performance analysis and debugExpert knowledge of System Verilog HDLExperience with scripting languages such as Python, Ruby, or PerlAbility to work well in a team in order to be productive under aggressive product schedulesBS + 10 minimum years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Do you love working on challenges that no one has solved yet? Join us to help deliver the next groundbreaking product containing an Apple designed GPU. \n\nAs a member of Apple’s GPU Shader Core team, you will develop power efficient, high performance 3D graphics processor microarchitectures targeted for low power mobile devices and high-performance personal computers that are used by millions of people every day."}, "200210438": {"jobID": "200210438", "origin_search": null, "posted": "Aug 9, 2022", "jobTitle": "Watch Touch HW- Senior Sensing Design & Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200210438/watch-touch-hw-senior-sensing-design-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. + 5 or PhD + 2 in Electrical Engineering, Mechanical Engineering, Physics or industry experience equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Multi-disciplinary understanding of EE, ME, and Physics principlesFamiliarity with mechanical design principles, FEA, and advanced materialsProven working proficiency in algorithms development / signal processing as applied to sensor systemsStrong EE fundamentals and experience with analog/mixed signal designFinite Element Analysis (FEA) experience. Proficiency in COMSOL, Maxwell, or similar FEA toolsProficiency in MATLAB, SPICE, or similar simulation and modeling / scripting toolsExcellent written and verbal communication skills along with collaboration and leadership skillsM.S. + 5 or PhD + 2 in Electrical Engineering, Mechanical Engineering, Physics or industry experience equivalent", "jobDescription": "The Sensor Technology team develops sensor solutions and technologies for Apple’s products, including the iPhone, iPad, Apple Watch, MacBooks, and more. The key goal of the Sensor Technology team is to enable the world’s best user-experience. New challenges arise every single day that require the sharp analytical skills of hardworking and talented individuals. We feature a collaborative and hands-on environment that cultivates engineering excellence, creativity, and innovation."}, "200458628": {"jobID": "200458628", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "GPU Post-Silicon Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458628/gpu-post-silicon-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven experience in GPU or SOC design or validationMeaningful experience in technical leadership and/or project management experienceStrong communication and executive presentation skillsStrong time and task management skills with consistent attention to detailGPU architectural experience is an advantage, but not requiredExposure to software driver and HW/SW interactionsCan work collaboratively across multiple sites and cross-functionally throughout the entire organizationAble to build trust and lead through influenceComfortable navigating tough situations, juggling priorities and managing constraints while running complex, fast-paced, programsDriven to continuously improve processes, methodologies and toolsExperience with end-to-end silicon bringup, validation and drive towards productionBS + 10 years of relevant experience", "jobDescription": "Come and join the team that delivers the GPUs in the M1/M2 Mac, iPhone, iPad, and Apple Watch! At Apple, we focus on innovative design and principled execution to build the most efficient GPUs that scale across our full range of products and deliver industry-leading power and performance. We work together across hardware, software, and systems teams to build truly optimized products and amazing user experiences. To accomplish this, we need technical excellence combined with the expertise to work across the organization and to put each decision in the right context.\n\nWe are looking for a dedicated Engineering Program Manager or a technical leader who is passionate about planning for and leading silicon bring-up and debug of ground breaking and innovative designs. You will use your creativity, technical knowledge and social skills to drive multi-functional teams to tackle complex technical problems under tight schedule constraints.\n\nThe GPU Post-Silicon Engineering Project Manager will be working closely with the GPU architecture, logic design, verification, physical design, DFT and debug teams, as well as SoC, software, system and others to resolve silicon issues blocking product development, starting with initial silicon bring up through production release and beyond."}, "200446461": {"jobID": "200446461", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "IC Package Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446461/ic-package-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "We are looking for someone with experience in Semiconductor Packaging Design, Process & Technology DevelopmentGood understanding of cross-functional packaging areas: Si floor plan, package layout and architecture, enabling process technologies, thermal, mechanical, SI/PI, material, component & system level reliability, testing, and FAKnowledgeable in advanced packaging technologies: Knowledge and insight to deliver high density / high performance interconnects in various form factor, thermo-mechanical, reliability, and cost constraintsExcellent problem solving with strong physics and fundamentalsExcellent communication skills that enable the candidate to work well with internal cross-functional teams and overseas suppliersMulti-functional coverage on package layout (Cadence APD/Allegro), critical signal integrity/power integrity, thermal, design rules, BOM, design for manufacturing, reliability, and costAbility to work independently and take on projects with minimum supervisionAbility to lead and manage teamsKnowledge of Cellular packaging and systems a plusBS and 3+years of relevant industry experienceBS and 3+years of relevant industry experience", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We are looking for a hardworking, and passionate IC Packaging Engineering Lead to join our team."}, "200455399": {"jobID": "200455399", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455399/cpu-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.In-depth knowledge of digital logic design, chip architecture and microarchitectureExperience with developing testplans/testbenches, C-based transactors, and writing/debugging assembly-based testsExperience with advanced verification techniques such as formal and assertions a plusExperience in silicon bringup a plusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200442520": {"jobID": "200442520", "origin_search": null, "posted": "Nov 16, 2022", "jobTitle": "WiFi Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442520/wifi-quality-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "3+ years of experience in 802.11 protocols and/or Bluetooth3+ years of experience in SQA methodologies and practicesExperience in developing test strategies and executing it with automation or manual testingExperience in utilizing tools, including Wireless and Bluetooth packet sniffers and network protocol analyzers, to help resolve, root cause and provide debugging information to engineering teams.Thrive in a collaborative environment and comfortable working with multi-functional teams.Laser-focused on the smallest details that are meaningful to our customers.Ability to write automation and automate existing test cases to improve efficiency.Proficiency in Python and/or C/C++. Previous automation experience required.Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Join the Sensing and Connectivity team in driving the innovation and delivering seamless wireless connectivity and the best user experience to our customers. Our team works on an Apple eco-system of devices that delivers the best wireless connectivity experience.\nIf you are motivated, highly technical and passionate about WiFi, Bluetooth and Networking technologies, possess excellent problem solving and coding skills, this team can be your destination."}, "200249779": {"jobID": "200249779", "origin_search": null, "posted": "May 19, 2021", "jobTitle": "Signal Integrity Engineer – iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200249779/signal-integrity-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "•\tMSEE/Ph.D"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "2+years of experienceMust have strong EE fundamentals and problems solving skillsMust have strong academic background in EM theory and coupling mechanisms.Must have experience in signal and power integrityAbility to relate electrical performance to physical layoutExperience in 3D EM simulations for debugging and mitigating complex EM coexistence issuesHands-on experience in EM and circuit simulation tools: Ansys HFSS/Maxwell/SIWave, CST, ADS/Spice/Spectre, Cadence/Sigrity, scripting languages (Python, Perl)Hands-on experience in hardware board-level testing, validation, and with lab equipment (near field scanning, spectrum analyzers, VNAs, scopes)•\tMSEE/Ph.D", "jobDescription": "The iPhone Hardware Engineering team is seeking a hardworking electrical engineer for the position of Hardware Engineer - System Technologies. The ideal candidate will work with iPhone Hardware multi-functional teams to perform in-depth debug, modeling and simulation of sophisticated electric and magnetic effects in mobile systems design."}, "200452048": {"jobID": "200452048", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Camera Mechanical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452048/camera-mechanical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Mechanical Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Mechanical design using CAD 3D modeling and drafting package experience with NXBasic structural dynamics and thermal Finite Element Analysis (FEA)Tolerance analysis of high complexity and precision mechanical designs with excellent understanding of GD&TDemonstrated ability design for plastic injection molding and metal stamping for mass productionExperience with various materials (research, selection, testing, process ability)Author documentations on mechanical inspection and fixture designPCB design experience a plusExperience with testing, reliability, and qualification of systemsBS/MS in Mechanical Engineering or related field", "jobDescription": "Why Apple? Do you love taking on big challenges that require exceptionally creative \nsolutions? Imagine what you could do here? At Apple, new ideas have a way of becoming \noutstanding products, services, and customer experiences very quickly. Bring passion \nand dedication to your role here at Apple and there's no telling what you could accomplish. \n\nThe Camera Hardware Engineering group is responsible for all research, design, \ndevelopment, test, and qualification of camera hardware for Apple products. We are \nsearching for an extraordinary Hardware Engineers to take ownership in the development of \nvery high-performance compact camera modules. We are seeking an engineer to take \nleadership of camera hardware projects in engagements with product and technology \nteams."}, "200451036": {"jobID": "200451036", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Sr. Wireless SoC Design Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451036/sr-wireless-soc-design-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.This position requires thorough knowledge of the ASIC design flowTop-level integration of connectivity, system bus, peripherals, and CPU IPStrong experience in complex ASIC design and IP integration, with a focus on high performance, low area, and low powerSuccessful tape-outs of multiple complexes, high-volume SoCs in advanced design nodesProficient in design methodologies and EDA tools for DFT, power, clocking, and debugExperience working with back-end tools, including synthesisExpert knowledge of ASIC design flow and netlist flow checks – Lint, CDC, Logical EquivalenceExpert knowledge of UPF flow for defining power intent of chips with multiple power domainsUnderstanding of multi-clock designs, power management, reset, and power sequencingProficiency in one or more of the following highly desirable: PCIe, AXI/AHB bus fabric, ARM-based processor sub-systemsBS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which are driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture, and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We encourage you to apply if you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times.\n\nAs a Senior SoC Integration Design Engineer, you will work in a team developing Wireless SoCs with custom hardware accelerators and multiple ARM-based sub-systems. You will integrate industry standard and custom hardware IP into SoCs. You will work closely with SoC architects IP developers to develop SoCs that meet Apple devices’ power, performance, and area goals. You will help define the processes, methods, and tools for designing and implementing large complex SoCs. You will develop and maintain methodology and flow checks for your design. Interact with our verification team to ensure appropriate validation and coverage goals are met. You’ll ensure security assumptions for the chip are accurately implemented within the block/s. Collaboration with multi-disciplinary groups to ensure designs are delivered on time and with the highest quality by incorporating accurate checks at every stage of the design process.\n\nIn this highly visible role, you will be at the center of the ASIC Integration effort, interfacing with all disciplines, with a critical impact on quickly getting functional products to millions of customers."}, "200303316": {"jobID": "200303316", "origin_search": null, "posted": "Mar 1, 2022", "jobTitle": "Hardware Design Engineer - Board Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200303316/hardware-design-engineer-board-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's or Master's degree in Electrical Engineering or relevant is required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You have broad experience with high-speed, high-power, embedded system designExperience defining routing constraints for high-speed interfacesDesign and analysis of power supplies as well as power integrity analysisExcellent signal integrity analysis and measurement techniquesCPU/SoC/Micro-controller system architecture expertiseProficiency with all standard hardware lab equipment including scopes, logic and spectrum analyzers, signal generators, eLoads, protocol analyzersTest automation expertise using Perl/Tcl/PythonBoard level analog and digital circuit design expertiseHDL experience is a plusBachelor's or Master's degree in Electrical Engineering or relevant is required", "jobDescription": "As a member of the Silicon Validation Hardware team you will be essential to enabling the next generation of incredible Apple products.   This position involves a wide range of activities including high-speed embedded system designs that push the limits of technology, designing and implementing test and characterization circuits in the lab, and debugging complicated system level problems.  You will work closely with designers from many groups within Apple and be a key contributor to the silicon engineering effort."}, "200451064": {"jobID": "200451064", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Software Engineer: Validation of Crypto and Security IPs", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451064/software-engineer-validation-of-crypto-and-security-ips?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong Interest in test automation, experience with Python.Knowledge and skill in C/C++ programmingStrong debugging skills for SoC and system level issues.BS and a minimum of 10 years relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nWe have a critical impact on getting high quality functional products to millions of customers quickly. You will develop software to validate and debug crypto and security blocks in Apple SoCs."}, "200417189": {"jobID": "200417189", "origin_search": null, "posted": "Aug 26, 2022", "jobTitle": "Retail Online WW Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200417189/retail-online-ww-program-manager?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS preferred, MBA desirable"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You are an excellent teammate with a “hands-on” and “can do” attitude that can influence through collaboration and leadership. Being able work effectively with other teams and taking them along for the journey is critical.You possess excellent communication and presentation skills at all levels of the organization (from specialists to senior leaders) and across multiple teams (RCC, Product, Store Ops, Ops, Finance, etc)Possess prioritization skills to constantly focus on the most important project in a constantly evolving environmentAnalytical, curious and creative mind setAbility to see the big picture while also zooming into the micro level technical detailA driver who is self-motivated and operates with a phenomenal sense of urgencyAbility to drive progress under immense degree of ambiguity and be comfortable working in an unstructured environmentExcellence and keen eye for detail should be a habitAbility to make key decisions and deliver results under very tight timelinesPassion for the customer experienceAbility to troubleshoot problems quickly and think creatively to solve problemsThe successful candidate will be experienced in the development and delivery of initiatives that will improve end to end customer experience, specialist workflows, improve performance and deliver a best in class customer experience within the functions at a global level..Can quantify results of strategy and tactical initiatives and drive decisions based on data.Must understand the end-to-end impact to the RCC teams, our customers and our Specialists when making strategic decisions on programs and initiatives that we will be supporting.Able to quickly gain credibility and mobilize resources across a WW organization covering multiple time zones.. Be able to make critical decisions, influence decisions and facilitate change management through collaboration and leadershipTeam player with a positive attitude, empathizing with multiple points of view but able to make the hard call and move onComfortable changing/evolving what’s not broken, looking for alternatives and never stop asking whyBA/BS preferred, MBA desirable5+ years experience of program and/or project management, contact center environment or relevant e-Commerce experience.1-2 years experience working in a global capacityJoin a worldwide company that welcomes the whole wide world.Our customers are all over the world, so it’s by design that Apple employees are all over the world, too. And we know our ability to continue creating the world’s most innovative products depends on people who represent the variety of the human experience and who inspire us with great thinking. Because the broader the backgrounds and perspectives, the bigger the ideas.At Apple, we’re not all the same. And that’s our greatest strength. We draw on the differences in who we are, what we’ve experienced, and how we think. Because to create products that serve everyone, we believe in including everyone.", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe Retail Customer Care Optimization team is seeking a highly-motivated professional to manage WW programs that span across the Retail Contact Center, Apple Online, Retail Stores and other customer-facing channel. Our global Support teams provide customer service support across Web, Mobile, and many different contact center locations around the world."}, "200449277": {"jobID": "200449277", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "RF Passive Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449277/rf-passive-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 10+ years' of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS and 10+ years' of relevant industry experience.Demonstrates deep knowledge on electromagnetic theory, microwave engineering and antenna engineering.Proficiency with EM passive designs and familiarity with EM simulation tools like HFSS, Peakview, EMX, Momentum or Helic. Experience on chip EM modeling is helpful.Familiar with on-wafer measurement, have experience using VNA, TDR, LCR meters etc.Excellent academic background with industry related work experience beyond graduate school studies.Good written and verbal communication skills.- BS and 10+ years' of relevant industry experience.", "jobDescription": "Do you love working on challenges that no one has solved yet? Do you like changing the game? Envision what you could do here! At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nWe are looking to hire a Chip Passive Design Engineer in a group at Apple that develops RF chips that will be used in Apple mobile devices. You will be responsible for on chip inductors / transformers/ caps/ transmission lines, as well as on chip filters, phase shifters, and couplers etc. You will orchestrate the process from design to tape-out and work closely with multi-functional teams including RF design team, packaging design team, CAD, process teams etc."}, "200448416": {"jobID": "200448416", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "2nd Shift Operations Test Coordinator", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448416/2nd-shift-operations-test-coordinator?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Phoenix", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree or relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to follow oral and written instructions with exceptional attention to detailEstablish and maintain cooperative working relationships with employees, contractors, and customersAbility to work in a fast pace environment with ever-changing prioritiesBackground in leadership, continuous improvement, and resource managementBackground in engineering is a plusEffectively handle multiple priorities, organize workload, and meet deadlinesWork 2nd shift; 2:30pm to 11:00pmWork onsite at Apple Facilities in a team-based environment, 5 days per weekBachelor’s Degree or relevant experienceComfortable in a dynamic development environmentExcellent written and verbal communication skills and solid teamworkDrive to innovate and improve operational processes", "jobDescription": "Play a role in bringing autonomous technologies to the real world.  We are looking for a motivated Operations Test Coordinator with excellent problem solving and communication skills. This person will be responsible for scheduling tests, coordinating resources, and maintaining a culture of safety on 2nd shift."}, "200452807": {"jobID": "200452807", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Software Engineer: SoC Level Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452807/software-engineer-soc-level-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Develop SoC and CPU directed and random stress workloadsDebug issues pre-silicon or post-siliconDevelop and maintain system-level SW platformWork with designers and architects to accomplish validation goalsBS and a minimum of 10 years relevant industry experience", "jobDescription": "What happens when you run almost everything on a System-On-Chip (SoC) all at once while powering down blocks, hammering new features, and running a complex suite of algorithms? You find bugs. That’s exactly what we do. We break Apple Silicon with our system level SW suite that runs mostly post-silicon, leverages pre-silicon and finds corner-case hardware bugs. Join our team to uphold the high quality of Apple Silicon."}, "200447291": {"jobID": "200447291", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Senior WebKit Text Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447291/senior-webkit-text-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Computer Science or equivalent and 4+ years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Skills in a manual memory-managed (e.g., pointer-based) language such as C, C++, or Objective-C.Familiarity with typographical concepts or world writing scripts is preferred.Bachelor’s degree in Computer Science or equivalent and 4+ years of relevant experience", "jobDescription": "As a Senior WebKit Text Engineer you will be responsible for improving the WebKit engine’s support for text features, world languages, and internationalization, focusing on character/glyph layout, rendering, and performance! The WebKit team is responsible for Safari, the world’s fastest web browser. WebKit is the iOS and macOS framework that powers Safari, Mail, Books, and many other applications.  \n\nAt Apple, we have a way of turning new ideas into extraordinary products, services, and customer experiences very quickly! Working on the browser engine, we have the extra opportunity to influence areas outside the Apple ecosystem."}, "200439172": {"jobID": "200439172", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "WiFi Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439172/wifi-quality-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "3+ years of experience in 802.11 protocols and/or Bluetooth3+ years of experience in SQA methodologies and practicesExperience in developing test strategies and executing it with automation or manual testingExperience in utilizing tools, including Wireless and Bluetooth packet sniffers and network protocol analyzers, to help resolve, root cause and provide debugging information to engineering teams.Thrive in a collaborative environment and comfortable working with multi-functional teams.Laser-focused on the smallest details that are meaningful to our customers.Ability to write automation and automate existing test cases to improve efficiency.Proficiency in Python and/or C/C++. Previous automation experience required.Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Join the Sensing and Connectivity team in driving the innovation and delivering seamless wireless connectivity and the best user experience to our customers. Our team works on an Apple eco-system of devices that delivers the best wireless connectivity experience.\nIf you are motivated, highly technical and passionate about WiFi, Bluetooth and Networking technologies, possess excellent problem solving and coding skills, this team can be your destination."}, "200465366": {"jobID": "200465366", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Hardware Power Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465366/hardware-power-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. with 5-7 years experience, or PhD (preferred) with minimum of 3-4 years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "covering voltage regulator technologies, power distribution network (PDN) modeling, PCB design practices and trade-offs for PDN design and optimization.Also, you should have a solid understanding of multi-phase of Buck/Boost converter and LDO design principles, operating modes, and system integration careabouts.Solid understanding of 3D/2D EM simulation tools, electromagnetic modeling and transmission line theory is required.Skills with associated tools for 2.5D (PowerSI, SIWave, Sentinel-PI, nSys), 3D Full wave (HFSS, nWave), quasi-static tools (Q3D, nApex) is required.You'll need to show relevant understanding of HSPICE, Spectre, AMS, and Simplis models for system-level transient droop analysisDeep Experience in CPM (Chip-Power-Model) usage for system transient analysis is an added benefit.In this role, you will be expected to have understanding of die-package-board power delivery network co-design constraints and tradeoffs.M.S. with 5-7 years experience, or PhD (preferred) with minimum of 3-4 years experience-  Experience with Perl, Python or other scripting languages is desired. MatLab Experience is a plus-  Excellent documentation and communication skills, with an ability to work independently-  A desire to mentor, with an ability to innovate are required.-  Candidate will need demonstrated experience in driving initiatives that improved process, procedures, and result quality.", "jobDescription": "The Mac organization is looking for an outstanding Power Integrity engineer, to support the system-level Power Distribution Network (PDN) design, analysis, and validation aspects of Mac and Accessory products development. We would like someone with deep knowledge of power delivery network design, analysis and validation methods. You will work with multi-functional teams to design and implement a power supply network solution, develop and validate impedance and droop targets, and verify the quality of the power supply using lab and in-situ silicon measurements!"}, "200455841": {"jobID": "200455841", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Verification Methodology and Tool Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455841/cpu-verification-methodology-and-tool-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceThe ideal candidate should have extensive experience in the following areas:Deep knowledge of verification methodologyVerification tool and verification development experienceTestbench setup and build experienceRandom regression flow and result analysis script developmentStrong in C, C++, Verilog and scripting languages.Should be a team player with excellent communication skills, be able to work independently.Knowledge of digital logic design and processor architecture.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!"}, "200389046": {"jobID": "200389046", "origin_search": null, "posted": "Jun 8, 2022", "jobTitle": "Operations, Manufacturing Design Engineer Internship", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200389046/operations-manufacturing-design-engineer-internship?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Pursuing BS, MS or PhD in Mechanical Engineering, Material Science, Industrial Engineering. You are additionally required to return to school after the internship to continue education or an internship needs to be required for graduation from your school. You also qualify if accepted into a graduate program after graduation."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You may meet or have interest in any one of the following qualifications:Experience in a hands-on manufacturing environment.Experience developing quality plans, validating test methods and gauges, and driving corrective actions / failure analysis efforts.Knowledge of quality and reliability concepts, supplier management, and general manufacturing operations.Project management experience and a deep understanding of problem solving tools including design of experiments, root cause analysis and statistical process control principles preferred.Experience with: mechanical enclosures, casings, plastic parts, injection molding, tooling, jigs, fixtures, or automotive high volume quality manufacturing engineering.Understanding of GD&T Geometric Design & Tolerance, as well as statistics.Understanding of mechanical properties of materials as they relate to manufacturing requirementsUnderstanding of DOE principlesAbility to travel periodically domestic and overseas.Extraordinary interpersonal skills - verbal, written and executive presentationsPursuing BS, MS or PhD in Mechanical Engineering, Material Science, Industrial Engineering. You are additionally required to return to school after the internship to continue education or an internship needs to be required for graduation from your school. You also qualify if accepted into a graduate program after graduation.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it\n\nBring passion and dedication to your job and there's no telling what you could accomplish. In this highly visible role, you will have the opportunity to make a significant impact on Apple Products, and leave a footprint for years to come. We have an opportunity for an accomplished quality engineer to lead development, and ramp for a next generation Apple product from both dimensional and cosmetic perspective. \n\nOur Operations team ensures that Apple’s ground breaking designs become industry-leading products, delivered on time and on spec. This high profile, highly respected organization is positioned at the junction of Apple’s product teams, the industries that supply core component technologies, and our manufacturing partners who help ensure that products such as iPad, iPhone and Mac can be restocked just as fast as they fly off the shelves! We’re looking for high-energy people to support the procurement, manufacturing, fulfillment and support of all things Apple."}, "200443273": {"jobID": "200443273", "origin_search": null, "posted": "Nov 11, 2022", "jobTitle": "Power Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443273/power-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. with 5-7 years experience, or PhD (preferred) with minimum of 3-4 years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You will need a proven technical understanding of power supply architectures covering voltage regulator technologies, power distribution network (PDN) modeling, PCB design practices and trade-offs for PDN design and optimization.Also, you should have a solid understanding of multi-phase of Buck/Boost converter and LDO design principles, operating modes, and system integration careabouts.Solid understanding of 3D/2D EM simulation tools, electromagnetic modeling and transmission line theory is required.Skills with associated tools for 2.5D (PowerSI, SIWave, Sentinel-PI, nSys), 3D Full wave (HFSS, nWave), quasi-static tools (Q3D, nApex) is required.You'll need to show relevant understanding of HSPICE, Spectre, AMS, and Simplis models for system-level transient droop analysisDeep Experience in CPM (Chip-Power-Model) usage for system transient analysis is an added benefit.In this role, you will be expected to have understanding of die-package-board power delivery network co-design constraints and tradeoffs.M.S. with 5-7 years experience, or PhD (preferred) with minimum of 3-4 years experience-  Experience with Perl, Python or other scripting languages is desired. MatLab Experience is a plus-  Excellent documentation and communication skills, with an ability to work independently, a desire to mentor, and a demonstrated ability to innovate are required.-  Candidate will need demonstrated experience in driving initiatives that improved process, procedures, and result quality.", "jobDescription": "The Mac organization is looking for an outstanding Power Integrity engineer, to support the system-level Power Distribution Network (PDN) design, analysis, and validation aspects of Mac and Accessory products development. You should have deep knowledge of power delivery network design, analysis and validation methods. You will work with multi-functional teams to design and implement a power supply network solution, develop and validate impedance and droop targets, and verify the quality of the power supply using lab and in-situ silicon measurements!"}, "200451110": {"jobID": "200451110", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Wireless FW Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451110/wireless-fw-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree \n10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience with the development and deployment of automated test and continuous integration frameworksExperience in FW/SW white box testing including test plan design, implementation, documentation, and maintenanceProficient in scripting and debugging in any of the following: Python, Perl, TCL, C++, or equivalentStrong problem solving and debugging skills: analyze and investigate test failures, errors, and build issues, able to accurately drive issues to completion.Thrive in a collaborative environment and comfortable working with multi-functional teamExcellent communication skills - both oral and writtenUnderstanding of embedded SW fundamentals and low-level hardware interfaces.Understanding of wireless protocol and systems/MAC/PHY, and WiFi/BT Functional or Performance or Stability TestingBachelors Degree \n10 years of experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Wireless Connectivity Silicon team is looking for wireless FW test engineers to help ensure the quality of the innovative wireless silicon for application in Apple’s products!"}, "200459101": {"jobID": "200459101", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Product Design Validation Prototyper", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459101/product-design-validation-prototyper?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "H.S. Diploma and relevant hands-on work experience required. College degree or technical training are valued."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$38.94", "max": "$69.23/hr,"}, "benefits": null, "requirements": "Knowledge and experience using tools and equipment found in a prototyping lab (3D printers and post-processing, laser cutter, mill, lathe, hand tools, etc.)Self motivated and driven to complete projects quickly and efficientlyValues quality of work and attention to detail with strong problem solving and risk mitigation skillsStrong organizational skills, familiarity with shop safety and housekeeping standardsAbility to understand technical drawingsAbility to work independently as well as with multiple teamsStrong written and verbal communication skillsADDITIONAL DESIRED EXPERIENCE AND SKILLS (NOT REQUIRED TO APPLY):CNC setup and finishing processes, CAD/CAM experienceExperience with characterization tools (Instron, data acquisition systems, DIC)Experience with metrology equipment (CMM, OMM, laser scanners, etc.)Experience with inventory managementH.S. Diploma and relevant hands-on work experience required. College degree or technical training are valued.", "jobDescription": "Are you passionate about creating high quality engineering prototypes using a mix of additive manufacturing, traditional manufacturing and softgoods prototyping techniques? If so, the Product Design Validation team is searching for a prototyper who will be responsible for assisting in the creation of prototype hardware in an exciting and fast-paced fabrication workspace. The ideal candidate will have experience working in an organized and highly functional shop/lab, a knowledge of shop tools and fabrication techniques, and is experienced in a rapid prototyping environment."}, "200446055": {"jobID": "200446055", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "PLL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446055/pll-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with minimum 3+ years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Understand system level requirements to create overall PLL specifications.Create behavioral models of PLL to drive architectural decisions and derive block-level requirements for analog and digital blocks.Work closely with mask design team to implement layout view of designs.Complete top-level spice and mixed-mode simulations to validate top-level integration.Run pre-tapeout verification flows to confirm design meets performance, power, reliability and timing requirements.Define production/bench-level test plans for post-silicon characterization.Work with lab engineers in taking lab measurements to validate IP.Review ATE and lab test results to resolve yield issues and drive bug fixes.Work with system teams in system bringup and debug.Hold design reviews of blocks with peers/management to show design meets spec targets and requirements.BSEE with minimum 3+ years of industry experience", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially talented PLL Designer.  As a member of our multifaceted group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every day\n\nApple Silicon Engineering is seeking qualified PLL designers to work on the next generation PLLs for Apple’s world-leading systems-on-chip (SOCs). You will be part of a growing analog/mixed-signal team involved in design and productization on leading-edge CMOS process technology nodes."}, "200458051": {"jobID": "200458051", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Sr. Wireless Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458051/sr-wireless-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Wireless/Wired communication block/system verification experience.Advanced knowledge of SystemVerilog and DV methodology.Solid verification skills in problem solving, constrained random testing, and debugging.Verification experience of one or more of the following: MAC, PHY, DMA, timer, AMBA bus and fabric, encryption/decryption engine.Knowledge of wireless protocols such as Bluetooth, WLAN, or Zigbee a plus.Experience with SystemVerilog Assertion (SVA) a plus.Should be a great teammate with excellent communication skills and the desire to take on diverse challenges.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nAs a Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of communication subsystem including MAC, PHY, and interfaces. With deep understanding of communication systems and protocols, you will interact with DV methodologists, designers and communication systems engineers to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification."}, "200458054": {"jobID": "200458054", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Sr. Wireless Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458054/sr-wireless-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Wireless/Wired communication block/system verification experience.Advanced knowledge of SystemVerilog and DV methodology.Solid verification skills in problem solving, constrained random testing, and debugging.Verification experience of one or more of the following: MAC, PHY, DMA, timer, AMBA bus and fabric, encryption/decryption engine.Knowledge of wireless protocols such as Bluetooth, WLAN, or Zigbee a plus.Experience with SystemVerilog Assertion (SVA) a plus.Should be a great teammate with excellent communication skills and the desire to take on diverse challenges.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nAs a Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of communication subsystem including MAC, PHY, and interfaces. With deep understanding of communication systems and protocols, you will interact with DV methodologists, designers and communication systems engineers to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification."}, "200464199": {"jobID": "200464199", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "CAD Engineer – Analog/RF Simulation Flow & Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464199/cad-engineer-analog-rf-simulation-flow-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 3 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong expertise in circuit simulations with Analog/RFIC design and/or related CAD/automation support areas involving various technology nodes and tape out.Expertise with Cadence ADE environment including knowledge of Schematic Editor, PDK, CDF, Callbacks, Netlisting, Analog Design Environment (ADE-L/XL/GXL/Maestro), OCEANProficient in Spice simulators, including Spectre, Spectre RF, AFS (BDA), Hspice, ADS, GoldenGate, AMS Designer, XA, Hsim, and FineSim.Strong ability to solve simulation accuracy, speed and capacity issues. Knowledge of AC, DC, Tran, Harmonic Balance, S-parameters, Periodic noise, PSS simulations.Expertise in device level SOA checks, ERC asserts, statistical simulations using Monte Carlo, PVT and Reliability/aging analysis involving Self-Heating is a plus.Experience in evaluating simulation and environment related CAD tool/product applications and driving EDA vendors to meet design requirements.Understand custom IC designs, and knowledge of Post-layout DSPF/SPF extraction. Knowledge of behavioral RTL/AMS circuits, experience in Verilog- A/AMS. Knowledge of PDK and spice models qualification.Efficient programming skills in SKILL language, Python, Perl, TCL, or Shell. Ability to provide automations for rapid and dynamic design needs. Knowledge in Perforce and/or regressions is preferred.Good written and verbal communication skills, and the ability to collaborate well with multi-functional teams and external vendors.Minimum requirement of BS + 3 years of relevant industry experience.", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nAs a member of our CAD team, you will architect, develop, maintain and enhance simulation methodology and solutions for our Analog, RF and mixed-signal designs. \n\nThe role requires working with different technology nodes and provide flows/methodologies for the different tool sets. Working in a small CAD team, you will be collaborating with the analog, mixed-signal, and RF circuit design teams. The role will also involve partnering with layout design, technology, and 3rd party EDA tool vendors to drive and coordinate effort of developing and validating simulation flows, enhancing custom design environment, validating checks and doing results analysis."}, "200268418": {"jobID": "200268418", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "PCB Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200268418/pcb-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$88,100", "max": "$186,600,"}, "benefits": null, "requirements": "Typically requires a minimum of 6+ years of related experienceExperience with Cadence, Allegro preferred.", "jobDescription": "Our Engineering PCB Services org takes pride in supporting board designs for Electrical Engineering teams at Apple. We are seeking a dynamic, motivated individual with deep understanding of printed circuit board design (PCB), high speed design environments, and the ability to receive guidance from our design engineers to build complex boards. We believe in technology enablement by collaboration and building extraordinary products at Apple.\n\nCollaborating with engineers and design teams in the design and development of complex, detailed layouts of rigid and flexible printed circuit boards using CAE and CAD applications and tools. You would work with multiple design teams to plan schedules, resolve costs, packaging, manufacturing, and electrical design issues. Dedicated in implementing new PCB technologies and processes."}, "200451281": {"jobID": "200451281", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "ESD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451281/esd-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS\n10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "The ideal candidate should have the following qualifications -Deep understanding of transistor device characteristicsSolid understanding of models used for testing ESD, including HBM, CDM, MM and IEC-61000-4-2Knowledge of state-of-the-art ESD circuit design techniques and topologiesHands-on experience with design/layout EDA tools, including Virtuoso, Calibre, Allegro, etc.Knowledge of ESD checking tools like PERC and PathfinderExperience with Si processes used for high voltage, RF, or advanced ASICsExperience with ESD/LUP test and characterization equipmentStrong initiative, teamwork, and ownership of responsibilities, productive, able to meet bold deadlinesExcellent written and verbal communication skillsBS\n10 years of experience", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. In this highly visible role, you will take ownership of the ESD and Latch-Up requirements of all ICs developed by and for Apple. Your mission is to ensure the silicon is designed to meet Apple's ESD specifications and manufacturing requirements. The role involves working closely with diverse teams within Apple as well as external vendors. Occasional travel might be required.\n\nDo you love working on challenges that no one has solved yet? Are you excited to build Apple’s products that strive for the highest expectations of quality, innovation and efficiency? We have an opportunity for an especially innovative ESD Designer with strong fundamentals! We are looking forward to having you join our fast growing team and help us deliver on these challenges while enjoying an amazing culture where you lead your career!"}, "200458849": {"jobID": "200458849", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Motion Editor, Content Design, Apple TV", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458849/motion-editor-content-design-apple-tv?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Degree in BS/BA Graphic Design or Visual Communication or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$134,000", "max": "$252,000,"}, "benefits": null, "requirements": "Hands-on crafting of narrative short form assets in non-linear editing platforms (Adobe Premiere, Final Cut Pro)Working knowledge of motion graphics software (such as After Effects, Photoshop) such that you can adapt existing projectsKnowledge of online / offline production workflows & conform of proxy to full-resolution footage, video compression and color managementCraft short-form narrative-driven video assets often without script or copy guidanceCompose and deliver repurposed footage in a variety of non-standard aspect ratiosIterate and creatively explore alternate versions based on feedback from multiple stakeholders to address the needs of multiple teams and usesBe resourceful, have an entrepreneurial mindset with the ability to self-manage and organize workloads around tight deadlinesDemand excellence and demonstrate deep passion for creating content and audience-centric experiencesCollaborate well in a cross-functional design team environmentHave experience developing work for a variety of platforms and use cases, and is used to thinking how those impact myriad devices, experiences and scenariosHave excitement collaborating with other creativesDegree in BS/BA Graphic Design or Visual Communication or equivalent work experience.History of work showing a range of editorial work across different medium and delivery formats 10+ years in editorial / post-production with a focus in entertainment (studio, agency or freelance) Has passion about the Apple brand and steadfast in preserving its authenticity", "jobDescription": "Imagine what you could make at Apple. Phenomenal ideas have a way of becoming innovative products, services, and customer experiences. Bring passion and dedication to your job and there's no telling what you could accomplish. The Media Content Design team conceptualizes, designs and creates the content experience for some of Apple’s most visible products. Apple TV Content Design is looking for a Motion Editor to bring our Sports programming to life on platform in innovative, compelling and visually stunning ways. Your work can impact the way people consume media products, what they look and feel like and how they’re used by millions of people across the world!"}, "200448955": {"jobID": "200448955", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "CPU RTL Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448955/cpu-rtl-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceThorough knowledge of microprocessor architecture including expertise in one or more of the following areas: instruction fetch and decode, branch prediction, instruction scheduling and register renaming, out-of-order execution, integer and floating point execution, load/store execution, cache and memory subsystemsKnowledge of Verilog and/or VHDL. Experience with simulators and waveform debugging toolsKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture techniquesUnderstanding of high performance techniques and trade-offs in a CPU microarchitectureExperience in C or C++ programmingExperience using an interpretive language such as Perl or PythonMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) is hiring dedicated engineers for CPU architecture and microarchitecture development targeted for low power mobile devices."}, "200455396": {"jobID": "200455396", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455396/cpu-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.In-depth knowledge of digital logic design, chip architecture and microarchitectureExperience with developing testplans/testbenches, C-based transactors, and writing/debugging assembly-based testsExperience with advanced verification techniques such as formal and assertions a plusExperience in silicon bringup a plusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200451257": {"jobID": "200451257", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451257/cpu-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.In-depth knowledge of digital logic design, chip architecture and microarchitectureExperience with developing testplans/testbenches, C-based transactors, and writing/debugging assembly-based testsExperience with advanced verification techniques such as formal and assertions a plusExperience in silicon bringup a plusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200455384": {"jobID": "200455384", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455384/cpu-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BSIn-depth academic knowledge of digital logic design, chip architecture and microarchitectureSolid programming knowledge in C/C++Internships or other academic project experience in hardware verification and/or designShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200458542": {"jobID": "200458542", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "ASIC Design Engineer - Pixel IP", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458542/asic-design-engineer-pixel-ip?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree + 10 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in IP/SoC front-end ASIC RTL digital logic design using Verilog and System Verilog.Extensive shown experience in ASIC implementation, especially logic synthesis, static timing analysis, logic equivalence checking, and working with physical design teams for floorplanning and timing closure.Deep experience with system design methodologies that contain multiple clock domains.Practiced in low-power design issues, tools, and methodologies including UPF power intent specification.Familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB).Industry exposure to and knowledge of ASIC/FPGA design methodology including familiarity with relevant scripting languages (Python, Perl, TCL).Tight-knit collaboration skills with excellent written and verbal communication skills.Extensive experience working multi-functionally with integration, design, and verification teams to specify, design, and debug digital systems.Bachelors Degree + 10 Years of Experience", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly transparent role, you will be at the center of the Pixel IP design effort to assemble and display breathtaking images and video. You will collaborate with all teams, making a critical impact getting functional products to millions of customers quickly."}, "200451465": {"jobID": "200451465", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Custom Circuits Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451465/custom-circuits-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "DV skills including, but not limited to, random verification process, functional coverage, code coverage, assertion methodology & philosophy.Knowledge of Verilog/System Verilog, digital simulation and debug tools.At least one scripting language, such as Perl or Python.Knowledge of behavioral and structural RTL coding especially as it pertains to SRAM, register file, and other custom circuit designs. Plus knowledge of FPGA and emulation challenges related to RTL coding and verification is desirable.Knowledge of industry standard design tools, such as ESPCV and/or LEC.Knowledge of regression and revision control tools.DFT (ATPG/MBIST) knowledge is desirable.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Does making the next great technology product excite you? At Apple, we work every single day to craft products that enrich peopleʼs lives. Our new ideas have a way of becoming great products, services, and customer experiences very quickly. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Appleʼs premier SoCs that make their way into Apple products. We are looking for a Design Verification Engineer who will enable bug-free first silicon for all the Digital custom IPs we deliver to the many SoCs that Apple produces."}, "200452496": {"jobID": "200452496", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "GPU Top Level Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452496/gpu-top-level-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep experience with all aspects of ASIC integration including Floorplanning, Clock and Power distribution, global signal planning, I/O planning and hard IP integration.Deep knowledge of GPU issues such as multiple voltage and clock domains, ESD strategies, mixed signal block integration, and package interactions.Familiar with hierarchical design approach, top-down design, budgeting, timing, and physical convergence.Depth of expertise on integrating IP from both internal and external vendors and able to specify and drive IP requirements in the physical domain.Experience with large subsystem designs (>20M gates) with frequencies in excess of 1GHz applying brand new technologies.Familiar with various process related design issues including design for yield and manufacturability, multi Vt strategies and thermal Mgt.Experience in technical project leadership and generating results that have had impact on project completion and objectives.Track record of applying creative thinking to strategically solve problems that have impact for a project, group, or organization.Consistent track record in solving complex PD and multi-functional problems, driving results directly and/or leading a team of engineers to innovate and execute on extraordinary GPU designs.From a CAD tool perspective, experience with floorplanning tools, P&R flows, timing verification and physical design verification flows is required.We are looking for candidates with a minimum of BS + 10 years of relevant experience.", "jobDescription": "Do you love creating sophisticated solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient GPU! You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions. Joining this group means crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices. This role requires a mix of strategic engineering along with hands-on, technical work, being responsible for implementing complete chip design from netlist to tapeout and having hands-on experience in physical design and large chip integration."}, "200459141": {"jobID": "200459141", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Emulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459141/emulation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience with Verilog, VHDL designExperience with Design Verification and System Verilog, UVM, and C/C++ verification environmentsCandidate should have emulation experience on available platforms, Palladium, Veloce, or Zebu, including compilation, debug, performance and throughput tuning.Experience writing scripts using Perl, Python, Makefile Experience with waveform debug tools, Verdi/SimVisionStrong communication skills and ability to work as a team.Bachelor's degree and a minimum of 10 years relevant industry experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.  \nAre you passionate about changing the world ? We have a critical impact on getting high quality functional products to millions of customers quickly. We are looking for you to join our emulation team focusing on the creation, deployment, and support of advanced emulation environments. In this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines."}, "200459702": {"jobID": "200459702", "origin_search": null, "posted": "", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459702/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Summerlin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200365616": {"jobID": "200365616", "origin_search": null, "posted": "Nov 11, 2022", "jobTitle": "Watch Touch HW - Sensing Design and Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200365616/watch-touch-hw-sensing-design-and-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MSc +4 years or PhD + 1 year industry experience in Electrical Engineering work."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Multi-disciplinary understanding of EE, ME, and Physics principlesStrong EE fundamentals and experience with analog/mixed signal designProven working proficiency in algorithms development / signal processing as applied to sensor systemsProficiency in MATLAB, SPICE, or similar simulation and modeling / scripting toolsExcellent written and verbal communication skills along with collaboration and leadership skillsFamiliarity with mechanical design principles, FEA, and advanced materials is a plusProficiency in COMSOL, Maxwell, or similar FEA tools is a plusAnalog circuit design experience requiredExperience with scripting languages (MATLAB, Python etc.) requiredKnowledge of electrical, thermal, and mechanical systems is preferredExperience with high volume mass production is a plusMSc +4 years or PhD + 1 year industry experience in Electrical Engineering work.", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200449239": {"jobID": "200449239", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Maintenance Manager - Real Estate & Development", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449239/maintenance-manager-real-estate-development?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Some college or technical training coursework required; Bachelors preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum 5 years of work experience in facilities/property management, commercial real estate or professional services industries preferredProven ability to plan and prioritize task in a self-directed work environment while maintaining high levels of efficiencySkilled understanding of mechanical, electrical, and plumbing concepts in around central utility plantsHighly skilled in oral and written communication, customer service, and customer satisfactionRelevant knowledge of local and state building and safety regulationsSkilled understanding in the use of computer tools such as Computer Maintenance Management Systems (CMMS), efficiency software, e-mail, and databasesFamiliarity with macros and iOS platformAble to quickly adapt to new concepts, processes and toolsSome college or technical training coursework required; Bachelors preferred", "jobDescription": "Do you love working in a complex, global, interdependent environment? Do you have a passion for developing real estate strategy? As part of our Real Estate and Development group, you’ll have a meaningful role in transforming spaces into our corporate offices, stores, and product development centers. You’ll also help locate, develop, and manage these properties around the world. You and your group will travel the world in search of groundbreaking new and sustainable materials. You’ll be an integral part of ensuring that Apple’s continued growth is sustainable and successful worldwide. Our goal is to ensure those workplaces also run smoothly, so everyone at Apple can focus on what they do best. Join us, and together, we’ll make it possible for Apple’s physical spaces to reflect the same simplicity and beauty as our products.\n\nAs a member of the Real Estate & Development team, you will operate as a true partner to local business units, Global Security, IS&T, and other functional areas. You thrive in operating on both the strategic and tactical levels, simultaneously acting as an internal ambassador, educator, analyst, solutions architect, and implementer. Having passion and in-depth knowledge of central plant and infrastructure daily operations. Your experience in developing and implementing maintenance programs is also key to the role."}, "200452743": {"jobID": "200452743", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "SoC 3rd Party IP Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452743/soc-3rd-party-ip-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proven experience working with Analog and/or Digital IP integration in ASIC/SOC/VLSI Designs or similar experienceExperience in Technical Program or Project Management, or Functional ManagementGood knowledge of the IP development process, tools/flows and methodologies, and the life-cycle in a SOCGood knowledge of the steps involved in planning silicon validation of the IPStrong team player and creative thinker who can lead technical teams, cross-functional groups, and vendors to meet aggressive development schedulesGreat leadership and communication skills (Executive communication)Experience working in a dynamic engineering environment, strong at multi-tasking and real-time crisis managementFamiliarity with project management tools (Confluence, JIRA)BS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple product!\n\nAs a 3rd Party IP Program Manager within the Hardware Technology Engineering organization, you will be responsible for ensuring that 3rd party IP's meet the technical, quality, and schedule requirements for Apple products. This role will focus on cross-functional communication working directly with Apple engineering teams, operations, legal, and 3rd party vendors to coordinate releases and drive, track, and resolve issues associated with 3rd party IP development, design integration and silicon validation of the IP. Strong technical background in analog and/or digital IP development and experience with silicon validation of these IPs will allow you to succeed in this role. A successful candidate for a Engineering Program Manager at Apple has project management experience in VLSI Chip Design, ASIC Chip Design, and/or IP management."}, "200458775": {"jobID": "200458775", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "CAD Engineer - AMS Simulation Flow and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458775/cad-engineer-ams-simulation-flow-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to use industry-standard mixed-signal simulation tools, including Cadence - Xcelium (Incisive), SimVision, AMS Designer; Synopsys - VCS, Verdi; Mentor – Symphony, QuestaExperience with AMS simulation techniques, including discipline resolution, binding, IE setup, Connect Modules, AMSD block, wreal, TCL probes, real number modeling, UDNs, etc.Exposure to industry-standard analog simulation tools, including Cadence Spectre, Synopsys CustomSim/PrimeSim (XA)/HSPICE/Finesim, Mentor AFSAbility to problem solve simulation issuesUnderstanding of behavioral and functional circuit description languages, including SystemVerilog, VerilogA, Verilog, Verilog-AMS, VHDLUnderstanding of custom IC transistor-level description formats, SPICE, DSPF, etc., and functional modelingProgramming skills, preferably in one or more of the following languages: Perl, Python, TCL, SKILL, and ShellGood written and verbal communication skills, and the ability to collaborate well with cross-functional teamsMinimum requirements of BS degree + 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chips (SoCs). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAs a member of our CAD team, you will architect, develop, maintain and enhance AMS (Analog/Mixed-Signal) simulation methodology and solutions for our analog, RF, and mixed-signal designs. The role requires you to work with different technology nodes and provide flows/methodologies for the different tool sets. You will be collaborating closely with design teams. You will drive and coordinate efforts to develop and validate AMS/co-simulation flows, providing ease of use, speeding up design validation, and ensuring functional silicon."}, "200451444": {"jobID": "200451444", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Top Level Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451444/cpu-top-level-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.You should have experience in verification methodology.Verification tool and verification development experience.Strong assembly and CPU architecture knowledge.Strong in C, C++, Verilog, and scripting languages.You should be a collaborative teammate with excellent interpersonal skills and be able to work independently.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nAs a CPU Top-Level Verification Engineer, you will be responsible for developing test infrastructure and triaging CPU failures in our validation environment."}, "200458572": {"jobID": "200458572", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Training Instructional Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458572/training-instructional-designer?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree or equivalent required; Master's or higher degree in a related field a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum 2 years of instructional systems design experience on projects involving adult learning audiences.Training development experience involving adult learners, such as in a call center or customer service environment.Superb written and verbal communication skills and proficiency writing instructional content.Experience analyzing, building, and assessing curricula for asynchronous and synchronous classroom-based or virtual training environments.Fluency with instructional systems design models and methodologies, authoring tools, and learning management systems integration.Experience as a solo or lead content developer on instructional systems design projects related to adult learners.Proven proficiency with Apple operating systems, such as macOS, iOS, iPadOS.Exposure to Web authoring and multimedia tools, such as basic HTML, Dreamweaver, and Pixelmator Pro.Experience creating learning content for global audiences is a plus.Experience with project management is a plus.Proficiency Apple software applications including Pages and Keynote is a plus.Experience in a call center or customer service environment is a plus.Bachelor’s Degree or equivalent required; Master's or higher degree in a related field a plus.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nAre you passionate about workplace learning and training development? Can you quickly and optimally resolve learning needs and create instructionally-sound synchronous and asynchronous training materials to meet those needs? If so, keep reading. The AppleCare Training Instructional Designer works with business partners to identify training needs and create instructor-led, virtual, and self-paced training using cutting-edge technology and innovative solutions."}, "200466004": {"jobID": "200466004", "origin_search": null, "posted": "Feb 25, 2023", "jobTitle": "Analog Design Lead - Power Management", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466004/analog-design-lead-power-management?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS+10 Years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "We are looking for applicants with 10+ years of demonstrated ability of developing leading power management integrated solutions implemented in silicon for the mobile market with the following experience:BS+10 Years of relevant industry experience, advanced degree preferred.Expertise in power topologies such as buck, boost, buck-boost, charge pumps, LDOs.Deep understanding of control architectures such as current mode, voltage mode, and hysteretic mode for applications include DC/DC converters, LED drivers, battery management circuits, LDOs, temperature sensors.Strong understanding of semiconductor device physics, device safe-operating area (SOA), and power transistors used for high frequency switching. Solid understanding of DC/DC power converter modeling techniques using any of the following simulation tools such as MATLAB, Simplis, PSIM, or Spectre.Understanding of Analog IC circuit design as it relates to power conversion architecture requirements, design tools and methodologies. Circuit blocks include bandgap references, op amps, OTAs, bias circuits, comparators, oscillators, DACs, ADCs, level- shifters, switching power stages, LDOs, charge pumps, glue logic. Key parameters include voltage and current accuracy, load and line transient response, DC gain, bandwidth, phase and gain margin, slew rate, efficiency, offset, PSRR, CMRR, noise, propagation delay, input and output common mode range, supply headroom.Experience working in a team environment on mixed signal ICs that integrate power management circuits, ADCs, DACs, and digital state machines is strongly preferred with proven industry- leading design expertise required.Experience taking projects from the concept phase, through chip architecture, writing electrical specifications, process technology selection, die size estimation, managing schedules, IC design, layout supervision, layout extraction and verification, DRCs, LVS, LVL, mask and wafer fabrication monitoring, ATE lab correlation, corner lot characterization analysis, hands-on lab evaluation, release to production, yield improvement, and failure analysis support.Knowledge of board level considerations, including component selection, PCB layout, packaging technologies and thermal analysis.Knowledge of IC process technologies, reliability design rules, ESD and latch-up testing.Knowledge about industrial standards and practices in appropriate technologies.Design management experience with multi-functional preferred.BS+10 Years of relevant industry experienceSome Travel Required", "jobDescription": "Can you influence, connect, get results and communicate effectively? We have an extraordinary opportunity for senior level engineers to drive and lead technical engagements between Apple and silicon and IP suppliers working on groundbreaking technologies! The Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, iPod, and AppleTV. Apple is looking for a remarkable Power Management Analog Design Lead to work with multi-functional teams and external vendors to define, develop and productize the next generation of mobile power solutions."}, "200455387": {"jobID": "200455387", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455387/cpu-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.In-depth knowledge of digital logic design, chip architecture and microarchitectureExperience with developing testplans/testbenches, C-based transactors, and writing/debugging assembly-based testsExperience with advanced verification techniques such as formal and assertions a plusExperience in silicon bringup a plusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200456642": {"jobID": "200456642", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "ASIC Design Engineer - Pixel IP", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456642/asic-design-engineer-pixel-ip?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree +10 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Deep experience in media, video, pixel, or display designs.Extensive experience in SoC front-end ASIC RTL digital logic design using Verilog and System Verilog.Practiced in low-power design techniques such as clock- and power-gating.Extensive experience working multi-functionally with architecture, design, and verification teams to specify, design, and debug designs.Tight-knit collaboration skills with excellent written and verbal communication skills.Familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB).Experience in front-end implementation tasks such as synthesis, timing, area/power analysis, linting, and logic equivalence checks.Industry exposure to and knowledge of ASIC design methodology including familiarity with relevant scripting languages (Python, Perl, TCL).Bachelor's degree +10 Years of Experience", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, and power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly visible role, you will be at the center of the Pixel IP design effort to gather and display alluring images and video. You will collaborate with all fields, making a critical impact getting functional products to millions of customers quickly."}, "200463928": {"jobID": "200463928", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Emulation Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463928/emulation-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven experience with bring up, debugging and verification in EmulationUnderstanding of the tool flow from RTL to Emulation is a big plusGood understanding of any Standard Emulator (Palladium, Veloce, Zebu) or FPGA (Xilinx, Altera) flowProven design verification skillsExperience in writing Synthesizable SystemVerilog/Verilog code and SystemVerilog assertionsExperience with System Verilog verification environments including C/C++ DPI, UVMExperience on any Scripting (Perl/Python/TCL)Excellent analytical and debug skillsExcellent oral and written English skillsExperience in UVM Acceleration is plusBS and 10+ years of relevant industry experience required.", "jobDescription": "Imagine what you could do at Apple! New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Dynamic, inquisitive people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. We have a critical impact on getting high quality functional products to millions of customers quickly.\n\nWe are looking for you to join our emulation team focusing on the creation, deployment, and support of sophisticated emulation environments, while being at the center of a chip design effort collaborating with multiple fields.\n\nAre you ready to help us deliver the next groundbreaking Apple products?"}, "200461005": {"jobID": "200461005", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "CPU Microprocessor Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461005/cpu-microprocessor-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceShould possess direct CPU RTL experienceThorough knowledge of microprocessor architecture including expertise in one or more of the following areas: instruction fetch and decode, branch prediction, instruction scheduling and register renaming, out-of-order execution, integer and floating point execution, load/store execution, cache and memory subsystemsExpert in using Verilog and/or VHDL. Experience with simulators and waveform debugging toolsExpert in logic design principles along with timing and power implicationsMust have deep understanding of high performance and low power techniques and trade-offs in a CPU microarchitectureExperience in working with cross-disciplinary teams to define CPU microarchitecture featuresExperience in C or C++ programming is a plusExperience using an interpretive language such as Perl or PythonMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nApple’s Silicon Engineering Group (SEG) designs high-performance, low power microprocessors that power our innovative products! We are looking to hire talented engineers who are experienced in CPU architecture and microarchitecture to develop our world-class CPU designs. Join us to help deliver the next groundbreaking Apple product!"}, "200461003": {"jobID": "200461003", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "CPU Microprocessor Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461003/cpu-microprocessor-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceShould possess direct CPU RTL experienceThorough knowledge of microprocessor architecture including expertise in one or more of the following areas: instruction fetch and decode, branch prediction, instruction scheduling and register renaming, out-of-order execution, integer and floating-point execution, load/store execution, cache and memory subsystemsKnowledge of Verilog and/or VHDL. Experience with simulators and waveform debugging toolsKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture techniquesUnderstanding of high-performance techniques and trade-offs in a CPU microarchitectureExperience in C or C++ programming is a plusExperience using an interpretive language such as Perl or PythonMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nApple’s Silicon Engineering Group (SEG) designs high-performance, low power microprocessors that power our innovative products! We are looking to hire talented engineers who are experienced in CPU architecture and microarchitecture to develop our world-class CPU designs. Join us to help deliver the next groundbreaking Apple product!"}, "200458821": {"jobID": "200458821", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Product Designer, Sports", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458821/product-designer-sports?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "BFA, BA, MA, or MS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Comfortable crafting mobile, desktop, and tv applicationsExpert knowledge of user-centered design principlesProven proficiency with Sketch, Photoshop, or other design toolsSkilled in Prototyping experiencesExtraordinary written and verbal communication skillsExcellent collaborative skillsCapable of working in a loosely-structured organizationHighly professional, deliver high-quality work efficientlyBFA, BA, MA, or MS", "jobDescription": "Apple’s TV App Design team is seeking a Sr. Product Designer to work on software applications. You are a problem solver, quick study, self starter, and excellent communicator with a passion for extraordinary design and the ability to achieve it. You possess a blend of interaction design, visual design, and prototyping skills. You understand the importance of accessibility and crafting inclusive products. We’ll provide you with levels of opportunity and resources, with the goal of crafting experiences that influence the industry, as well as people’s lives. By constantly focusing on the consumer, you’ll build products and features that are not only amazing to look at, but also intuitive and useful to billions of people worldwide. \n\nJoin this team if you’re committed to making each human interaction — visual, audial, and haptic — amazing for our customers!"}, "200462221": {"jobID": "200462221", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Software QA Engineer, Safari & WebKit", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462221/software-qa-engineer-safari-webkit?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science, or related field, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$76,000", "max": "$146,900"}, "benefits": null, "requirements": "Ability to investigate, debug and triage problems and independently work towards results.Ability to think creatively with a strong attention to detail.Knowledge of Python or other scripting languages.Familiarity in test automation.At ease and adaptable in a dynamic and informal environment.Highly organized, creative, motivated, and passionate about achieving results.Excellent written and verbal communication skills are needed to facilitate close interaction with development teams, management, and other organizations within Apple.BS in Computer Science, or related field, or equivalent.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The Safari and WebKit team is looking for a QA Engineer to help deliver the next generation Safari browser to customers on both iOS and macOS. We're looking for critical thinkers to play a key role qualifying Safari software releases and ensuring a high-quality customer experience. We need someone who is comfortable working in an exciting environment with rapidly changing priorities, and someone creative and inspired to invent new ways to help build better products."}, "200318300": {"jobID": "200318300", "origin_search": null, "posted": "Oct 25, 2022", "jobTitle": "Display Silicon Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200318300/display-silicon-applications-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE + 5 years of experience working in EE, silicon, or FPGA design or applications"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Working knowledge of digital logic design and architectureExperience with high speed serial interface test and measurementUnderstanding of digital communication interfaces: I2C, SPIExperience with use of test and measurements equipment including oscilloscopes, multimeters, logic and protocol analyzers.Experience with failure analysis and debug of highly integrated (millions of gates) digital designsAbility to develop automation scripts using Python or similar languageBSEE + 5 years of experience working in EE, silicon, or FPGA design or applications", "jobDescription": "The display silicon applications team develops a deep understanding of the performance and capabilities of our portfolio of custom silicon to enable new display features, capabilities and products as well as prototypes of new display technologies. The team plays a critical role in resolving silicon architecture and design issues and contributes to the definition and architecture of next generation custom silicon design for future products. Resourcefulness, collaboration skills, and taking a methodical approach are key attributes for the display silicon applications team."}, "200458782": {"jobID": "200458782", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "CAD Engineer - AMS Simulation Flow and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458782/cad-engineer-ams-simulation-flow-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proficient in using industry-standard mixed-signal simulation tools, such as Cadence - Xcelium (Incisive), SimVision, AMS Designer; Synopsys - VCS, Verdi; Mentor – Symphony, QuestaFamiliarity with industry-standard analog simulation tools, including Cadence Spectre, Synopsys CustomSim/PrimeSim (XA)/HSPICE/Finesim, Mentor AFSThe ability to solve simulation accuracy, speed, and capacity issuesExperience with AMS techniques, including disres, binding, IE setup, Connect Modules, AMSD block, wreal, TCL probes, real number modeling, UDNs, etc.Strong understanding of behavioral and functional circuit description languages, including SystemVerilog, VerilogA, Verilog, Verilog-AMS, VHDLUnderstanding of custom IC designs and transistor description formats, SPICE, DSPF, etc., and functional modelingAdvanced programming skills, mainly in Perl, Python, TCL, SKILL, and ShellKnowledge of Schematic Editors, PDK, CDF, Callbacks, netlistingExperience with Virtuoso Analog Design Environment (ADE-Explorer/Assembler/L/XL/GXL) is desirableExcellent written and verbal communication skills, project planning capabilities, and collaboration with cross-functional teamsMinimum requirements of BS degree + 10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chips (SoCs). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nAs a member of our CAD team, you will architect, develop, maintain and enhance AMS (Analog/Mixed-Signal) simulation methodology and solutions for our analog, RF, and mixed-signal designs. The role requires you to work with different technology nodes and provide flows/methodologies for the different tool sets. You will be collaborating closely with design teams. You will drive and coordinate efforts to develop and validate AMS/co-simulation flows, providing ease of use, speeding up design validation, and ensuring functional silicon."}, "200299120": {"jobID": "200299120", "origin_search": null, "posted": "Oct 12, 2021", "jobTitle": "Optical Engineer - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200299120/optical-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Graduate degree in Optics, Physics, Electrical Engineering, Mechanical Engineering, Material Science, Manufacturing, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You will have 5+ years experience in the area of lens design, metrology and integration.Experience in lens design, tolerance analysisYou have done stray light analysisYou will know lens characterization methodology and instrumentationProficiency with ZEMAX, CODE V, FRED, LightTool, etc.Ability to perform comprehensive optical and image quality characterization of the lens and the camera moduleSupport metrology methodology for camera lens testing and develop appropriate test charts and methods for camera evaluationInterface with the assembly and packaging groups to support integration of camera lens into moduleGraduate degree in Optics, Physics, Electrical Engineering, Mechanical Engineering, Material Science, Manufacturing, or equivalent work experienceWorking knowledge of thin film physics and fabrication Track record of imaging related innovations Working knowledge of optomechanics Must be high energy, multi-tasker, resourceful problem solver, ability to work under pressure, take initiative", "jobDescription": "Why Apple?\n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\nThe Camera Hardware Engineering group is responsible for all research, design, development, test, and qualification of camera hardware for Apple products. The team is looking for an Optical Engineer to work on advanced optical technology development."}, "200451438": {"jobID": "200451438", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Cache Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451438/cpu-cache-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.The ideal candidate should have industry experience with CPU verificationIn-depth knowledge of digital logic design, processor and cache architecture and microarchitectureKnowledge of the multiprocessor coherency and memory orderingExpertise in developing test plans, test benches, C-based transactors, and writing/debugging assembly based testsExperience with advanced verification techniques such as formal and assertionsExperience in silicon bringup a plusShould be a great teammate with excellent interpersonal skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200451279": {"jobID": "200451279", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "ESD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451279/esd-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS\nMinimum 10 years of experience\n\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate should have the following qualificationsDeep understanding of transistor device characteristicsSolid understanding of models used for testing ESD, including HBM, CDM, MM and IEC-61000-4-2Knowledge of state-of-the-art ESD circuit design techniques and topologiesHands-on experience with design/layout EDA tools, including Virtuoso, Calibre, Allegro, etc.Knowledge of ESD checking tools like PERC and PathfinderExperience with Si processes used for high voltage, RF, or advanced ASICsExperience with ESD/LUP test and characterization equipmentStrong initiative, collaboration, and ownership of responsibilities, productive, able to meet bold deadlinesExcellent written and verbal communication skillsBS\nMinimum 10 years of experience\n\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. In this highly visible role, you will take ownership of the ESD and Latch-Up requirements of all ICs developed by and for Apple. Your mission is to ensure the silicon is designed to meet Apple's ESD specifications and manufacturing requirements. The role involves working closely with diverse teams within Apple as well as external vendors. Occasional travel might be required.\n\nDo you love working on challenges that no one has solved yet? Are you excited to build Apple’s products that strive for the highest expectations of quality, innovation and efficiency? We have an opportunity for an especially innovative ESD Designer with strong fundamentals! We are looking forward to having you join our fast growing team and help us deliver on these challenges while enjoying an amazing culture where you lead your career!"}, "200465292": {"jobID": "200465292", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465292/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Garden State Plaza", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200465311": {"jobID": "200465311", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465311/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Staten Island", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$38.90", "max": "$58.65/hr,"}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200444374": {"jobID": "200444374", "origin_search": null, "posted": "Nov 18, 2022", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444374/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Topanga", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$36.15", "max": "$54.20/hr,"}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200466200": {"jobID": "200466200", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466200/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Station Park", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200455844": {"jobID": "200455844", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Top-Level Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455844/cpu-top-level-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Minimum BSThe ideal candidate should have following qualifications:Computer ArchitectureRTL developmentVerilog or SystemVerilogProgramming/scripting skills (C, C++, Python)Problem solving skillsMinimum BS", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!"}, "200459973": {"jobID": "200459973", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Signal and Power Integrity Engineer (SI/PI)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459973/signal-and-power-integrity-engineer-si-pi?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in EE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "5+ years of industry experiences. Solid EE fundamentals and excellent problem solving skills.In-depth knowledge in electrical signaling of common high-speed and low-speed I/O interfaces. Protocol level familiarity is a plus.Strong background in power integrity modeling, simulation, and lab correlation. Familiarity with DC-DC regulator design principles, modeling, and troubleshooting.Proficiency in SI/PI simulation tools such as Cadence/Sigrity, ADS/Spice, Ansys HFSS, CST, etc.  Strong programming background is a plus.Hands-on experience in hardware characterization, validation, and failure analysis with lab equipment such as VNA, TDR, Oscilloscope, spectrum analyzer, etc. Compliance testing experience  on SerDes links is a plus.BS/MS/PhD in EE or equivalent", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it!\n\nWe are seeking a mid to senior level signal and power integrity (SI/PI) engineer with outstanding track record in supporting both architectural exploration and product development. An ideal candidate should be highly skilled in all major aspects of SI/PI, including high speed links (e.g. PCIe, USB, DP, MIPI, etc.), low speed buses (e.g. SPMI, SPI, I2C, I2S, SoundWire, etc.), and system power delivery network (PDN) analysis. The engineer will play an integral role in developing innovative technologies and new products."}, "200464200": {"jobID": "200464200", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "CAD Engineer – Analog/RF Simulation Flow & Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464200/cad-engineer-analog-rf-simulation-flow-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 3 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Strong expertise in circuit simulations with Analog/RFIC design and/or related CAD/automation support areas involving various technology nodes and tape out.Expertise with Cadence ADE environment including knowledge of Schematic Editor, PDK, CDF, Callbacks, Netlisting, Analog Design Environment (ADE-L/XL/GXL/Maestro), OCEANProficient in Spice simulators, including Spectre, Spectre RF, AFS (BDA), Hspice, ADS, GoldenGate, AMS Designer, XA, Hsim, and FineSim.Strong ability to solve simulation accuracy, speed and capacity issues. Knowledge of AC, DC, Tran, Harmonic Balance, S-parameters, Periodic noise, PSS simulations.Expertise in device level SOA checks, ERC asserts, statistical simulations using Monte Carlo, PVT and Reliability/aging analysis involving Self-Heating is a plus.Experience in evaluating simulation and environment related CAD tool/product applications and driving EDA vendors to meet design requirements.Understand custom IC designs, and knowledge of Post-layout DSPF/SPF extraction. Knowledge of behavioral RTL/AMS circuits, experience in Verilog- A/AMS. Knowledge of PDK and spice models qualification.Efficient programming skills in SKILL language, Python, Perl, TCL, or Shell. Ability to provide automations for rapid and dynamic design needs. Knowledge in Perforce and/or regressions is preferred.Good written and verbal communication skills, and the ability to collaborate well with multi-functional teams and external vendors.Minimum requirement of BS + 3 years of relevant industry experience.", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nAs a member of our CAD team, you will architect, develop, maintain and enhance simulation methodology and solutions for our Analog, RF and mixed-signal designs. \n\nThe role requires working with different technology nodes and provide flows/methodologies for the different tool sets. Working in a small CAD team, you will be collaborating with the analog, mixed-signal, and RF circuit design teams. The role will also involve partnering with layout design, technology, and 3rd party EDA tool vendors to drive and coordinate effort of developing and validating simulation flows, enhancing custom design environment, validating checks and doing results analysis."}, "200455847": {"jobID": "200455847", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Top-Level Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455847/cpu-top-level-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceThe ideal candidate should have experience in the following areas:Verification tool and verification development experienceTestbench setup and build experienceRandom regression and failure analysisDriving coverage convergenceVerilog or SystemVerilogProgramming/scripting skills (C, C++, Python)Problem solving skillsMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with many disciplines, with a critical impact on getting high quality products to millions of customers quickly."}, "200460858": {"jobID": "200460858", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Physical Design Methodology and CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460858/physical-design-methodology-and-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Demonstrated depth and experience in CAD flow or PD Methodology developmentProficiency with Tcl, Python or Perl scripting languagesExpert knowledge of industry standard PNR toolsDeep understanding and experience in analysis aspects of Physical Design - extraction, timing, noise, physical verification, EMIRHands on experience with high performance and low power implementation flowsExperience using or supporting signoff tools for design closureBe able to drive tool/flow improvements independently, present findings to broad audienceExperience with chip level design is a plus: floorplanning, pin assign, feed through insertion, custom clock, high speed bus, pad ring, assemblyMinimum requirements of BS degree + 10 years of industry experience", "jobDescription": "As part of the Hardware Technology CAD team, you’ll help design our next-generation, high-performance, power-efficient SoCs. You will work on world class CPU, GPU, Analog/Mixed Signal and SOC designs by developing flows, tools and methodologies for future Apple products. You will explore and enable new technology nodes, stdcells and tools for design teams. You will collaborate with design teams and tool vendors to improve PPA (Power, Performance, Area) and design productivity. You will actively work on developing internal methodologies using your understanding of CAD algorithms and ML\n\nWe are looking for passionate engineers to join our team. In this role, you will be impacting a wide range of chips used across Apple’s world-class products (iPhone, iPad, Mac, Apple Watch, Airpods…)!"}, "200455790": {"jobID": "200455790", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "US-Store Leader", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455790/us-store-leader?team=APPST", "jobLocation": {"remote": "not specified", "city": "Walden Galleria", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive positive customer experiences that build loyalty and deliver measurable results.Ability to manage separate business groups within a complex environment.Strong communication skills to clearly impart the Apple vision to the teams you oversee.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome — a retail background is not necessary.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You'll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Would you love to work in a complex and ever-changing work environment?  As more and more people discover Apple, they visit our stores seeking ways to incorporate our products into their lives. It’s your job, as a Store Leader, to build and manage the various teams that engage customers in this dynamic environment. In this role, you lead the people that help customers achieve ownership, learn new skills, get technical support, and find business solutions. Adaptable and flexible by nature, you’re composed and collected as you balance the diverse needs of your teams in the midst of constant change. "}, "200435809": {"jobID": "200435809", "origin_search": null, "posted": "Oct 13, 2022", "jobTitle": "Cloud DevOps Engineer, Apple Pay", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435809/cloud-devops-engineer-apple-pay?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or Equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "6+ years of experience with Linux, UNIX, CoreOS, etc.Puppet, Ansible, Salt, Chef… Been there and done that. You know where each are strong and weak.Docker, Nomad, Kubernetes, Mesos, Swarm… Yup, you’ve orchestrated it all.The operating system is just one part of the ecosystem. You’re well versed in the rest (networking, storage, DBs, etc).Prometheus, Nagios, Sensu… observability is imperative to success.You know how to set direction and build consensus through vigorous debate.Ambiguity doesn’t scare you. You see it as an opportunity to define the future.You automate things rather than doing them twice.You’re a hands-on strategist.You can lead a project yourself.You’re an expert in the DevOps space, but don’t want to be limited to that space.Experience with HashiCorp stack - Nomad, Consul, Vault is a plus.BS/MS in Computer Science or Equivalent", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and memorable customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple Pay is transforming the industry in payments, transit and identity, and we’re passionately focusing on the customer’s digital wallet experience. Our scale and security demands create unique opportunities for innovative and creative solutions which contribute to millions of customer’s daily interactions."}, "200448246": {"jobID": "200448246", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Finance Project Lead, Services & Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448246/finance-project-lead-services-infrastructure?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree required or equivalent practical experience within accounting, finance, and general business processes"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$96,500", "max": "$145,000,"}, "benefits": null, "requirements": "Minimum of 5 years relevant experience.Experience and understanding of the full business cycle from customer purchase, procurement, and financial reporting.Experience in project management (PLC) and project documentation.Excellent written and verbal communication skills.Strong prioritization skills with ability to manage multiple projects simultaneously.Self-motivated, driven individual who is comfortable working in a global, high-pressure and rapidly evolving business environment.Ability to think strategically on critical business issues, and to simultaneously act tactically to execute against them.Strong team orientation and collaborative style. Flexible attitude and an ability to get involved in the details while maintaining a wider view.Excellent process management, planning and organizational skills. Resilient and determined to ensure projects and deliverables are achieved.Ability to challenge and debate issues of importance and to identify the best possible outcome for customers and partners.BS degree required or equivalent practical experience within accounting, finance, and general business processes", "jobDescription": "Imagine what you could do here. At Apple, our ideas have a way of becoming top selling products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nServices and Infrastructure Finance is looking for an experienced project lead to support global product development, new business opportunities, business and geographic expansions and other platform initiatives.\n\nThis role requires substantial cross-functional interaction with the S&I Finance team, Product Marketing, Engineering, Project Management, Shared Services (GBS), Global Finance Projects, Tax, Legal, Treasury and other corporate finance teams, and business counterparts in other parts of Apple."}, "200451536": {"jobID": "200451536", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451536/cpu-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceSolid electrical engineering fundamentals in digital circuits, timing/power concepts, and basics of logic designExperienced in using industry standard logic Synthesis, PnR, STA and Power analysis tools along with floor-planing, pin-placement and timing budgeting knowledgeFamiliar with programming and scripting (Perl, TCL) with strong fundamentalsAbility to work well in a team, self-motivated and excellent communication skillsMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level physical design."}, "200450227": {"jobID": "200450227", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Analog Layout Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450227/analog-layout-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Typically requires more than 8 years of experience in analog/mixed-signal layout design of deep sub-micron CMOS circuits.Experience implementing analog layouts to achieve tight matching, low noise, and low power consumption.  Layouts may include analog blocks, resistors, capacitors, pad IOs, ESD structures, etc.High level of proficiency in custom and standard cell based floor-planning and hierarchical layout assembly.Must understand techniques for managing IR drop, RC delay, electromigration, self-heating and coupling capacitance.Must recognize failure prone circuit and layout structures, have experience with analog and DFM best practices, and proactively work with circuit designer to identify the best approach to solving problems.High level proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc. reports.Knowledge of MENTOR GRAPHICS or CADENCE layout tools.Scripting skills in PERL or SKILL are considered a plus, but not required.Excellent communication skills and able to work with cross-functional teams.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "As a member of the layout team, you will be working on the latest technology nodes to create world-class custom analog designs. This is a fast-paced work environment with endless learning opportunities working on a multi-disciplinary team with members of design, integration, CAD and technology engineering."}, "200456718": {"jobID": "200456718", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Thermal Engineering Technician", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456718/thermal-engineering-technician?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "3+ years as a Support Technician or QA TechnicianA deep knowledge and passion for Apple’s ecosystemExperience troubleshooting and repairing Apple HW and SWShown ability to build and run test suites, file bugs and regressions, and communicate status.Experience with Python, shell scripting or other programming language.Attention to detail.Proven ability to influence at all levels, with outstanding oral and written communication.Ability to create clear documentation for test procedures.BA/BS degree or equivalent experience.", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you could accomplish!\n\nWe are looking for an experienced Thermal Engineering Technician to join our Thermal Product Design team. We hope to find candidates who have deep knowledge of Apple’s hardware and software products, technical problem-solving experience, and outstanding interpersonal skills, to partner with multi-functional teams to debug development hardware and software control systems."}, "200451783": {"jobID": "200451783", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed-Signal Behavioral Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451783/analog-mixed-signal-behavioral-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Deep knowledge of Verilog/SystemVerilog with ability to write synthesize-able and behavioral codeDeep knowledge of digital logic gates, clocking and state elementsDeep knowledge of HDL simulationDeep ability to read device level schematicsFamiliarity with software methods, algorithms and optimizationDeep understanding in writing scripts in PERL/PythonDeep understanding of passive circuit elements, nodal analysis and simple blocks like op-ampsWorking knowledge with SPICE simulation and logic equivalence tools is very helpfulWorking knowledge of MATLAB desirableDeep knowledge of systems such as PLLs/DLLs and SERDES blocks is a strong plusSome working knowledge of numerical probability and statistic is very helpfulBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an ambitious and extraordinarily hardworking Analog Modeling Engineer. As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and support millions of Apple’s customers every single day. \n\nIn this role, you will work within the analog mixed-signal design team to model complex custom circuits in order to verify system-level functionality and performance expertly. This is meaningful and rewarding cross-disciplinary position, with a high degree of collaboration and openness across multiple teams. This role will provide the opportunity to work on state of the art mixed-signal systems used in Apple’s world-leading SoCs."}, "200420860": {"jobID": "200420860", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "WiFi Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420860/wifi-quality-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "3+ years of experience in 802.11 protocols and/or Bluetooth3+ years of experience in SQA methodologies and practicesExperience in developing test strategies and executing it with automation or manual testingExperience in utilizing tools, including Wireless and Bluetooth packet sniffers and network protocol analyzers, to help resolve, root cause and provide debugging information to engineering teams.Thrive in a collaborative environment and comfortable working with multi-functional teams.Laser-focused on the smallest details that are meaningful to our customers.Ability to write automation and automate existing test cases to improve efficiency.Proficiency in Python and/or C/C++. Previous automation experience required.Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Join the Sensing and Connectivity team in driving the innovation and delivering seamless wireless connectivity and the best user experience to our customers. Our team works on an Apple eco-system of devices that delivers the best wireless connectivity experience.\nIf you are motivated, highly technical and passionate about WiFi, Bluetooth and Networking technologies, possess excellent problem solving and coding skills, this team can be your destination."}, "200169032": {"jobID": "200169032", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "Watch Touch HW-Senior Sensing Design and Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200169032/watch-touch-hw-senior-sensing-design-and-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. + 10 years or PhD + 3 years in Electrical Engineering, Physics or industry experience equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Multi-disciplinary understanding of EE, ME, and Physics principlesStrong EE fundamentals and experience with analog/mixed signal designProven working proficiency in algorithms development / signal processing as applied to sensor systemsProficiency in MATLAB, SPICE, or similar simulation and modeling / scripting toolsExcellent written and verbal communication skills along with collaboration and leadership skillsFamiliarity with mechanical design principles, FEA, and advanced materials is a plusProficiency in COMSOL, Maxwell, or similar FEA tools is a plusAnalog circuit design experience requiredExperience with scripting languages (MATLAB, Python etc.) requiredKnowledge of electrical, thermal, and mechanical systems is preferredExperience with high volume mass production is a plusM.S. + 10 years or PhD + 3 years in Electrical Engineering, Physics or industry experience equivalent", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200455850": {"jobID": "200455850", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Top-Level Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455850/cpu-top-level-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceThe ideal candidate should have experience in the following areas:Knowledge of digital logic design and processor architectureVerification tool and verification development experienceRandom test generator developmentTestbench setup and build experienceRandom regression and failure analysisDriving coverage convergenceVerilog or SystemVerilogProgramming/scripting skills (C, C++, Python)Problem solving skillsMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with many disciplines, with a critical impact on getting high quality products to millions of customers quickly."}, "200451223": {"jobID": "200451223", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Digital Layout Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451223/digital-layout-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "We are looking for applicants experience in custom layout design of deep SubMicron CMOS circuits used in high performance microprocessors.Experience designing low noise, low power datapaths, SRAM, Register files layout structures, etc.High level proficiency in layout floorplanning, standard cell planning and hierarchical layout assembly.Good understanding of issues with RC delay, electromigration, self heating and cross capacitance.Recognize failure prone circuit and layout structures, dedicatedly work with designers for the best approach to problems.Excellent communication skills and able to work with multi-functional teams.Great skills on interpretation of CALIBRE DRC, ERC, LVS, etc. reports.Knowledge of MENTOR GRAPHICS or CADENCE layout tools.Scripting skills in CSH, PERL or SKILL are considered a plus, but not required.Experience in layout automation is considered a plus, but not required.Experience in memory compiler development is considered a plus, but not required.BS and a minimum of 3 years relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions?\n\nAs part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned.\n\nYou will be part of an exciting silicon design group that is responsible for designing pioneering ASICs. We have an extraordinary opportunity for Digital Layout Designers!\n\nIn this highly visible role, you will be a member of Apple’s custom layout team, working on the latest technology nodes to create extraordinary custom digital macros, libraries, etc. This is a fast paced work environment with endless learning opportunities working in the design team with members of integration, CAD, circuit and technology engineering."}, "200451463": {"jobID": "200451463", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Digital Layout Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451463/digital-layout-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for applicants experience in custom layout design of deep SubMicron CMOS circuits used in high performance microprocessors.Experience designing low noise, low power datapaths, SRAM, Register files layout structures, etc.High level proficiency in layout floorplanning, standard cell planning and hierarchical layout assembly.Good understanding of issues with RC delay, electromigration, self heating and cross capacitance.Recognize failure prone circuit and layout structures, dedicatedly work with designers for the best approach to problems.Great skills on interpretation of CALIBRE DRC, ERC, LVS, etc. reports.Knowledge of MENTOR GRAPHICS or CADENCE layout tools.Scripting skills in CSH, PERL or SKILL are considered a plus, but not required.Experience in layout automation is considered a plus, but not required.Experience in memory compiler development is considered a plus, but not required.Excellent communication skills and able to work with multi-functional teams.BS and a minimum of 3 years of relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions?\nAs part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned.\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Digital Layout Designers! In this highly visible role, you will be a member of Apple’s custom layout team, working on the latest technology nodes to create extraordinary custom digital macros, libraries, etc. This is a fast paced work environment with endless learning opportunities working in the design team with members of integration, CAD, circuit and technology engineering."}, "200461960": {"jobID": "200461960", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Digital Layout Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461960/digital-layout-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "8+ year minimum professional service related experience required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for applicants experience in custom layout design of deep SubMicron CMOS circuits used in high performance microprocessors.Experience designing low noise, low power datapaths, SRAM, Register files layout structures, etc.High level proficiency in layout floorplanning, standard cell planning and hierarchical layout assembly.Good understanding of issues with RC delay, electromigration, self heating and cross capacitance.Recognize failure prone circuit and layout structures, dedicatedly work with designers for the best approach to problems.Great skills on interpretation of CALIBRE DRC, ERC, LVS, etc. reports.Knowledge of MENTOR GRAPHICS or CADENCE layout tools.Scripting skills in CSH, PERL or SKILL are considered a plus, but not required.Experience in layout automation is considered a plus, but not required.Experience in memory compiler development is considered a plus, but not required.Excellent communication skills and able to work with multi-functional teams.8+ year minimum professional service related experience requiredApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions?\nAs part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned.\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Digital Layout Designers! In this highly visible role, you will be a member of Apple’s custom layout team, working on the latest technology nodes to create extraordinary custom digital macros, libraries, etc. This is a fast paced work environment with endless learning opportunities working in the design team with members of integration, CAD, circuit and technology engineering."}}