{"200465897": {"jobID": "200465897", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465897/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Mall of Georgia", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200449453": {"jobID": "200449453", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Graphics Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449453/graphics-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "The ideal candidate will have minimum 10 years of relevant experience including:Experience developing test plans and testbenches for advanced hardware designsExperience driving verification effort from specification to tapeoutExperience with SystemVerilog or expertise in object-oriented languages such as C++Expertise in common verification methodologies such as UVM or OVMExperience with HDL simulators and waveform viewersExperience with Python, Ruby or Perl; developing tools for workflow automationExperience working under strict schedule deadlines with the ability to manage multiple prioritiesExcellent communication skills and ability to collaborateBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nThe Graphics Design Verification Engineer will be responsible for the unit level pre-silicon RTL verification of embedded graphics IP. This includes developing a deep understanding of the micro-architectural details of relevant units and the greater GPU design. A strong computer architecture background, and solid software skills are key attributes to contributing to the Graphics IP verification effort. Exposure to graphics concepts is a plus but not required."}, "200455240": {"jobID": "200455240", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "SRAM Layout Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455240/sram-layout-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$142,000", "max": "$248,000,"}, "benefits": null, "requirements": "We are looking for applicants with years of hands-on experience in custom layout design of deep SubMicron CMOS circuits used in high performance microprocessors.Proven experience in developing, driving, and implementing layout methodologies.Proven experience managing and mentoring a small team.Strong influence and negotiation skills.Excellent interpersonal skills and able to work with multi-functional teams.Experience designing low noise, low power data paths, standard cells and large memory blocks.Experience in layout automation is considered a plus, but not required.Experience in memory compiler development is considered a plus, but not required.High-level proficiency in layout floor planning, standard cell planning and hierarchical layout assembly.Ability to recognize failure prone circuit and layout structures and actively work with circuit designers for the best approach to resolve problems.Ability to estimate the design work for an assignment.Scripting skills in CSH, PERL or SKILL are preferred.Ability to understand issues of RC delay, IR, electro migration, cross and self-heating.BS and a minimum of 10 years of relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Hardware Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned. You will be part of an exciting silicon design group that is responsible for designing pioneering ASICs. We have an extraordinary opportunity for SRAM Layout Manager! In this highly visible role, you will be leading a team of Apple employees and contractors working on the latest technology nodes to create extraordinary custom digital macros, libraries, etc. This is a fast paced work environment with endless learning opportunities working in the design team with members of integration, CAD, circuit and technology engineering."}, "200460990": {"jobID": "200460990", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Apple Watch HW EPS", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460990/apple-watch-hw-eps?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree preferred, but NOT required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "Experience managing, organizing and maintaining large quantities of dataDetail oriented accuracyExcellent communication (written and verbal)Proficient in Excel/Numbers/Keynote/Quip/iCal/AgileUnparalleled multi tasking abilitiesTop notch critical thinking skill-setAbility to react to resets and changes in a time sensitive environmentStrong interpersonal skills and ability to work with a large cross-functional teamBA/BS degree preferred, but NOT requiredApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Apple's Engineering Program Management Team is looking for a resourceful, inclusive HW Engineering Project Specialist (EPS) to assist with BOMs, budgets, and Material Management in support of our WATCH EE design group. The preferred candidate is a fearless organizer! Someone who can prioritize issues and track details to handle the risks associated with NPI SMT builds."}, "200456620": {"jobID": "200456620", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "ASIC Design Engineer - Pixel IP", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456620/asic-design-engineer-pixel-ip?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree +3 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Prefer previous experience in media, video, pixel, or display designs.Experience in SoC front-end ASIC RTL digital logic design using Verilog or System Verilog.Experience working multi-functionally with architecture, design, and verification teams to specify, design, and debug designs.Good collaboration skills with strong written and verbal communication skills.Prefer familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB).Familiarity with low-power design techniques such as clock- and power-gating is a plus.Experience in front-end implementation tasks such as synthesis, timing, area/power analysis, linting, and logic equivalence checks.Industry exposure to and knowledge of ASIC/FPGA design methodology including familiarity with relevant scripting languages (Python, Perl, TCL).Bachelor's degree +3 Years of Experience", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, and power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly visible role, you will be at the center of the Pixel IP design effort to gather and display alluring images and video. You will collaborate with all fields, making a critical impact getting functional products to millions of customers quickly."}, "200456330": {"jobID": "200456330", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "ASIC Design Engineer - Pixel IP", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456330/asic-design-engineer-pixel-ip?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree +0 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Knowledge of front-end ASIC RTL digital logic design using Verilog or System Verilog.Strong problems-solving skills using finite state machines, pipelining, parallelism, and similar computer-architecture fundamentals.Good collaboration skills with excellent written and verbal communication skills.Prefer familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB).Knowledge of front-end implementation tasks such as synthesis and timing/area/power analysis.Prefer familiarity with relevant scripting languages (Python, Perl, TCL).Bachelor's degree +0 Years of Experience", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, and power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly visible role, you will be at the center of the Pixel IP design effort to gather and display alluring images and video. You will collaborate with all fields, making a critical impact getting functional products to millions of customers quickly."}, "200464196": {"jobID": "200464196", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "CAD Engineer – Analog/RF Simulation Flow & Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464196/cad-engineer-analog-rf-simulation-flow-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 10 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong expertise in circuit simulations with Analog/RFIC design and/or related CAD/automation support areas involving various technology nodes and tape out.Expertise with Cadence ADE environment including knowledge of Schematic Editor, PDK, CDF, Callbacks, Netlisting, Analog Design Environment (ADE-L/XL/GXL/Maestro), OCEANProficient in Spice simulators, including Spectre, Spectre RF, AFS (BDA), Hspice, ADS, GoldenGate, AMS Designer, XA, Hsim, and FineSim.Strong ability to solve simulation accuracy, speed and capacity issues. Knowledge of AC, DC, Tran, Harmonic Balance, S-parameters, Periodic noise, PSS simulations.Expertise in device level SOA checks, ERC asserts, statistical simulations using Monte Carlo, PVT and Reliability/aging analysis involving Self-Heating is a plus.Experience in evaluating simulation and environment related CAD tool/product applications and driving EDA vendors to meet design requirements.Understand custom IC designs, and knowledge of Post-layout DSPF/SPF extraction. Knowledge of behavioral RTL/AMS circuits, experience in Verilog- A/AMS. Knowledge of PDK and spice models qualification.Efficient programming skills in SKILL language, Python, Perl, TCL, or Shell. Ability to provide automations for rapid and dynamic design needs. Knowledge in Perforce and/or regressions is preferred.Good written and verbal communication skills, and the ability to collaborate well with multi-functional teams and external vendors.Minimum requirement of BS + 10 years of relevant industry experience.", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nAs a member of our CAD team, you will architect, develop, maintain and enhance simulation methodology and solutions for our Analog, RF and mixed-signal designs. \n\nThe role requires working with different technology nodes and provide flows/methodologies for the different tool sets. Working in a small CAD team, you will be collaborating with the analog, mixed-signal, and RF circuit design teams. The role will also involve partnering with layout design, technology, and 3rd party EDA tool vendors to drive and coordinate effort of developing and validating simulation flows, enhancing custom design environment, validating checks and doing results analysis."}, "200452007": {"jobID": "200452007", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CAD Custom EM/IR Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452007/cad-custom-em-ir-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "We are counting on your expertise in developing EM and IR related flows and automation for better accuracy and efficient runs.Experience in usage of EMIR analysis tools and knowledgeable on their working principles and methods, including hierarchical AOT (Analog-on-Top) analysis.Familiar with custom design environment and flows, such as schematic/layout design, simulation, extraction, physical verification and timing analysis.Experience in supporting design teams with ramping the work environment, correct settings and reliable runs.You can work directly with the tool vendors, and drive them to resolve tools bugs as well as implement required improvements.We expect experience in exploring and defining new technology nodes settings, and working with various technology and foundry teams on the actual node limits.Your communication skills are excellent, and like the rest of us at Apple you love working in an open and multi-cultural environment.Minimum requirements of BS degree + 10 years of industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products very quickly. Do you want to bring passion and dedication to your job? There's no telling what you could accomplish at Apple.\n\nThe people who work here have reinvented entire industries with Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices - we continue to strengthen our commitment to leave the world better than we found it!\n\nAs a key member of our best-in-class CAD Group, you will be part of building innovative designs. We will apply your hands-on experience in power EM/IR analysis to define, develop and refine the methodologies and flows which enable transistor-level as well as gate level analysis. Major tasks will include functional static / dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, SigEM, power switch modeling, design abstraction and reuse for EM/IR purposes, IP / SoC level EMIR sign-off / ECO, and much more.\n\nAre you ready to join some of the world's leading engineers, and help us deliver the next generation of ground-breaking Apple products?"}, "200322849": {"jobID": "200322849", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Hardware System Integration Engineer - AirPods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200322849/hardware-system-integration-engineer-airpods?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS/PHD EE.  2+ years in wearable or consumer electronics industry experiences desirable"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong working experience with PCB/flex development work flow.  Successful candidates have the ability to stay organized, execute to a timeline, and deliver high quality designs.Great EE fundamentals and analog design knowledge (circuit design, SPICE sims). This means you have a deep understanding of why our discipline works the way it does; you've developed an intuition and can apply it to new topics because you understand the basics.Hands-on experience in prototype bring-up, debugging and functional verificationPractical knowledge with various communication protocols (especially USB, SPI, I2C and UART)Technical expertise in the following areas is especially desirable: DC/DC power design, wireless technologies integration,  audio system design and measurement, sensor design & integrationUnderstanding challenges in low power embedded systems is extremely beneficial.  Every µA is sacred.Experience in designing high volume products from beginning to end and dealing with contract manufacturers is a huge bonus.BS/MS/PHD EE.  2+ years in wearable or consumer electronics industry experiences desirable", "jobDescription": "At Apple, new ideas have a way of quickly becoming extraordinary products, services, and customer experiences. Sound is an essential and compelling facet of the customer experience so Apple is assembling a world-class team of engineers who obsesses over the delivery of products that enables our customers to experience music with delight and communicate with clarity.\n\nThe AirPod System Integration team is looking for Electrical Engineers who can own and deliver electronic solutions that elevate audio experiences to the highest standards.  This is a unique position allowing ownership of all things \"EE\" about a product, from architecture to component selection, schematic capture and board layout to validation and manufacturing.  The small form factor of these products challenges us to innovate in all aspects of our responsibilities; everything from advanced physical architecture (SiP) to highly power-optimized IC development.  \n\nCollaboration across teams is a key component of success at Apple. The right candidate will thrive in that type of environment.  This person will interact with a wide variety of teams including: acoustics, mechanical engineering, industrial design, EMC, reliability, operations and various SW / QA organizations.\n\nSome international travel is required, as our teams go on-site for prototype build support. It is one of the most exciting aspects of the job."}, "200458638": {"jobID": "200458638", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Semi-Custom Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458638/semi-custom-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Significant Physical Design experience on mixed-signal and/or SOC designs-  Deep knowledge of industry standards and practices in Physical Design, including physically aware synthesis, Floor-planning, and Place & Route-  Deep knowledge or experience with digital signal processing filters design, analog-on-top mixed signal physical and timing interface implementation techniques, and a passion to pursue out-of-the-box physical implementation techniques to achieve uncompromised design goals-  Validated experience in developing and implementing Power-grid and efficient Clock Distribution Networks-  Significant understanding of all aspects of physical construction, Integration, Design-For-Test (DFT), and Physical Verification-  Confirmed knowledge of Basic SoC Architecture and HDL languages like Verilog to be able to collaborate with logic design teams for timing fixes. Power user of industry standard Synthesis, Physical Design, Timing & Power Analysis tools-  Deep understanding of scripting languages such as Perl/Tcl-  Deep understanding and knowledge of STA methodology, constraints, and tools-  Solid understanding of Physical Design Verification methodology to debug LVS/DRC issues at block levelBachelors of Science in Electrical Engineering and 10+ years experience preferred", "jobDescription": "At Apple, we work constantly to craft products that enrich people’s lives. Do you like changing the game and working on challenges that no one has solved yet? We have an opportunity for a forward-thinking and unusually hardworking Semi-Custom Physical Design Engineer! As a member of our dynamic group, you will have the rare and opening to craft upcoming products that will delight and encourage millions of Apple’s customers every single day!\n\nAs a part of the Analog Mixed Signal (AMS) team you will collaborate with architecture, Circuits, CAD, timing and logic design teams, with a critical impact on delivering outstanding Semi-Custom Physical Designs. You will be required to deliver semi-custom high speed and ultra-low power physical designs of innovative mixed-signal designs."}, "200442469": {"jobID": "200442469", "origin_search": null, "posted": "Nov 10, 2022", "jobTitle": "Camera Process Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442469/camera-process-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience working with semiconductor, sensors, actuators, MEMS, System in Package, laser, LED and Camera Module.Knowledge in the following areas is a plus:-  Semi-additive process (SAP), electrochemical machining (ECM)-  Frontend technique such as sputtering, plating, photolithography, etching-  Assembly manufacturing processes-  Roll to roll process-  Transfer from development to mass development, and high volume manufacturing,Strong collaboration skill to work with diversified x-function teamProven ability to perform DOE, data analysis, and process capability controlDemonstrated failure mode analysis, root cause investigation, and problem solving for product yield and quality issue.Experienced working with subcontract manufacturing partners.Ability for International business travel to support project development, and support product manufacturing", "jobDescription": "Why Apple? \n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nAn extraordinary opportunity to be part of our Camera Process Engineering group, we are responsible to develop assembly processes, equipment and materials for cutting edge optical modules. Working closely in highly collaborated environment with different teams. New challenges arise every day that require the sharp problem-solving skills of individuals."}, "200305993": {"jobID": "200305993", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Silicon Validation Software Engineer: PCIe, USB and Thunderbolt", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200305993/silicon-validation-software-engineer-pcie-usb-and-thunderbolt?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / Ph.D. in EE or CS is required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Knowledge and skill in C/C++ programming is a requirementYou should be familiar with digital design, design verification, and silicon and analogcharacterizationExperience with assembly languages, and scripting languages is a plusExperience with using test equipment and analyzers is a plusKnowledge and experience with high speed interface (PCIE/USB/NAND) is a plusBS / MS / Ph.D. in EE or CS is required", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.\n\nWe have a critical impact on getting high quality functional products to millions of customers quickly and we are hiring all levels from junior to senior roles."}, "200451420": {"jobID": "200451420", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451420/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep knowledge of mixed signal conceptsDeep knowledge of RTL design fundamentalsDeep knowledge of Verilog and System-VerilogDeep knowledge of front-end tools (Verilog simulators, linters, clock-domain crossing checkers)Working knowledge of synthesis, static timing, DFT is a huge plusDeep knowledge of System-Verilog assertions, checkers, and other design verification techniquesDeep knowledge of scripting languages. Perl and Python are plussesDeep knowledge of Algorithm developmentsStrong communication and presentation skills SERDES knowledge is a plusBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and uncommonly hardworking RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nIn this role, you will have the opportunity to specify, design, and help in the verification and lab bring-up of advanced mixed-signal circuits (digital side)."}, "200451607": {"jobID": "200451607", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Memory Subsystem Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451607/memory-subsystem-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Experience with digital logic design, CPU and SOC architecture/micro-architecture and memory subsystem is preferredStrong programming (C/C++, Verilog, Scripting), software optimization, and performance improvement skillsExperience in unit and full chip level test benchesExperience in developing testplans, assertions, and developing stimulusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designExperience with emulation and developing synthesizable transactors is a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all subject areas, with a critical impact on getting functional products to millions of customers quickly."}, "200465519": {"jobID": "200465519", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Ergo Mechanical Product Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465519/ergo-mechanical-product-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelor of Science in Mechanical Engineering required\nMaster of Science preferred and/or PHD\nBS/MS/Minor in Biomechanics / Biomedical Engineering / Human Factors / Ergonomics is a bonus (not required, mostly looking for robust mechanical engineering experience)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "7+ years of hands-on, detailed product design experienceComfortable with non-linear mechanical problemsAdvanced in 3D CAD (any modeling package)Experience with optimizing structuresMastery of FEA principlesCross-functional prowess. Especially with background knowledge of the motivations of adjacent functions / modules. Ability to balance multiple constraints and lead multi-disciplinary teams towards a common goal. Always be closing.Practical experience working through DFM challenges with external vendorsWide knowledge of basic engineering materials and manufacturing processesConsumer electronics knowledge in these disciplines is a plus: industrial design, optics and lenses, cameras, sensors, displays, PCBs and flexes, silicon, antennas, batteries, thermalsExperience with dynamic protective equipment, prosthetics, wearables, comfort, energy absorption is recommendedExcellent communication skills (verbal and written) including emails, preparing slide presentations, and presenting technical concepts to multi-disciplinary teamsCreative problem solving, with experience in failure analysis, root cause investigation, and DOE creationDetail orientated and capable of handling multiple assignments at onceExperience collaborating with Asian manufacturing facilities, specifically in high-volume mass production is a plusBachelor of Science in Mechanical Engineering required\nMaster of Science preferred and/or PHD\nBS/MS/Minor in Biomechanics / Biomedical Engineering / Human Factors / Ergonomics is a bonus (not required, mostly looking for robust mechanical engineering experience)", "jobDescription": "Mac… iPod… iPhone… iPad… WATCH… what’s next? We are a team of passionate engineers who are designing, prototyping, analyzing, and eventually launching that next new product category at Apple!"}, "200458046": {"jobID": "200458046", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "AF/OIS Custom Silicon Drivers Lead/Architect - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458046/af-ois-custom-silicon-drivers-lead-architect-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Preferred MS, or Ph.D. in Electrical and Computer Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Complex analog/mixed signal IC development management experienceProven track of record with entire IC development all the way to large volume production ramp-up.You will have understanding of board level design/constraints.Understanding embedded FW/host SW interactionBroad range of engineering knowledge and/or expertise.Sharp problem-solving skills and critical thinking.Past experience of independence in designing complex systems.Strong understanding of EE fundamentals.Strong commitment to going above and beyond to get work done at the highest quality.Strong written and verbal communication and presentation skills.Experience with the development and analysis of experiments to root- cause challenging electrical problems.Experience in the fields of autofocus and optical stabilizations (AF/OIS) drivers, sensing and controls, voice coil motor (VCM) drivers, and optical sensing systems and silicon strongly desired.Preferred MS, or Ph.D. in Electrical and Computer Engineering", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in developing excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Camera Hardware Engineering group is responsible for the design, development, and innovation of camera hardware for all related Apple products. Our target is to deliver superior camera hardware to enable best-in-class camera user experience. We are looking for an enthusiastic, high energy individual who can help us with tomorrow’s challenges.  In this role, you will contribute to the development of next-generation camera hardware and drive integrated circuit development. You will work on custom silicon IC development lead and architect with in-depth understanding from system to chip architecture down to block level design details. You will have broad EE, fundamental physics and signal processing skills and offers a mixture of system architecture, chip level circuit design, board level circuit design."}, "200451437": {"jobID": "200451437", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Cache Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451437/cpu-cache-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.The ideal candidate should have industry experience with CPU verificationIn-depth knowledge of digital logic design, processor and cache architecture and microarchitectureKnowledge of the multiprocessor coherency and memory orderingExpertise in developing test plans, test benches, C-based transactors, and writing/debugging assembly based testsExperience with advanced verification techniques such as formal and assertionsExperience in silicon bringup a plusShould be a great teammate with excellent interpersonal skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200451610": {"jobID": "200451610", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Cache Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451610/cpu-cache-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.The ideal candidate should have industry experience with CPU verificationIn-depth knowledge of digital logic design, processor and cache architecture and microarchitectureKnowledge of the multiprocessor coherency and memory orderingExpertise in developing test plans, test benches, C-based transactors, and writing/debugging assembly based testsExperience with advanced verification techniques such as formal and assertionsExperience in silicon bringup a plusShould be a great teammate with excellent interpersonal skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200389038": {"jobID": "200389038", "origin_search": null, "posted": "Sep 9, 2022", "jobTitle": "Hardware, Hardware Products, Hardware Engineering Internship", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200389038/hardware-hardware-products-hardware-engineering-internship?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Pursuing a BS, MS, or Ph.D. in EE/CE/ECE."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You may meet or have interest in any one of the following qualifications:Computer system architecture, digital logic design and verification, and digital and analog circuit analysis, Analog ICChip design; microarchitecture of on-chip interconnection networksAntenna, cellular, wireless, OTA, RF Engineering, high-speed signals; wireless communication theory, RF circuit designCPU & GPU ArchitectureC, C++, Python, Perl, SQL, assembly, Mac OS X, PH, Obj-CVHDL, Verilog RTL, Digital Logic DesignMeasurement equipment: spectrum analyzers, network analyzers, oscilloscopeAbility to interpret schematics and have exposure to physical design and debugging of circuits via FPGA or PCBs.Excellent verbal and written interpersonal skills.Prior internship(s), group or personal project exposure, TA and/or work experiencePursuing a BS, MS, or Ph.D. in EE/CE/ECE.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unrivaled and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nApple is currently seeking enthusiastic EE major interns who can start work anytime between September, 2022 to September, 2023. The interns will support electrical & system design and integration of the iPod, iPhone, iPad, Watch and Mac computers. The applicants will assist in engineering processes that support the design, integration, implementation, testing, and qualification of various electrical sub-systems."}, "200451394": {"jobID": "200451394", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451394/wireless-systems-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Extensive experience with system design, integration, bringing up and productization of wireless communication systems.Deep understanding of communication theory and signal processing related algorithms (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, etc.)Proven experience, knowledge and skills on system bringup, integration, characterization and debug of real wireless silicon in a labExperience using and understanding of the theory of operation of lab equipment (spectrum analyzer, signal generator, power meter, etc.).Experience developing test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Knowledge in existing wireless communication protocols: LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE.Extensive experience with at least two of Matlab, Python, Shell scripting and/or C/C++Validated experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI, database, reporting tools)BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Wireless System Engineer. As a member of our wide-ranging group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nIn this highly technical role, you will be responsible for system integration, and characterization of state-of-the-art wireless SoC products, and own the development of the test infrastructure at the center of a silicon design group from conception to production."}, "200458495": {"jobID": "200458495", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC Physical Design Engineer, Electrical Analysis", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458495/soc-physical-design-engineer-electrical-analysis?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Solid background and knowledge on computer architecture and digital system, circuit design, and low power techniques.Hands-on experience with ASIC or AMS physical implementation and analysis flow.Possess scripting skills to automate and debug verification flows for digital VLSI design.You have knowledge with industrial EDA backend verification tools like Redhawk, PrimeRail or Voltus and PrimeTime and Tempus.Past experience with sign-off on successful chip tape-outs will help you succeed on our team.Circuit design background and SPICE experience are a plus.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nAs a Physical Electrical Analysis Engineer on our SoC team, you will be driving the electrical analysis and verification of an SoC."}, "200458591": {"jobID": "200458591", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC Physical Design Engineer, Electrical Analysis", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458591/soc-physical-design-engineer-electrical-analysis?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Solid background and knowledge on computer architecture and digital system, circuit design, and low power techniques.Hands-on experience with ASIC or AMS physical implementation and analysis flow.Possess scripting skills to automate and debug verification flows for digital VLSI design.You have knowledge with industrial EDA backend verification tools like Redhawk, PrimeRail or Voltus and PrimeTime and Tempus.Past experience with sign-off on successful chip tape-outs will help you succeed on our team.Circuit design background and SPICE experience are a plus.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nAs a Physical Electrical Analysis Engineer on our SoC team, you will be driving the electrical analysis and verification of an SoC."}, "114438148": {"jobID": "114438148", "origin_search": null, "posted": "Mar 6, 2023", "jobTitle": "US-Business Expert", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/114438148/us-business-expert?team=APPST", "jobLocation": {"remote": "not specified", "city": "Various Locations within United States", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Knowledge of how businesses use technology and what Apple solutions can offer them.Comfort using the phone to interact with customers and to position business solutions.Ability to facilitate business experiences through in-store briefings, workshops, and events.• You have at least one year of experience selling in the business market.• You’re comfortable developing qualified leads by phone.• You have strong people and presentation skills, and excellent written and verbal communication skills.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you love to collaborate and help businesses thrive?   At the Apple Store, you connect business professionals and entrepreneurs with the tools they need in order to put Apple solutions to work in their businesses. As a Business Expert, you help them learn about Apple products and explore various possibilities. You’re part of a team that’s passionate about helping businesses succeed. With your understanding of business needs and enthusiasm for Apple, you find great satisfaction in offering powerful, innovative solutions to each customer. "}, "200459710": {"jobID": "200459710", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Advanced Package Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459710/advanced-package-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Silicon fab interconnect process integration experience in BEoL process, RDL, fine pitch μ-bumps, hybrid bonds, TSVs, etc.Deep knowledge of electrical, mechanical and thermal properties of fab materialsStrong expertise in Si Fab equipment and Fab Logistics ManagementExperience on advanced packaging for groundbreaking CMOS nodesExpertise on Si structure yield and reliability mechanisms and analysesGood familiarity with electrical, mechanical and/or thermal characterization, failure analysisTool experience: One or more of TCAD, JMP, Virtuoso, KLayout, Ansys EDTCapable of independent R&D Work in a cross-functional team, driving vendorsExcellent communication skillsExperience in Si fab integration role and advanced packagingBS and 3+ years of relevant industry experience.", "jobDescription": "Imagine the pride of having your hardwork being in the hands of a billion people all over the world? That’s the pleasure we find here being able to work at Apple. A company that has consistently brought ground-breaking technologies to the average consumer and has enabled just about anybody to carry a high performance computer in their pocket. If you are motivated by crafting advanced technologies that improve lives everywhere and have unwavering focus on excellence in your craft, then we are looking for you! Bring your technology skills and self-motivation to your job here and be prepared for an adventure! This position will support Apple’s Advanced Packaging Program with responsibilities for package integration and technology development."}, "200459703": {"jobID": "200459703", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Advanced Package Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459703/advanced-package-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Silicon fab interconnect process integration experience in BEoL process, RDL, fine pitch μ-bumps, hybrid bonds, TSVs, etc.Deep knowledge of electrical, mechanical and thermal properties of fab materialsStrong expertise in Si Fab equipment and Fab Logistics ManagementExperience on advanced packaging for groundbreaking CMOS nodesExpertise on Si structure yield and reliability mechanisms and analysesGood familiarity with electrical, mechanical and/or thermal characterization, failure analysisTool experience: One or more of TCAD, JMP, Virtuoso, KLayout, Ansys EDTCapable of independent R&D Work in a cross-functional team, driving vendorsExcellent communication skillsExperience in Si fab integration role and advanced packagingBS and 3+ years of relevant industry experience.", "jobDescription": "Imagine the pride of having your hardwork being in the hands of a billion people all over the world? That’s the pleasure we find here being able to work at Apple. A company that has consistently brought ground-breaking technologies to the average consumer and has enabled just about anybody to carry a high performance computer in their pocket. If you are motivated by crafting advanced technologies that improve lives everywhere and have unwavering focus on excellence in your craft, then we are looking for you! Bring your technology skills and self-motivation to your job here and be prepared for an adventure! This position will support Apple’s Advanced Packaging Program with responsibilities for package integration and technology development."}, "200456257": {"jobID": "200456257", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "CAD Engineer - Custom Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456257/cad-engineer-custom-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid understanding of circuit design principlesStrong understanding of CAD flowsExperience in developing CMOS analog and mixed signal designs with emphasis on simulation, extraction, and layout.Experience with chip integrating and analog IP verification at the block and chip level is a plus.Proficiency in programming/scripting languages (Python and Perl)Strong verbal and written communications skillsMinimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on innovative designs. You’ll use your hands-on experience in Custom analysis to develop/define & refine the signoff methodologies for transistor level as well as gate level designs. The areas will include but are not limited to signoff of power and signal analysis, Power-intent verification, Formal verification, mixed-signal simulation, and signoff of IP for reuse.\n\nYou will contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibility also includes directly communicating with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200194358": {"jobID": "200194358", "origin_search": null, "posted": "Aug 9, 2022", "jobTitle": "Watch Touch HW- Senior Sensing Design & Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200194358/watch-touch-hw-senior-sensing-design-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. + 5 or PhD + 2 in Electrical Engineering, Mechanical Engineering, Physics or industry experience equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Multi-disciplinary understanding of EE, ME, and Physics principlesFamiliarity with mechanical design principles, FEA, and advanced materialsProven working proficiency in algorithms development / signal processing as applied to sensor systemsStrong EE fundamentals and experience with analog/mixed signal designFinite Element Analysis (FEA) experience. Proficiency in COMSOL, Maxwell, or similar FEA toolsProficiency in MATLAB, SPICE, or similar simulation and modeling / scripting toolsExcellent written and verbal communication skills along with collaboration and leadership skillsM.S. + 5 or PhD + 2 in Electrical Engineering, Mechanical Engineering, Physics or industry experience equivalent", "jobDescription": "The Sensor Technology team develops sensor solutions and technologies for Apple’s products, including the iPhone, iPad, Apple Watch, MacBooks, and more. The key goal of the Sensor Technology team is to enable the world’s best user-experience. New challenges arise every single day that require the sharp analytical skills of hardworking and talented individuals. We feature a collaborative and hands-on environment that cultivates engineering excellence, creativity, and innovation."}, "200451417": {"jobID": "200451417", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451417/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Deep knowledge of mixed signal concepts, along with relevant experience in logical/RTL designsDeep knowledge of Verilog and SystemVerilog and front-end tools (Verilog simulators, linters, clock-domain crossing checkers)Shown knowledge of synthesis, static timing, DFT, is a plusSome working experience with SystemVerilog assertions, checkers, and other design verification techniques are a plusPrefers to have some working knowledge of scripting languages such as Perl and PythonStrong communication and presentation skills, leadership and management skills are all plussesBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and extraordinarily hardworking RTL Design Engineer. As a member of our multifaceted group, you will have the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. \n\nIn this highly technical role, you will gain the opportunity to specify, design, and help in the verification and lab bring-up of sophisticated mixed-signal circuits (digital side)"}, "200451942": {"jobID": "200451942", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "RF PHY Test Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451942/rf-phy-test-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid verification skills in problem solving, constrained random testing, and debugging. Bring up and test wireless SoC, Perform system integration, characterization, and optimization.Work with different teams (Design, HW board teams and Firmware) within apple. Have proficiency with measurement automation tools and scripting languages such as Python and shell scripts.Experience with lab equipment such as network analyzer, spectrum analyzer, oscilloscopes, DMM’s etc.Knowledge of wireless protocols such as Bluetooth, WLAN, UWB or others Experience with MAC or PHY Verification is a plus.BS with 3+ years relevant experience required.Additional Requirements:Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with Phy, Mac, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200451937": {"jobID": "200451937", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RF PHY Test Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451937/rf-phy-test-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Solid verification skills in problem solving, constrained random testing, and debugging. Bring up and test wireless SoC, Perform system integration, characterization, and optimization.Work with different teams (Design, HW board teams and Firmware) within apple. Have proficiency with measurement automation tools and scripting languages such as Python and shell scripts.Experience with lab equipment such as network analyzer, spectrum analyzer, oscilloscopes, DMM’s etc.Knowledge of wireless protocols such as Bluetooth, WLAN, UWB or others Experience with MAC or PHY Verification is a plus.BS required.Additional Requirements:Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with Phy, Mac, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200441472": {"jobID": "200441472", "origin_search": null, "posted": "Nov 8, 2022", "jobTitle": "System Power Validation Engineer - Wireless", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441472/system-power-validation-engineer-wireless?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum Bachelor's degree in Computer Science or Electronic Engineering or related degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "3+ years hands on experience in wireless System Testing with focus on PowerHands on experience with high speed time series power measurement on early stage hardwareHands on experience in developing and validating test cases for mobile devices and cellular technologies (LTE/UMTS/CDMA/VoLTE) using popular test development platformsFamiliarity with modern cellular standards including LTE, and 5G NRFamiliarity of automation and scripting language/library such as Python3, Pandas or similarExcellent communication and interpersonal skillsMinimum Bachelor's degree in Computer Science or Electronic Engineering or related degree.", "jobDescription": "Are you passionate about making battery life phenomenal on devices that are used by millions of people? Do you enjoy measuring, analyzing and optimizing power? If this describes you, we would love to hear from you!\n\nIn role, you will be challenged to learn Apple’s latest features and technologies to ensure they ship with extraordinary battery life. You will get opportunity to work on latest Apple iPhone, AppleWatch, iPad etc. You will be responsible for bringing up new hardware to measure, analyze and tune cellular radio power in close collaboration with other experts in company to improve end user battery life!"}, "200461709": {"jobID": "200461709", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Software QA and Automation Engineer - Mail", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461709/software-qa-and-automation-engineer-mail?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science, or related field, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "2 or more years experience crafting, maintaining, and driving tests plans at all application layers2 or more years experience with blackbox testingStrong experience in using Python, Swift, shell scripting, version control systems, and other related tools /scripting languagesExperience in testing and automating APIs, UIs and Native ApplicationsProficient with bug tracking software like Bugzilla and JiraAdept at debugging, fixing, and critical thinkingExperience with multi-functional projectsA great teammate with the ability to act as a mentor and peer leaderBS in Computer Science, or related field, or equivalent.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Mail team is seeking an experienced and passionate engineer to find major problems in our software so our customers don't have to. Our team designs and engineers the iOS, macOS, and watchOS Mail application. We need someone who is comfortable working in an exciting environment with rapidly changing priorities and someone inspired to invent new ways to test, to find problems no one else could, and to build amazing products."}, "200451424": {"jobID": "200451424", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451424/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Extensive knowledge of mixed signal conceptsRelevant and proven experience of RTL design, Verilog and SystemVerilogDeep knowledge of front-end tools (Verilog simulators, linters, clock-domain crossing checkers)Validated experience with synthesis, static timing, DFT, is a plusProven knowledge of SystemVerilog assertions, checkers, and other design verification techniques are a plusKnowledge of scripting languages. Perl and Python are plussesStrong communication, collaboration  and presentation skillsBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and extraordinarily hardworking RTL Design Engineer. As a member of our multifaceted group, you will have the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. \n\nIn this highly technical role, you will get to specify, design, and help in the verification and lab bring-up of sophisticated mixed-signal circuits (digital side)"}, "200461979": {"jobID": "200461979", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "6G Cellular Platform Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461979/6g-cellular-platform-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "Minimum requirement of BS and 3+ years of relevant industry experience.\nMaster’s degree or PhD degree in Electrical Engineering or equivalent degree with at least 3-5 years of working experience is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "A deep understanding of real-world wireless systems, network architectures, user applications, and end-user device platform architectures (such as power delivery, processing, and memory systems) is required.Good programming skills are a plus.Proven record in several of the following areas related to wireless systems and prototypes:1.\tSetting and refining system requirements to build solutions for prototype design, sub-component design, and validation.2.\tCreation of system abstractions and simplifications that allow rapid validation of research hypotheses.3.\tApplying AI/ML techniques to specific problem statements for wireless communications or application systems.4.\tUnderstanding product and application layer architectures in conjunction with operational knowledge of wireless platforms, chipset architectures, or devices.Proven technical expertise in at least one of the following areas:1.\t5G NR and 3GPP standards or similar IEEE wireless standards.2.\tD2D communication system design.3.\tCellular and wireless networks.4.\tWireless modem design, product and platform architecture and prototyping;5.\tintegrated sensing and communication system design;6.\tchipset and computer architectures for wireless platforms (baseband and RF)Excellent communication and leadership skills. Experience in leading multi-disciplinary engineering investigations with technical expertise is highly desired.Minimum requirement of a BS and 3+ years of relevant industry experience.Minimum requirement of BS and 3+ years of relevant industry experience.\nMaster’s degree or PhD degree in Electrical Engineering or equivalent degree with at least 3-5 years of working experience is preferred.", "jobDescription": "Imagine what you can do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Inquisitive people and inspiring, innovative technologies are the norms here.\n\nDo you love working on challenges that no one has solved yet? Are you ready to be part of a team redefining wireless technology? Join us to help deliver the next groundbreaking Apple product!"}, "200459304": {"jobID": "200459304", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Senior Wireless RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459304/senior-wireless-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong fixed-point knowledge and extensive experience with bit-true verificationsUnderstanding of DSP communication algorithms and trade-offs between performance and complexityGood knowledge in modern design techniques and energy-efficient/low power logic designTrack record of bringing logic designs into mass production.Ability to work well in a team and be productive under aggressive schedulesExcellent communication skills and self-motivation/organizationExperience with FPGA and/or emulation platform desiredBS +10 years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}, "200448209": {"jobID": "200448209", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Graphics Cache Hierarchy Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448209/graphics-cache-hierarchy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 3 years of meaningful experience including:Experience developing unit or cluster level test environmentsExperience defining and executing unit level test plans. Expertise with verification languages such as SystemVerilogExperience with common verification methodologies such as UVM.Expertise with HDL simulators and waveform viewers.Experience defining coverage space, writing coverage and coverage closureExperience working under strict schedule deadlines with the ability to manage multiple prioritiesStrong fundamental software and programming skillsExperience with cache verification and memory subsystem testing highly desired. Graphics architecture a plus.Experience with Perl, Ruby, Shell scripting, Makefiles a plus.BS + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nThe Graphics Cache Hierarchy Verification Engineer will be responsible for the pre-silicon RTL verification of graphics memory subsystem units including Caches, Memory Management Unit, Interconnects and Link interface units. This includes deep understanding of the micro-architectural details of their block and how it works within the broader GPU design. A strong computer architecture background, and a solid foundation in verification methodology is required."}, "200449421": {"jobID": "200449421", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "CPU Silicon Validation Lead/Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449421/cpu-silicon-validation-lead-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience and management of CPU and ASIC design, validation and bring up.Working knowledge of CPU core architectureGood knowledge of design and verification processGood problem solving skillsExperience managing small/mid size design/validation teams.Experience working with multi-functional teams managing bring up effortsOutstanding oral and written communication skillsMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role, you will be at the center of a chip design effort that interfaces with many disciplines and has a critical impact on getting functional products to millions of customers quickly. You will be responsible for functional validation of CPU silicon including planning and execution. This involves execution of test plans, continuous development of test generation tools and management of triage/debug of silicon issues. The work includes coordinating and driving debug activities in conjunction with external teams. You will put together bring up status updates and presentations for cross-functional teams. This is a visible role where the candidate will be required to represent CPU silicon validation status and issues to senior management at a deeply technical level."}, "200457742": {"jobID": "200457742", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Tools and Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457742/tools-and-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Strong object-oriented programming experience preferably in Swift or Objective-CExperience in iOS or macOS development using XcodeExcellent troubleshooting skills with a passion for qualityExperience in writing automation tests at unit, API, UI, and non-UI levelsCollaborative and curious contributor with a proactive communication styleDemonstrated ability to lead projectsBS in Computer Science or equivalent experienceKnowledge of complex system level debugging and root cause analysisExperience working with CI systemsComfortable with rapid development release cycles and tight schedulesPassion for perfecting beautiful user interfaces and seamless user experiences", "jobDescription": "The Xcode team provides the tools to develop software for Apple’s innovative iOS, watchOS, tvOS and macOS platforms. Because tools are our products, software engineers on the Xcode team have the unique and rewarding opportunity to apply personal experience to enhance and augment the tools they use every day. The Xcode team is looking for a detail-oriented and focused Quality Engineer with the curiosity to find bugs and the initiative to get them fixed."}, "200447699": {"jobID": "200447699", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "GNSS Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447699/gnss-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and 10+ years of relevant industry experience\nMS with a focus on digital communication, signal processing and/or geomatics or Ph.D is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Great foundation in physical layer functionality for wireless systems in areas such as detection/acquisition, synchronization, parameter estimation & tracking, multipath detection, and mitigation, etc.Familiarity with Inertial Measurement Unit (IMU) sensors data processing and fusion with GNSS and other wireless signals.Proficiency with modeling in MATLAB is required.Experience with leading technical initiatives and key work.Knowledge and experiences in IC implementation and optimization, and familiarity with HDL / RTL are desirable.Experience with lab bring-up of SoC designs reaching volume production is desirable.Experience in GNSS baseband signal processing is desirable.BS and 10+ years of relevant industry experience.BS and 10+ years of relevant industry experience\nMS with a focus on digital communication, signal processing and/or geomatics or Ph.D is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which are driven by an elite vertically coordinated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. As a Senior Wireless Systems Engineer, you will be a key member of our highly innovative Wireless SoC design team, defining modem architectures, driving physical-layer algorithm designs, and developing digital signal processing schemes for novel ultra-low-power wireless applications."}, "200466831": {"jobID": "200466831", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "GNSS Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466831/gnss-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and 3+ years of relevant industry experience\nMS with a focus on digital communication, signal processing and/or geomatics or Ph.D is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Great foundation in physical layer functionality for wireless systems in areas such as detection/acquisition, synchronization, parameter estimation & tracking, multipath detection, and mitigation, etc.Familiarity with Inertial Measurement Unit (IMU) sensors data processing and fusion with GNSS and other wireless signals.Proficiency with modeling in MATLAB is required.Experience with leading technical initiatives and key work.Knowledge and experiences in IC implementation and optimization, and familiarity with HDL / RTL are desirable.Experience with lab bring-up of SoC designs reaching volume production is desirable.Experience in GNSS baseband signal processing is desirable.BS and 3+ years of relevant industry experience.BS and 3+ years of relevant industry experience\nMS with a focus on digital communication, signal processing and/or geomatics or Ph.D is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which are driven by an elite vertically coordinated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. As a Senior Wireless Systems Engineer, you will be a key member of our highly innovative Wireless SoC design team, defining modem architectures, driving physical-layer algorithm designs, and developing digital signal processing schemes for novel ultra-low-power wireless applications."}, "200447732": {"jobID": "200447732", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "RF Hardware Engineer - Multi-Radio Coexistence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447732/rf-hardware-engineer-multi-radio-coexistence?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience on at least one radio of Cellular, GPS, Bluetooth, Wi-Fi, Thread, NFC and UWBKnowledge of wireless architectures including front-end, antenna sharing, link budget line-up, etc.Proven understanding of RF hardware and standard methodologies for system-level grounding, shielding, isolation and electromagnetic interference mitigationKnowledge of RF component characteristics and experience using lab equipment including spectrum analyzer, network analyzer, signal generator and oscilloscopesExperience performing hands-on disassembly and system level debug on module, reference board or system levelExperience debugging and performing optimizations at the conducted or radiated radio systems levelExcellent communication written and verbal skillsAbility to travel domestically and internationally up to 20%BS with 3+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work on overall system performance of multi-radio coexistence for various wireless technologies (e.g., Cellular, Wi-Fi, BT, GPS, NFC, etc.)."}, "200389001": {"jobID": "200389001", "origin_search": null, "posted": "Jun 7, 2022", "jobTitle": "Product Design, Mechanical Engineering and Materials Internship", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200389001/product-design-mechanical-engineering-and-materials-internship?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Working toward BS, MS or PhD in Mechanical Engineering, Materials Science or similar degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You may meet or have interest in any one of the following qualifications:Ability to work in team-based environment.Self-motivating.Strong analytical/problem solving skills and ability to use statistical tools and techniques.Knowledge of finite element analysis theory and general mechanical engineering analysis.Flexibility and comfort working in a quickly changing environment.Desired Experience in any of the following:Prior experience in product design (preferably consumer electronics).Experience with component modules (LCD assemblies, batteries, camera modules, etc.) and their interconnect (FPC design and ACF bonding).Knowledge of materials science fundamentals for plastic, adhesive, metal, glass, ceramic, composite, and coating materials.Ability in plastic, metal, composite, and glass/ceramic part design.3-D CAD skillsExperience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing.Handheld, portable and/or hardware experience.Integration of wireless antenna (GSM, GPS, Wifi) into mechanical enclosures.Design of audio subsystems (microphone, speaker, receiver).Unigraphics or Pro-engineer fluency.Working toward BS, MS or PhD in Mechanical Engineering, Materials Science or similar degree.Good written and verbal communication. Ability to juggle multiple requests/tests.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unrivaled and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nApple is currently seeking enthusiastic Mechanical Engineering and Materials Science majors who can start work anytime between September, 2022 to September, 2023. The interns will provide support to design, engineering, prototyping and validation activities for all hardware product lines."}, "200463134": {"jobID": "200463134", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Wireless Charging Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463134/wireless-charging-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors in relevant EE field, Masters/PhD preferred\nAt least four years of relevant technical work in industry"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "M.S. or B.S. with 2 years experience in Electrical Engineering (analog & mixed-signal design, especially board-level circuits) or M.S. in Applied Physics (Electro-magnetics, Thermodynamics) or industry experience equivalent.Experience / background in Power & Magnetics (Electromagnets, Motors, Transformers). Direct experience in wireless charging preferredHands-on experience in system design & integration - including uC & digital buses (SPI, I2C)Hands-on experience in prototype bring-up and debugging, functional verificationProficiency in Python, C/C++ or other scripting languagesProficiency in COMSOL, MATLAB, SPICE or other simulation toolsComfort with a fast-paced environment and appetite for Innovation, Rigor & Healthy ParanoiaStrong communication (written & verbal) & problem solving skills - self-starter driving problems to resolutionExperience with high volume manufacturing and statistical production tolerance analysis - plusExperience supporting contract manufacturers & designing high volume products (concept-to-production) - plusBachelors in relevant EE field, Masters/PhD preferred\nAt least four years of relevant technical work in industry", "jobDescription": "We believe the future is powered by Wireless!\n\nThe mission of the Wireless Power Technology team - Create the world’s best Wireless Charging user- experience by inventing state-of-the-art technologies. We develop effortless and safe Wireless Charging designs that are central to Apple’s products - the iPhone, Apple Watch, iPad and AirPods! New challenges arise every day that require the sharp problem-solving skills of individuals. \n\nWe are looking for a system integration engineer that leads the integration of the inductive technology into products in the partnership with multiple discipline teams including but not limited to architecture, FW, system EE, silicon, noise and vibration, safety, thermal, reliability, operations , regulatory teams and more."}, "200400524": {"jobID": "200400524", "origin_search": null, "posted": "Oct 11, 2022", "jobTitle": "WW Digital Merchandising Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200400524/ww-digital-merchandising-specialist?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS desired, MBA a plus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$135,000", "max": "$242,000,"}, "benefits": null, "requirements": "7-10 years digital merchandising or equivalent experience.Validated analytical and numerical proficiency; versed in site analytics and proficient in analyzing data for decision making.Experience with merchandising tools.High attention to detail and obsesses over customer experience.Experience working closely with creative and UX teams to build customer experiences and define shopping journeys.Proven ability to influence across teams to drive innovation and results.Experience presenting to and influencing senior leadership.Deep knowledge of the global retail industry and digital commerce trends.Demonstrated ability to achieve strategic goals in an innovative and fast-paced environment.Superior verbal and written communications skills.Excellent project management skills, including work prioritization and planning.Ability to think and react in a high-energy, fast-paced environment.Exceptional ability to problem solve, develop creative solutions, and demonstrate resourcefulness.BA/BS desired, MBA a plusRegular meetings with peers in Asia and Europe during overlapping business hours.Flexibility for occasional evening or weekend work during critical time periods.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.Join a worldwide company that welcomes the whole wide world.Our customers are all over the world, so it’s by design that Apple employees are all over the world, too. And we know our ability to continue creating the world’s most innovative products depends on people who represent the variety of the human experience and who inspire us with great thinking. Because the broader the backgrounds and perspectives, the bigger the ideas.At Apple, we’re not all the same. And that’s our greatest strength.At Apple, we’re not all the same. And that’s our greatest strength. We draw on the differences in who we are, what we’ve experienced, and how we think. Because to create products that serve everyone, we believe in including everyone.", "jobDescription": "The Digital Merchandising Specialist will play a key role in the Global Digital Experience and Merchandising team, partnering with various collaborators across Apple to lead the merchandising strategy, planning, and tooling, supporting some of our most visible pages on the Apple Store Online. The right candidate must have demonstrated the ability to deliver innovative merchandising concepts, have experience with developing digital visual merchandising plans, and be a specialist in best in class digital practices, including customer journey, navigation, content briefing, merchandising story telling and continuous analysis of shopper-led, data driven insights, with a meticulous test and learn approach. This is a highly collaborative role that requires exceptional abilities to develop effective cross-functional relationships, establish new processes, and the ability to operate at a strategic level while implementing perfectly."}, "200455378": {"jobID": "200455378", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "AppleCare BPR Senior Systems Quality Project Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455378/applecare-bpr-senior-systems-quality-project-manager?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or commensurate experience\nQuality Assurance certification (ISTQB, ASQ, etc) and/or PMI certification is highly desirable"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5-7 years experience leading testing/QA, with emphasis on planning and managing cross-functional testingExperience with test automation tools and frameworksExperience with different testing methodologies and driving a quality mindsetAbility to develop technical expertise and understanding of system interdependencies, and their impacts on testing plansAbility to abstract technical details and effectively communicate to audiences at different levelsProficient at balancing multiple efforts at a timeExcellent listening, communication, leadership and presentation skillsAbility to develop and maintain relationships with internal partnersExemplify flexible thinking, curiosity, self-motivation, dedication to quality, focus on the details, and a positive perspectiveStrong organizational and documentation skillsSAP functional experience, and experience migrating from SAP R/3 to SAP S/4 HANAAbility to travel up to 10% of the timeBachelors degree or commensurate experience\nQuality Assurance certification (ISTQB, ASQ, etc) and/or PMI certification is highly desirable", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of our people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it!\n\nThe AppleCare Business Process Reengineering team has an immediate opening for a Senior Systems Quality Project Manager to manage and lead User Acceptance Testing (UAT) activities for complex Regional and Global AppleCare systems and software projects. You will be responsible for the planning, coordination, execution management, issue resolution, and progress reporting of testing activities across business and technical groups on BPR led projects.\n\nYou will also play a key role in our ambitious testing transformation journey. Through your knowledge of industry standard methodologies for quality management, you will help to evolve the way we approach test planning and execution."}, "200455398": {"jobID": "200455398", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "AppleCare BPR Senior Systems Quality Project Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455398/applecare-bpr-senior-systems-quality-project-manager?team=CUST", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or commensurate experience\nQuality Assurance certification (ISTQB, ASQ, etc) and/or PMI certification is highly desirable"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$188,000,"}, "benefits": null, "requirements": "5-7 years experience leading testing/QA, with emphasis on planning and managing cross-functional testingExperience with test automation tools and frameworksExperience with different testing methodologies and driving a quality mindsetAbility to develop technical expertise and understanding of system interdependencies, and their impacts on testing plansAbility to abstract technical details and effectively communicate to audiences at different levelsProficient at balancing multiple efforts at a timeExcellent listening, communication, leadership and presentation skillsAbility to develop and maintain relationships with internal partnersExemplify flexible thinking, curiosity, self-motivation, dedication to quality, focus on the details, and a positive perspectiveStrong organizational and documentation skillsSAP functional experience, and experience migrating from SAP R/3 to SAP S/4 HANAAbility to travel up to 10% of the timeBachelors degree or commensurate experience\nQuality Assurance certification (ISTQB, ASQ, etc) and/or PMI certification is highly desirable", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of our people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it!\n\nThe AppleCare Business Process Reengineering team has an immediate opening for a Senior Systems Quality Project Manager to manage and lead User Acceptance Testing (UAT) activities for complex Regional and Global AppleCare systems and software projects. You will be responsible for the planning, coordination, execution management, issue resolution, and progress reporting of testing activities across business and technical groups on BPR led projects.\n\nYou will also play a key role in our ambitious testing transformation journey. Through your knowledge of industry standard methodologies for quality management, you will help to evolve the way we approach test planning and execution."}, "200461986": {"jobID": "200461986", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Analog Mixed Signal SerDes Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461986/analog-mixed-signal-serdes-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with 3+ years of experience\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The ideal candidate should have deep understanding of AMS design with experience in high-speed serial links.Proven understanding and experience of designing analog mixed-signal circuit blocks including Bandgap, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits, ADCs, DACs, Oscillators, FiltersSolid understanding of analog mixed-signal concepts like mismatch mitigation, linearity, stability, low-power and low-noise techniquesGood grasp and understanding of digitally assisted analog design concepts (e.g. background calibrations, LMS based adaptive loops)Experience with high speed digital circuits (e.g., serializer, deserializer, counters, dividers, etc.) with the understanding of digital design conceptsKnowledge of Tx/Rx equalization techniques and circuits (e.g. CTLE, DFE, de-emphasis) for 20+ Gbps NRZ and PAM applicationsKnowledge of CDR architectures and implementationsKnowledge of lab equipments and testingExperience in AMS circuit modeling and performance evaluation (e.g. SystemVerilog, Matlab, Python, VerilogAMS)Hands-on experience in advanced CMOS technologies, design with FinFet technologyHands-on experience with AMS IC development from definition to high-volume production including layout supervision, bench evaluation, correlation, and characterizationEXPERIENCE IN THE FOLLOWING AREAS IS A PLUSConcepts of timing closure and related industry tools (e.g., Nanotime, Primetime)Experience in lab testing of high-speed serial I/O, debug and data analysis techniquesKnowledge of common high-speed SerDes protocols (e.g., PCIe, USB, DP, MPHY)Skills in scripting and automation to improve efficiencyBSEE with 3+ years of experience\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "We are seeking skilled Analog Mixed-Signal designers to join our high-speed SerDes team!\n\nOur team specializes in building next generation high-performance wireline transceivers delivering intellectual-property (IP) for Apple’s world-leading system-on-chip (SOC).\n\nIn this role, you will actively work with cross-functional Analog Mixed-Signal design teams to create state-of-the-art IPs key to Apple’s products. \n\nYou will be challenged to make the best-in-class designs to surprise and delight Apple customers. With transforming the user experience in focus, you will get an opportunity to work on designs which makes the best systems. This enables you to learn end-to-end system while exceeding the highest expectations of quality, innovation and efficiency.\n\nIf you have strong fundamentals and a track record of tackling technical challenges, \n\nIf you are passionate about learning new skills and improving the value of your work, \n\nIf you like to be tuned to the bigger-picture while diving deeply into the details to innovate and solve problems, \n\nWe invite you to join and grow with our team!"}, "200453649": {"jobID": "200453649", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "Product Manager - New Products, Apple Store Online", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453649/product-manager-new-products-apple-store-online?team=APPST", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "10+ years of Product Management experience with at least 5 years leading product for a large scale direct to consumer e-commerce retailer. Experience with Omni-Channel retailers, a strong plusFluency in core e-commerce concepts like affordability, credit, payment systems, order fulfillment, supply chain, and then stitches across these capabilitiesConsistent track record of successfully implementing new concepts or programs in a fast paced, digital retail environmentAbility to take product vision and turn it into a world class customer experience within the online platform as well as between online and physical store spacesTechnical mentality and ability to work closely with engineering partners to solve for system interdependencies, devise implementation strategies and refine scope based on concrete considerationsWork independently, but not alone, leading through influence and leading from the middle of the packPassionate about the customer experience with significant focus on what needs to be done to improve itExceptional presentation and communication skills, with experience presenting to and influencing high-level, senior executivesAbility to take an undefined initiative, and create structure to drive an effort among a team of cross functional people (formal project or not)", "jobDescription": "Apple is a place where extraordinary people gravitate in order to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job!\n\nThe Apple Store Online team seeks a seasoned Product Manager to bring our new products and experiences to market and surprise and delight our customers. In this role, you will collaborate closely within Retail as well as with Design, Engineering, Product Marketing, and Ops to launch new Apple products. This role will draw upon your extensive experience as a Product Manager to combine your technical fluency, strong sense of user experience, and business understanding to chart a vision, align your partners, and deliver flawlessly executing product launches."}, "200458559": {"jobID": "200458559", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "IC Package Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458559/ic-package-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS and 10+years hands-on experience with package design and proficient in Cadence Allegro platform tools (PCB Editor, Advanced Package Designer, APD/SiP) or Mentor Xpedition platform tools.Solid fundamentals in electrical/material/thermal/mechanical engineering field.Familiarity with various sophisticated package configurations and assembly / substrate technology (wirebond, POP, etc.).SI/PI tools (XtractIM, PowerSI, HFSS, Q3D, etc.), package model extraction, S-parameters and RLGC model.Substrate manufacturing process, structure, design rules and material property.Solid understanding of high-speed interfaces, including DDR, PCIe, NAND, etc.Exposure to Unix environment, scripting languages (PERL, Python, TCL and or shell) and methodology.Good understanding of system specification and IC design, ability to work with design teams to translate IC / system requirement into package / SIP configuration.Consistent track record to drive package selection through feasibility studies and drive chip Floor planning and bump assignment.Preferred Experience:Familiar with package design reviews and familiarity with CAM350/Valor or Calibre and CAD.Knowledge of high-speed layout constraints (crosstalk mitigation, differential pairs, EMI/RFI, PCB/package resonance).Design experience with RFIC and 5G packages, SIP or module schematic and layout design. Hands-on knowledge of Design Rules Check and Design for Manufacturing.Experience with TSV, 2D/2.5D and 3D package connection.Familiar with Cadence Concept HDL for schematic review, experience in schematic capture and system integration.-  BS and 10+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nOur Hardware Technology Packaging team invents, designs, develops and integrates electronic packaging solutions for Apple’s internal and custom external components of hardware for its consumer electronic products such as iPhone, iPad, Mac, Apple Watch, Apple TV, etc.\n\nIn this highly visible role, you will own and drive sophisticated package selection, new generation product package structure and configuration optimization. You will be responsible for Package/SIP/module physical design and layout, optimization, design verification and tape out; and work with multi-functional teams to achieve optimized mechanical / electrical / thermal performance for various types of chips."}, "200451435": {"jobID": "200451435", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Silicon Bringup Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451435/cpu-silicon-bringup-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceThe ideal candidate should have experience in hardware and low-level software skillsStrong understanding of processor architectureExperience with FPGA design and optimizationGood understanding of firmware and device driversGood C and assembly programming skillsExcellent partnership and communicationAbility to work with multiple teams in delivering a solutionMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nYou will be a member of a CPU silicon bringup team where your tasks will include reproducing silicon failures on FPGA or Emulators, optimizing FPGA models for speed, creating silicon irritators on FPGA, and executing parts of functional silicon bringup plans."}, "200307864": {"jobID": "200307864", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "Display Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200307864/display-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "PhD, MS or BS in EE or Physics, with up to 5 years of proven experience working in a display related field is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "An in-depth understanding of display measurement & performance evaluation, display technologies, display module construction, process development and display systems.Excellent project management, communication and collaboration skills required.Willingness and ability to travel.PhD, MS or BS in EE or Physics, with up to 5 years of proven experience working in a display related field is preferred.", "jobDescription": "Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.\n\nApple Inc. is looking for a Display Engineer for the development and qualification of Displays for iPhone products. This individual will be working on flat panel displays both at the component and system level, serving as a focal point between the system design team, the display EE team, display mechanical team, the supply base management team, and the display suppliers, managing all activities vital to deliver displays into final products from initial concept to production."}, "200460706": {"jobID": "200460706", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Training Instructional Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460706/training-instructional-designer?team=CUST", "jobLocation": {"remote": "not specified", "city": "Elk Grove", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree or equivalent required; Master's or higher degree in a related field a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$63,000", "max": "$105,500,"}, "benefits": null, "requirements": "Minimum 2 years of instructional systems design experience on projects involving adult learning audiences.Training development experience involving adult learners, such as in a call center or customer service environment.Superb written and verbal communication skills and proficiency writing instructional content.Experience analyzing, building, and assessing curricula for asynchronous and synchronous classroom-based or virtual training environments.Fluency with instructional systems design models and methodologies, authoring tools, and learning management systems integration.Experience as a solo or lead content developer on instructional systems design projects related to adult learners.Proven proficiency with Apple operating systems, such as macOS, iOS, iPadOS.Exposure to Web authoring and multimedia tools, such as basic HTML, Dreamweaver, and Pixelmator Pro.Experience creating learning content for global audiences is a plus.Experience with project management is a plus.Proficiency Apple software applications including Pages and Keynote is a plus.Experience in a call center or customer service environment is a plus.Bachelor’s Degree or equivalent required; Master's or higher degree in a related field a plus.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nAre you passionate about workplace learning and training development? Can you quickly and optimally resolve learning needs and create instructionally-sound synchronous and asynchronous training materials to meet those needs? If so, keep reading. The AppleCare Training Instructional Designer works with business partners to identify training needs and create instructor-led, virtual, and self-paced training using cutting-edge technology and innovative solutions."}, "200448142": {"jobID": "200448142", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "RF Hardware Engineer - Multi-Radio Coexistence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448142/rf-hardware-engineer-multi-radio-coexistence?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Experience on at least one radio of Cellular, GPS, Bluetooth, Wi-Fi, Thread, NFC and UWBKnowledge of wireless architectures including front-end, antenna sharing, link budget line-up, etc.Proven understanding of RF hardware and standard methodologies for system-level grounding, shielding, isolation and electromagnetic interference mitigationKnowledge of RF component characteristics and experience using lab equipment including spectrum analyzer, network analyzer, signal generator and oscilloscopesExperience performing hands-on disassembly and system level debug on module, reference board or system levelExperience debugging and performing optimizations at the conducted or radiated radio systems levelExcellent communication written and verbal skillsAbility to travel domestically and internationally up to 20%BS required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work on overall system performance of multi-radio coexistence for various wireless technologies (e.g., Cellular, Wi-Fi, BT, GPS, NFC, etc.)."}, "200463555": {"jobID": "200463555", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "GNSS Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463555/gnss-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "BS and 10+ years of relevant industry experience is required. M.Sc. or PhD degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Wireless/DSP block/System-on-Chip verification experience.Advanced knowledge of SystemVerilog and in-depth understanding in UVM methodology.Solid verification skills in problem-solving, constrained random testing, and debugging.Knowledge of SOC subsystem and low power verification experience is desirable.Experience with SystemVerilog Assertion (SVA) is a plus.Knowledge of scripting (like Shell, Python, and Perl…) is desirable.Experience in mixed-signal modeling and simulation is a plus.Strong verbal and written communication skills are needed.BS and 10+ years of relevant industry experience is required.BS and 10+ years of relevant industry experience is required. M.Sc. or PhD degree preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Global Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. Our GNSS team is part of Apple's wireless SOC team. We are a vertically integrated engineering team spanning RF, mixed signal analog design, systems engineering, Design Verification, RTL design, firmware and software engineering, Test, and Validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of our GNSS IP and SoC subsystem. As part of our DV team, you will develop reusable testbench and verification environment deploying the latest methodology, working closely with GNSS and SoC front-end designers and Systems Engineers."}, "200450872": {"jobID": "200450872", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "CAD Engineer - EMIR Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450872/cad-engineer-emir-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Solid understanding of circuit design principles and EMIR analysis at the transistor and gate level for multiple modes such as static and dynamicIn-depth knowledge in industry leading tools, like Redhawk, Voltus, and TotemExperience in developing CMOS analog and mixed signal designs is a plusExperience in simulation and power analysis to verify circuit performanceStrong understanding of CAD flowsProficiency in programming/scripting languages (Perl and Python)Excellent communication skills and ability to collaborateMinimum requirements of BS + 10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on innovative designs. You’ll use your hands on experience in power EMIR analysis to develop/define & refine the signoff methodologies for gate-level, as well as transistor level designs. The areas will include but are not limited to signoff of functional static/dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, Signal EM, power switch modeling, and IP for reuse.\n\nYou will contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibilities also includes directly collaborating with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200452249": {"jobID": "200452249", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CAD Engineer - EMIR Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452249/cad-engineer-emir-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid understanding of circuit design principles and EMIR analysis at the transistor and gate level for multiple modes such as static and dynamicPrevious exposure to industry leading tools, like Redhawk, Voltus, and TotemExperience in developing CMOS analog and mixed signal designs is a plusExperience in simulation and power analysis to verify circuit performance is a plusStrong understanding of CAD flowsProficiency in programming/scripting languages (Perl and Python)Excellent communication skills and ability to collaborateMinimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on innovative designs. You’ll use your hands on experience in power EMIR analysis to develop/define & refine the signoff methodologies for gate-level, as well as transistor level designs. The areas will include but are not limited to signoff of functional static/dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, Signal EM, power switch modeling, and IP for reuse.\n\nYou will contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibilities also includes directly collaborating with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200422119": {"jobID": "200422119", "origin_search": null, "posted": "Sep 23, 2022", "jobTitle": "WiFi Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200422119/wifi-quality-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$171,000,"}, "benefits": null, "requirements": "2+ years of experience in 802.11 protocols and/or Bluetooth2+ years of experience in SQA methodologies and practicesExperience in developing test strategies and executing it with automation or manual testingExperience with scripting and automation - python preferredExperience in utilizing tools, including Wireless and Bluetooth packet sniffers and network protocol analyzers, to help resolve, root cause and provide debugging information to engineering teams.Thrive in a collaborative environment and comfortable working with multi-functional teams.Laser-focused on the smallest details that are meaningful to our customers.We are open to entry level engineers with wireless background and scripting experience or with internship experience in Wireless domainBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Join the Sensing and Connectivity team in driving the innovation and delivering seamless wireless connectivity and the best user experience to our customers. Our team works on an Apple eco-system of devices that delivers the best wireless connectivity experience.\nIf you are motivated, highly technical and passionate about WiFi, Bluetooth and Networking technologies, possess excellent problem solving and coding skills, this team can be your destination."}, "200434871": {"jobID": "200434871", "origin_search": null, "posted": "Oct 12, 2022", "jobTitle": "Sensor Systems Test Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434871/sensor-systems-test-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. / Ph.D. Mechanical, Electrical or Physics degree with 5 / 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$157,000", "max": "$276,000,"}, "benefits": null, "requirements": "Track record managing high performance teams.Experience developing sensor system test plans for development, verification and validation.Good understanding of optical and/or RF sensors physics and signal processing.Strong communication, documentation and presentation skills.Strategic and analytical thinkingM.S. / Ph.D. Mechanical, Electrical or Physics degree with 5 / 10+ years of relevant industry experience", "jobDescription": "The Special Project Group (SPG) at Apple is currently looking for an exceptional candidate to lead the sensor systems test team.  As a successful applicant you will provide strategic direction to a team of talented engineers evaluating, developing and validating sensing hardware for autonomous systems.  You will work cross functionally with domain experts in sensor hardware, signal processing implementation, autonomy algorithms, systems engineering, and safety to perform module and system level testing. You must have a strong understanding of various sensing modalities’ strengths and limitations, associated algorithms, and general understating of perception systems.  You must feel passionate about guiding high performance teams developing complex systems tests with multi-disciplinary teams and delivering within aggressive timelines."}, "200452388": {"jobID": "200452388", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "PHY Systems Engineer – PHY and RF Control", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452388/phy-systems-engineer-phy-and-rf-control?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 10+ years of relevant experiences."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems (OFDM/MIMO, etc.) physical layer algorithm design and validation.Understanding of 5G-NR or LTE standards: PHY and RF specifications.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience with 4G/5G PHY FW design is a plus as well as experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc.Understanding of related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, estimation, etc.) is a plus.Ability to understand performance impact under external restrictions such as coexistence issues is a plus.BS with 10+ years of relevant experiences.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nWireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we utilize a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for innovative wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200451443": {"jobID": "200451443", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Top Level Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451443/cpu-top-level-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.You should have experience in verification methodology.Verification tool and verification development experience.Strong assembly and CPU architecture knowledge.Strong in C, C++, Verilog, and scripting languages.You should be a collaborative teammate with excellent interpersonal skills and be able to work independently.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nAs a CPU Top-Level Verification Engineer, you will be responsible for developing test infrastructure and triaging CPU failures in our validation environment."}, "200458298": {"jobID": "200458298", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "NAND Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458298/nand-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Typically requires at least 5+ years of program managing experience, preferably in NAND or Flash Memory or Storage in general. Individuals with extensive experience are also encouraged to apply and can take on additional responsibilities.Experience with NAND Flash memory technology is required.Must have a strong track record managing product definition and specification.Must have vendor management experience. Experience managing offshore vendors is considered a plus.Must be analytical and possess strong interpersonal / problem-solving skills.Technical background in product development or product management, architecture, process or packaging.Working knowledge and understanding of high-volume manufacturing process.BS and 10+ years of relevant industry experience.", "jobDescription": "Do you love building sophisticated solutions to highly complex challenges? You’ll ensure Apple products and services can seamlessly and deftly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nApple’s NAND group is a growing, high energy, results oriented team that has an opportunity for a Technical Program Manager to drive our storage solutions across next generation product lines. This is a phenomenal opportunity that will allow you to utilize your technical expertise as well as broad program management experience setting strategies and executing on scheduled work you're doing!"}, "200448743": {"jobID": "200448743", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Senior Wireless MAC Standards Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448743/senior-wireless-mac-standards-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven track record of participation and technical leadership in wireless standardization organization, such as IEEE 802.11, IEEE 802.15, Bluetooth, UWB or similar technologiesStrong familiarity with MAC protocols and algorithms of wireless standards, such as IEEE 802.11, IEEE 802.15, Bluetooth SIG, or similar technologies.In-depth knowledge of wireless MAC protocols and algorithms, such as channel access, QoS, power save, low latency, coexistence, security, privacy, etc.Must have strong analytical and problem-solving skillsExperience with ns3, OpNet, C/C++, or Python for modeling and simulationsExperience with MAC modem architecture, algorithms, hardware design, and software design is a plusExperience with PHY/MAC cross-layer algorithm design is a plusAbility to present complex technical concepts in a clear and organized mannerHave a strong and proven leadership ability is a plusSelf-motivated and passionate to solve problems in innovative waysBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "As a Senior Wireless MAC Standards Architect, you will be responsible for driving and designing the next generation of media access control layer protocols for wireless technologies. You will influence the standards process by participating in the meetings, making technical contributions, and driving company strategic interests. In addition, you will be responsible for creating new MAC layer IPs and developing innovative proprietary cross-layer algorithms and systems for new and emerging applications. You will also actively work with internal teams to keep them apprised of the development and direction of the standards, help them define features, requirements, and architectures, generate new ideas and features, and achieve best-in class and robust product performances in all environments. In addition, you will collaborate with cross-functional teams to innovate, drive wireless architectures, incubate ideas for new generations of wireless communication protocols, and participate in the development of emerging applications and devices. As a member of the silicon design group, you will be responsible for developing state-of-the-art wireless SoC products that are enjoyed by millions of Apple customers."}, "200446448": {"jobID": "200446448", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Wireless Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446448/wireless-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS in EE or CS with + 10 is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong understanding of SoC/FPGA architecture and silicon micro-architectureExperience in writing basic embedded software routines and test scriptsExperience with hardware/software interactionSolid Digital logic fundamentals including timing analysis, state-machine debug and/or RTL/test-bench development Experience with high-speed memory systems and communication interfacesGood understanding of MAC + Protocol specifications for digital interfacesExperience in crafting tests to target specific portions of silicon designs and digital interconnectsHands on debug experience with usage of modern lab equipment (DSOs, Logic Analyzers, Protocol Analyzers)Familiarity with interpreting and navigating schematics and layoutStrong desire to deep-dive system level issues and drive problems to closure in a team-based environment with a proactive demeanorMinimum BS in EE or CS with + 10 is required.", "jobDescription": "Are you passionate about changing the world? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. \n\nCome join a team of expert software and hardware engineers with a diverse set of backgrounds (Cellular Modems, Connectivity solutions, Device Drivers, CPUs and caching, kernel programming, embedded systems) to test Apple's next generation Wireless SoCs! As part of the Silicon Validation team, you will define and develop test coverage to evaluate functional blocks and debug silicon issues."}, "200451247": {"jobID": "200451247", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451247/cpu-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.In-depth knowledge of digital logic design, chip architecture and microarchitectureExperience with developing testplans/testbenches, C-based transactors, and writing/debugging assembly-based testsExperience with advanced verification techniques such as formal and assertions a plusExperience in silicon bringup a plusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200455391": {"jobID": "200455391", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455391/cpu-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.In-depth knowledge of digital logic design, chip architecture and microarchitectureExperience with developing testplans/testbenches, C-based transactors, and writing/debugging assembly-based testsExperience with advanced verification techniques such as formal and assertions a plusExperience in silicon bringup a plusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200452540": {"jobID": "200452540", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "GNSS RF System Debug Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452540/gnss-rf-system-debug-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant industry experience is required \n\nBS degree in EE or related fields/ M.Sc. degree is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands on experience in RF System level test development, debug, and reportingStrong RF background and familiarity with RF systems fundamentalsWorking knowledge of RF test equipment (network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.)Experience in RF system simulation environment (Matlab, SystemVue or Verilog-A)Knowledge in test and script development (Python, PERL, TCL)Solid understanding of RF, PLL, and general wireless systems measurements (i.e. IP3, NF, ACPR, phase noise, lock time, etc.)Strong verbal and written communication skillsPrevious GPS/GNSS experience is a plusBS + 3 years of relevant industry experience is requiredBS + 3 years of relevant industry experience is required \n\nBS degree in EE or related fields/ M.Sc. degree is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Global Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away.\n\nOur GNSS team is part of Apple's Cellular organization. We are a vertically integrated engineering team spanning RF, mixed signal analog design, systems engineering, design verification, RTL design, firmware and software engineering, test, and validation. Our focus is on highly energy-efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. \n\nAs a GNSS RF System Debug Engineer, you will be a crucial member of Apple’s cellular team, driving cellular development for our next-generation wireless products used by millions. Come to Apple and do your life's best work!"}, "200457107": {"jobID": "200457107", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "GNSS RF Systems Lab Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457107/gnss-rf-systems-lab-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant industry experience is required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "The ideal candidate will have the following qualifications:Experience in board bring-up, testing, and ensuring the stability of operationDebug issues related to poor boards design practices, the root cause of the issue, simulate it, and come up with solutionsCapable of reworking SMAs and BGA components up to 0201Proven understanding of RF test equipment such as network analyzer, spectrum analyzer, vector signal analyzer, vector signal generators, etc.Knowledge of RF-centric board design and test for internal validation usageReview, represent and promote the team’s interests with regards to the board designs and layouts for our productsKnowledge in test and script development (Python, MATLAB, PERL, TCL)Strong RF background and familiarity with RF system measurementsBS + 3 years of relevant industry experience handling RF lab, testing, and debugStrong written and verbal communication skillsBS + 3 years of relevant industry experience is required", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? \n\nGlobal Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just a few MHz away.\n\nOur GNSS team is part of Apple's Cellular organization. We are a vertically coordinated engineering team spanning RF, mixed-signal analog design, systems engineering, Design Verification, RTL design, firmware and software engineering, Test, and Validation. Our focus is on highly energy-efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about! We’d like you to consider being a part of our team. \n\nAs a GNSS RF Systems Lab Engineer, you will be a key member of part of the GNSS RF System team and design, review, purchase, and implement the HW platforms and lab equipment to enable this mission."}, "200458552": {"jobID": "200458552", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Silicon Validation Software Engineer - High Speed IO Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458552/silicon-validation-software-engineer-high-speed-io-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Familiar with SoC and System architecture.Knowledge and experience working with board schematics.Experience with Embedded system is a plusExperience with using test equipment and analyzers (USB, PCIe, DP, I2C) is a plusKnowledge and experience with High Speed interfaces such USB-PD, USB2.0, USB3.0, Thunderbolt 3, USB4.0, PCIE or DP is a plus.BS and a minimum of 3 years relevant industry experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nJoin us to help deliver the next groundbreaking Apple product. We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles."}, "200447863": {"jobID": "200447863", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Verification Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447863/cellular-4g-5g-firmware-verification-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS + 10 years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP specifications with focus on physicallayer, protocol stack procedures and configurations, systems design andimplementationStrong experience and proven understanding of 4G/5G wireless systems design,RF interface and firmware architectureCapability of defining sophisticated verification use cases and schemes and drivesystem performance and define verification criteriaExperience with firmware test case planning, design, and development for the4G/5G functional and performance scenariosStrong solid understanding of multiple 4G/5G signaling and physical layer testequipment along with their automation interfacesDeep understanding of software engineering principles, and core computerscience fundamentalsFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, andvirtual platformsMinimum BS + 10 years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an outstanding modem team, we'll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. Do you want to have an impact on every single Apple product? As a Cellular 5G/4G Firmware Verification Architect, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200447651": {"jobID": "200447651", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "WW Sales BPR Program Manager, Compliance", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447651/ww-sales-bpr-program-manager-compliance?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree \n\nPMI/PMP certification preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$128,000", "max": "$196,000,"}, "benefits": null, "requirements": "Deep understanding of project, program and portfolio planning and delivery to the level that they can set standards, propose policy and coach others.Knowledge of general Privacy policies and/or regulatory requirementsAbility to clearly articulate strategy and requirements to collaborators, legal teams, engineering and business partners.Ability to establish rapport, credibility and influence others to get results across a broad cross functional team.Experience leading compliance initiativesPossess strong decision making and prioritization skillsWell versed in multiple styles of Release & Change Management processes including Agile/Scrum, Waterfall and IterativeMinimum of 8+ years of managing complex and highly integrated projectsStrong analytical skills with continuous process improvement mind set. Ability to use data to tell a story, drive root cause analysis and extract concrete insight.Passionate about driving quality within a project organizationExceptional communication skills - verbal, written and presentation. Interest in fostering positive relationships and ability to communicate at all organization levelsAbility to facilitate Brainstorming sessions to gather lessons learned from implementation with business and BPR, and Information Technology group (IS&T)Excellent teamwork skills and ability to influence others and an ability to quickly establish trust and credibilityHigh level of professionalism, energy and sense of urgency to “make things happen”Self-motivated, driven individual who is comfortable working in a global, matrixed, fast-paced environment with high levels of complexity and ambiguity and will have experience with agile method of working.Curious, flexible, results oriented and a dedicated problem solver.Innovative mind set and ability to think “out of the box”, challenge status-quo and incorporate industry standard methodologies.Prior consulting experience with Big 4 Consulting Firms is desirable, but not required.Bachelor’s degree \n\nPMI/PMP certification preferredKnowledge of sales processes and operations is preferredPrior privacy experience suggestedKnowledge of insider trading policy preferredKnowledge of global privacy policies such as: GDPR, PIPL, LGPD, CCPA preferredExperience working in Numbers, Pages, Keynote; Microsoft Word and Excel; JIRA suggestedSix Sigma preferredDesign Thinking preferredAgile, SCRUM & Salesforce certification (s) pre", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nYou will play a meaningful role within the Project Management Office (PMO) to support all of Apple WW Sales project teams. This role would work in a range of capacities from planning strategies, through portfolio management and governance, and down to supporting individual project requests. As a key focus, you will assist with providing accountability and resolution for privacy related matters in WW Sales and act as a point of contact for Privacy Legal and Compliance, liaising between Sales Teams and our Privacy partners. \n\nIn addition, you will play a key role in the delivery of key programs which cut across the normal structure of the project delivery organization and are very high profile in nature."}, "200348123": {"jobID": "200348123", "origin_search": null, "posted": "Mar 1, 2022", "jobTitle": "Digital Imaging Technician and On-Set Dailies Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200348123/digital-imaging-technician-and-on-set-dailies-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Newport Beach", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$134,000", "max": "$201,500,"}, "benefits": null, "requirements": "5+ years experienceWorking as a DIT on theatrical, IMAX, high concept or prime time series television.A proven track record of collaborating with DP’s and colorists to establish and maintain the look of the show from on-set to editorial.Hands-on experience working with high-end professional color and dailies tools (Resolve, Scratch Lab, Colorfront OSD, etc.)Hands-on experience working with realtime color, LUT & look tools. (LiveGrade, LiveLooks, Resolve Live, etc.)Hands on experience generating dailies proxy files from RAW camera files.Experience working directly with producers, directors, executives, 3rd party vendors, editors and post production supervisors to setup and manage media management workflows.Experience working in international, highly metropolitan, and underdeveloped locations as key member of the production staff. (This role requires 50%+ travel both domestically & internationally. It will be physically demanding at all times.)Bachelors degree or equivalent work experience• Prior experience working with non-standard types of photography or cinematography technology such as underwater, aerial, extreme conditions, and virtual production.• Familiarity with typical video and audio recording formats commonly found in the cinematic or live broadcast industry. (RAW, ProRes, EXR, BWF, etc.)• Familiarity with production equipment and maintenance tasks typically found in cinematic or live broadcast environments and pipelines.• Working knowledge of media production and workflow tools such as Adobe Premiere, BlackMagic Resolve, ColorFront (OSD), ShotGrid/ShotGun, Perforce, Unity, Unreal, Movie Magic, StudioBinder, etc.,• Experience using standard organization and communication tools. (Jira, Confluence, Keynote, PowerPoint, Omnigraffle, Vizio, Word, etc.)• Extensive work with domestic and international rental equipment and shipping service providers. (PRG/VER, Panavision/LightIron, Otto Nemenz, NEP/Bexel, ARRI Rental, FedEx Custom Critical, FilmLogics, SOS, PacAir, Delta, etc.)Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Our creative and technical development team is looking for a Digital Imaging Technician (DIT)and On-Set Dailies Lead to support look management, media management, and dailies/ proxy file generation for Immersive Media productions. The Lead will use industry standard production practices to ensure that Apple’s demanding standards for the highest capture quality and preservation of creative intent for each production are upheld\n\u2028\nIn addition to guiding workflow setup during show prep and working on productions, the Lead will provide realtime feedback and guidance to the production engineering R&D team on systems and workflow improvements. The Lead’s “normal day at the office” may include working on a multi-week shoot on a Hollywood stage with a full crew and then immediately flying to a dense jungle or arctic location, with only the most basic support gear in a backpack and a skeleton crew at their side.\n\nEach shoot is treated as a “zero downtime” and “failure-is-not-an-option” high-stakes production where minutes equal dollars and there’s only one chance to capture amazing content. If this sounds familiar and exciting, this could be the opportunity you’ve been working towards."}, "200460625": {"jobID": "200460625", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "GPU Top RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460625/gpu-top-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 0 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Familiar with energy-efficient/low-power logic design.Familiar with logic optimization, synthesis, timing analysis, floor-planning, power intent descriptions, and clock domain clock crossings.Proficient in Verilog and/or System Verilog and scripting languages.Familiarity with logic simulation and debug.Ability to work well in a team and be productive under aggressive schedules.Graphics hardware background a plus.We are looking for candidates with a minimum of BS + 0 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAt Apple, we push our designs to the limit to make amazing products. We want to delight our customers with hardware that performs great while delivering long battery life. As part of the mobile GPU design team, you will collaborate with Platform Architecture, Software, Design Verification, and Physical Design teams to deliver RTL and specifications for GPU power management, SOC interface logic, and shared IP. In addition, you will be responsible for integrating applicable IP from other teams to enable complete security, debug, and power management solutions."}, "200460622": {"jobID": "200460622", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "GPU Top RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460622/gpu-top-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven expertise in energy-efficient/low-power logic design.Expertise in logic optimization, synthesis, timing analysis, floor-planning, power intent descriptions, and clock domain clock crossings.Proficient in Verilog and/or System Verilog and scripting languages.Solid experience with logic simulation and debug.Ability to work well in a team and be productive under aggressive schedules.3+ years of industry experience.Graphics hardware background a plus.We are looking for candidates with a minimum of BS + 3 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAt Apple, we push our designs to the limit to make amazing products. We want to delight our customers with hardware that performs great while delivering long battery life. As part of the mobile GPU design team, you will collaborate with Platform Architecture, Software, Design Verification, and Physical Design teams to deliver RTL and specifications for GPU power management, SOC interface logic, and shared IP. In addition, you will be responsible for integrating applicable IP from other teams to enable complete security, debug, and power management solutions."}, "200415200": {"jobID": "200415200", "origin_search": null, "posted": "Aug 23, 2022", "jobTitle": "Technical Animator", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200415200/technical-animator?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent industry experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Having worked through an entire AAA production cycle.Thorough knowledge of pipelines and processes used in real-time animation development.Extensive experience rigging for and animating across a wide range of stylesDeep understanding of runtime performance for different platforms.Strong understanding of real time rigging, proceduralism, and animation workflows..Strong understanding of deformation, skinning, simulation, and keyframe workflows.Able to communicate precisely with multiple departments and vendors.Independent and self managed, excellent communicator and team-player.Ability to anticipate, prioritize, and organize work to meet objectives.Strong experience working with performance capture data.Bachelors degree or equivalent industry experience required.", "jobDescription": "The ideal candidate has deep experience in the facilitation of art production workflows, balancing considerations for performance optimizations and quality, including working with custom engines. The candidate has ideally managed the responsibility and acted the role of delivering best in class environments and assets. The candidate will collaboration between disciplines, working closely with designers, technical artists and engineers and have experience doing it at the highest level of real-time production, at AAA studios. There is a substantial R+D component to our development and production. If you are excited about defining new workflows, and passionate about embracing new forms of content creation and delivery, this is your call."}, "200449775": {"jobID": "200449775", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Graphics RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449775/graphics-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We will need you to demonstrate their knowledge of logic design principles along with timing and power implicationsA proficiency at low power microarchitecture techniques is a key qualification for successYou will be expected to perform performance and power analysisA Proficiency at design development using System Verilog HDLAbility to drive development and debug of complex designsUnderstanding of synthesis tools, timing analysis, floor planning, the PNR flowA proficiency in hardware performance analysis and debugUnderstanding of Design Validation Practices and PrinciplesExperience with scripting languages such as Python, Ruby, or PerlDemonstrate the ability to work well within and leadership of a teamDemonstrate the ability to mentor junior engineersBS + minimum of 10 years experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this highly visible role, team members will develop power efficient, high performance 3D graphics processors targeted for low power mobile devices."}, "200455838": {"jobID": "200455838", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Verification Methodology and Tool Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455838/cpu-verification-methodology-and-tool-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Minimum BSThe ideal candidate should have following qualifications:Computer ArchitectureRTL developmentVerilog or SystemVerilogProgramming/scripting skills (C, C++, Python)Problem solving skillShould be a great teammate with excellent communication skills, be able to work independently.Minimum BS", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!"}, "200450179": {"jobID": "200450179", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "AMS Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450179/ams-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience in Analog Mixed Signal design with advanced CMOS technology nodes. The candidate should have a focus and background in AMS modeling and verification, basic digital design, timing closure, and analog to digital interface. We are open to multiple experience levels.Understanding of analog and mixed signal circuit design.Direct tape out experience with one or more of the following blocks: ADCs, DACs, PLLs, SERDES, source synchronous digital interfaces, and custom digital circuits.Familiarity with the integration flows and integration challenges of Analog and Mixed Signal circuits with the Digital portion in an SOC.Experienced in timing analysis (STA) of analog to digital interface.Familiarity with STA tools like NanoTime and PrimeTime.Working knowledge of RTL, System Verilog, PnR, Modeling and Design verification flows is a plus.Experienced with mixed-signal mode verification methodologies including Verilog-AMS and behavioral modeling in Verilog-A and Verilog-D.Having coding experience in Python is a plus.Experience in wireless SoC products is highly desirable.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an Analog Mixed Signal (AMS) Integration Engineer, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200466715": {"jobID": "200466715", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Cellular RFIC Transceiver Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466715/cellular-rfic-transceiver-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Proven verification skills in problem-solving and debugging.Extensive experience with bringing up and testing RFIC, performing system integration, characterization and optimization.Experience in end-to-end RF measurements, as well as block level characterization like LNAs, Mixers, Amplifiers, PLLs, VCOs, high-performance ADCs, and DACs.The ability to collaborate with different teams (IC Design, RF Systems, Firmware, and HW teams) within Apple.Bench Automation experience and proficiency with measurement automation tools and scripting languages, such as Python, Matlab, C++ scripts.Experience with lab equipment such as spectrum analyzers, network analyzers, signal generators, phase noise analyzers, oscilloscopes, DMM’s, etc.Experience with MAC or PHY Verification would be useful.Good understanding of board schematics, layout. Experience with defining HW board requirements for validation board.Experience supporting with ATE engineers and on mass production will be plusBS with 3+years of relevant experience.", "jobDescription": "Would you like to join Apple’s growing cellular wireless design team? Do you thrive on pushing the limits of integration for highly complex RF cellular SoCs in advanced technology nodes? Our team is responsible for all aspects of cellular transceivers silicon development with a particular emphasis on highly integrated and efficient designs and technologies that transform the user experience at the product level. \nWe invite you to join us if you are looking for a challenging RFIC Validation Engineering position to work on RF cellular transceiver SoCs! You will work with cellular RFIC circuit designers and system integration engineers to validate major RF cellular system performance."}, "200446218": {"jobID": "200446218", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "Mixed-Signal behavioral Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446218/mixed-signal-behavioral-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree with minimum 3 years of proven experience\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent knowledge of digital logic gates, clocking and state elementsExcellent knowledge of Verilog/SystemVerilog with ability to write behavioral codeSolid understanding of logic simulationsSome understanding of SPICE circuit simulations understanding of synthesis and timing of digital logicBasic knowledge of reading device level schematics for circuits such as logic gatesFamiliarity of writing scripts in PERL/Python and basic algorithms is a strong plusFamiliarity with blocks such as PLLs/DLLs/SERDES is a strong plusKnowledge of digital signal processing and numerical concepts is a plusKnowledge of probability and statistical concepts is a plusBachelor’s degree with minimum 3 years of proven experience\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Modeling Engineer.\n\nIf you are early in your journey towards a chip design career and wish to challenge yourself in a technical and multi-disciplinary effort, we have an exciting position for you in the extraordinary Apple mixed-signal silicon design team. This position will encourage building of a validated foundation in logic circuits and gentle entry into understanding analog circuits. You will gain transparency into a variety of flows fundamental to modern silicon engineering: insight into full custom schematics for analog as well as high-speed digital circuits, translating functionality of such circuits into an efficient software behavioral representation, simulation of such code and ensuring formal equivalence between custom designs and their abstract representation. You will gain experience and knowledge into software methods and analysis that is increasingly significant for a variety of fields."}, "200437801": {"jobID": "200437801", "origin_search": null, "posted": "Oct 21, 2022", "jobTitle": "System Architecture - Pixel Processing", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437801/system-architecture-pixel-processing?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in optics, physics, EE, CS or computer architecture or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong background in visual signal and image processing. Mapping of algorithms to computer architecture.Computer architecture analysis and design experience for signal processing algorithms.Broad experience in human vision & perception, vision models & metrics, color science, image signal processing and analysis, display processing pipeline, radiometry and photometry, optical simulations & computational modeling, display/optics metrologyExperience in computational image synthesis, shading, rendering and fixed function pixel pipeline modelsExperience in coding with Python, C/C++, MatlabExperience in working with optical design SW such as Zemax for optics component analysisUnderstanding of graphics/compute APIs (DirectX, OpenGL, Vulkan, Metal)MS/PhD in optics, physics, EE, CS or computer architecture or equivalent work experience", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it! \n\nApple is seeking a highly motivated, energetic System Architect to lead and drive system technical designs and roadmaps. The ideal candidate oversees and analyzes key system architectural and implementation trade-offs such as power, visual quality and performance in a thermally constrained system. The person will drive product level capabilities by driving cross functional teams."}, "200464270": {"jobID": "200464270", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Sr Web UI Engineer Digital Apps and Diagnostics, Enterprise Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464270/sr-web-ui-engineer-digital-apps-and-diagnostics-enterprise-systems?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA or foreign equivalent in Computer Science, Computer Engineering or related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Build pixel-perfect Web UI in: HTML, CSS, and JavaScriptReact/Redux/WebPack for front end development requiredJest / Enzyme or equivalent unit-testing experience requiredBuilding reusable components and front-end libraries for future use.Experience in developing secure web applications and knowledge of application vulnerabilities such as Cross Site Scripting (XSS), Cross Site Request Forgery (CSRF) etc.Ability to design, architect and quickly complete projects with minimal supervision and directionWorking experience with NodeJS and Typescript are desired, but not requiredExperience growing, mentoring, and managing a team of high-performing engineers from diverse backgrounds.Experience owning the full lifecycle of an internally- or externally-facing product, including design and analysis, feature prioritization, collecting early feedback, launch, and customer onboarding.Good communication and personal skills: ability to communicate effectively and work well with members of other functional groups in a project team and a solid sense of project ownershipExcitement and passion to work on amazing products.Proven ability to excel in a fast-paced development team.BA or foreign equivalent in Computer Science, Computer Engineering or related field.You will benefit from having knowledge of high performance web UI systems that are responsive and reusable between desktop and mobile platforms. We are a fast paced and dynamic group who is looking for someone who has experience delivering under pressure.", "jobDescription": "Imagine what you could do here! At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\nApple's Digital Apps and Diagnostics Engineering team is looking for a highly creative, detail oriented senior front end/UI Web developer to craft highly usable Web applications that serve millions of customers worldwide.  You will join a world class team and collaborate cross-functionally with other teams around the world."}, "200464694": {"jobID": "200464694", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Battery Test Technician", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464694/battery-test-technician?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "8+ years of relevant experience. Associates degree or greater preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$38.94", "max": "$58.84/hr,"}, "benefits": null, "requirements": "8+ years of relevant experience.Proven experience as a team leader.Strong communication and interpersonal skills.Good organization, time management and decision-making skills.Has a previous track record of success conducting tests - should also be able to process and summarize data.Possesses a high level of attention to detail with handling of samples and test data.Possess experience with electrical and mechanical lab measurement equipment (measurement gauges, volt and impedance meters, as well as automated test equipment, etc).Willingness to work in a repetitive environment.Ability to write detailed and comprehensive test procedures (SOPs) and train operators.Willingness to adjust work days in order to meet schedules during high demand times.Experience with battery cycle life testing using Maccor or Arbin testers is a plus.Experienced in handling of Lithium ion batteries is preferred but not essential.Safety training in previous jobs preferred.Experience working with torque wrenches and thickness gauges preferred.Lifting requirement (weight): 30 lbs.8+ years of relevant experience. Associates degree or greater preferred.", "jobDescription": "Do you have a passion for invention and self-challenge? Are you looking to push the limits of what’s considered feasible? As part of our Battery Engineering group, you’ll be a team member to craft creative battery solutions that deliver more energy in smaller spaces than ever before. We work across subject areas to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new battery technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what batteries can do and improve the product experience for our customers across the world.\n\nIn this highly visible role, you will have the opportunity to use your broad skills as a test technician, and apply them to next generation battery development for Apple products, pushing the boundaries battery innovation!"}, "200449332": {"jobID": "200449332", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449332/cellular-4g-5g-firmware-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10 + years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10 + years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP physical layer and protocol stack procedures and configurationsExperience with firmware test case planning, design, and development for the 4G/5G functional and performance scenariosStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong validated understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesStrong analysis and debugging capabilities to be able to define issues and work with firmware development and systems design teams to close these issuesDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 10 + years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of a world class modem team, we'll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We'll work across fields to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a Cellular 5G/4G Firmware Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multifaceted multi- functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200449681": {"jobID": "200449681", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Clock Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449681/cpu-clock-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceKnowledge of industrial standards and practices in physical design, analysis, and physical verification on large processor or SOC designsExperience in developing and implementing powergrid and clock specificationsSolid knowledge of low power design, physical construction, Spice, EM/IR-Drop/Noise, SIGEM analysis, formal verification, physical verification, and DFMStrong communication skillsProven understanding of CMOS circuit designLayout design background is a plusWorking knowledge of extraction and STA methodology and toolsWorking knowledge of computer architectureSolid understanding of scripting languages such as Perl/TclAbility to work well in a team, problem solver, and self-motivatedMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nAs a CPU Clock Implementation Engineer, you will be driving the planning, design, implementation, and analysis of clock."}, "200458068": {"jobID": "200458068", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Thermal Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458068/thermal-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. (preferred) in Mechanical Engineering with emphasis on Heat Transfer or Fluid Dynamics"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Deep technical and functional expertise in:Conduction, convection (passive and active), and radiationNumeric modeling techniques and concepts (convergence, discretization, and meshing)A thorough understanding of:Heat sinksHeat pipes and vapor chambersFans, blowers, and nontraditional air movers, aero-acousticsCAD and CFD tools (NX, Ansys, StarCCM)Optimization techniquesScripting languages (perl, tcl, etc.)MATLAB, C++, R, JMP or equivalent toolkit for data analysisFlow and thermal measurement techniques.manufacturing processes (for heatsink for example)The ability to think creatively and devise novel solutions to complex, multi-discipline design problemsPersistent attention to detailThe ability to work effectively in a collaborative environmentStrong communication skillsM.S. or Ph.D. (preferred) in Mechanical Engineering with emphasis on Heat Transfer or Fluid Dynamics", "jobDescription": "The Apple Thermal team is seeking a world-class Thermal Engineer to play a key role in the Definition and Design of Apple products. The primary responsibility of this role will be to ensure that, from initial concept to design fruition, all thermal objectives are met or surpassed in order to optimize the user experience of Apple customers."}, "200442814": {"jobID": "200442814", "origin_search": null, "posted": "Nov 9, 2022", "jobTitle": "TFT Panel Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442814/tft-panel-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Ph.D. or M.S degree degree in Electrical Engineering, or B.S degree in Electrical Engineering plus 4 years TFT industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands-on experience, in-depth technical knowledge, and proven track record in the design and development for displays or related electronics.Understanding the basic TFT and panel process is a mustUnderstanding the basic OLED electro-optical characteristics is a mustAbility to perform computer modeling and simulation with SPICE Ability to perform pixel layout and parasitic RC extraction Experience in measuring and characterizing TFT devices Experience in TFT integrated circuit designExcellent written and verbal communication skills are requiredExperience in developing, designing and manufacturing high volume display products is a plus Experience in characterizing panel optical and electrical performance is a plusExperience in Verilog A behavior modeling is a plusPh.D. or M.S degree degree in Electrical Engineering, or B.S degree in Electrical Engineering plus 4 years TFT industry experience", "jobDescription": "Apple is looking for a world-class talent panel design engineer to design, develop and launch the next-generation display technologies for Apple products. The panel design team is responsible for delivering the advanced panel designs and technologies to enable the world’s best display performance in Apple Products. Each Individual will serve as a focal point in architecting and developing the total pixel and panel designs. This includes Thin-Film Transistor (TFT) & Organic Light Emission Diode (OLED) device modeling, electro-optical simulation, TFT integrated circuit design, panel architecture, and whole panel function simulation."}, "200441970": {"jobID": "200441970", "origin_search": null, "posted": "Nov 8, 2022", "jobTitle": "Optical System Engineer - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441970/optical-system-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Graduate degree in Optics or Physics or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Resourceful, prepared to champion your work in front of a large group, ready to take initiative, enjoys working in cross-functional teamsExperience in lens design, tolerance analysisExperience in Stray light analysisProficiency with ZEMAX, CODE V, FRED, LightTools, etc.Ability to perform comprehensive optical and image quality characterization of the lens and the camera moduleAbility to communicate optical design decisions to multi-functional teamsExperience making difficult design decisions with limited informationAbility to analyze production data and extract relevant dataCollaborate with the assembly and packaging groups to support integration of camera lens into moduleGraduate degree in Optics or Physics or equivalent work experienceHigh energy, multi-tasker, resourceful problem solver, ability to work under pressure, take initiativeWorking knowledge of opto-mechanics and optics manufacturingTrack record of imaging related innovationsWorking knowledge of thin film physics and fabrication", "jobDescription": "Why Apple? \n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Camera Hardware Engineering group is responsible for all research, design, development, test and qualification of camera hardware for Apple products. The team is looking for an Optical Engineer to develop and support custom lens design and development."}, "200459179": {"jobID": "200459179", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Power Management Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459179/power-management-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Must have extraordinary EE fundamentals.2 + years overall experience in industry.Experience in one or more of the following areas is critical: switching mode power supply, linear power supply, PMIC, system power architecture, charger, battery gas gauge, BMU, and camera flash driversExperience in prototyping circuits and products in the labStrong interpersonal skillsBS/MS EE or equivalent", "jobDescription": "The iPhone Division is seeking a hardworking Power Management engineer for an individual contributor position on an outstanding hardware team responsible for developing the next-generation iPhones and related products. Responsibilities include conceptualization, requirement collection, design, implementation, integration, validation, and productization of the Power Management subsystems (PMIC, charger, battery management, camera flash driver, discrete power supplies, etc.). Collaboration is key to success in this position. Collaboration opportunities exist with internal multi-functional HW and SW teams, contract manufactures, and industry component/IC suppliers. The applicant should be familiar with the design of portable low-power products, preferably with experience in a consumer electronics environment taking care of high-volume and high-quality products."}, "200401615": {"jobID": "200401615", "origin_search": null, "posted": "Jul 21, 2022", "jobTitle": "iPhone Power Management Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200401615/iphone-power-management-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Must have extraordinary EE fundamentals.2 + years overall experience in industry.Experience in one or more of the following areas is critical: switching mode power supply, linear power supply, PMIC, system power architecture, charger, battery gas gauge, BMU, and camera flash driversExperience in prototyping circuits and products in the labStrong interpersonal skillsBS/MS EE or equivalent", "jobDescription": "The iPhone Division is seeking a hardworking Power Management engineer for an individual contributor position on an outstanding hardware team responsible for developing the next-generation iPhones and related products. Responsibilities include conceptualization, requirement collection, design, implementation, integration, validation, and productization of the Power Management subsystems (PMIC, charger, battery management, camera flash driver, discrete power supplies, etc.). Collaboration is key to success in this position. Collaboration opportunities exist with internal multi-functional HW and SW teams, contract manufactures, and industry component/IC suppliers. The applicant should be familiar with the design of portable low-power products, preferably with experience in a consumer electronics environment taking care of high-volume and high-quality products."}, "200389635": {"jobID": "200389635", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "WW Salesforce Business Analyst & Admin", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200389635/ww-salesforce-business-analyst-admin?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor's degree or equivalent experience required.\n- Master's Degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$128,000", "max": "$196,000,"}, "benefits": null, "requirements": "Strong knowledge of Consumer and Retail sales;  Experience in sales operations, partner management, and enablement preferredProven experience as a business analyst and admin role leading enterprise-scale CRM and PRM projectsDeep expertise in Salesforce Platform functionality and best practices;  Experience with the Salesforce AppExchange and a deep understanding of both this ecosystem as well as native Salesforce capabilitiesProven experience in implementation, including the ability to determine configuration, customization, and/or integrations with external systemsHands-on experience with the configuration of platform features including user management, profiles, permission sets, role hierarchy, org-wide defaults, sharing rules, territories, custom objects, new page layouts, custom fields, formula fields, validations, workflows rules, email templates, process builder, flows, lightning pages, managed packages, etc.Excellent organization skills, with a natural inclination for both strategic and tactical planning, and the ability to turn strategy into tangible results.Solid understanding of Agile / Scrum delivery modelsPrior experience in SDLC project management and analysis including scoping / timeline management, documenting use cases, process flows/swim lane diagrams, requirements, user acceptance testing, change management, etc.Working knowledge of process documentation and project management softwareExperience working with large-scale, complex datasets and using Salesforce data tools;  Ability to design and implement dashboards in Einstein Analytics and Tableau CRM requiredStrong communication and presentation skills with the ability to quickly establish trust, credibility, and influence across a variety of cross-functional and multi-directional partners.Experience collaborating on global projects with a geographically dispersed team in a highly-matrixed, fast-paced environment.- Bachelor's degree or equivalent experience required.\n- Master's Degree preferred.- Salesforce Administrator Certification (required)- Agile SCRUM Master Certification (preferred)- Salesforce Sales Cloud Consultant Certification (preferred)- Salesforce Marketing Cloud Consultant (preferred)", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nAre you a strategic thinker who excels at tactical execution? Do you love to solve problems and have an uncanny knack for analytics? As part of our World Wide Sales Business Process Re-engineering (BPR) group, you and your team will be responsible for implementing strategies, programs, tools, and processes that enable the business to drive sales, improve customer experience, and innovate the way we lead and support one of the largest channel operations in the world. \n\nThese solutions are typically new technical capabilities and/or the transformation of business processes to support continuously evolving sales motions, expanding Geo coverage and routes-to-market, and growing complexity of sales plays. As a WW Salesforce Business Analyst & Admin, you will deliver key initiatives that support a broad, cohesive sales solution strategy."}, "200452809": {"jobID": "200452809", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Software Engineer: SoC Level Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452809/software-engineer-soc-level-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Develop SoC and CPU directed and random stress workloadsDebug issues pre-silicon or post-siliconDevelop and maintain system-level SW platformWork with designers and architects to accomplish validation goalsBS and a minimum of 10 years relevant industry experience", "jobDescription": "What happens when you run almost everything on a System-On-Chip (SoC) all at once while powering down blocks, hammering new features, and running a complex suite of algorithms? You find bugs. That’s exactly what we do. We break Apple Silicon with our system level SW suite that runs mostly post-silicon, leverages pre-silicon and finds corner-case hardware bugs. Join our team to uphold the high quality of Apple Silicon."}, "200443559": {"jobID": "200443559", "origin_search": null, "posted": "Nov 14, 2022", "jobTitle": "Display Electrical Hardware Architect / Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443559/display-electrical-hardware-architect-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "PhD/MSEE/BSEE plus minimum 8 years industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong math and analytical skillsSolid EE fundamentals (analog/mixed-signal/digital design, power electronics, etc)Prior complex system design and/or analog/mixed-signal circuit design experiencePrior knowledge in display and/or touch hardware and technologies is a plusPrior knowledge in OLED displays is preferredPrevious experience in system modeling and integration is a plusExpert knowledge in Matlab and/or circuit simulation toolsExcellent verbal and written communication skillsGood leadership skills to lead multiple Apple and vendor effortsAttention to project detail and task tracking to ensure error-free and short time to market productsPhD/MSEE/BSEE plus minimum 8 years industry experience", "jobDescription": "Apple display engineering organization is looking for a senior display electrical hardware architect to work on the next generation display electronics and technologies as well as their interactions with other subsystems such as touch, audio, antenna, etc. In this role you will be architecting display sub-systems that seamlessly integrate into beautiful Apple products. Strong collaboration and interaction with cross-functional teams offer an incredible opportunity to extend technical depth and breadth as well as learning from world-class authorities in multiple disciplines spanning from EE to system,  silicon, panel, mechanical, manufacturing, optical, etc. Your work will have high visibility across the company and strong influence on product definition."}, "200461049": {"jobID": "200461049", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461049/engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$260,000,"}, "benefits": null, "requirements": "Experience leading and developing a team of highly skilled engineers in a cross-functional environmentStrong track record of shipping high quality applications for Apple products (e.g., macOS, iOS, tvOS or watchOS)Experience collaborating with other disciplines including design, art, and quality assuranceDetailed understanding of the OS, graphics, networking, and other sub-systemsFamiliarity in one or more of the following languages: C/C++, Objective-C, SwiftExtraordinary attention to detailInterest or proficiency in UI/UX designExperience with low-level graphics APIs (Metal, OpenGL, DirectX) Experience developing AR/VR applicationsFamiliarity with ARKit", "jobDescription": "Are you ready to explore a new application domain with a talented and collaborative team? Apple's Technology Development Group is seeking a hands-on leader to help shape and guide the development of graphically intense and highly interactive applications. Our team is working with some of Apple's most advanced technologies including the augmented reality (AR) and virtual reality (VR) support offered in ARKit and Metal 2. As a leader within our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every day."}, "200366157": {"jobID": "200366157", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Data Plane Developer, Infrastructure Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200366157/data-plane-developer-infrastructure-services?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and MS in Computer Science"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum 5+ years of experience in production system buildingExperience in building high performance virtual data pathsValidated foundation in architectural design, data structures and algorithmsExpertise in kernel programmingExperience in working with Layer 3+ networksStrong organizational and communication skillsSolid ability to prioritize, deliver on daring deadlines and drive closuresGood ability to prioritise and debug production issuesProgramming languages: Go, C, Any scriptingHighly proficient in git and config management systemsBS and MS in Computer Science", "jobDescription": "We are seeking individuals who are passionate about building and operating highly virtualized, performant and robust systems to support one of the world’s largest cloud infrastructures."}, "200431560": {"jobID": "200431560", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "App Compatibility QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431560/app-compatibility-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or related field, or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "2+ years of experience with manual and automated testing on mobile platforms.Experience writing, triaging, and debugging tests, as well as test harness enhancement, primarily focused on UI applications.Development experience in Python, Swift, or similar languages.Ability to identify and investigate difficult problems and independently work towards results.Creative and critical thinker with strong problem-solving skills to investigate and debug difficult issues, often involving limited information.Passion for software and product quality; commitment to Apple’s customers and their high standards; and steadfast focus on the customer experience.BS degree in Computer Science or related field, or equivalent work experience.Experience with Continuous Integration systems.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe App Compatibility Team is responsible for identifying bugs within third-party apps on future iOS, macOS, tvOS, iPadOS, and watchOS releases. We ensure a high-quality customer experience when Apple ships software updates and new devices. \n\nAs an engineer on our team, you’ll contribute to both our manual and automation efforts. We help internal framework teams understand their impact on existing apps and guard our operating systems against changes that would negatively impact critical applications. With the global success of the App Store and the wide array of apps available for all of Apple’s platforms, your impact will be worldwide and will help improve the customer experience for everyone using our products."}, "200443708": {"jobID": "200443708", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Display Technologist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443708/display-technologist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "This position generally requires a PhD degree, or a Master degree with more than 5 years of experience in relevant industrial work environment."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Good understanding of semiconductor device physics and principles of LEDIn-depth knowledge and hands-on cleanroom experience on optoelectronic device processingHands-on experience in optoelectronic / optical device characterization and failure analysisProficiency using programming languages (Matlab, Python, JMP) to analyze data and tackle problemsProven record of analytical, critical thinking and problem-solving skillsExcellent written and verbal communication skillsGood project management, written and verbal communication skillsThis position generally requires a PhD degree, or a Master degree with more than 5 years of experience in relevant industrial work environment.", "jobDescription": "At Apple, we believe that new ideas have a way of becoming outstanding products. As part of our Display Technologies group, we are charged with assessing disruptive technology for future Apple products. If you are enthusiastic about working in a highly capable team developing new technology and working on challenges that no one has solved yet, this is a great chance. We are looking for a Display Technologist to help drive an LED based display project at the technology development stage. We are looking for a highly motivated and collaborative individual with clear communication skills and strong technical background on semiconductor device fabrication and characterization."}, "200451726": {"jobID": "200451726", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Display Electrical Hardware Architect / Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451726/display-electrical-hardware-architect-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "PhD/MSEE/BSEE plus minimum 8 years industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong math and analytical skillsSolid EE fundamentals (analog/mixed-signal/digital design, power electronics, etc)Prior complex system design and/or analog/mixed-signal circuit design experiencePrior knowledge in display and/or touch hardware and technologies is a plusPrior knowledge in OLED displays is preferredPrevious experience in system modeling and integration is a plusExpert knowledge in Matlab and/or circuit simulation toolsExcellent verbal and written communication skillsGood leadership skills to lead multiple Apple and vendor effortsAttention to project detail and task tracking to ensure error-free and short time to market productsPhD/MSEE/BSEE plus minimum 8 years industry experience", "jobDescription": "Apple display engineering organization is looking for a senior display electrical hardware architect to work on the next generation display electronics and technologies as well as their interactions with other subsystems such as touch, audio, antenna, etc. In this role you will be architecting display sub-systems that seamlessly integrate into beautiful Apple products. Strong collaboration and interaction with cross-functional teams offer an incredible opportunity to extend technical depth and breadth as well as learning from world-class authorities in multiple disciplines spanning from EE to system,  silicon, panel, mechanical, manufacturing, optical, etc. Your work will have high visibility across the company and strong influence on product definition."}}