{"200450043": {"jobID": "200450043", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450043/cpu-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceFamiliarity with high performance microprocessor architectureKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture and implementation techniquesDesign experience in deep submicron technologies and basic device physicsExperience with scripting in Perl and C is requiredMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nAs a CPU Power Engineer, you will be responsible for the overall dynamic and static power of the core for different applicable use cases. You will drive CPU power budgeting, measurement, and analysis and provide global power methodologies for reduction across micro-architecture and gate-level design spaces."}, "200450041": {"jobID": "200450041", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450041/cpu-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceFamiliarity with high performance microprocessor architectureKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture and implementation techniquesDesign experience in deep submicron technologies and basic device physicsExperience with scripting in Perl and C is requiredMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nAs a CPU Power Engineer, you will be responsible for the overall dynamic and static power of the core for different applicable use cases. You will drive CPU power budgeting, measurement, and analysis and provide global power methodologies for reduction across micro-architecture and gate-level design spaces."}, "200366157": {"jobID": "200366157", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Data Plane Developer, Infrastructure Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200366157/data-plane-developer-infrastructure-services?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and MS in Computer Science"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum 5+ years of experience in production system buildingExperience in building high performance virtual data pathsValidated foundation in architectural design, data structures and algorithmsExpertise in kernel programmingExperience in working with Layer 3+ networksStrong organizational and communication skillsSolid ability to prioritize, deliver on daring deadlines and drive closuresGood ability to prioritise and debug production issuesProgramming languages: Go, C, Any scriptingHighly proficient in git and config management systemsBS and MS in Computer Science", "jobDescription": "We are seeking individuals who are passionate about building and operating highly virtualized, performant and robust systems to support one of the world’s largest cloud infrastructures."}, "200431560": {"jobID": "200431560", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "App Compatibility QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431560/app-compatibility-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or related field, or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "2+ years of experience with manual and automated testing on mobile platforms.Experience writing, triaging, and debugging tests, as well as test harness enhancement, primarily focused on UI applications.Development experience in Python, Swift, or similar languages.Ability to identify and investigate difficult problems and independently work towards results.Creative and critical thinker with strong problem-solving skills to investigate and debug difficult issues, often involving limited information.Passion for software and product quality; commitment to Apple’s customers and their high standards; and steadfast focus on the customer experience.BS degree in Computer Science or related field, or equivalent work experience.Experience with Continuous Integration systems.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe App Compatibility Team is responsible for identifying bugs within third-party apps on future iOS, macOS, tvOS, iPadOS, and watchOS releases. We ensure a high-quality customer experience when Apple ships software updates and new devices. \n\nAs an engineer on our team, you’ll contribute to both our manual and automation efforts. We help internal framework teams understand their impact on existing apps and guard our operating systems against changes that would negatively impact critical applications. With the global success of the App Store and the wide array of apps available for all of Apple’s platforms, your impact will be worldwide and will help improve the customer experience for everyone using our products."}, "200451726": {"jobID": "200451726", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Display Electrical Hardware Architect / Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451726/display-electrical-hardware-architect-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "PhD/MSEE/BSEE plus minimum 8 years industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong math and analytical skillsSolid EE fundamentals (analog/mixed-signal/digital design, power electronics, etc)Prior complex system design and/or analog/mixed-signal circuit design experiencePrior knowledge in display and/or touch hardware and technologies is a plusPrior knowledge in OLED displays is preferredPrevious experience in system modeling and integration is a plusExpert knowledge in Matlab and/or circuit simulation toolsExcellent verbal and written communication skillsGood leadership skills to lead multiple Apple and vendor effortsAttention to project detail and task tracking to ensure error-free and short time to market productsPhD/MSEE/BSEE plus minimum 8 years industry experience", "jobDescription": "Apple display engineering organization is looking for a senior display electrical hardware architect to work on the next generation display electronics and technologies as well as their interactions with other subsystems such as touch, audio, antenna, etc. In this role you will be architecting display sub-systems that seamlessly integrate into beautiful Apple products. Strong collaboration and interaction with cross-functional teams offer an incredible opportunity to extend technical depth and breadth as well as learning from world-class authorities in multiple disciplines spanning from EE to system,  silicon, panel, mechanical, manufacturing, optical, etc. Your work will have high visibility across the company and strong influence on product definition."}, "200461049": {"jobID": "200461049", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461049/engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$260,000,"}, "benefits": null, "requirements": "Experience leading and developing a team of highly skilled engineers in a cross-functional environmentStrong track record of shipping high quality applications for Apple products (e.g., macOS, iOS, tvOS or watchOS)Experience collaborating with other disciplines including design, art, and quality assuranceDetailed understanding of the OS, graphics, networking, and other sub-systemsFamiliarity in one or more of the following languages: C/C++, Objective-C, SwiftExtraordinary attention to detailInterest or proficiency in UI/UX designExperience with low-level graphics APIs (Metal, OpenGL, DirectX) Experience developing AR/VR applicationsFamiliarity with ARKit", "jobDescription": "Are you ready to explore a new application domain with a talented and collaborative team? Apple's Technology Development Group is seeking a hands-on leader to help shape and guide the development of graphically intense and highly interactive applications. Our team is working with some of Apple's most advanced technologies including the augmented reality (AR) and virtual reality (VR) support offered in ARKit and Metal 2. As a leader within our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every day."}, "200398871": {"jobID": "200398871", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Watch Touch Hardware, Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200398871/watch-touch-hardware-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSME required; MSME, PhD preferred (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 4+ years of experience in a mechanical design, failure analysis, or validation role.Ability to inform design intent (requirements) and define path-to-validation.Ability to leverage various analysis techniques (tolerance analysis, FEA, CT, X-ray, FIB/SEM/EDX, Monte Carlo, design-of-experiments, etc.) to inform root cause.Ability to collaborate with a diverse cross-functional team and external vendors to achieve project goals.Excellent written, verbal, and visual communication skills are required.Familiarity with building 3D CAD and drafting 2D technical drawings is required.Strong technical curiosity and desire to learn is required.Proficiency in statistical analysis in MATLAB or JMP is preferred, but not required.Familiarity with sensor technology, analog/digital signals, flex circuits, IC packaging is preferred, but not required.BSME required; MSME, PhD preferred (or equivalent)", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?   \n\nThe Apple Watch Touch team is looking for a talented mechanical engineer to influence new designs as well as own and drive validation for new products and sensing technologies. You will work within a cross-functional team of experts whose shared goal is to ship products that surprise and delight our customers and break new ground in technology. Millions of customers will interact with the hardware you invent, develop and validate."}, "200443708": {"jobID": "200443708", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Display Technologist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443708/display-technologist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "This position generally requires a PhD degree, or a Master degree with more than 5 years of experience in relevant industrial work environment."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Good understanding of semiconductor device physics and principles of LEDIn-depth knowledge and hands-on cleanroom experience on optoelectronic device processingHands-on experience in optoelectronic / optical device characterization and failure analysisProficiency using programming languages (Matlab, Python, JMP) to analyze data and tackle problemsProven record of analytical, critical thinking and problem-solving skillsExcellent written and verbal communication skillsGood project management, written and verbal communication skillsThis position generally requires a PhD degree, or a Master degree with more than 5 years of experience in relevant industrial work environment.", "jobDescription": "At Apple, we believe that new ideas have a way of becoming outstanding products. As part of our Display Technologies group, we are charged with assessing disruptive technology for future Apple products. If you are enthusiastic about working in a highly capable team developing new technology and working on challenges that no one has solved yet, this is a great chance. We are looking for a Display Technologist to help drive an LED based display project at the technology development stage. We are looking for a highly motivated and collaborative individual with clear communication skills and strong technical background on semiconductor device fabrication and characterization."}, "200448415": {"jobID": "200448415", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Sr Wireless Network Engineer, Infrastructure Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448415/sr-wireless-network-engineer-infrastructure-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "College degree (BA or BS) or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "12 to 14 years of experience in Enterprise wireless networking with IEEE 802.11 standards, encryption, WIDS, rogue detection, 802.1x, RADIUS, EAP-TLS, wireless client chipset/driver, RF engineering for wireless planning, along with multi-vendor technologies including Cisco, Aruba Networks controller, AOS8, Aruba I/AP, Aruba Airwave, Mist wireless, Meraki wireless, Aruba ClearPass, Cisco AerOS, IOS-XE, Cisco DNAC, Mobility-Anchor, and SplunkExperience in operating and leading a large-scale network infrastructure using your wireless Networking experience.Experience with various wireless tools such as Spectrum Analyzer, Protocol Analyzer, and Site Survey Tools and qualified in automation, tooling, and scripting (Ansible and python preferred).Proven understanding of TCP/IP (both IPv4/IPv6), routing, and switching.Experience with wireless supporting voice and video applicationDriving strategic projects that scale and are highly availableStrong analytical and organizational skills along with a professional demeanor.College degree (BA or BS) or equivalent work experience.CCIE or equivalent certifications in WirelessExtensive knowledge of at least two to three vendor CLI of IOS-XE, EOS, AEROS, AOS, are requiredAbility to script using Ansible, Python, and Shell a plus", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job; there's no telling what you could accomplish.\nAre you an adventurous problem solver? Do you love the challenge of advancing a widely accepted technology? Join the Enterprise Network team under the Infrastructure Services organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! You'll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, LTE, 5G and GPS, with multi-vendor technology. You'll collaborate with innovative product teams, take up challenges on sophisticated issues, and design, develop, and patent the next generation of our innovative connectivity technologies. This role requires cross collaboration across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers connections with their devices. If you join us, you'll help build world-renowned wireless systems so seamlessly that they almost feel like magic!"}, "200458539": {"jobID": "200458539", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC Physical Design Engineer, Electrical Analysis", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458539/soc-physical-design-engineer-electrical-analysis?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Solid background and knowledge on computer architecture and digital system, circuit design, and low power techniques.Hands-on experience with ASIC or AMS physical implementation and analysis flow.Possess scripting skills to automate and debug verification flows for digital VLSI design.You have knowledge with industrial EDA backend verification tools like Redhawk, PrimeRail or Voltus and PrimeTime and Tempus.Past experience with sign-off on successful chip tape-outs will help you succeed on our team.Circuit design background and SPICE experience are a plus.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nAs a Physical Electrical Analysis Engineer on our SoC team, you will be driving the electrical analysis and verification of an SoC."}, "200441686": {"jobID": "200441686", "origin_search": null, "posted": "Nov 8, 2022", "jobTitle": "Thermal Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441686/thermal-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. (preferred) in Mechanical Engineering with emphasis on Heat Transfer or Fluid Dynamics"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep technical and functional expertise in:Conduction, convection (passive and active), and radiationNumeric modeling techniques and concepts (convergence, discretization, and meshing)A thorough understanding of:Heat sinksHeat pipes and vapor chambersFans, blowers, and nontraditional air movers, aero-acousticsCAD and CFD tools (NX, Ansys, StarCCM)Optimization techniquesScripting languages (perl, tcl, etc.)MATLAB, C++, R, JMP or equivalent toolkit for data analysisFlow and thermal measurement techniques.manufacturing processes (for heatsink for example)The ability to think creatively and devise novel solutions to complex, multi-discipline design problemsPersistent attention to detailThe ability to work effectively in a collaborative environmentStrong communication skillsM.S. or Ph.D. (preferred) in Mechanical Engineering with emphasis on Heat Transfer or Fluid Dynamics", "jobDescription": "The Apple Thermal team is seeking a world-class Thermal Engineer to play a key role in the Definition and Design of Apple products. The primary responsibility of this role will be to ensure that, from initial concept to design fruition, all thermal objectives are met or surpassed in order to optimize the user experience of Apple customers."}, "200448435": {"jobID": "200448435", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Thermal Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448435/thermal-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. (preferred) in Mechanical Engineering with emphasis on Heat Transfer or Fluid Dynamics"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep technical and functional expertise in:Conduction, convection (passive and active), and radiationNumeric modeling techniques and concepts (convergence, discretization, and meshing)A thorough understanding of:Heat sinksHeat pipes and vapor chambersFans, blowers, and nontraditional air movers, aero-acousticsCAD and CFD tools (NX, Ansys, StarCCM)Optimization techniquesScripting languages (perl, tcl, etc.)MATLAB, C++, R, JMP or equivalent toolkit for data analysisFlow and thermal measurement techniques.manufacturing processes (for heatsink for example)The ability to think creatively and devise novel solutions to complex, multi-discipline design problemsPersistent attention to detailThe ability to work effectively in a collaborative environmentStrong communication skillsM.S. or Ph.D. (preferred) in Mechanical Engineering with emphasis on Heat Transfer or Fluid Dynamics", "jobDescription": "The Apple Thermal team is seeking a world-class Thermal Engineer to play a key role in the Definition and Design of Apple products. The primary responsibility of this role will be to ensure that, from initial concept to design fruition, all thermal objectives are met or surpassed in order to optimize the user experience of Apple customers."}, "200461978": {"jobID": "200461978", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "6G Cellular Platform Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461978/6g-cellular-platform-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "Minimum requirement of BS and 10+ years of relevant industry experience.\nMaster’s or PhD degree in Electrical Engineering or equivalent degree with 10+ years of work experience is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proven track record in wireless product design and prototyping.A deep understanding of real-world wireless systems, network architectures, user applications, and end-user device platform architectures (such as power delivery, processing, and memory systems) is required.Good programming skills are a plus.Consistent record in several of the following areas related to wireless systems and prototypes:1.Setting and refining system requirements to build solutions for prototype design, sub-component design, and validation.2.Creation of system abstractions and simplifications that allow rapid validation of research hypotheses.3.Applying AI/ML techniques to specific problem statements for wireless communications.4.Understanding product and application layer architectures in conjunction with deep hands-on operational knowledge of wireless platforms and devices.Confirmed deep technical expertise in at least one of the following areas:1.5G NR and 3GPP standards.2.IEEE wireless standards.3.Cellular and wireless networks.4.Wireless modem design and prototyping;5.Performance optimization in live networks.Excellent communication and leadership skills. Experience in leading multi-disciplinary engineering investigations with technical expertise is highly desired.Minimum requirement of a BS and 10+ years of relevant industry experience.Minimum requirement of BS and 10+ years of relevant industry experience.\nMaster’s or PhD degree in Electrical Engineering or equivalent degree with 10+ years of work experience is preferred.", "jobDescription": "Imagine what you can do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Inquisitive people and inspiring, innovative technologies are the norms here.\n\nDo you love working on challenges that no one has solved yet? Are you ready to be part of a team redefining wireless technology? Join us to help deliver the next groundbreaking Apple product!"}, "200452463": {"jobID": "200452463", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "SoC Audio Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452463/soc-audio-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "We'd like you to have:Experiences in low power digital IP related designProficiency in ASIC logic design and SoC integrationSystem architecture knowledge including one or more of the following:Bus fabric, especially APB/AHB/AXITiered memory systemsSystem debug architectureSerial communications like UART/SPI/I2C, etc.Hands-on skills in Shell and Perl scripting, Python is a plusPerformance analysis experience desirableEmbedded firmware development knowledge would be an advantageStrong skills in solving complex problems on the flyExcellent communication for collaboration across different functionsBS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. In this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}, "200447481": {"jobID": "200447481", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447481/cellular-4g-5g-firmware-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3 + years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS and 3 + years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP physical layer and protocol stack procedures and configurationsExperience with firmware test case planning, design, and development for the 4G/5G functional or performance or RF scenariosStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong validated understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesStrong RF background and familiarity with RF systems fundamentals as well as hands-on experience with RF test equipment including network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc. (a plus)Strong analysis and debugging capabilities to be able to define issues and work with firmware development and systems design teams to close these issuesDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 3 + years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of a world class modem team, we'll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We'll work across fields to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a Cellular 5G/4G Firmware Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200449328": {"jobID": "200449328", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449328/cellular-4g-5g-firmware-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3 + years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3 + years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP physical layer and protocol stack procedures and configurationsExperience with firmware test case planning, design, and development for the 4G/5G functional or performance or RF scenariosStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong validated understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesStrong RF background and familiarity with RF systems fundamentals as well as hands-on experience with RF test equipment including network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc. (a plus)Strong analysis and debugging capabilities to be able to define issues and work with firmware development and systems design teams to close these issuesDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 3 + years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of a world class modem team, we'll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We'll work across fields to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a Cellular 5G/4G Firmware Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200430846": {"jobID": "200430846", "origin_search": null, "posted": "Oct 12, 2022", "jobTitle": "US-Senior Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200430846/us-senior-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Willowbrook", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to collaborate with the store leadership team to develop strategic plans across multiple business groups, improving process and surpassing standards to drive the business in the storeProven ability to inspire, coach, train, and develop store team members to consistently provide exceptional customer service and drive for resultsExperience adapting to challenges, providing support, and guiding communications in a constantly changing retail environment• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome — a retail background is not necessary.• You have a passion for learning about Apple technology and products.• You’re fluent in English (both written and spoken) and the local language. Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a real passion for helping others learn and grow?   The challenges and opportunities of a continuously evolving business make leadership at the Apple Store a rewarding career. It’s your job as a Senior Manager to lead the staff and operations of one or more store areas and seek solutions and results that create a high-performing work environment. By reading situations quickly and acting courageously, you are able to build success for the business and promote the Apple brand through unparalleled customer service."}, "200446048": {"jobID": "200446048", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "ESD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446048/esd-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with minimum 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The ideal candidate should have the following qualifications -Deep understanding of transistor device characteristicsSolid understanding of models used for testing ESD, including HBM, CDM, MM and IEC-61000-4-2Knowledge of state-of-the-art ESD circuit design techniques and topologiesHands-on experience with design/layout EDA tools, including Virtuoso, Calibre, Allegro, etc.Knowledge of ESD checking tools like PERC and PathfinderExperience with Si processes used for high voltage, RF, or advanced ASICsExperience with ESD/LUP test and characterization equipmentStrong initiative, teamwork, and ownership of responsibilities, productive, able to meet bold deadlinesExcellent written and verbal communication skillsBSEE with minimum 3 years of experience", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. In this highly visible role, you will take ownership of the ESD and Latch-Up requirements of all ICs developed by and for Apple. Your mission is to ensure the silicon is designed to meet Apple's ESD specifications and manufacturing requirements. The role involves working closely with diverse teams within Apple as well as external vendors. Occasional travel might be required.\n\nDo you love working on challenges that no one has solved yet? Are you excited to build Apple’s products that strive for the highest expectations of quality, innovation and efficiency? We have an opportunity for an especially innovative ESD Designer with strong fundamentals! We are looking forward to having you join our fast growing team and help us deliver on these challenges while enjoying an amazing culture where you lead your career!"}, "200446041": {"jobID": "200446041", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "ESD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446041/esd-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with minimum 3 years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate should have the following qualificationsDeep understanding of transistor device characteristicsSolid understanding of models used for testing ESD, including HBM, CDM, MM and IEC-61000-4-2Knowledge of state-of-the-art ESD circuit design techniques and topologiesHands-on experience with design/layout EDA tools, including Virtuoso, Calibre, Allegro, etc.Knowledge of ESD checking tools like PERC and PathfinderExperience with Si processes used for high voltage, RF, or advanced ASICsExperience with ESD/LUP test and characterization equipmentStrong initiative, collaboration, and ownership of responsibilities, productive, able to meet bold deadlinesExcellent written and verbal communication skillsBSEE with minimum 3 years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. In this highly visible role, you will take ownership of the ESD and Latch-Up requirements of all ICs developed by and for Apple. Your mission is to ensure the silicon is designed to meet Apple's ESD specifications and manufacturing requirements. The role involves working closely with diverse teams within Apple as well as external vendors. Occasional travel might be required.\n\nDo you love working on challenges that no one has solved yet? Are you excited to build Apple’s products that strive for the highest expectations of quality, innovation and efficiency? We have an opportunity for an especially innovative ESD Designer with strong fundamentals! We are looking forward to having you join our fast growing team and help us deliver on these challenges while enjoying an amazing culture where you lead your career!"}, "200446045": {"jobID": "200446045", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "ESD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446045/esd-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with minimum of 3 years of industry experience\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate should have the following qualifications:Deep understanding of transistor device characteristicsSolid understanding of models used for testing ESD, including HBM, CDM, MM and IEC-61000-4-2Knowledge of state-of-the-art ESD circuit design techniques and topologiesHands-on experience with design/layout EDA tools, including Virtuoso, Calibre, Allegro, etc.Knowledge of ESD checking tools like PERC and PathfinderExperience with Si processes used for high voltage, RF, or advanced ASICsExperience with ESD/LUP test and characterization equipmentStrong initiative, collaboration, and ownership of responsibilities, productive, able to meet challenging deadlinesExcellent written and verbal communication skillsBSEE with minimum of 3 years of industry experience\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. In this highly visible role, you will take ownership of the ESD and Latch-Up requirements of all ICs developed by and for Apple. Your mission is to ensure the silicon is designed to meet Apple's ESD specifications and manufacturing requirements. The role involves working closely with diverse teams within Apple as well as external vendors. Occasional travel might be required\n\nDo you love working on challenges that no one has solved yet? Are you excited to build Apple’s products that strive for the highest expectations of quality, innovation and efficiency? We have an opportunity for an especially innovative ESD Designer with strong fundamentals! We are looking forward to having you join our fast growing team and help us deliver on these challenges while enjoying an amazing culture where you lead your career!"}, "200449768": {"jobID": "200449768", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Graphics RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449768/graphics-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We will need you to demonstrate their knowledge of logic design principles along with timing and power implicationsLogic design, including simulation and debugUnderstanding of timing analysis, and familiarity with synthesis, placement, and routingAn understanding of low power microarchitecture techniques is a key qualification for successYou will be expected to perform performance and power analysisAbility to code using System Verilog HDLExperience with scripting languages such as Python, Ruby, or PerlDemonstrate the ability to work well in a teamMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this highly visible role, team members will develop power efficient, high performance 3D graphics processors targeted for low power mobile devices."}, "200445726": {"jobID": "200445726", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Product Design Engineer - Home Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445726/product-design-engineer-home-products?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors of Science in Mechanical Engineering; Masters Degree in an Engineering discipline preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Bachelors of Science in Mechanical Engineering2 or more years of experience in product designExperience developing parts and assemblies in 3-D CADExperience in plastic and metal part designExperience with design cycle from concept to manufacturingInnovative thinking, high personal motivation, deep engineering capabilityThis position requires international travel (up to 20%).Preferred Experience: Masters Degree in an Engineering disciplineDirect management or leadership of product development engineering teamsHigh volume mass production experienceExperience in FEAKnowledge of material scienceExperience in the areas of: GD&T, Tolerance Analysis, Statistical Analysis, Design of ExperimentsBachelors of Science in Mechanical Engineering; Masters Degree in an Engineering discipline preferred", "jobDescription": "Looking for a highly motivated mechanical engineer to join the Home product design group. You will be part of a mechanical product design team responsible for conceiving, designing and producing exciting new products."}, "200450168": {"jobID": "200450168", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "AMS Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450168/ams-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience in Analog Mixed Signal design with advanced CMOS technology nodes. The candidate should have a focus and background in AMS modeling and verification, basic digital design, timing closure, and analog to digital interface. We are open to multiple experience levels.Understanding of analog and mixed signal circuit design.Direct tape out experience with one or more of the following blocks: ADCs, DACs, PLLs, SERDES, source synchronous digital interfaces, and custom digital circuits.Familiarity with the integration flows and integration challenges of Analog and Mixed Signal circuits with the Digital portion in an SOC.Experienced in timing analysis (STA) of analog to digital interface.Familiarity with STA tools like NanoTime and PrimeTime.Working knowledge of RTL, System Verilog, PnR, Modeling and Design verification flows is a plus.Experienced with mixed-signal mode verification methodologies including Verilog-AMS and behavioral modeling in Verilog-A and Verilog-D.Having coding experience in Python is a plus.Experience in wireless SoC products is highly desirable.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an Analog Mixed Signal (AMS) Integration Engineer, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200403298": {"jobID": "200403298", "origin_search": null, "posted": "Jul 19, 2022", "jobTitle": "AR Technical Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200403298/ar-technical-designer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Degree in Computer Science, Interaction Design, Game Design or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proficiency in at least one of these programming languages: Swift, Python, C#, or C++Proficiency building tools in DCC’s like Maya, 3DMax, and Nuke. Houdini is a plus.Expertise in producing I/O connective frameworks that promote art pipeline ingestion, formatting, tracking, and export automation.Degree in Computer Science, Interaction Design, Game Design or equivalentFamiliarity with macOS and iOS application programmingExperience working with 3D content and content creation tools like Maya, 3ds Max, Blender, etc.", "jobDescription": "Are you a Technical Designer who tackles challenges in an evolving domain? In this role you will play a significant role in cross-functional collaborations with artists, designers and developers. You'll partner with an extraordinary team of artists and engineers to build the next technological revolution. You will create and contribute to innovative solutions for content production for AR and VR experiences. This role requires an understanding of realtime interaction concepts and an ambition to produce visually stunning and compelling interactive 3D content while navigating through unique technical challenges!"}, "200451419": {"jobID": "200451419", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451419/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Melbourne", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logicLogic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and uncommonly hardworking RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nIn this role, you will have the opportunity to specify, design, and help in the verification and lab bring-up of advanced mixed-signal circuits (digital side)."}, "200449872": {"jobID": "200449872", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "CAD Engineer – Design Verification Tools and Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449872/cad-engineer-design-verification-tools-and-infrastructure?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS Degree + 0 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong scripting/coding abilities in Python/Perl are needed.Good communications skills are required and prior customer support experience is a plus.Knowledge of C/C++, Java or any other OOP programming language is a plus.Minimum requirements of BS Degree + 0 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world.\n\nAs a member of our CAD team, you will develop, maintain, and enhance existing sophisticated software systems for regression-testing Apple’s silicon designs in software simulation, to find and report defects in our chip designs, and thus ensure that Apple tapes-out world-class silicon. Your experience and innovative ideas will inform the design of the next generation of these regression systems. Your experience and insight, your skill at diagnosing the root cause of complex problems, and your ability to guide engineers who come to you with problems will be important contributions to an extended CAD team that comprehensively supports Apple’s DV and chip design engineering efforts. You will work closely with EDA vendors to incorporate new capabilities of their commercial tools, and to resolve problems."}, "200445959": {"jobID": "200445959", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "Display Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445959/display-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "PhD, MS, or BS in Physics, Optics, EE or ME with at least 3 years of experience.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The candidate will need to have minimum 3 years of hands-on experience and proven track record in the design and development of Flat Panel Displays.Proven ability to perform OLED / micro-LED design & validation is a must.Experiences in developing and manufacturing high volume display products preferred.Proven track of record in OLED panel design & process in mainstream flat panel display industry.In-depth knowledge of TFT, driving circuit, cell design and production process of OLED and micro LEDExperience in working directly with mainstream display vendors is helpful.Excellent project management abilities, as well as written and verbal communication skills and people skills are required.PhD, MS, or BS in Physics, Optics, EE or ME with at least 3 years of experience.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Display Technologies group, you’ll help ensure our products’ displays work beautifully through the successful design, fabrication, and implementation of components in Apple devices. \n\nWe are looking for a Display Module/Optical Engineer to lead the development and qualification activities to design and develop innovative Flat Panel Displays used in iPad and MacBook products from initial concept to mass production. Through touch and sight, these displays are how millions of Apple customers connect with our products every single day. Together, you’ll collaborate with multifunctional teams across Apple to make each interaction a magical experience to see and touch."}, "200452147": {"jobID": "200452147", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless System Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452147/wireless-system-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS + 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "This is an individual technical contributor role that requires industry experience in testing of wireless silicon within wireless communication systems.Understanding of communication theory and key metrics like EVM and sensitivity.Experience using and understanding of the theory of operation of lab equipment (spectrum analyzer, signal generator, network analyzer, power meter).Experience debugging test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Knowledge in existing wireless communication protocols: LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE.Experience completing and debugging test software in Python, Matlab, and/or C/C++.Minimum qualification is BS + 3 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before.\nBuild the test plans for wireless silicon design verification and software regression of the PHY and radio \nCarry out test campaigns, analyze results, and generate performance and status reports \nIdentify, root-cause and debug issues found \nDebug and extend the Python based bringup, integration, and debug environment. \nDebug and extend the Python based characterization, regression and reporting framework.\nBringup and validate algorithms on real silicon alongside PHY, MAC, RFIC and digital circuit designers."}, "200451734": {"jobID": "200451734", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless System Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451734/wireless-system-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS + 0 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "This is an individual technical contributor role that requires industry experience in testing of wireless silicon within wireless communication systems.Understanding of communication theory and key metrics like EVM and sensitivity.Experience using and understanding of the theory of operation of lab equipment (spectrum analyzer, signal generator, network analyzer, power meter).Experience debugging test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Knowledge in existing wireless communication protocols: LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE.Experience completing and debugging test software in Python, Matlab, and/or C/C++.Minimum qualification is BS + 0 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before.\nBuild the test plans for wireless silicon design verification and software regression of the PHY and radio \nCarry out test campaigns, analyze results, and generate performance and status reports \nIdentify, root-cause and debug issues found \nDebug and extend the Python based bringup, integration, and debug environment. \nDebug and extend the Python based characterization, regression and reporting framework.\nBringup and validate algorithms on real silicon alongside PHY, MAC, RFIC and digital circuit designers."}, "200450638": {"jobID": "200450638", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "CAD Custom EM/IR Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450638/cad-custom-em-ir-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are counting on your expertise in developing EM and IR related flows and automation for better accuracy and efficient runsYou are experienced in usage of EMIR analysis tools and knowledgeable on their working principles and methods, including hierarchical AOT (Analog-on-Top) analysis.You are familiar with custom design environment and flows, such as schematic/layout design, simulation, extraction, physical verification and timing analysis.You have experience in supporting design teams with ramping the work environment, correct settings and reliable runs.You can work directly with the tool vendors, and drive them to resolve tools bugs as well as implement required improvementsWe expect experience in exploring and defining new technology nodes settings, and working with various technology and foundry teams on the actual node limitsYour communication skills are excellent, and like the rest of us at Apple you love working in an open and multi-cultural environmentMinimum requirements of BS degree + 10 years of industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products very quickly. Do you want to bring passion and dedication to your job? There's no telling what you could accomplish at Apple.\n\nThe people who work here have reinvented entire industries with Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices - we continue to strengthen our commitment to leave the world better than we found it!\n\nAs a key member of our best-in-class CAD Group, you will be part of building innovative designs. We will apply your hands-on experience in power EM/IR analysis to define, develop and refine the methodologies and flows which enable transistor-level as well as gate level analysis. Major tasks will include functional static / dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, SigEM, power switch modeling, design abstraction and reuse for EM/IR purposes, IP / SoC level EMIR sign-off / ECO, and much more.\n\nAre you ready to join some of the world's leading engineers, and help us deliver the next generation of ground-breaking Apple products?"}, "200451399": {"jobID": "200451399", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451399/cpu-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceSolid electrical engineering fundamentals in logic design and digital circuitsExperienced in using industry standard logic Synthesis, PnR, STA and Power analysis tools along with floor-planing, pin-placement and timing budgeting knowledgeFamiliarity with high performance CPU microprocessor architectureBasic scripting/programming skillsAbility to work well in a team, self-motivated and excellent communication skillsMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level implementation."}, "200463938": {"jobID": "200463938", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "HWE Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463938/hwe-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/A preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong leadership and relationship building skills; the ability to inspire and lead cross-functional teams.Excellent communication skills and an aptitude for blending qualitative and quantitative data into executive level presentations and messaging.Well-organized, self-directed, and adaptable; able to balance multiple projects with minimal supervision in a dynamic environment.Ability to discern and manage business requirements and projects with competing priorities.Strong interest in and ability to take on a range of efforts.10+ years of relevant work experienceBS/A preferred", "jobDescription": "The Hardware Engineering (HWE) Strategic Support team is looking for an experienced Program Manager to join our team. Strategic Support’s mission is to systematically enable and improve HWE’s business and operational outcomes. As a Program Manager, you will be responsible for driving and delivering on key operational initiatives from ideation through implementation, with an initial focus on real estate, asset and labor management. This is a great opportunity for a self-driven individual to utilize their business and organizational acumen, strong collaboration and relationship building skills, and ability to execute to create impact."}, "200449720": {"jobID": "200449720", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Clock Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449720/cpu-clock-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceKnowledge of industrial standards and practices in physical design, analysis, and physical verification on large processor or SOC designsExperience in developing and implementing powergrid and clock specificationsSolid knowledge of low power design, physical construction, Spice, EM/IR-Drop/Noise, SIGEM analysis, formal verification, physical verification, and DFMStrong communication skillsProven understanding of CMOS circuit designLayout design background is a plusWorking knowledge of extraction and STA methodology and toolsWorking knowledge of computer architectureSolid understanding of scripting languages such as Perl/TclAbility to work well in a team, problem solver, and self-motivatedMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nAs a CPU Clock Implementation Engineer, you will be driving the planning, design, implementation, and analysis of clock."}, "200461787": {"jobID": "200461787", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "GNSS Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461787/gnss-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "BS and 3+ years of relevant industry experience is required. M.Sc. or PhD degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Wireless/DSP block/System-on-Chip verification experience.Advanced knowledge of SystemVerilog and in-depth understanding in UVM methodology.Solid verification skills in problem-solving, constrained random testing, and debugging.Knowledge of SOC subsystem and low power verification experience is desirable.Experience with SystemVerilog Assertion (SVA) is a plus.Knowledge of scripting (like Shell, Python, and Perl…) is desirable.Experience in mixed-signal modeling and simulation is a plus.Strong verbal and written communication skills are needed.BS and 3+ years of relevant industry experience is required.BS and 3+ years of relevant industry experience is required. M.Sc. or PhD degree preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Global Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. Our GNSS team is part of Apple's wireless SOC team. We are a vertically integrated engineering team spanning RF, mixed signal analog design, systems engineering, Design Verification, RTL design, firmware and software engineering, Test, and Validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of our GNSS IP and SoC subsystem. As part of our DV team, you will develop reusable testbench and verification environment deploying the latest methodology, working closely with GNSS and SoC front-end designers and Systems Engineers."}, "200463266": {"jobID": "200463266", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Emulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463266/emulation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong skills with Verilog, VHDL designStrong skills with Design Verification and System Verilog, UVM, and C/C++ verification environmentsCandidate should have emulation experience on available platforms, Palladium, Veloce, or Zebu, including compilation, debug, performance and throughput tuning.At least 10 years experience writing scripts using Perl, Python, Makefile Experience with waveform debug tools, Verdi/SimVisionStrong communication skills and ability to work as a team.Bachelor's degree and a minimum of 10 years relevant industry experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.  \nAre you passionate about changing the world ? We have a critical impact on getting high quality functional products to millions of customers quickly. We are looking for emulation engineers to join our team that focuses on the creation, deployment, and support of advanced emulation environments. In this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines."}, "200459834": {"jobID": "200459834", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Senior Wireless RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459834/senior-wireless-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong fixed-point knowledge and extensive experience with bit-true verificationsUnderstanding of DSP communication algorithms and trade-offs between performance and complexityGood knowledge in modern design techniques and energy-efficient/low power logic designTrack record of bringing logic designs into mass production.Ability to work well in a team and be productive under aggressive schedulesExcellent communication skills and self-motivation/organizationExperience with FPGA and/or emulation platform desiredBS +10 years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}, "200461201": {"jobID": "200461201", "origin_search": null, "posted": "", "jobTitle": "Admin Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461201/admin-lead?team=CORSV", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200448934": {"jobID": "200448934", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "IC Package Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448934/ic-package-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-BS and 3+years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "We are looking for someone with experience in Semiconductor Packaging Design, Process & Technology DevelopmentGood understanding of cross-functional packaging areas: Si floor plan, package layout and architecture, enabling process technologies, thermal, mechanical, SI/PI, material, component & system level reliability, testing, and FAKnowledgeable in advanced packaging technologies: Knowledge and insight to deliver high density / high performance interconnects in various form factor, thermo-mechanical, reliability, and cost constraintsExcellent problem solving with strong physics and fundamentalsExcellent communication skills that enable the candidate to work well with internal cross-functional teams and overseas suppliersMulti-functional coverage on package layout (Cadence APD/Allegro), critical signal integrity/power integrity, thermal, design rules, BOM, design for manufacturing, reliability, and costAbility to work independently and take on projects with minimum supervisionAbility to lead and manage teamsKnowledge of Cellular packaging and systems a plusBS and 3+years of relevant industry experience-BS and 3+years of relevant industry experience", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We are looking for a hardworking, and passionate IC Packaging Engineering Lead to join our team."}, "200448945": {"jobID": "200448945", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "IC Package Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448945/ic-package-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "We are looking for someone with experience in Semiconductor Packaging Design, Process & Technology DevelopmentGood understanding of cross-functional packaging areas: Si floor plan, package layout and architecture, enabling process technologies, thermal, mechanical, SI/PI, material, component & system level reliability, testing, and FAKnowledgeable in advanced packaging technologies: Knowledge and insight to deliver high density / high performance interconnects in various form factor, thermo-mechanical, reliability, and cost constraintsExcellent problem solving with strong physics and fundamentalsExcellent communication skills that enable the candidate to work well with internal cross functional teams and overseas suppliersMulti-functional coverage on package layout (Cadence APD/Allegro), critical signal integrity / power integrity, thermal, design rules, BOM, design for manufacturing, reliability, and costAbility to work independently and take on projects with minimum supervisionAbility to lead and manage teamsKnowledge of Cellular packaging and systems a plus-BS and +10 years of relevant industry experience", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We are looking for a hardworking, and passionate IC Packaging Engineering Lead to join our team."}, "200379185": {"jobID": "200379185", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Product Designer, Common UI", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200379185/product-designer-common-ui?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Design, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of design experience focused on unifying UI and UX design across multiple teams with differing goals and priorities—including developing, maintaining, and gaining adoption of pattern libraries.Experience and interest designing media applications and services, while maintaining Apple's design aesthetic and interaction patterns.A portfolio of work that showcases excellence in user experience and visual design.A demonstrated ability to foster an environment teamwork and cooperation, and build partnerships across multiple design organizations.Ability to create sketches, wireframes, high fidelity comps, prototypes, and written documentation, and organize them into libraries that are easy and enjoyable for other designers to use.Outstanding ability to advocate for UI consistency with designers, engineers, product managers, and executives through writing, visuals, and presentations.Highly skilled in Sketch, Photoshop, Keynote, and similar tools.Deep knowledge of the UI controls available in Apple UI frameworks, and familiarity with the underlying technology that powers them.Familiarity with accessibility standards, inclusive design practices, and accessibility features on Apple operating systems.Flexible and comfortable with ambiguity and change during a project.A passion for Apple, our products, and our customers is a must.Bachelors or Masters in Design, or equivalent experience.", "jobDescription": "The Apple Services ** design team is seeking an experienced UI designer to focus on standards and consistency across our media products. The ideal candidate will have a passion for creating and maintaining design patterns and shared features, and helping product designers apply them to create a suite of elegant products that anyone can use.\n\nThe position requires working across several teams to create consensus and provide deliverables under tight deadlines. Strong communication skills are a must, as well as coolness under pressure, problem solving, attention to detail, and the ability to mediate and cope with rapid change. Above all, the role requires a dedicated individual who understands Apple’s high standards and design aesthetic to the core."}, "200452376": {"jobID": "200452376", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452376/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a Bachelor's Degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusUnderstanding of embedded software development, RTOS and/or LinuxUnderstanding of computer architecture, operating systemUnderstanding of boot code, CPU & SOC initialization, device driversGood troubleshooting skills in embedded software debuggingExperience with script language such as Python, Perl, or TclMinimum requirement of a Bachelor's Degree", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers  to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200452812": {"jobID": "200452812", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Software Engineer: SoC Level Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452812/software-engineer-soc-level-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Develop SoC and CPU directed and random stress workloadsDebug issues pre-silicon or post-siliconDevelop and maintain system-level SW platformWork with designers and architects to accomplish validation goalsBS and a minimum of 10 years relevant industry experience", "jobDescription": "What happens when you run almost everything on a System-On-Chip (SoC) all at once while powering down blocks, hammering new features, and running a complex suite of algorithms? You find bugs. That’s exactly what we do. We break Apple Silicon with our system level SW suite that runs mostly post-silicon, leverages pre-silicon and finds corner-case hardware bugs. Join our team to uphold the high quality of Apple Silicon."}, "200456717": {"jobID": "200456717", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "ASIC Design Engineer - Pixel IP", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456717/asic-design-engineer-pixel-ip?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree + 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in IP/SoC front-end ASIC RTL digital logic design using Verilog and System Verilog.Extensive shown experience in ASIC implementation, especially logic synthesis, static timing analysis, logic equivalence checking, and working with physical design teams for floorplanning and timing closure.Deep experience with system design methodologies that contain multiple clock domains.Practiced in low-power design issues, tools, and methodologies including UPF power intent specification.Familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB).Industry exposure to and knowledge of ASIC/FPGA design methodology including familiarity with relevant scripting languages (Python, Perl, TCL).Tight-knit collaboration skills with excellent written and verbal communication skills.Extensive experience working multi-functionally with integration, design, and verification teams to specify, design, and debug digital systems.Bachelor's Degree + 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly transparent role, you will be at the center of the Pixel IP design effort to capture and display alluring images and video. You will collaborate with all fields, making a critical impact getting functional products to millions of customers quickly."}, "200459176": {"jobID": "200459176", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Associate Ad Operations Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459176/associate-ad-operations-specialist?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$72,000", "max": "$108,500,"}, "benefits": null, "requirements": "1 or more years of experience at a Digital Media Agency with experience or an interest in Ad OperationsBasic experience with ad serving technologies such as Google Campaign Manager (formerly DCM)Proficiency in recognizing tracking issues through thoughtful and thorough QAStrong attention to detail to assist with QADepth of understanding of various ad tag structures (e.g. VAST/VPAID)Comfortable with adapting workflow to shifts in priorities and urgenciesExperience in establishing systems and processes to create operational efficienciesHyper organized and detail oriented by natureBS/BA degree preferred", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you could accomplish.\n\nApple is in search of an Associate Ad Operations Specialist to join the Apple Services Digital Marketing Team. In this role you will work hand-in-hand with media strategy, analytics, creative, and campaign strategy teams, facilitating the execution of all go-to-market display/video campaigns.\n\nAs an Associate Ad Operations Specialist, you will be responsible for helping traffic media plans developed by our in-house activation and strategy teams. This involves managing URL coding, trafficking, tag generation, and troubleshooting for display/video activity across Apple Services LOBs. You will work with experienced Ad Ops Specialists to ensure timely and accurate digital campaign launches. On this team, you will work across Apple’s suite of Services: Apple Music, TV+, Apple Card, Apple Arcade, Apple Podcasts, Apple Books, Apple News+, and more."}, "200463386": {"jobID": "200463386", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Hardware Development Engineer - Mac Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463386/hardware-development-engineer-mac-systems?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BS in electrical or computer engineering required, MS preferred\n\n-  Minimum 5 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "High-volume consumer electronics system experience preferred.Lab skills: oscilloscopes, logic analyzers, electronic loadsExperience with schematic capture and PCB physical design using Cadence Concept and Allegro or similar CAD toolsDesign experience in digital logic, simulation, power conversion and deliveryFamiliarity with RF/wireless conceptsExperience with high-speed serial and memory interfaces including signal integrity design and measurement fundamentalsExcellent written and verbal communication skillsCommand line interface and scripting skillsSpecific deep expertise in several of the following areas is a plus: CPU or GPU microarchitecture, batteries, power management, analog design, audio, wireless, DisplayPort, PCIe, Thunderbolt, USB, SPI, I2C, UART, analog sensors, interconnectStatistical data analysis and visualization (ex. JMP) is a plus-  BS in electrical or computer engineering required, MS preferred\n\n-  Minimum 5 years relevant industry experience.", "jobDescription": "The Mac Division is seeking enthusiastic electrical engineers for the Mac Engineering Team! As a part of the Mac team, you will help with concept and feature development, rapid prototyping, production part selection and product integration. You’ll have the opportunity to travel to our contract manufacturing partners to support mass production builds and develop both the test development and failure analysis procedures to ensure a high level of quality for the product.\n\nOur engineers rely on skills in computer system architecture, schematic design, digital and analog circuits, power and voltage regulator integration, high speed signal integrity concepts, PCB design, bring up and system level troubleshooting to surprise and delight millions of customers."}, "200194914": {"jobID": "200194914", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Health Sensing HW Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200194914/health-sensing-hw-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "M.S. degree in electrical engineering, physics, or related field, or industry experience equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "3+ years of hands-on experience and proven track record in electrical or system hardware engineeringStrong electrical engineering background on analog, mixed signal and failure analysis with mass production experienceProficiency in SPICE, Matlab, Python, LabView, or similar scripting and simulation toolsExcellent written and verbal communication skills, as well as solid teamwork and leadership skillsKnowledge of system and firmware development is a huge plusExperience in optical module development and quality management is a plusExperience in working overseas manufacturers and vendors is a plusMinimum of 3 years of relevant consumer electronics or research experience requiredM.S. degree in electrical engineering, physics, or related field, or industry experience equivalent.", "jobDescription": "The Health Sensing team design, develop, and launch next-generation Sensor Technologies in Apple products.\n\nThe key goal of the Health Sensing team is to enable the world’s best user- experience. New challenges arise everyday that require the sharp problem-solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation."}, "200318153": {"jobID": "200318153", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Get Connected: Product Management Roles for Apple Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200318153/get-connected-product-management-roles-for-apple-services?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA degree or equivalent working experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Passion for building usable, delightful consumer products that innovate rather than imitateConviction to do the right thing for users, with a humbleness to listen and learnCuriosity to know the competitive set and anticipate evolving consumer trendsStrong verbal and written communication skills, with the ability to create and deliver winning presentationsAbility to engage and influence diverse stakeholdersFlexibility to adapt to change and to thrive in a dynamic, discourse-driven environmentExperience with analytics, experimentation, and data storytellingBS/BA degree or equivalent working experience", "jobDescription": "At Apple, we don’t just create products. We create products, services, and experiences that redefine what customers expect and revolutionize entire industries. Join the team that dreams up what’s next, and that does everything necessary to make it happen. Bring your passion, dedication and focus, and help invent the future!\n\nWe are seeking talented Product Managers to join our services teams, working across our world class apps. If you have a strong track record in consumer services to lead the development of new customer experiences and are someone that brings creativity and humility, product sense and analytical skill, leadership and ability to collaborate, we'd love to invite you to apply to this pipeline. \n\nOur Product Managers collaborate with other product managers and cross-functional colleagues across content production, business intelligence, data science, marketing, design, and engineering to drive measurable outcomes for app engagement.\n\nOur Product Management roles span across Apple Music, Apple TV+, Sports, Maps and more."}, "200448144": {"jobID": "200448144", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "RF Hardware Engineer - Multi-Radio Coexistence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448144/rf-hardware-engineer-multi-radio-coexistence?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 10+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience on at least one radio of Cellular, GPS, Bluetooth, Wi-Fi, Thread, NFC and UWBKnowledge of wireless architectures including front-end, antenna sharing, link budget line-up, etc.Proven understanding of RF hardware and standard methodologies for system-level grounding, shielding, isolation and electromagnetic interference mitigationKnowledge of RF component characteristics and experience using lab equipment including spectrum analyzer, network analyzer, signal generator and oscilloscopesExperience performing hands-on disassembly and system level debug on module, reference board or system levelExperience debugging and performing optimizations at the conducted or radiated radio systems levelExcellent communication written and verbal skillsAbility to travel domestically and internationally up to 20%BS with 10+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work on overall system performance of multi-radio coexistence for various wireless technologies (e.g., Cellular, Wi-Fi, BT, GPS, NFC, etc.)."}, "200443232": {"jobID": "200443232", "origin_search": null, "posted": "Nov 14, 2022", "jobTitle": "Softgoods Magnetics Product Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443232/softgoods-magnetics-product-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in Physics/Material/Electrical/Mechanical Engineering, or similar engineering fields  with magnet design experience or magnetic FEA experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Knowledge of magnetic material or devices, magnetic test methodsDetail oriented, proactive thinking and capable of handling multiple assignments under high pressureStrong analytical problem solving skills and ability to use statistical toolsFlexibility working in a quickly changing environment.Solid verbal and written communication and presentation skills (Keynote or Powerpoint)BS/MS/PhD in Physics/Material/Electrical/Mechanical Engineering, or similar engineering fields  with magnet design experience or magnetic FEA experience", "jobDescription": "Why Apple?\n\nAt Apple, we believe our products begin with our people. By hiring a diverse team we drive creative thought. By giving that team everything they need we drive innovation. By hiring incredible engineers we drive precision. And through our collaborative process we create memorable experiences for our customers.  \n\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives.\n\nWhy Softgoods Magnet Team?\n\nApple’s Softgoods Engineering team is relatively new to Apple. We work with textiles, leather, silicone and soft polymers. Our mission is to use these incredible materials to enable new product categories, and to enhance Apple’s existing product lines. Bringing Apple engineering and precision to products made of soft materials is an exciting challenge and requires a creative and open minded approach. Magnet is another element that gives our customers a magical and delightful experience. \n\nYou will assist the magnet and mechanical design effort associated with creating world-class products for Apple. Responsibilities will include working closely with product design, manufacturing, test engineering, electrical engineering, reliability, and compliance.  You will implement design of our products, with emphasis on practical and clever solutions. You will resolve technical issues that arise in the design of these products and be expected to follow the product from concept, through development, and into ramp. International travel will be required. \n\nIf this sounds like an exciting challenge, we hope you will consider a place in our team!"}, "200463184": {"jobID": "200463184", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Wireless Charging Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463184/wireless-charging-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors in relevant EE field, Masters/PhD preferred\nAt least four years of relevant technical work in industry"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "M.S. or B.S. with 2 years experience in Electrical Engineering (analog & mixed-signal design, especially board-level circuits) or M.S. in Applied Physics (Electro-magnetics, Thermodynamics) or industry experience equivalent.Experience / background in Power & Magnetics (Electromagnets, Motors, Transformers). Direct experience in wireless charging preferredHands-on experience in system design & integration - including uC & digital buses (SPI, I2C)Hands-on experience in prototype bring-up and debugging, functional verificationProficiency in Python, C/C++ or other scripting languagesProficiency in COMSOL, MATLAB, SPICE or other simulation toolsComfort with a fast-paced environment and appetite for Innovation, Rigor & Healthy ParanoiaStrong communication (written & verbal) & problem solving skills - self-starter driving problems to resolutionExperience with high volume manufacturing and statistical production tolerance analysis - plusExperience supporting contract manufacturers & designing high volume products (concept-to-production) - plusBachelors in relevant EE field, Masters/PhD preferred\nAt least four years of relevant technical work in industry", "jobDescription": "We believe the future is powered by Wireless!\n\nThe mission of the Wireless Power Technology team - Create the world’s best Wireless Charging user- experience by inventing state-of-the-art technologies. We develop effortless and safe Wireless Charging designs that are central to Apple’s products - the iPhone, Apple Watch, iPad and AirPods! New challenges arise every day that require the sharp problem-solving skills of individuals. \n\nWe are looking for a system integration engineer that leads the integration of the inductive technology into products in the partnership with multiple discipline teams including but not limited to architecture, FW, system EE, silicon, noise and vibration, safety, thermal, reliability, operations , regulatory teams and more."}, "200450730": {"jobID": "200450730", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Manager, Product Management - New Products, Apple Store Online", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450730/manager-product-management-new-products-apple-store-online?team=APPST", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$183,500", "max": "$334,500,"}, "benefits": null, "requirements": "10+ years of Product Management experience with at least 5 years leading product for a large scale direct to consumer e-commerce retailer. Experience with Omni-Channel retailers a strong plus3-5+ years managing a product function and team with experience in building and developing a diverse team of dedicated individual contributorsFluency in core e-commerce concepts like affordability, credit, payment systems, order fulfillment, supply chain, and then stitches across these capabilitiesHighly analytical and able to find opportunities to influence multi-year product roadmapsExperience translating business concepts into a strategic roadmap and excellent delivery track recordAbility to take product vision and turn it into a world class customer experience within the online platform as well as between online and physical store spacesTechnical mentality and ability to work closely with engineering partners to solve for system interdependencies, devise implementation strategies and refine scope based on concrete considerationsPassionate about the customer experience and can focus on what needs to be done to improve itExceptional presentation and communication skills, with experience presenting to and influencing senior executivesAbility to take an undefined initiative, and creating structure to drive an effort among a team of cross functional people (formal project or not)", "jobDescription": "Apple is a place where extraordinary people gravitate in order to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. Do you love problem solving and thinking beyond an obvious solution? Do you thrive in ambiguity and teams where little guidance fuels your creativity? If you’re excited by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple Store Online might be your dream job!\n\nApple is looking for a proven, dynamic leader of Product Management to join the Apple Store Online team to bring our new products to market and surprise and delight our customers. In this role, you will collaborate closely within Retail as well as with Design, Engineering, Product Marketing, and Ops to launch new Apple products. This role will draw upon your extensive leadership and experience in Product Management to combine your technical fluency, strong sense of user experience, and business understanding to chart a vision, align your partners, and lead your team to deliver amazing products."}, "200446466": {"jobID": "200446466", "origin_search": null, "posted": "Dec 1, 2022", "jobTitle": "Wireless Bluetooth QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446466/wireless-bluetooth-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$171,000,"}, "benefits": null, "requirements": "Highly motivated, dedicated, quick learner with recognized ability to work individually and as a team.Proven track record in defining robust test plans and delivering high quality outcomes.Experience designing, developing robust and scalable automation frameworks using industry best practices.Excellent interpersonal, communication and documentation skills.Efficient time management and organization, ability to handle multiple tasks and thrive in a fast paced environment.Laser-focused on the smallest details that are meaningful to our customers.Self-motivated, dedicated with validated creative and critical thinking capabilities, strong troubleshooting skills.Obsessively passionate and inquisitive, and seek to pursue everyday problems in innovative ways.Strong understanding of development methodology and object oriented programming concepts.Experience building automation setups for testing embedded devices for various mobile operating systems.Domain expertise in one of these areas preferred: Bluetooth, WiFi, Audio, Wireless RF protocols.Experience with hardware communication interfaces such as USB, UART, PCIe.Experience with source control (Git, GitHub Flow, Gitlab, SVN, Perforce).Experience on Continuous Integration tools like Jenkins is a plus.Experience building/creating/using Robotics to create automated solutions.Good Knowledge on database concepts.Passionate about consumer products and technology.Bachelors or Masters Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters. We craft and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. The Bluetooth Quality Engineering team is looking for a motivated Tools & Automation Engineer to design, implement, test and maintain next generation macOS connectivity solutions. You are responsible for creating and delivering world changing experiences on the very latest Apple products."}, "200447289": {"jobID": "200447289", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "WebKit Text Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447289/webkit-text-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Skills in a manual memory-managed (e.g., pointer-based) language such as C, C++, or Objective-C.Familiarity with typographical concepts or world writing scripts is preferred.Bachelor’s degree in Computer Science or equivalent", "jobDescription": "As a WebKit Text Engineer you will be responsible for improving the WebKit engine’s support for text features, world languages, and internationalization, focusing on character/glyph layout, rendering, and performance! The WebKit team is responsible for Safari, the world’s fastest web browser. WebKit is the iOS and macOS framework that powers Safari, Mail, Books, and many other applications. \n \nAt Apple, we have a way of turning new ideas into extraordinary products, services, and customer experiences very quickly! Working on the browser engine, we have the extra opportunity to influence areas outside the Apple ecosystem."}, "200446441": {"jobID": "200446441", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Baseband Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446441/baseband-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "BSEE and 3+ years of relevant industry experienceStrong EE fundamentals and experience with mobile and/or embedded processorsExperience with memory systems, DC-DC / power/clock management, high speed digital interfacesSchematic capture/layout and hands on test/debug experienceScripting experience and Signal/Power integrity simulation experience preferredWireless protocol or RF experience preferred, not requiredStrong communications and organizational skillsStrong problem solving and analytical skillsExperience interacting with offshore manufacturing partnersEnergy and desire to thrive in a start-up like environmentSuccessful track record of delivering highly innovative communications productsPosition will require some international travel when approved to do soBS and 3+ years of relevant industry experience", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nBe a part of a premier design team responsible for the architecture, design, implementation, and integration of the baseband system for all Apple products. The applicant should be familiar with computer system architecture and digital design. The candidate will work proactively with other cross-functional engineering groups."}, "200447737": {"jobID": "200447737", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Wireless Systems Engineer – RF Systems Cellular RAN5", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447737/wireless-systems-engineer-rf-systems-cellular-ran5?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 10+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficiency in RF, Demodulation and RRM aspects of 3GPP, GCF, PTCRB / GCF and carrier conformance requirements and implications to device and test equipment architectures, and performance tradeoffs.Proficiency in device certification processes on at least one (GCF, PTCRB) industry certifications or (FCC, EU, China) Regulatory complianceDirect hands-on experience with and proficient knowledge of underlying theory and techniques used in 2G, 3G, 4G LTE cellular technologies. Proficiency in 5G-FR1 or 5G-mmWave cellular technology is a plus.Experience as RAN5 delegate. Understanding of 3GPP RAN4 interaction with RAN5. Experience as RAN5 delegate towards 4G or 5G-FR1, FR2 cellular technologies is a plus.Experience working with different industry member across carrier, chipset and infrastructure.Knowledge of conducted RF and antenna characteristics impact to both conducted and radiated testing. Familiarity with test setups, radiated chambers and their calibrations & use.Experience with entire product development cycle of cellular handsets.Excellent written and verbal communication skills.BS with 10+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to define and lead 3GPP RAN5 technical standardization topics in 3GPP meetings representing Apple."}, "200451606": {"jobID": "200451606", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "CPU Power Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451606/cpu-power-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceFamiliarity with high performance microprocessor architectureKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture and implementation techniquesDesign experience in deep submicron technologies and basic device physicsExperience with scripting in Perl and C is a mustMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product!\n\nAs a CPU Power Engineer, you will be responsible for the overall dynamic and static power of the core for different applicable use cases. You will drive CPU power budgeting, measurement, and analysis and provide global power methodologies for reduction across micro-architecture and gate-level design spaces."}, "200458878": {"jobID": "200458878", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "Coordinating Producer, Live Sports", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458878/coordinating-producer-live-sports?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$188,500,"}, "benefits": null, "requirements": "8 to 12+ years of experience producing live sports eventsExperience overseeing all creative aspects of development production, and post-productionExperience coordinating shoots for broadcast, cable, or digital media outletsWilling to travel >50% to produce on-air, live sporting eventsExperience owning program strategy and end to end deliveryStrong knowledge of professional sportsBA/BS degree preferred.", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nCome be a part of one of the most exciting and fastest-growing areas at Apple. Apple’s Internet Software & Services team is seeking an experienced, thoughtful, and entrepreneurial individual to coordinate production for our growing live sports video business. The Coordinating Producer, Live Sports will support our live production team, other internal cross-functional groups, and external production partners on complex tasks related to planning, coordinating, and producing live sporting events. In this role, you will be involved in every stage of the production from pre-production planning to the live event broadcast. This role requires great flexibility, the ability to deal with ambiguity, and a high production competence. A successful candidate has a growth mindset and does not need much oversight, as they have exceptional stakeholder and project management skills needed to balance competing priorities and deadlines. \n\nThe role requires a highly motivated, adaptive self-starter to meet goals and achieve hard deadlines. Candidates must have a proven track record of producing high level, live events and a deep understanding of the live sports production space."}, "200458884": {"jobID": "200458884", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "Coordinating Producer, Live Sports", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458884/coordinating-producer-live-sports?team=MKTG", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$107,000", "max": "$209,500,"}, "benefits": null, "requirements": "8 to 12+ years of experience producing live sports eventsExperience overseeing all creative aspects of development production, and post-productionExperience coordinating shoots for broadcast, cable, or digital media outletsWilling to travel >50% to produce on-air, live sporting eventsExperience owning program strategy and end to end deliveryStrong knowledge of professional sportsBA/BS degree preferred.", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nCome be a part of one of the most exciting and fastest-growing areas at Apple. Apple’s Internet Software & Services team is seeking an experienced, thoughtful, and entrepreneurial individual to coordinate production for our growing live sports video business. The Coordinating Producer, Live Sports will support our live production team, other internal cross-functional groups, and external production partners on complex tasks related to planning, coordinating, and producing live sporting events. In this role, you will be involved in every stage of the production from pre-production planning to the live event broadcast. This role requires great flexibility, the ability to deal with ambiguity, and a high production competence. A successful candidate has a growth mindset and does not need much oversight, as they have exceptional stakeholder and project management skills needed to balance competing priorities and deadlines. \n\nThe role requires a highly motivated, adaptive self-starter to meet goals and achieve hard deadlines. Candidates must have a proven track record of producing high level, live events and a deep understanding of the live sports production space."}, "200402369": {"jobID": "200402369", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Engineering Project Manager, Partner Solutions and Tech", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200402369/engineering-project-manager-partner-solutions-and-tech?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science related field or 5+ years relevant experience or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience successfully completing/delivering projects using an Agile methodology.High ownership, self-sufficient, hands-on leader to drive quality across the project; in usability and experience from requirements, technical design reviews, testing and more - the position requires a hands-on, get-the-job-done, attitude.Drive technical aspects of interactive web projects, internal systems and supporting processes.Hands on experience with design and development of highly available, distributed and scalable enterprise systems.Demonstrate innovative and creative thinking capabilities and also have sharp troubleshooting skills.Passion for quality and attention to detail.Comfortable with rapid development cycles and tight schedules.Ability to brainstorm and communicate technology ideas and issues with peers and IT management.Excellent communication, leadership, documentation and presentation skills.BS in Computer Science related field or 5+ years relevant experience or equivalent", "jobDescription": "Imagine what you could do here! At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We are looking for people with proven record of running sophisticated cross functional projects under demanding timelines. This is a hands-on position where the Project Manager will be involved in requirement analysis, functional and technical design discussions and tracking project deadlines."}, "200458034": {"jobID": "200458034", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "SoC Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458034/soc-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree + 20 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$343,500,"}, "benefits": null, "requirements": "Deep experience in RTL Logic Design of multi-million gate ASICs.Hands on experience for all aspects of the chip development process with proficiency in front end tools and methodologies related to synthesis, formal verification, CDC analysis, ECO and power checks.Shown experience writing micro-architecture specifications and converting them to design.Experience crafting low power ASICs/SOCs from scratch.Bachelor's Degree + 20 Years of Experience", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? As part of our Silicon Technologies group, we would like you to help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You'll ensure Apple products and services can seamlessly and authoritatively handle the tasks that make t hem beloved by millions. Joining this group means you'll be responsible for crafting and building the technology that fuels Apple's devices. Together, we will enable our customers to do all the things they love with their devices. As a member of SoC design team, you will be at the center of a SoC design and integration with a critical impact on getting functional products to millions of customers."}, "200446460": {"jobID": "200446460", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Wireless Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446460/wireless-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS in EE or CS with + 3 years experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong understanding of SoC/FPGA architecture and silicon micro-architectureExperience in writing basic embedded software routines and test scriptsExperience with hardware/software interactionSolid Digital logic fundamentals including timing analysis, state-machine debug and/or RTL/test-bench development Experience with high-speed memory systems and communication interfacesGood understanding of MAC + Protocol specifications for digital interfacesExperience in crafting tests to target specific portions of silicon designs and digital interconnectsHands on debug experience with usage of modern lab equipment (DSOs, Logic Analyzers, Protocol Analyzers)Familiarity with interpreting and navigating schematics and layoutStrong desire to deep-dive system level issues and drive problems to closure in a team-based environment with a proactive demeanorMinimum BS in EE or CS with + 3 years experience is required.", "jobDescription": "Are you passionate about changing the world? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. \n\nCome join a team of expert software and hardware engineers with a diverse set of backgrounds (Cellular Modems, Connectivity solutions, Device Drivers, CPUs and caching, kernel programming, embedded systems) to test Apple's next generation Wireless SoCs! As part of the Silicon Validation team, you will define and develop test coverage to evaluate functional blocks and debug silicon issues."}, "200458549": {"jobID": "200458549", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "IC Package Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458549/ic-package-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Hands-on experience with package design and proficient in Cadence Allegro platform tools (PCB Editor, Advanced Package Designer, APD/SiP) or Mentor Xpedition platform tools.Solid fundamentals in electrical/material/thermal/mechanical engineering field.Familiarity with various sophisticated package configurations and assembly / substrate technology (wirebond, POP, etc.).SI/PI tools (XtractIM, PowerSI, HFSS, Q3D, etc.), package model extraction, S-parameters and RLGC model.Substrate manufacturing process, structure, design rules and material property.Solid understanding of high-speed interfaces, including DDR, PCIe, NAND, etc.Exposure to Unix environment, scripting languages (PERL, Python, TCL and or shell) and methodology.Good understanding of system specification and IC design, ability to work with design teams to translate IC / system requirement into package / SIP configuration.Consistent track record to drive package selection through feasibility studies and drive chip Floor planning and bump assignment.Preferred Experience:Familiar with package design reviews and familiarity with CAM350/Valor or Calibre and CAD.Knowledge of high-speed layout constraints (crosstalk mitigation, differential pairs, EMI/RFI, PCB/package resonance).Design experience with RFIC and 5G packages, SIP or module schematic and layout design. Hands-on knowledge of Design Rules Check and Design for Manufacturing.Experience with TSV, 2D/2.5D and 3D package connection.Familiar with Cadence Concept HDL for schematic review, experience in schematic capture and system integration.BS and 10+ years of relevant industry experience.-  BS and 10+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nOur Hardware Technology Packaging team invents, designs, develops and integrates electronic packaging solutions for Apple’s internal and custom external components of hardware for its consumer electronic products such as iPhone, iPad, Mac, Apple Watch, Apple TV, etc.\n\nIn this highly visible role, you will own and drive sophisticated package selection, new generation product package structure and configuration optimization. You will be responsible for Package/SIP/module physical design and layout, optimization, design verification and tape out; and work with multi-functional teams to achieve optimized mechanical / electrical / thermal performance for various types of chips."}, "200452776": {"jobID": "200452776", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452776/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusBackground in embedded software development, bare metal, RTOS and/or LinuxSolid understanding about ARM specification, computer architecture, operating systemExperience in boot code, CPU & SOC initialization, device driversFamiliar with IO protocols: I2C, SPMI, UART, GPIOExperience in lpDDR4/5, DRAM initialization and calibration a big plusGood troubleshooting skills in silicon bring-up and embedded software debuggingExperience with script language such as Python, Perl, or TclBS and a minimum of 3 years relevant industry experience", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers with background in embedded software development to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200458494": {"jobID": "200458494", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC Physical Design Engineer, Electrical Analysis", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458494/soc-physical-design-engineer-electrical-analysis?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Solid background and knowledge on low-power circuit design, computer architecture, and digital systems.Multi-year hands-on experience working on ASIC or AMS physical implementation and analysis flow for IP blocks as well as SoC fullchip.Proficient in automating and debugging verification flows for digital VLSI design.Knowledge with industrial EDA backend tools like Redhawk, PrimeRail, Voltus, or a similar tool is required. Experience with Innovus, Design Compiler, PrimeTime and Tempus is preferred.Familiar with voltage drop budgeting, low-power design techniques, and sign-off criteria for solid-state digital circuit systems.You have engaged in multiple design tape-outs regarding power integrity signoff.Circuit design background and SPICE experience are a plus.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nAs a Physical Electrical Analysis Engineer on our SoC team, you will be driving the electrical analysis and verification of an SoC."}, "200457016": {"jobID": "200457016", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Global Supply Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457016/global-supply-manager?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree plus 3 to 5 years of work experience, masters degree or MBA is a plus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$109,000", "max": "$164,500,"}, "benefits": null, "requirements": "The Global Sourcing & Supply Manager is positioned at the interface between Apple’s product teams and the industries that supply core component technologies. We are responsible for developing and carrying out sourcing strategies as well as recommending product innovations based on improving technology. The position requires an interest in market dynamics, pricing, manufacturing processes, and risk mitigation. The team drives centralized capacity planning for all semiconductor components used across Apple products and helps drive long term strategic deals.BA/BS degree plus 3 to 5 years of work experience, masters degree or MBA is a plusExperience in semiconductor supply chain operations or semiconductor equity research is desiredDirect experience in long-term silicon capacity planning, a plusStrong analytical and critical thinkingAbility to develop sound internal and external working relationshipsAn interest in negotiationsAbility to make quick decisions with 80% informationThirst for knowledge and the ability to learn quicklyWillingness to travel internationally (20% - 30%)", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple is seeking a Global Sourcing & Supply Manager (GSSM) to assist with Silicon Strategic Planning, long-term deal structuring and negotiations. This position requires working with procurement, engineering, finance and legal teams and also third-parties such as semiconductor foundries and suppliers. This position requires strong quantitative and analytical skills, critical thinking, and ability to balance multiple projects simultaneously."}, "200457017": {"jobID": "200457017", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Global Supply Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457017/global-supply-manager?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BA/BS degree and 6+ years of work experience\nMasters degree or MBA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$138,500", "max": "$208,500,"}, "benefits": null, "requirements": "The Global Sourcing & Supply Manager is positioned at the interface between Apple’s product teams and the industries that supply core component technologies. We are responsible for developing and carrying out sourcing strategies as well as recommending product innovations based on improving technology. The position requires an interest in market dynamics, pricing, manufacturing processes, and risk mitigation. The team drives centralized capacity planning for all semiconductor components used across Apple products and helps drive long term strategic deals.BA/BS degree and 6+ years of work experience\nMasters degree or MBA preferredStrong analytical and critical thinkingAbility to develop sound internal and external working relationshipsAn interest in negotiationsAbility to make quick decisions with 80% informationThirst for knowledge and the ability to learn quicklyWillingness to travel internationally (20% - 30%)", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple is seeking a Global Sourcing & Supply Manager (GSSM) to assist with Silicon Strategic Planning, long-term deal structuring and negotiations. This position requires working with procurement, engineering, finance and legal teams and also third-parties such as semiconductor foundries and suppliers. This position requires strong quantitative and analytical skills, critical thinking, and ability to balance multiple projects simultaneously."}, "200405571": {"jobID": "200405571", "origin_search": null, "posted": "Sep 8, 2022", "jobTitle": "Localization Ops Strategy Analyst", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200405571/localization-ops-strategy-analyst?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Engineering, Business / Economics, or equivalent experience preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$88,100", "max": "$186,600,"}, "benefits": null, "requirements": "Minimum 2-4 years of experience in Consulting, Corporate Strategy, or Strategic Finance.Strong analytical and financial modeling skills; expertise in Excel.Exceptional problem solving skills to structure sophisticated business problems into clear manageable analyses.Curiosity to dive into the details with the vision to identify business insights and recommendations.Ability to craft compelling narratives and deliver complex problems in a clear, concise format.Ability to build strong partnerships and collaborate cross-functionally to deliver results.Passion to offer the best experience to Apple’s international audience.Excellent oral and written business communications and presentation skills.Bachelor's degree in Engineering, Business / Economics, or equivalent experience preferred.", "jobDescription": "Imagine what you could do here. Apple’s Services Localization team builds experiences for our ever growing international audience to enjoy. Our team supports all of Apple Services, including App Store, Apple Music, TV App, Marketing, iCloud, and more! \n\nWe are looking for an experienced Business Analyst to help lead our group into the future and support our growing scale. This role will help by deep-diving into our business operations, partnering with leaders within our group, crafting financial analyses, and informing the strategy for how we grow our operations. This is a highly visible role with opportunities to present to work to senior leadership and influence the product experience for our international customers.\n\nThe ideal candidate will apply their interpersonal skills and critical thinking to help tackle complex, ambiguous business problems to scale our organization."}, "200452139": {"jobID": "200452139", "origin_search": null, "posted": "Dec 22, 2022", "jobTitle": "Manufacturing Process Engineer- Display", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452139/manufacturing-process-engineer-display?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS (MS preferred) in Mechanical Engineering or equivalent with 2-5 years experience in Design or Manufacturing"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$109,000", "max": "$164,500,"}, "benefits": null, "requirements": "Creative problem solving experienceExperience in process development/bring up and qualificationProgram/project management experienceManufacturing or supplier management experienceWorking knowledge of GD&T and Engineering Drawing InterpretationDesign of Experiments, statistical process control methods and theoryGood command of Excel and JMPKnowledge of Metrology design and Optical/Contact Measurement Equipment is preferredExcellent written and verbal communication skills in English. Mandarin or Korean language skills are a plus but not requiredStrong Team PlayerBS (MS preferred) in Mechanical Engineering or equivalent with 2-5 years experience in Design or ManufacturingApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just create products — they create the kind of wondera that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nIn this highly visible role, you will have the opportunity to make a significant impact on Apple Products, and leave a footprint for years to come. We have an opportunity for an accomplished mechanical engineer to lead development and ramp for a next generation Apple product."}, "200233108": {"jobID": "200233108", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "Senior Quality Manager, Ads Demand Platform", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200233108/senior-quality-manager-ads-demand-platform?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS, or PhD in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience\n\n15+ years of experience in relevant fields of engineering development, quality assurance or project management."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$343,500,"}, "benefits": null, "requirements": "Strong background in designing and architecting automation solutions that enable a shared accountability in qualityEstablish a culture that continuously strives towards best practices, measurable outcomes, and operational excellenceStrong leadership, influence, and thought leadership skillsDemonstrated ability to achieve results through people and across an organization, forming relationships, collaborating with and influencing multi-functional teamsAble to deep dive into technical areas when needed but also up level communications to broader audienceExperience developing and testing front and back-end customer-facing componentsExpertise with continuous integration systems that incorporate fast feedback mechanisms and quality metrics5-7 years of experience leading multiple quality teamsBS, MS, or PhD in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience\n\n15+ years of experience in relevant fields of engineering development, quality assurance or project management.", "jobDescription": "At Apple, we believe in the power of technology to enrich people's lives. Everything we build is designed-first and foremost-with helping people in mind. We believe digital advertising is no different, and that its value should come from how it benefits customers, not what it extracts from them. Our Ad Platforms team applies that belief to create ads that add value, by helping people discover content, supporting creators, and protecting and respecting everyone’s privacy. \n\nWe help developers and marketers drive discovery of their apps across the App Store with Apple Search Ads. We help advertisers promote their products alongside trusted content in the brand-safe environment of Apple News, while supporting publishers and journalists. All with the same dedication to privacy you expect from Apple. Because when advertising is done right, it benefits everyone.\n\nWe are looking for a top-tier quality leader to provide technical leadership and strategic direction to the Demand Side Platform quality engineering team. In this role, you will have an opportunity to improve quality, enable a fast feedback engineering culture, and accelerate the delivery of the most privacy-forward, technologically sophisticated DSP in the world. Your primary responsibilities will be to ensure that customers will experience a delightful, intuitive experience across Apple’s ecosystem. If you care deeply about quality and customer experience we want to talk with you!"}, "200450506": {"jobID": "200450506", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CPU Implementation Analysis Infrastructure Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450506/cpu-implementation-analysis-infrastructure-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Minimum BSStrong fundamentals in digital design, good understanding on physical design related issues and techniquesStrong fundamentals in programming/algorithms, proficient in one or more of the following languages, Perl/Python/TCL/Java/C/C++Understanding of logic design (RTL) and electrical fundamentalsExcellent communication and interpersonal skillsMinimum BS", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role as a part of the industry-recognized and innovative CPU design team, you will work closely with design team on developing infrastructure to enable and standardize analysis of state of the art CPU physical design and implementation. In this role, you will have the opportunity to interface and interact across most disciplines in CPU design and also influence other teams in the Silicon Engineering Group (SEG) at Apple."}, "200241417": {"jobID": "200241417", "origin_search": null, "posted": "Sep 23, 2022", "jobTitle": "Display Pipeline Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200241417/display-pipeline-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in an Engineering discipline, or equivalent experiences."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Excellent communication skills and ability to collaborate under aggressive schedules.Ability and motivation to understand top to bottom architecture and functional details of a complex system with multiple inter-dependencies.Excellent math and analytical skills.Experience in the field of image/video processing algorithms and/or architectures.Experience with relevant developments using programming tools and languages such as C/C++, MATLAB, Python, Lua, HLS, etc.PhD or MS in an Engineering discipline, or equivalent experiences.", "jobDescription": "Apple display engineering organization is looking for a Display Pipeline Architect to perform system and visual quality validation for the next generation display pixel and backlight pipeline IPs. The role offers an incredible opportunity to learn from world class experts in multiple disciplines spanning from EE to system, mechanical, manufacturing, etc. Join us in crafting solutions the world doesn't know of yet. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200452171": {"jobID": "200452171", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Engineer – RF Systems Cellular RAN5", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452171/wireless-systems-engineer-rf-systems-cellular-ran5?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 10+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proficiency in RF, Demodulation and RRM aspects of 3GPP, GCF, PTCRB / GCF and carrier conformance requirements and implications to device and test equipment architectures, and performance tradeoffs.Proficiency in device certification processes on at least one (GCF, PTCRB) industry certifications or (FCC, EU, China) Regulatory complianceDirect hands-on experience with and proficient knowledge of underlying theory and techniques used in 2G, 3G, 4G LTE cellular technologies. Proficiency in 5G-FR1 or 5G-mmWave cellular technology is a plus.Experience as RAN5 delegate. Understanding of 3GPP RAN4 interaction with RAN5. Experience as RAN5 delegate towards 4G or 5G-FR1, FR2 cellular technologies is a plus.Experience working with different industry member across carrier, chipset and infrastructure.Knowledge of conducted RF and antenna characteristics impact to both conducted and radiated testing. Familiarity with test setups, radiated chambers and their calibrations & use.Experience with entire product development cycle of cellular handsets.Excellent written and verbal communication skills.BS with 10+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to define and lead 3GPP RAN5 technical standardization topics in 3GPP meetings representing Apple."}, "200393115": {"jobID": "200393115", "origin_search": null, "posted": "Jul 4, 2022", "jobTitle": "Computational Designers: Industrial Design Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200393115/computational-designers-industrial-design-group?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s or demonstrable experience in Industrial Design, Mechanical Engineering, Architecture or Computational Design required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Demonstrable understating of Computational Design for productionProficiency in Grasshopper and Rhino is preferred. Proficiency with Python or C# is a plus. Curiosity to learn and explore new tools is a must.Highly adaptable and able to offer creative solutions for difficult, often ambiguous, problems.Ability to comprehend and integrate large data sets into computational models.Conceptual ability to translate and change parameters.Proven complex data and file management.Excellent communication skills. English proficiency required.Bachelor’s or demonstrable experience in Industrial Design, Mechanical Engineering, Architecture or Computational Design required.", "jobDescription": "Apple’s Industrial Design Group is looking for Computational Designers to be a key part of our iterative design process."}, "200453773": {"jobID": "200453773", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "GPU Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453773/gpu-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We value proven ability in all aspects of ASIC implementation including Synthesis, DFT insertion, Floorplanning, Clock and Power distribution, Place and Route and all aspects of timing, electrical and physical signoff.Work with FE teams to understand the design architecture to drive optimal floorplanning and physical implementation through early RTL feedback.Use design knowledge and innovative physical construction and optimization flows to push performance, power, and Area (PPA) of GPU designs.Experience with multi-voltage, power gated, and power retention will be an advantage.Practical knowledge with hierarchical design approach, top-down design, budgeting, timing, and physical convergence will be an asset.Showcase your experience on integrating IP from both internal and external vendors and be able to specify and drive IP requirements in the physical domain.Track record of applying creative thinking to strategically solve problems that have impact for a project, group, or organization.Depth of expertise with large GPU designs (>20M gates) with frequencies in excess of 1GHz applying brand-new technologies.From a CAD tool perspective, experience creating and analyzing floorplanning tools, P&R flows, static timing, and Physical Design Verification Flows is required.Experience with various process related design issues including Design for Yield and manufacturability, multi Vt strategies and thermal management.Consistent record in solving complex PD and multi-functional problems, achieving results directly and/or leading a team of engineers to innovate and achieve extraordinary GPU designs.We are looking for candidates with a minimum of BS + 10 years of relevant experience.", "jobDescription": "Do you love creating sophisticated solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient GPU! You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions! Joining this group means crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices. This role requires a mix of strategic engineering along with hands-on experience in physical design and large chip integration, being responsible for implementing complete chip design from RTL to tapeout."}, "200455016": {"jobID": "200455016", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455016/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Recent successful tapeouts in deep submicron technology.Knowledgeable in partition level P&R implementation, including floorplanning, clock & power distribution, timing closure, physical & electrical verification.Strong knowledge of PD construction & analysis flows and methodology.Shown ability to execute to stringent schedule & die size requirements.Strong interpersonal skills.Experienced in industry standard tools, understand their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nWe are seeking a seasoned Physical Design technical leader with deep expertise in high-performance & low-power design. In this highly visible role, you will work closely with cross-functional teams to come up with efficient chip and IP physical architecture taking into account physical design constraints early in the design cycle."}, "200459173": {"jobID": "200459173", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Signal Integrity Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459173/signal-integrity-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSEE/MSEE/PhD"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "2+years of experienceMust have strong EE fundamentals and problems solving skillsMust have strong academic background in EM theory and coupling mechanisms.Must have experience in signal and power integrityAbility to relate electrical performance to physical layoutExperience in 3D EM simulations for debugging and mitigating complex EM coexistence issuesHands-on experience in EM and circuit simulation tools: Ansys HFSS/Maxwell/SIWave, CST, ADS/Spice/Spectre, Cadence/Sigrity, scripting languages (Python, Perl)Hands-on experience in hardware board-level testing, validation, and with lab equipment (near field scanning, spectrum analyzers, VNAs, scopes)BSEE/MSEE/PhDPosition will require some international travel", "jobDescription": "The iPhone Hardware Engineering team is seeking a hardworking electrical engineer for the position of Hardware Engineer - System Technologies. The ideal candidate will work with iPhone Hardware multi-functional teams to perform in-depth debug, modeling and simulation of sophisticated electric and magnetic effects in mobile systems design."}, "200463073": {"jobID": "200463073", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "WiFi Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463073/wifi-quality-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "3+ years of experience in 802.11 protocols and/or Bluetooth3+ years of experience in SQA methodologies and practicesExperience in developing test strategies and executing it with automation or manual testingExperience in utilizing tools, including Wireless and Bluetooth packet sniffers and network protocol analyzers, to help resolve, root cause and provide debugging information to engineering teams.Thrive in a collaborative environment and comfortable working with multi-functional teams.Laser-focused on the smallest details that are meaningful to our customers.Ability to write automation and automate existing test cases to improve efficiency.Proficiency in Python and/or C/C++. Previous automation experience required.Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Join the Sensing and Connectivity team in driving the innovation and delivering seamless wireless connectivity and the best user experience to our customers. Our team works on an Apple eco-system of devices that delivers the best wireless connectivity experience.\nIf you are motivated, highly technical and passionate about WiFi, Bluetooth and Networking technologies, possess excellent problem solving and coding skills, this team can be your destination."}, "200447398": {"jobID": "200447398", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Cellular SOC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447398/cellular-soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 3 years of relevant industry experience is required.\nMSEE or beyond is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS + 3 years of relevant industry experienceDedicated/hands-on ASIC DV experience.Advanced knowledge of HVL methodology (UVM/OVM) with most recent experience in UVM.Consistent record of working full ASIC cycle from concept to tape-out to bring-up.Experience taping out large SOC systems with embedded processor cores.Hands-on verification experience of PCIe, Bus Fabric, NOC, AHB, AXI, based bus architecture in UVM environment.In-depth knowledge and experience working with low-power design, UPF integration, boot-up, power-cycling, and HW/FW interaction verification.Should be a great teammate with excellent communication and problem-solving skills and the desire to seek diverse challenges.BS + 3 years of relevant industry experience is required.\nMSEE or beyond is preferred.", "jobDescription": "Do you have a passion for invention and self-challenge? This position gives you an opportunity to be a part of one of the most innovative and key projects that Apple’s Silicon Engineering Group has embarked upon to date.\n\nAs part of our team, you will have the opportunity to take the lead and contribute to verifying a set of sophisticated SOCs. This team will allow you to integrate multiple sophisticated IP-level DV environments, craft highly reusable outstanding UVM TB, implement effective coverage-driven and directed test cases, deploy new tools and implement methodologies to improve the quality of tape-out readiness. By collaborating with other product development groups across Apple, you can push the industry boundaries of what cellular systems can do and improve the product experience for our customers across the world! You will be able to learn all aspects of a large-scale SOC, different types of SOC architecture, many high-speed layered protocols, the industry’s standard methodologies on low-power architecture, outstanding DV methodology, verification on accelerated platforms, knowledge of Cellular protocol, FW-HW interactions, complexities of multi-chip SOC debug architecture, etc.\n\nAs a Design Verification Engineer on our team, you'll be at the center of the verification effort within our silicon design group responsible for crafting and productizing innovative Cellular SoCs! This position requires someone comfortable will all areas of SoC design verification engineering. Someone that thrives in a dynamic multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift inconstantly evolving requirements."}, "200447386": {"jobID": "200447386", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Cellular SOC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447386/cellular-soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 3 years of relevant industry experience is required.\nMSEE or beyond is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BS + 3 years of relevant industry experienceDedicated/hands-on ASIC DV experience.Advanced knowledge of HVL methodology (UVM/OVM) with most recent experience in UVM.Consistent record of working full ASIC cycle from concept to tape-out to bring-up.Experience taping out large SOC systems with embedded processor cores.Hands-on verification experience of PCIe, Bus Fabric, NOC, AHB, AXI, based bus architecture in UVM environment.In-depth knowledge and experience working with low-power design, UPF integration, boot-up, power-cycling, and HW/FW interaction verification.Should be a great teammate with excellent communication and problem-solving skills and the desire to seek diverse challenges.BS + 3 years of relevant industry experience is required.\nMSEE or beyond is preferred.", "jobDescription": "Do you have a passion for invention and self-challenge? This position gives you an opportunity to be a part of one of the most innovative and key projects that Apple’s Silicon Engineering Group has embarked upon to date.\n\nAs part of our team, you will have the opportunity to take the lead and contribute to verifying a set of sophisticated SOCs. This team will allow you to integrate multiple sophisticated IP-level DV environments, craft highly reusable outstanding UVM TB, implement effective coverage-driven and directed test cases, deploy new tools and implement methodologies to improve the quality of tape-out readiness. By collaborating with other product development groups across Apple, you can push the industry boundaries of what cellular systems can do and improve the product experience for our customers across the world! You will be able to learn all aspects of a large-scale SOC, different types of SOC architecture, many high-speed layered protocols, the industry’s standard methodologies on low-power architecture, outstanding DV methodology, verification on accelerated platforms, knowledge of Cellular protocol, FW-HW interactions, complexities of multi-chip SOC debug architecture, etc.\n\nAs a Design Verification Engineer on our team, you'll be at the center of the verification effort within our silicon design group responsible for crafting and productizing innovative Cellular SoCs! This position requires someone comfortable will all areas of SoC design verification engineering. Someone that thrives in a dynamic multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift inconstantly evolving requirements."}, "200432652": {"jobID": "200432652", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sr. Network Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432652/sr-network-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Sacramento", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- B.Sc. degree or equivalent experience\n- Cisco CCNA/CCNP, Juniper JNCIA/JNCIP, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$72,000", "max": "$130,500"}, "benefits": null, "requirements": "5+ years of experience in network troubleshootingExtraordinary interpersonal communications and customer-service skillsExperience evaluating and managing outages to business critical infrastructureAbility to maintain composure and customer-service focus in stressful and ambiguous situationsSelf-starter, self-motivated, self-directed, self-sufficientExperience in large scale networksSolid understanding of BGP, TCP/IP, Enterprise Wireless, and L2 technologiesGood background in Cisco, Arista, Aruba, or Juniper routing/switching and firewall configurationExperience with configuration management and automation technologies such as Ansible, Salt, Chef and Python, Go, etcExperience working in large scale environments with ITIL incident and problem management- B.Sc. degree or equivalent experience\n- Cisco CCNA/CCNP, Juniper JNCIA/JNCIP, or equivalent experienceFlexibility to work in a day-time or afternoon shift pattern.", "jobDescription": "Apple is a place where extraordinary people gather to do their best work. Together we build products and experiences people once couldn’t have envisioned — and now can’t imagine living without. If you’re excited by the idea of making an impact, joining a team where we pride ourselves in being one of the most diverse and expansive companies in the world, a career with Apple might be your dream job!\n\nWe are a global community of engineers who operate the diverse technology, protocol and vendor stack that interconnects all facets of Apple’s Retail networks at a scale that is second to none. We are looking for an enthusiastic and hardworking person to join a dynamic and exciting team. You will be skilled in cross-organizational collaboration, liaising with internal teams and external service providers to operate and maintain the network infrastructure. You will need to develop and maintain clear documentation and procedures associated with operations and known issues. This position provides the opportunity to operate a ground breaking, worldwide, multi-vendor network."}, "200432278": {"jobID": "200432278", "origin_search": null, "posted": "Oct 12, 2022", "jobTitle": "Retail Contact Center, WW Voice Channel Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432278/retail-contact-center-ww-voice-channel-manager?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "10+ years of experience with contact center platforms: Genesys Engage/premise voice, SIP environments, IVR speech call steering, contact routing, real time and historical reporting, and WAN/LANExtensive Genesys experience in the areas of Genesys SIP Server, URS/ORS, Stat Server, IRD/Composer, CME, SCI/SCS, and ICON10+ years enterprise experience designing, implementing & managing technology infrastructure solutions in Retail, e-commerce and contact center environments7+ years maintaining and managing global PBX/SIP and Call Center services environment5+ years IVR enterprise solution experienceExperience with telephony switching systems:  Session Boarder Controller (SBC), Session Manager (SM), Call Manager (CM), Unified Communications Manager (UCM), and WebRTCExperience working with global carriers (AT&T, BT, SingTel, Tata) or Network servicesExposure to contact center support technologies including  Call recording and Workforce Management systems (NICE IEX, Aspect eWFM)Success with designing, building, and maintaining global telephony infrastructure solutions including inbound, outbound, virtual hold, click to call and scheduled callback contact methodsRefined ability to work at a detailed level with technical peers while also being able to articulate abstract concepts to executive managementExcellent judgment when balancing technical limitations, business priorities, strategic direction, resource availability and project deliverablesAbility to convert business requirements into technical designs and communicate the features and solution to multiple parties (business and IS&T)Deep understanding of the full lifecycle project process including evaluating business and functional requirements, developing detailed business requirements, conducting technical design reviews, thoroughly testing, and implementing sustainable, flexible solutionsBA/BS or equivalent work experience", "jobDescription": "At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe Retail Online organization is looking for an outstanding leader to join our Global Business Process Re-Engineering organization. This role will lead the Infrastructure Operations Voice Team and will be responsible for connectivity within the Apple enterprise contact center in support of all regional RCC business groups and Apple Retail Stores. Areas of focus include telephony architecture, setup, modification and troubleshooting of the call delivery, logic, coordination of site launches, collaboration with other Apple business units on joint projects and supporting business needs in a timely manner as they arise. \n\nThe ideal candidate will be highly analytical, thorough, and technically savvy and will strive for operational excellence. Candidates should have a deep understanding of contact center systems, IVR enterprise solutions, and global carriers and a knack for problem solving and trouble-shooting. Candidates should be able to thrive in ambiguous work environments and respond gracefully in the face of rapid change. Good communication and presentation skills are essential as is the ability to build relationships with multiple partner teams and confidently lead a distributed team."}, "200451286": {"jobID": "200451286", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "ESD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451286/esd-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS\n10 years of experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate should have the following qualifications:Deep understanding of transistor device characteristicsSolid understanding of models used for testing ESD, including HBM, CDM, MM and IEC-61000-4-2Knowledge of state-of-the-art ESD circuit design techniques and topologiesHands-on experience with design/layout EDA tools, including Virtuoso, Calibre, Allegro, etc.Knowledge of ESD checking tools like PERC and PathfinderExperience with Si processes used for high voltage, RF, or advanced ASICsExperience with ESD/LUP test and characterization equipmentStrong initiative, collaboration, and ownership of responsibilities, productive, able to meet challenging deadlinesExcellent written and verbal communication skillsBS\n10 years of experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. In this highly visible role, you will take ownership of the ESD and Latch-Up requirements of all ICs developed by and for Apple. Your mission is to ensure the silicon is designed to meet Apple's ESD specifications and manufacturing requirements. The role involves working closely with diverse teams within Apple as well as external vendors. Occasional travel might be required\n\nDo you love working on challenges that no one has solved yet? Are you excited to build Apple’s products that strive for the highest expectations of quality, innovation and efficiency? We have an opportunity for an especially innovative ESD Designer with strong fundamentals! We are looking forward to having you join our fast growing team and help us deliver on these challenges while enjoying an amazing culture where you lead your career!"}, "200453774": {"jobID": "200453774", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "GPU Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453774/gpu-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We value ability in all aspects of ASIC implementation including Synthesis, DFT insertion, Floorplanning, Clock and Power distribution, Place and Route and all aspects of timing, electrical and physical signoff.Work with FE teams to understand the design architecture to drive optimal floorplanning and physical implementation through early RTL feedback.Use design knowledge and innovative physical construction and optimization flows to push performance, power, and Area (PPA) of GPU designs.Experience with multi-voltage, power gated, and power retention will be an advantage.Practical knowledge with hierarchical design approach, top-down design, budgeting, timing, and physical convergence will be an asset.Experience on integrating IP from both internal and external vendors and able to specify and drive IP requirements in the physical domain.Depth of expertise with large GPU designs (>20M gates) with frequencies in excess of 1GHz applying brand-new technologies.From a CAD tool perspective, experience crafting Floorplanning tools, P&R flows, global timing verification and Physical Design Verification Flows is required.Familiar with various process related design issues including Design for Yield and Manufacturability, multi Vt strategies and thermal management.We are looking for candidates with a minimum of BS + 3 years of relevant experience.", "jobDescription": "Do you love creating sophisticated solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient GPU! You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions! Joining this group means crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices. This role requires a mix of strategic engineering along with hands-on experience in physical design and large chip integration, being responsible for implementing complete chip design from RTL to tapeout."}, "200466689": {"jobID": "200466689", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Product Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466689/product-designer?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Degree in human interaction sociology, psychology, interaction design, visual design, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience designing desktop applicationsExpert knowledge of user-centered design principlesTried proficiency with Photoshop, Illustrator, or other design toolsAbility to do rapid prototyping in Flash and HTML5Complete proficiency in MacOS and iOS.Extraordinary written and verbal communication skillsExcellent collaborative skillsCapable of working in a loosely structured organizationHighly professional, with the ability to deliver work on tight scheduleDegree in human interaction sociology, psychology, interaction design, visual design, or equivalent", "jobDescription": "Apple’s Applications Group is seeking a Sr. Product Designer to work on consumer software applications for the Mac and iOS. You are a problem solver, quick study, self starter, and excellent communicator with a passion for phenomenal design and the ability to achieve it. You possess a rare blend of interaction design, visual design, and prototyping skills. We’ll provide you with unparalleled levels of opportunity and resources, with the goal of creating experiences that influence the industry, as well as people’s lives. By constantly focusing on the consumer, you’ll create products that are not only amazing to look at, but also intuitive and useful to billions of people worldwide. Join this team if you’re committed to making each human interaction — visual, audial, and haptic — amazing for our customers."}, "200456277": {"jobID": "200456277", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Analog Mixed Signal IP Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456277/analog-mixed-signal-ip-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE required plus 10+ years of relevant experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience in analog IC designMultidisciplinary; being able to work on a large range of analog related topicsHands-on design expertise in at least 3 of the following areas: LDO, ADC, DAC, PLL, SerDes, band-gap reference, filter design, switched capacitor circuit designExperience with advanced CMOS processes (45nm and below)Strong understanding of transistor device characteristicsDeep understanding of power, area and performance trade-off in mixed-signal designsKnowledge of Analog IC design flow and toolsStrong initiative and ownership of responsibilities, productive, able to meet bold deadlinesExcellent written, verbal communication skills as well as interpersonal skillsBSEE required plus 10+ years of relevant experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "In this highly visible role, you will take ownership of analog IP provided by external vendors. Your job is to assure that the IP is meeting Apple's high quality standards and gets flawlessly coordinated in industry leading mobile devices! The role involves working closely with different multi-functional teams within Apple as well as external vendors! Occasional travel might be required."}, "200451230": {"jobID": "200451230", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Digital Layout Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451230/digital-layout-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for applicants experience in custom layout design of deep SubMicron CMOS circuits used in high performance microprocessors.Experience designing low noise, low power datapaths, SRAM, Register files layout structures, etc.High level proficiency in layout floorplanning, standard cell planning and hierarchical layout assembly.Good understanding of issues with RC delay, electromigration, self heating and cross capacitance.Recognize failure prone circuit and layout structures, dedicatedly work with designers for the best approach to problems.Great skills on interpretation of CALIBRE DRC, ERC, LVS, etc. reports.Knowledge of MENTOR GRAPHICS or CADENCE layout tools.Scripting skills in CSH, PERL or SKILL are considered a plus, but not required.Experience in layout automation is considered a plus, but not required.Experience in memory compiler development is considered a plus, but not required.Excellent communication skills and able to work with multi-functional teams.BS and a minimum of 3 years relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions?\n\nAs part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned.\n\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Digital Layout Designers!\n\nIn this highly visible role, you will be a member of Apple’s custom layout team, working on the latest technology nodes to create extraordinary custom digital macros, libraries, etc. This is a fast paced work environment with endless learning opportunities working in the design team with members of integration, CAD, circuit and technology engineering."}, "200455834": {"jobID": "200455834", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Processor Emulation and FPGA Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455834/cpu-processor-emulation-and-fpga-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceThe primary skills required for this job are RTL design, simulation, expertise in mapping designs to emulation, improving model performance, excellent communication skills, and ability to work in a fast-paced exciting environment.The ideal candidate should have extensive experience in the following areas:Hardware Emulation/FPGA Platforms and tools (Palladium/Zebu/HAPS)Computer ArchitectureRTL developmentVerilog, SystemVerilog (DPI and transactors)Simulation acceleration knowledge and FPGA prototypingProgramming/scripting skills (C, C++, Python)Software Debug tools (e.g. gdb)Problem solving skillsMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!"}, "200443159": {"jobID": "200443159", "origin_search": null, "posted": "Nov 14, 2022", "jobTitle": "Packaging Retail and Events Engineering Project Specialist (EPS)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443159/packaging-retail-and-events-engineering-project-specialist-eps?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree preferred, 3+ years of industry related experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Extensive understanding of Configuration Management / Manufacturing Process and BOM structuring, preferably with experience using AGILE and HW Development platformsExcellent communication (written and verbal) with proficiency in ExcelUnparalleled multi-tasking abilities, must be able to manage, organize and maintain large quantities of dataTop notch critical thinking skillsetAbility to react to resets and changes in a time sensitive environmentExcellent organization and conflict resolution skills with the ability to see around cornersExperience with overseas vendorsOff hour support via email and phoneBachelors degree preferred, 3+ years of industry related experience preferredApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Are you passionate about the \"unboxing\" experience when a new product arrives on your doorstep? Do you find yourself holding on to an Apple product package longer than other packages you've opened? You're not alone! Our team is responsible for the design decisions that go into making millions of Apple products' packaging. \n\nApple’s HW Engineering Team is looking for a resourceful, energetic Engineering Project Specialist (EPS) to manage and assist with Configuration Management, Vendor and Logistics Management.  Preferred candidate is a strategic problem solver who can lead and work with cross-functional teams to manage Build of Materials (BOMs), track details to support the engineering development builds, prioritize issues, and multi-task."}, "114438150": {"jobID": "114438150", "origin_search": null, "posted": "Mar 6, 2023", "jobTitle": "US-Expert", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/114438150/us-expert?team=APPST", "jobLocation": {"remote": "not specified", "city": "Various Locations within United States", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Demonstrated proficiency in technology, particularly Apple products, and the ability to quickly learn about new products.Proven experience in sales and technology solutions, as well as in developing customer loyalty.Ability to consistently deliver great customer experiences — no matter what the situation.•You’re passionate about Apple, and you inspire and educate others about all that Apple has to offer.•You can set the standard for Apple’s unique style of service through words and action.•You have strong people skills — you’re approachable, a good listener, and empathetic.•You can serve as an engaging role model to Specialists.•You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Are you passionate about sharing your knowledge of Apple products? We’re looking for people who get great satisfaction from helping people develop lifelong relationships with Apple every day. The Apple Store is a retail environment like no other — uniquely focused on delivering amazing customer experiences. As an Expert, whether you work full-time or part-time, you introduce people to the exciting world of Apple, having meaningful interactions, offering customized solutions, and turning curious visitors into loyal customers. With a deep understanding of Apple products and services, you spend time mentoring team members and serving as a role model for your team. \n\nBoth full-time and part-time jobs are available."}, "200460745": {"jobID": "200460745", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460745/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Professional coding skills in Verilog or SystemVerilogSophisticated knowledge of standard ASIC design and verification flows including RTL design, simulation and testbench development, coverage analysis and constrained random testingAdvanced knowledge of HVL methodology like UVM/OVM is a big plusExperience with SystemVerilog Assertion (SVA)Experience writing scripts in languages such as Perl or Python is a plusExperience with Formal Verification is a plusBS and 10+ years of relevant experience required.", "jobDescription": "Imagine what you could do here at Apple! New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love working on challenges that no one has solved yet? Bring passion and dedication to your career, and there's no telling what you could accomplish.\n\nOur Display Technologies Engineering team is working on the next generation of groundbreaking products using best in class tools, flows and methodologies. Come join our team and be a part of the excitement!"}, "200451264": {"jobID": "200451264", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "FW Build Integration and Release Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451264/fw-build-integration-and-release-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS \n10 years of experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficiency in GitStrong knowledge of Gerrit,  GitLab, Git Hub or any other project hosting solutionHigh proficiency on Groovy and Jenkins pipelinesDeep understanding of verification, quality assurance, and release flowExperience debugging and building automation on Linux/Unix/MacOS environmentsProven knowledge of Make and CMakeProficiency with Python and Shell ScriptingExperience with automation of test on virtual platforms and hardware devicesFamiliarity with the configuration of Docker imagesKnowledge of Splunk and Django are a plusBS \n10 years of experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Wireless Connectivity Silicon team is looking for wireless FW Build Integration and Release engineers for the design, development, and bringup of innovative wireless silicon for application in Apple’s products! You will work with hardware and FW teams to maintain several compiler and linker options in a complex build system and a CI/CD infrastructure on multiple development and production platforms to enable automated builds and automated testing!"}, "200402982": {"jobID": "200402982", "origin_search": null, "posted": "", "jobTitle": "Administrative Assistant, Wireless Technologies and Ecosystems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200402982/administrative-assistant-wireless-technologies-and-ecosystems?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200428886": {"jobID": "200428886", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Display Pipeline Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200428886/display-pipeline-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in an Engineering discipline, or equivalent experiences."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Excellent communication skills and ability to collaborate under aggressive schedules.Ability and motivation to understand top to bottom architecture and functional details of a complex system with multiple inter-dependencies.Excellent math and analytical skills.Experience in the field of image/video processing algorithms and/or architectures.Experience with relevant developments using programming tools and languages such as C/C++, MATLAB, Python, Lua, HLS, etc.PhD or MS in an Engineering discipline, or equivalent experiences.", "jobDescription": "Apple display engineering organization is looking for a Display Pipeline Architect to perform system and visual quality validation for the next generation display pixel and backlight pipeline IPs. The role offers an incredible opportunity to learn from world class experts in multiple disciplines spanning from EE to system, mechanical, manufacturing, etc. Join us in crafting solutions the world doesn't know of yet. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200450095": {"jobID": "200450095", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Wireless Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450095/wireless-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Wireless/Wired communication block/system verification experience.Advanced knowledge of SystemVerilog and DV methodology.Solid verification skills in problem solving, constrained random testing, and debugging.Verification experience of one or more of the following: MAC, PHY, DMA, timer, AMBA bus and fabric, encryption/decryption engine.Knowledge of wireless protocols such as Bluetooth, WLAN, or Zigbee a plus.Experience with SystemVerilog Assertion (SVA) a plus.Should be a great teammate with excellent communication skills and the desire to take on diverse challenges.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nAs a Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of communication subsystem including MAC, PHY, and interfaces. With deep understanding of communication systems and protocols, you will interact with DV methodologists, designers and communication systems engineers to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification."}, "200464170": {"jobID": "200464170", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Senior Manager, Music Insights", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464170/senior-manager-music-insights?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree in Business or related subject."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$168,000", "max": "$316,000,"}, "benefits": null, "requirements": "7+ years experience leading analytics teams and managing people and people managersComfort working in and through ambiguity; cross-functional experience is a mustStrong prioritization skills and ability to find creative solutions when roadmaps are fullStrong analytical skills and a deep understanding of statistical and forecasting principlesAdvanced Excel skills and comfort working with Python, R, SQL and related toolsExperience creating compelling data visualizations and building presentations using KeynoteExcellent communication skills, both written and oral - you can convey complex ideas simplySelf-starter and results-oriented, upbeat and focused with a strong passion to learnCritical and curious thinker with the ability to focus on both the details and big pictureBA/BS degree in Business or related subject.", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!\n\nWe are looking for an insights leader with deep music knowledge to lead insights at Apple Music. In this role, you will lead a global team of Music Insights Analysts and support Apple Music's global content teams. Come work with us and use your passion for data and people to help shape the future of music."}, "200446147": {"jobID": "200446147", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Ad Operations Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446147/ad-operations-specialist?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA degree required; 3+ years of advertising operations experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$72,000", "max": "$145,000,"}, "benefits": null, "requirements": "3+ years of experience at a Digital Media Agency in an Ad Operations dedicated roleExpertise in ad serving technologies such as Google Campaign Manager (formerly DCM)Proficiency in recognizing tracking issues through thoughtful and detailed QAStrong troubleshooting skills for QA of backend data discrepanciesAbility to develop and test solutions for tracking issues and/or tag implementation errors (coding experience a plus)Depth of understanding of various ad tag structures (e.g. VAST/VPAID)Experience with QAing spec requirements and tag implementation with various publisher/DSP ad operations teamsComfortability with adapting workflow to shifts in priorities and urgenciesExperience with various URL tagging structures (i.e. ad server/ MMP parameters and macros) and understanding of various attribution methodologiesExperience in establishing systems and processes to build operational efficienciesHyper organized and detail oriented by natureBS/BA degree required; 3+ years of advertising operations experience required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nApple is in search of an experienced Ad Operations Specialist to join the Apple Services Digital Marketing team. In this role you will work hand-in-hand with media strategy, analytics, creative, and campaign strategy teams, facilitating the execution of all go-to-market display/video campaigns. \n\nAs an Operations Specialist, you will manage URL coding, trafficking, tag generation, and troubleshooting for display/video activity across Apple Services LOBs. You will help to identify and develop best practices from both a creative and technical operations perspective while also completing soup-to-nuts ad tech platform execution to ensure timely and accurate digital campaign launches. On this team, you will work across Apple’s suite of Services: Apple Music, TV+, Apple Card, Apple Arcade, Apple Podcasts, Apple Books, Apple News+, and more."}, "200464499": {"jobID": "200464499", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "CAD Engineer – Analog/RF Simulation Flow & Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464499/cad-engineer-analog-rf-simulation-flow-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 3 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Strong expertise in circuit simulations with Analog/RFIC design and/or related CAD/automation support areas involving various technology nodes and tape out.Expertise with Cadence ADE environment including knowledge of Schematic Editor, PDK, CDF, Callbacks, Netlisting, Analog Design Environment (ADE-L/XL/GXL/Maestro), OCEANProficient in Spice simulators, including Spectre, Spectre RF, AFS (BDA), Hspice, ADS, GoldenGate, AMS Designer, XA, Hsim, and FineSim.Strong ability to solve simulation accuracy, speed and capacity issues. Knowledge of AC, DC, Tran, Harmonic Balance, S-parameters, Periodic noise, PSS simulations.Expertise in device level SOA checks, ERC asserts, statistical simulations using Monte Carlo, PVT and Reliability/aging analysis involving Self-Heating is a plus.Experience in evaluating simulation and environment related CAD tool/product applications and driving EDA vendors to meet design requirements.Understand custom IC designs, and knowledge of Post-layout DSPF/SPF extraction. Knowledge of behavioral RTL/AMS circuits, experience in Verilog- A/AMS. Knowledge of PDK and spice models qualification.Efficient programming skills in SKILL language, Python, Perl, TCL, or Shell. Ability to provide automations for rapid and dynamic design needs. Knowledge in Perforce and/or regressions is preferred.Good written and verbal communication skills, and the ability to collaborate well with multi-functional teams and external vendors.Minimum requirement of BS + 3 years of relevant industry experience.", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nAs a member of our CAD team, you will architect, develop, maintain and enhance simulation methodology and solutions for our Analog, RF and mixed-signal designs. \n\nThe role requires working with different technology nodes and provide flows/methodologies for the different tool sets. Working in a small CAD team, you will be collaborating with the analog, mixed-signal, and RF circuit design teams. The role will also involve partnering with layout design, technology, and 3rd party EDA tool vendors to drive and coordinate effort of developing and validating simulation flows, enhancing custom design environment, validating checks and doing results analysis."}, "200447872": {"jobID": "200447872", "origin_search": null, "posted": "Jan 4, 2023", "jobTitle": "Analog Design Lead - Power Management", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447872/analog-design-lead-power-management?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS+10 Years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for applicants with 10+ years of demonstrated ability of developing leading power management integrated solutions implemented in silicon for the mobile market with the following experience:BS+10 Years of relevant industry experience, advanced degree preferred.Expertise in power topologies such as buck, boost, buck-boost, charge pumps, LDOs.Deep understanding of control architectures such as current mode, voltage mode, and hysteretic mode for applications include DC/DC converters, LED drivers, battery management circuits, LDOs, temperature sensors.Strong understanding of semiconductor device physics, device safe-operating area (SOA), and power transistors used for high frequency switching. Solid understanding of DC/DC power converter modeling techniques using any of the following simulation tools such as MATLAB, Simplis, PSIM, or Spectre.Understanding of Analog IC circuit design as it relates to power conversion architecture requirements, design tools and methodologies. Circuit blocks include bandgap references, op amps, OTAs, bias circuits, comparators, oscillators, DACs, ADCs, level- shifters, switching power stages, LDOs, charge pumps, glue logic. Key parameters include voltage and current accuracy, load and line transient response, DC gain, bandwidth, phase and gain margin, slew rate, efficiency, offset, PSRR, CMRR, noise, propagation delay, input and output common mode range, supply headroom.Experience working in a team environment on mixed signal ICs that integrate power management circuits, ADCs, DACs, and digital state machines is strongly preferred with proven industry- leading design expertise required.Experience taking projects from the concept phase, through chip architecture, writing electrical specifications, process technology selection, die size estimation, managing schedules, IC design, layout supervision, layout extraction and verification, DRCs, LVS, LVL, mask and wafer fabrication monitoring, ATE lab correlation, corner lot characterization analysis, hands-on lab evaluation, release to production, yield improvement, and failure analysis support.Knowledge of board level considerations, including component selection, PCB layout, packaging technologies and thermal analysis.Knowledge of IC process technologies, reliability design rules, ESD and latch-up testing.Knowledge about industrial standards and practices in appropriate technologies.Design management experience with multi-functional preferred.BS+10 Years of relevant industry experienceSome Travel Required", "jobDescription": "Can you influence, connect, get results and communicate effectively? We have an extraordinary opportunity for senior level engineers to drive and lead technical engagements between Apple and silicon and IP suppliers working on groundbreaking technologies! The Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, iPod, and AppleTV. Apple is looking for a remarkable Power Management Analog Design Lead to work with multi-functional teams and external vendors to define, develop and productize the next generation of mobile power solutions."}}