{"200458615": {"jobID": "200458615", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458615/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of a BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for entry level applicants with an interest in circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits.Strong understanding of CMOS device characteristics and design rules.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Understanding of Timing characterization & modeling of Standard cell circuits.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.Minimum requirement of a BS degree", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200458616": {"jobID": "200458616", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458616/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of a BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.19", "max": "$67.78/hr,"}, "benefits": null, "requirements": "We are looking for entry level applicants with an interest in circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits.Strong understanding of CMOS device characteristics and design rules.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Understanding of Timing characterization & modeling of Standard cell circuits.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.Minimum requirement of a BS degree", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200451436": {"jobID": "200451436", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Silicon Bringup Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451436/cpu-silicon-bringup-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceThe ideal candidate should have experience in hardware and low-level software skillsStrong understanding of processor architectureExperience with FPGA design and optimizationGood understanding of firmware and device driversGood C and assembly programming skillsExcellent partnership and communicationAbility to work with multiple teams in delivering a solutionMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nYou will be a member of a CPU silicon bringup team where your tasks will include reproducing silicon failures on FPGA or Emulators, optimizing FPGA models for speed, creating silicon irritators on FPGA, and executing parts of functional silicon bringup plans."}, "200451973": {"jobID": "200451973", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Cellular/Wireless RF Silicon & System Validation Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451973/cellular-wireless-rf-silicon-system-validation-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience in Cellular/Wireless RF silicon and system validationExcellent communication, presentation, social, and leadership skillsAbility to tailor information to the right audience, including executive managementExperience working in a wide-ranging multi-functional engineering environment, strong at multi-tasking, and real-time crisis managementExpertise in owning and driving project development/technical program managementExperience working with RF systems & design flows and leading cellular/wireless projects from concept to productionBS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norms here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nAre you a leader? Do you want to use your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively? Can you deliver on a predictable yet multidimensional schedule? \n\nAs a Cellular/Wireless RF Silicon & System Validation Program Manager within the Hardware Technology Engineering organization, you will be working on a senior program management team driving RF silicon and system validation program schedules and resolving technical issues to drive timely silicon delivery. This is an individual contributor role, helping lead the development process for Cellular/Wireless SoC silicon used in groundbreaking Apple products. This role spans across the full SoC development cycle, from concept to productization. Validated experience working in a multi-layered engineering environment, sophisticated multi-tasking skills, and real-time crisis management are all desired strengths for this position."}, "200458144": {"jobID": "200458144", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "DDR Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458144/ddr-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logicLogic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented DRR Design Engineer. \n\nAs a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.  You will join the DDR PHY design team. We provide best-in-class PHY designs for high-performance, low power applications. As a logic design engineer, you will be involved in all phases of the design, from concept study, architecture definition, design and verification, to silicon bring-up and characterization."}, "200451428": {"jobID": "200451428", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer - Design Verification Tools and Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451428/cad-engineer-design-verification-tools-and-infrastructure?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS Degree + 0 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Strong scripting/coding abilities in Python/Perl are needed.Good communications skills are required and prior customer support experience is a plus.Knowledge of C/C++, Java or any other OOP programming language is a plus.Minimum requirements of BS Degree + 0 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world.\n\nAs a member of our CAD team, you will develop, maintain, and enhance existing sophisticated software systems for regression-testing Apple’s silicon designs in software simulation, to find and report defects in our chip designs, and thus ensure that Apple tapes-out world-class silicon. Your experience and innovative ideas will inform the design of the next generation of these regression systems. Your experience and insight, your skill at diagnosing the root cause of complex problems, and your ability to guide engineers who come to you with problems will be important contributions to an extended CAD team that comprehensively supports Apple’s DV and chip design engineering efforts. You will work closely with EDA vendors to incorporate new capabilities of their commercial tools, and to resolve problems."}, "200451421": {"jobID": "200451421", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451421/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logic, Logic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and uncommonly hardworking RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nIn joining the Analog Mixed Signals team, we will provide the best-in-class PHY designs for high-performance, low power applications. As a logic/RTL design engineer, you will be involved in all phases of the design, from concept study, architecture definition, design and verification, to silicon bring-up and characterization."}, "200455212": {"jobID": "200455212", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455212/soc-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 0 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "-  Knowledge of computer architecture and digital design fundamentals-  Knowledge of Verilog or SystemVerilog, digital simulation and debug-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to take on diverse challengesMinimum of BS + 0 years relevant industry experience", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200426205": {"jobID": "200426205", "origin_search": null, "posted": "", "jobTitle": "Administrative Assistant, Wireless Technologies and Ecosystems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200426205/administrative-assistant-wireless-technologies-and-ecosystems?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200459587": {"jobID": "200459587", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Thermal Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459587/thermal-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands-on thermal-design experience in electronics.Experience designing, simulating, and validating thermal designs for high-powered silicon devices with hotspots is requiredIntimate solid understanding of key thermal technologies required: heat sinks, heat pipes, vapor chambers; TIM materials; chillers and thermoelectric heads; fansExtensive thermal simulation experience using Ansys Icepak is requiredExperience with TIM selection for various environments is requiredExperience selecting fans using CFD models is requiredUnderstanding of PCB thermal modeling is requiredExperience with high-speed, high-pin-count, high-power sockets is preferredLab experience with TTVs, thermocouples, IR camera, stroboscopes, DAQ desired3D CAD experience required, NX preferredSubject area in GD&T practices with close attention to datum establishmentBackground in SOC, flip chip, PMIC thermals is valuableExcellent written and verbal communication skills and people skills; ability to work well with management, team members and external vendorsTeamwork: the candidate must be able to communicate well with multi-functional team members, be able to efficiently collaborate with team members to achieve project goals and contribute positively to the engineering community.Leadership: Must be able to confidently lead a multi-functional team of engineers to achieve ambitious project goals on an aggressive scheduleMentorship: You will be able to mentor team members technically and in working multi-functionally within the larger engineering community.Bachelor's degree and a minimum of 10 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nWe are a small, productive team of passionate engineers building the infrastructure to validate the very wide range of Apple-designed silicon devices that power the iPhone, Apple Watch, iPad, Mac, and more. We collaborate with electronic engineers to build mechanical fixtures for innovative silicon packages, including sockets, thermal stations, and automated chip testers. Our silicon characterization infrastructure enables our silicon engineering team to produce world-class silicon on a tight schedule.\n\nWe are looking for an expert thermal engineer to own the design, development, and validation of thermal solutions used for silicon characterization."}, "200449766": {"jobID": "200449766", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Design Timing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449766/cpu-design-timing-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceThe ideal candidate will have implementation experience on high performance CPU designs including at least one project that includes ownership of timing analysisWorking knowledge of CPU microarchitecture including common critical loops for timing and understanding of low power microarchitecture and implementation techniques for CPUsDeep knowledge of static timing tools and flows including how to handle multiple clock and power domains and other complex scenariosPhysical design knowledge of device physics and in particular aspects which impact timing (cross talk, noise, OCV etc.)Prior experience owning the timing flow on a major CPU or similar projectGood understanding of physical design tools and methodology including but not limited to physically aware synthesis and place & route tools and flows, extraction, STA, and other analysis flows, and physical design verification (LEC, DVS, etc.)Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! \n\nIn this role, you will be responsible for all aspects of timing including working with the implementation and RTL teams on timing changes, helping with constructing and modify timing flows, timing analysis, and timing closure."}, "200451402": {"jobID": "200451402", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451402/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logicLogic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and uncommonly hardworking RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nIn joining the Analog Mixed-Signals team, we will provide the best-in-class PHY designs for high-performance, low power applications. As a RTL design engineer, you will be involved in all phases of the design, from concept study, architecture definition, design and verification, to silicon bring-up and characterization."}, "200451409": {"jobID": "200451409", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451409/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep understanding of mixed signal concepts, along with RTL design fundamentalsDeep knowledge of Verilog and System-VerilogExperience with front-end tools (Verilog simulators, linters, clock-domain crossing checkers)Working knowledge of synthesis, static timing, DFT is a huge plusSome working experience with System-Verilog assertions, checkers, and other design verification techniquesKnowledge of SerDes, algorithm developments, scripting languages such as Perl and Python are plussesStrong communication, collaboration and presentation skillsBS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.  \n\nIn this role, you will gain the opportunity to specify, design, and contribute in the verification and lab bring-up of advanced mixed-signal circuits (digital side)."}, "200448057": {"jobID": "200448057", "origin_search": null, "posted": "Jan 3, 2023", "jobTitle": "Sr iOS Application Developer - Health Software", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448057/sr-ios-application-developer-health-software?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "iOS development experienceExperience with both Objective C & SwiftExperience with iOS frameworks such as UIKitProven software architecture experienceAbility to understand and break down large features into complete solutionsExcellent interpersonal skills and ability to work well with all levels of engineers and other teams3+ years industry experienceBS Computer Science or equivalent experience.Familiarity with Wellness or Medical concepts is a plus.", "jobDescription": "At Apple we want to make great products that empower people to improve their health. We are seeking a senior level, energetic and self-driven software engineer to join Apple’s Health team to lead health features by expanding the capabilities of iOS and watchOS. As a member of our team, you will have the unique and rewarding opportunity to shape upcoming features that will delight and inspire millions of Apple's customers every day."}, "200349958": {"jobID": "200349958", "origin_search": null, "posted": "Feb 24, 2022", "jobTitle": "Wireless System Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200349958/wireless-system-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Electrical Engineering or Wireless Communications"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "5+ years experience in design and development of wireless communication systemsExperience in wireless communication protocols like 802.11be/ax, BT, Cellular NR/LTE, IP and their application to E2E product designHands on experience with lab test stations, performance and power characterization is neededExperience in optimizing air-interface protocols to meet product requirementsExperience with multi-radio coexistence management is a plus.Experience in defining technical specifications for wireless products in IEEE/3GPP and/or other forums where specifications are discussed is a plusKnowledge of Matlab, Python and/or C/C++ for algorithm development, modeling, and system simulationsMS or PhD in Electrical Engineering or Wireless Communications", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. \n\nApple is seeking a highly motivated, energetic Wireless System Architect to lead and drive wireless system designs, define product requirements, identify suitable technologies and drive implementation and validation. The ideal candidate oversees and analyzes key system architectural requirements and implementation trade-off while taking into account power consumption budgets, coexistence, cross-layer platform design etc."}, "200449771": {"jobID": "200449771", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Graphics RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449771/graphics-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We will need you to demonstrate their knowledge of logic design principles along with timing and power implicationsAn understanding of low power microarchitecture techniques is a key qualification for successYou will be expected to perform performance and power analysisProficient at design development using System Verilog HDLAbility to drive development and debug of complex designsUnderstanding of synthesis tools, timing analysis, floor planning, the PNR flowUnderstanding of Design Validation Practices and PrinciplesExperience with scripting languages such as Python, Ruby, or PerlDemonstrate the ability to work well within and leadership of a teamBS + minimum of 3 years experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this highly visible role, team members will develop power efficient, high performance 3D graphics processors targeted for low power mobile devices."}, "200235642": {"jobID": "200235642", "origin_search": null, "posted": "Mar 31, 2021", "jobTitle": "TFT Panel Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200235642/tft-panel-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$171,000,"}, "benefits": null, "requirements": "Hands-on experience, in-depth technical knowledge, and proven track record in the design and development for displays or related electronics.Understanding the basic TFT and panel process is a mustUnderstanding display touchAbility to perform computer modeling and simulation with SPICEExperience in measuring and characterizing IV and CV of TFT devicesExcellent written and verbal communication skills are requiredExperience in developing, designing and manufacturing high volume display products is a plusExperience in characterizing panel optical and electrical performance is a plusExperience in gate and column driver IC designs is a plusPhD or MS in Electrical Engineering", "jobDescription": "Apple is looking for a world-class Thin Film Transistor (TFT) panel design engineer to design, develop and launch the next TFT technologies for the portable, laptop and desktop displays in Apple products. The TFT panel design team is responsible for delivering the advanced TFT panel designs and technologies to enable the world’s best display performance in Apple Products. Individual will serve as a focal point in architecting and developing the total TFT pixel and panel designs. This includes TFT device modeling, simulation, integrated circuit-on-glass design, panel architecture, and whole panel function simulation."}, "200461977": {"jobID": "200461977", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "6G Cellular Platform Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461977/6g-cellular-platform-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "Minimum requirement of BS and 10+ years of relevant industry experience.\nMaster’s or PhD degree in Electrical Engineering or equivalent degree with 10+ years of work experience is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven track record in wireless product design and prototyping.A deep understanding of real-world wireless systems, network architectures, user applications, and end-user device platform architectures (such as power delivery, processing, and memory systems) is required.Good programming skills are a plus.Consistent record in several of the following areas related to wireless systems and prototypes:1.Setting and refining system requirements to build solutions for prototype design, sub-component design, and validation.2.Creation of system abstractions and simplifications that allow rapid validation of research hypotheses.3.Applying AI/ML techniques to specific problem statements for wireless communications.4.Understanding product and application layer architectures in conjunction with deep hands-on operational knowledge of wireless platforms and devices.Confirmed deep technical expertise in at least one of the following areas:1.5G NR and 3GPP standards.2.IEEE wireless standards.3.Cellular and wireless networks.4.Wireless modem design and prototyping;5.Performance optimization in live networks.Excellent communication and leadership skills. Experience in leading multi-disciplinary engineering investigations with technical expertise is highly desired.Minimum requirement of a BS and 10+ years of relevant industry experience.Minimum requirement of BS and 10+ years of relevant industry experience.\nMaster’s or PhD degree in Electrical Engineering or equivalent degree with 10+ years of work experience is preferred.", "jobDescription": "Imagine what you can do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Inquisitive people and inspiring, innovative technologies are the norms here.\n\nDo you love working on challenges that no one has solved yet? Are you ready to be part of a team redefining wireless technology? Join us to help deliver the next groundbreaking Apple product!"}, "200435805": {"jobID": "200435805", "origin_search": null, "posted": "Oct 17, 2022", "jobTitle": "Video SRE", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435805/video-sre?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in engineering, computer science or other technical disciplines (or equivalent experience) plus 2-5+ years of related experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "2-5+ years of managing large scale web services in a *nix environmentCloud and on-prem administration experienceLoad balancer experienceFluent in a scripting language like Python or shellExperience with configuration management automation (Puppet, Chef, Ansible, Salt)Monitoring/alerting and log mining experiencePerformance monitoring and tuningContainer platform(s) (Docker, Kubernetes)Cloud architecture experienceDR architecture and testingCI/CD experience deploying and supporting/troubleshooting complex dependencies in java applicationsComprehensive understanding of DNSBS in engineering, computer science or other technical disciplines (or equivalent experience) plus 2-5+ years of related experience", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\n\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.\n\nThanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here."}, "200460618": {"jobID": "200460618", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "GPU Top RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460618/gpu-top-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven expertise in GPU/CPU/SOC design and power management.Significant tapeout experience for complex IPs.Expertise in energy-efficient/low-power logic design.Strong understanding of logic optimization, synthesis, timing analysis, floor-planning, power intent descriptions, and clock domain clock crossings.Proficient in Verilog and/or System Verilog and scripting languages.Solid experience with logic simulation and debug.Ability to work well in a team and be productive under aggressive schedules.10+ years of industry experience.Graphics hardware background a plus.We are looking for candidates with a minimum of BS + 10 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAt Apple, we push our designs to the limit to make amazing products. We want to delight our customers with hardware that performs great while delivering long battery life. As part of the mobile GPU design team, you will collaborate with Platform Architecture, Software, Design Verification, and Physical Design teams to deliver RTL and specifications for GPU power management, SOC interface logic, and shared IP. In addition, you will be responsible for integrating applicable IP from other teams to enable complete security, debug, and power management solutions."}, "200449096": {"jobID": "200449096", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Signal Integrity - RF Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449096/signal-integrity-rf-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Excellent problem solving skills in a dynamic and complex environment when boundary is not clearly defined.Strong fundamentals in microwave engineering and 2D/3D EM simulation tools.Deep knowledge on interaction between EM model and other circuit structures.Familiar with RF impairment at block and transceiver levels, including amplifier, filter, PLL, etc.Experience with RF lab equipment, such as VNA, signal generator, spectrum analyzer, real-time scope, probe station, etc.Enthusiasm in learning new technology and willingness to take risks to solve problems.Strong academic training and knowledge on fundamentals of SI and PI issues is a plus.Familiar with RFIC design and simulation flow is preferredExperience in advanced transceiver design and integration is a plusRF system modeling and link budgeting for transceiver chains.Preferred experience on RF module/board development.- BS and 10+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for precision to work towards an extraordinary result? We are looking for a hardworking and hard-working RF Integrity Engineer for Apple's IC Packaging team. \n\nRFI (RF Integrity) team develops novel methodologies to solve coupling, spur, and coexistence issues in highly integrated RF systems through simulation and lab debug. The engineering regime covers Si, package, module, PCB, and form-factor device. The working methods are constantly evolving and blurring boundaries of existing domains. As an RF Integrity Engineer, you will explore multiple aspects of RF technology and expand the boundary of innovation. The team is small and the coverage is huge due to its multidiscipline nature."}, "200449095": {"jobID": "200449095", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Signal Integrity - RF Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449095/signal-integrity-rf-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Excellent problem solving skills in a dynamic and complex environment when boundary is not clearly defined.Strong fundamentals in microwave engineering and 2D/3D EM simulation tools.Deep knowledge on interaction between EM model and other circuit structures.Familiar with RF impairment at block and transceiver levels, including amplifier, filter, PLL, etc.Experience with RF lab equipment, such as VNA, signal generator, spectrum analyzer, real-time scope, probe station, etc.Enthusiasm in learning new technology and willingness to take risks to solve problems.Strong academic training and knowledge on fundamentals of SI and PI issues is a plus.Familiar with RFIC design and simulation flow is preferredExperience in advanced transceiver design and integration is a plusRF system modeling and link budgeting for transceiver chains.Preferred experience on RF module/board development.- BS and 3+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for precision to work towards an extraordinary result? We are looking for a hardworking and hard-working RF Integrity Engineer for Apple's IC Packaging team. \n\nRFI (RF Integrity) team develops novel methodologies to solve coupling, spur, and coexistence issues in highly integrated RF systems through simulation and lab debug. The engineering regime covers Si, package, module, PCB, and form-factor device. The working methods are constantly evolving and blurring boundaries of existing domains. As an RF Integrity Engineer, you will explore multiple aspects of RF technology and expand the boundary of innovation. The team is small and the coverage is huge due to its multidiscipline nature."}, "200451401": {"jobID": "200451401", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451401/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Extensive experience in logic design with the following qualifications:RTL design using Verilog or SystemVerilog, assertion writingDesign of state machines, data paths, arbitration and clock domain crossing logicLogic synthesis, timing constraintsExposure to Design For Test, understanding of scan concept and writing DFT friendly RTLUnified Power Format for simulation, synthesis and electrical rule checking Equivalence checkingPrior experience in DDR PHY design and mixed-signal environment is a plusBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and uncommonly hardworking RTL Design Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  You will join the DDR PHY design team. We provide best-in-class PHY designs for high-performance, low power applications. As a logic design engineer, you will be involved in all phases of the design, from concept study, architecture definition, design and verification, to silicon bring-up and characterization."}, "200448141": {"jobID": "200448141", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "SoC Security Architect, Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448141/soc-security-architect-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 20+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 20+ years of relevant industry experienceSolid background of applied cryptographyWorking experience in definition of secure systemsExperience in threat modeling and weaknesses analysisKnowledge of SoC architecture, microprocessor architecture a plusExposure to OS securityExcellent interpersonal skillsAbility to independently pursue new ideas and innovationsGood knowledge of Verilog/VHDLExperience in C/C++ and interpretive language such as Perl/PythonBS and 20+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. \n\nWe are looking for an experienced Security Architect with experience spanning both hardware and software. You will work with a multi-functional engineering team to define, design, and verify security systems. Join us to help deliver the next groundbreaking Apple product!"}, "200448138": {"jobID": "200448138", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "SoC Security Architect, Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448138/soc-security-architect-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 20+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BS and 20+ years of relevant industry experienceSolid background of applied cryptographyWorking experience in definition of secure systemsExperience in threat modeling and weaknesses analysisKnowledge of SoC architecture, microprocessor architecture a plusExposure to OS securityExcellent interpersonal skillsAbility to independently pursue new ideas and innovationsGood knowledge of Verilog/VHDLExperience in C/C++ and interpretive language such as Perl/PythonBS and 20+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. \n\nWe are looking for an experienced Security Architect with experience spanning both hardware and software. You will work with a multi-functional engineering team to define, design, and verify security systems. Join us to help deliver the next groundbreaking Apple product!"}, "200447660": {"jobID": "200447660", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Baseband Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447660/baseband-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "BSEE and 10+ years of relevant industry experienceExpert in electrical engineering fundamentalsExperience with schematic capture, layout design and reviewExperience with mobile platform system design, system integration and/or high-volume consumer electronics designExperience with voltage regulators, LDO, switch mode power supplies (SMPS)Experience with high-speed and low-speed digital interfaces, e.g. PCIe, SPMI, RFFE etc.Bench-level design verification experience with high-speed oscilloscopes, J-BERT, network analyzer, spectrum analyzer, phase noise analyzerSignal/Power integrity simulation experience with SIwave, HFSS, etc. preferredExperience with clock and timing devices, e.g. crystal resonator, TCXO, crystal oscillator preferredExperience with wireless chipset, e.g. WIFI/BT, GNSS, cellular, NFC preferredStrong problem solving and analytical skillsPosition will require some international travel when approved to do soBSEE and 10+ years of relevant industry experience", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nBe a part of a premier design team responsible for the architecture, design, implementation, and integration of the baseband system for all Apple products. The applicant should be familiar with computer system architecture and digital design. The candidate will work proactively with other cross-functional engineering groups."}, "200452777": {"jobID": "200452777", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452777/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusBackground in embedded software development, bare metal, RTOS and/or LinuxSolid understanding about ARM specification, computer architecture, operating systemExperience in boot code, CPU & SOC initialization, device driversFamiliar with IO protocols: I2C, SPMI, UART, GPIOExperience in lpDDR4/5, DRAM initialization and calibration a big plusGood troubleshooting skills in silicon bring-up and embedded software debuggingExperience with script language such as Python, Perl, or TclBS and a minimum of 3 years relevant industry experience", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers with background in embedded software development to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200452774": {"jobID": "200452774", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452774/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusBackground in embedded software development, bare metal, RTOS and/or LinuxSolid understanding about ARM specification, computer architecture, operating systemExperience in boot code, CPU & SOC initialization, device driversFamiliar with IO protocols: I2C, SPMI, UART, GPIOExperience in lpDDR4/5, DRAM initialization and calibration a big plusGood troubleshooting skills in silicon bring-up and embedded software debuggingExperience with script language such as Python, Perl, or TclBS and a minimum of 3 years relevant industry experience", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers with background in embedded software development to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200458513": {"jobID": "200458513", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Cellular PHY Systems Engineer – System Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458513/cellular-phy-systems-engineer-system-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "-  Hands-on experience in lab testing, characterization, and field certifications.-  Experience in chip bring-up and lab equipment such as protocol tester, spectrum analyzers, signal generators, power meters, etc.-  Experience with multiple 4G/5G protocol test equipment (e.g., Keysight/Anritsu/R&S etc.) along with their test automation interfaces.-  Deep-knowledge of communication system theory and signal processing to be able to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.-  Understanding of multi-antenna techniques and MIMO, mmWave Beamforming and Beam Acquisition, mmWave mesh networks.-  In-depth knowledge of cellular communication standards: 5GNR, 4G LTE, and the corresponding L1/MAC/RRC procedures such as PLMN/Cell search, hand over, reselection, measurements, random access procedures, registration, etc.-  Full-stack system-level understanding and ability to comprehend and affect an improvement to multi-disciplinary processes of RF/PHY/L1/L2.-  Experience with Matlab, C/C++, and/or Python for algorithm modeling (floating-point and fixed-point), link-level simulation, and lab testing environments.-  Demonstrate clarity of thought and strong analytical and problem-solving skills (probability, digital signal processing, linear algebra, random processes, detection and estimation).-  Good understanding and debug capabilities of a mixed HW/FW multi-processor PHY/L1 implementation.-  Ability to work well both independently and within a team.BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here! At Apple, innovative ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The Wireless Communication group at Apple is a rapidly growing, high energy and result oriented team. \n\nThe team focuses on the system design integration of a Wireless IC solution. We are interested in a forward-thinking, motivated and hardworking System Engineer to be a part of Apple’s new product introduction process from prototype to mass production. If you are intrigued about Wireless technologies and want to make an impact and have a desire to work on groundbreaking wireless technologies, then this is for you!"}, "200460751": {"jobID": "200460751", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer - High Speed IO Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460751/silicon-validation-software-engineer-high-speed-io-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelor's degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Familiar with SoC and System architecture.Knowledge working with board schematics.Knowledge in embedded systems is a plus.Knowledge with test equipment and analyzers (USB, PCIe, DP, I2C) is a plusKnowledge in High Speed interfaces such USB-PD, USB2.0, USB3.0, Thunderbolt 3, USB4.0, PCIE or DP is a plus.Minimum requirement of a bachelor's degree.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nJoin us to help deliver the next groundbreaking Apple product. We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles."}, "200458526": {"jobID": "200458526", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Silicon Validation Software Engineer - High Speed IO Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458526/silicon-validation-software-engineer-high-speed-io-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Familiar with SoC and System architecture.Knowledge and experience working with board schematics.Experience with Embedded system is a plusExperience with using test equipment and analyzers (USB, PCIe, DP, I2C) is a plusKnowledge and experience with High Speed interfaces such USB-PD, USB2.0, USB3.0, Thunderbolt 3, USB4.0, PCIE or DP is a plus.BS and a minimum of 3 years relevant industry experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nJoin us to help deliver the next groundbreaking Apple product. We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles."}, "200398861": {"jobID": "200398861", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Touch ID Product Design - Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200398861/touch-id-product-design-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSME required; MSME, PhD preferred (or equivalent)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "At least 2+ years of hands-on experience designing for a production environment. High volume, consumer electronics or sensing experience is a plus.3D CAD experience is required.Excellent written and verbal communication skills.Able to craft clear engineering documentation.Able to effectively collaborate with diverse team members and external vendors to achieve project goals.BSME required; MSME, PhD preferred (or equivalent).", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?   The Sensing Product Design team is looking for a talented mechanical engineer to develop great experiences and bring Apple products to life. We are the team developing many of the sensors that changed the way people interact with their technology. Touch redefined the phone and tablet, Touch ID seamlessly secured them, and the heart rate monitor let you keep tabs on yourself."}, "200456303": {"jobID": "200456303", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Touch Product Design - Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456303/touch-product-design-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSME required; MSME, PhD preferred (or equivalent)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "At least 2+ years of hands-on experience designing for a production environment. High volume, consumer electronics or sensing experience is a plus.3D CAD experience is required.Excellent written and verbal communication skills.Able to craft clear engineering documentation.Able to effectively collaborate with diverse team members and external vendors to achieve project goals.BSME required; MSME, PhD preferred (or equivalent).", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Sensing Product Design team is looking for a talented mechanical engineer to develop great experiences and bring Apple products to life. We are the team developing many of the sensors that changed the way people interact with their technology. Touch redefined the phone and tablet, Touch seamlessly secured them, and the heart rate monitor let you keep tabs on yourself."}, "200462787": {"jobID": "200462787", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Sr. Industrial Hygienist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462787/sr-industrial-hygienist?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS or MPH in Industrial Hygiene. CIH Certification."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years Industrial Hygiene experienceMS or MPH in Industrial HygieneCIH CertificationSubject matter expertise in exposure assessment, noise, industrial ventilation, ionizing and non-ionizing radiation, respiratory protection, and personal protective equipmentExperience with the design and evaluation of exposure controls for areas of IH expertiseExperience with IH & safety program development and implementationExperience with EHS auditing and compliance assuranceExperience in semiconductor R&D, laboratory R&D, chemical manufacturing, microelectronic manufacturing, or other chemically or high complexity industryDemonstrated experience with project management and process improvement methodologies (Lean Six Sigma, Agile, Other)Experience with enterprise wide health and safety data systemsStrong communication skills (Oral, written, & presentation) with the ability to interact with all levels of the company.A passion for teaching, training, and growing the IH skills of othersStrong sense of curiosityMS or MPH in Industrial Hygiene. CIH Certification.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Environment Health & Safety (EHS) and Occupational Health teams at Apple are growing, and we need upbeat, dedicated and flexible professionals to join a dynamic team committed to protecting the environment, health, and safety of our employees, customers, and the global communities where we operate, while supporting our team members in their mission to develop amazing products.\n\nApple is looking for a senior Industrial Hygiene professional to join the Industrial Hygiene team. This position will support global R&D, manufacturing, TV+, Data Centers, Retail Operations, and special project teams by providing subject matter expertise and consultation. This position will serve as a subject matter authority for all IH fields including exposure assessment, noise control, industrial ventilation, respiratory protection, personal protective equipment, ionizing/non-ionizing radiation, and IH technology solutions. You will be responsible for assisting and enabling operations teams around the world by performing complex exposure assessments, developing and implementing IH sampling plans, designing and evaluating engineering controls, and coaching facility leads. This position will aid in the implementation and assessment of global programs across all lines of business and all geographies. The senior Industrial Hygienist will be responsible for developing and delivering training materials for Apple Employees, EHS generalists, and IH specialists. \n\nThis position may require between 15-45% domestic and international travel with a target of 25%."}, "200456196": {"jobID": "200456196", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Systems Software Engineer, Special Projects Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456196/systems-software-engineer-special-projects-group?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or higher in Computer Science or related field; or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong programming skills with C or C++Some exposure to multithreaded programmingProgramming for embedded systemsExcellent communication and collaborative skillsBS or higher in Computer Science or related field; or equivalent experience", "jobDescription": "The Special Projects Group at Apple is looking for a software engineer to join our team to work on Embedded Systems Frameworks supporting a sensors, algorithms, and controls pipeline. The team is responsible for design, implementation, verification, and debugging of features written in C and C++ code. We work cross-functionally with teams across the project to provide an efficient framework on a real-time OS, and cross-platform tools to support its use."}, "200452529": {"jobID": "200452529", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "GNSS RF System Debug Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452529/gnss-rf-system-debug-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant industry experience is required \n\nBS degree in EE or related fields/ M.Sc. degree is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience in RF System level test development, debug, and reportingStrong RF background and familiarity with RF systems fundamentalsWorking knowledge of RF test equipment (network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.)Experience in RF system simulation environment (Matlab, SystemVue or Verilog-A)Knowledge in test and script development (Python, PERL, TCL)Solid understanding of RF, PLL, and general wireless systems measurements (i.e. IP3, NF, ACPR, phase noise, lock time, etc.)Strong verbal and written communication skillsPrevious GPS/GNSS experience is a plusBS + 3 years of relevant industry experience is requiredBS + 3 years of relevant industry experience is required \n\nBS degree in EE or related fields/ M.Sc. degree is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Global Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away.\n\nOur GNSS team is part of Apple's Cellular organization. We are a vertically integrated engineering team spanning RF, mixed signal analog design, systems engineering, design verification, RTL design, firmware and software engineering, test, and validation. Our focus is on highly energy-efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. \n\nAs a GNSS RF System Debug Engineer, you will be a crucial member of Apple’s cellular team, driving cellular development for our next-generation wireless products used by millions. Come to Apple and do your life's best work!"}, "200458045": {"jobID": "200458045", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "STA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458045/sta-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree + 3 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Detailed knowledge of the ASIC design timing closure flow and methodology.Experience in ASIC timing constraints generation and timing closure. Expertise in STA tools (Primetime) and flow.Knowledge of timing corners/modes, process variations and signal integrity related issues.Hands on experience in timing/SDC constraints generation and management.Proficient in scripting languages (TCL and Perl).Familiarity with synthesis, logic equivalence, DFT and backend related methodology and tools.Understand and improve existing methodologies and flowsFamiliarity in Constraint analysis and debug, using industry standard tools such as Synopsys GCA (Galaxy Constraint Analyzer)Experience in timing closure of various test modes such as scan shift, scan capture, atspeed and Bist testing is a plusSelf-starter and highly motivatedBachelors Degree + 3 Years of Experience", "jobDescription": "Imagine what you could do here at Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next extraordinary Apple product.\n\n Do you enjoy working on challenges that no one has solved yet? As a member of our dynamic group, you will get the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Are you ready to join a team transforming hardware technology? We are searching for a hardworking engineer to join our exciting team of problem solvers.\n\nJoin our team and be responsible for groundbreaking IP development and coordinating with multiple SOC teams. In this role, you will work collaboratively with various SOC teams to execute design and integration tasks for the high quality IP deliverables."}, "200447694": {"jobID": "200447694", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "GNSS Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447694/gnss-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and 3+ years of relevant industry experience \nMS with a focus on digital communication, signal processing and/or geomatics; or Ph.D is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong foundation in physical layer functionality for wireless systems in areas such as detection/acquisition, synchronization, parameter estimation & tracking, multipath detection, and mitigation, etc.Familiarity with Inertial Measurement Unit (IMU) sensors data processing and fusion with GNSS and other wireless signals.Proficiency with modeling in MATLAB is required.Knowledge and experiences in IC implementation and optimization, and familiarity with HDL / RTL are desirable.Knowledge and comfortability in channel coding algorithms, such as LDPC decoder, are desirable.Experience with lab bring-up of SoC designs reaching volume production is desirable.Experience in GNSS baseband signal processing is desirable.BS and 3+ years of relevant industry experience \nMS with a focus on digital communication, signal processing and/or geomatics; or Ph.D is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which are driven by an elite vertically coordinated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. As a Senior Wireless Systems Engineer, you will be a key member of our highly innovative Wireless SoC design team, defining modem architectures, driving physical-layer algorithm designs, and developing digital signal processing schemes for novel ultra-low-power wireless applications."}, "200447858": {"jobID": "200447858", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "GNSS Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447858/gnss-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS and 10+ years of relevant industry experience\nMS with a focus on digital communication, signal processing and/or geomatics or Ph.D is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Great foundation in physical layer functionality for wireless systems in areas such as detection/acquisition, synchronization, parameter estimation & tracking, multipath detection, and mitigation, etc.Familiarity with Inertial Measurement Unit (IMU) sensors data processing and fusion with GNSS and other wireless signals.Proficiency with modeling in MATLAB is required.Experience with leading technical initiatives and key work.Knowledge and experiences in IC implementation and optimization, and familiarity with HDL / RTL are desirable.Experience with lab bring-up of SoC designs reaching volume production is desirable.Experience in GNSS baseband signal processing is desirable.BS and 10+ years of relevant industry experience.BS and 10+ years of relevant industry experience\nMS with a focus on digital communication, signal processing and/or geomatics or Ph.D is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which are driven by an elite vertically coordinated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. As a Senior Wireless Systems Engineer, you will be a key member of our highly innovative Wireless SoC design team, defining modem architectures, driving physical-layer algorithm designs, and developing digital signal processing schemes for novel ultra-low-power wireless applications."}, "200451408": {"jobID": "200451408", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451408/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Extensive knowledge of mixed signal conceptsRelevant and proven experience of RTL design, Verilog and SystemVerilogDeep knowledge of front-end tools (Verilog simulators, linters, clock-domain crossing checkers)Validated experience with synthesis, static timing, DFT, is a plusProven knowledge of SystemVerilog assertions, checkers, and other design verification techniques are a plusKnowledge of scripting languages. Perl and Python are plussesStrong communication, collaboration  and presentation skillsBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and extraordinarily hardworking RTL Design Engineer. As a member of our multifaceted group, you will have the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. \n\nSpecify, design, and help in the verification and lab bring-up of sophisticated mixed-signal circuits (digital side)"}, "200400021": {"jobID": "200400021", "origin_search": null, "posted": "Sep 20, 2022", "jobTitle": "Software Quality Engineering Manager, Apple Pay", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200400021/software-quality-engineering-manager-apple-pay?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS, or Ph.D. in Computer Science or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven experience developing and testing customer-facing restful web services, using structured query language, and relational and non-relational databasesStrong background in designing and architecting automation solutionsExpertise with continuous deployment systems; define branching, tagging, and code merging strategiesGood understanding of security fundamentals; authentication, authorization and cryptographyAbility to communicate within the team and cross-functionallyBS, MS, or Ph.D. in Computer Science or equivalent industry experience", "jobDescription": "Apple Pay is growing! Envision what you could do here.  At Apple, new ideas have a way of becoming excellent products, services, and customer experiences very quickly.  Bring passion and dedication to your job and there's no telling what you could accomplish. The Apple Pay organization strives to build payment solutions that are easy to use, secure, and a private way to pay on the iPhone, iPad, Apple Watch, and Mac.  \n\nYou’ll be joining a team of extraordinary engineers and interacting every single day with teams that span across Apple including iOS software and hardware engineering, iCloud engineering, iTunes engineering, and our network and banking partners. We are looking for a dedicated leader in software quality engineering who strongly believes in “good enough is never enough” to take our capabilities in automation, tools, process, and effectiveness to the next level.  \n\nThis position will provide management leadership, technical leadership, and strategic direction to the quality engineering team. In this role, you will have an opportunity to improve quality and accelerate the delivery of Apple Pay software and be involved in all phases and layers of the application having a direct impact on the experience of millions of customers."}, "200464194": {"jobID": "200464194", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "CAD Engineer - Custom Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464194/cad-engineer-custom-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Requires custom circuit design analysis experience to verify circuit performanceDeep knowledge of custom CAD flowsExperience in developing CMOS analog, digital, and mixed signal designs with emphasis on simulation, extraction, and layoutExperience with chip integration and analog IP verification at the block and chip levelProficiency in programming/scripting languages (Python and Perl)Strong verbal and written communications skillsMinimum requirements of BS +10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on state-of-the-art designs. You will need custom circuit design analysis experience to develop and define the signoff methodologies for transistor level and gate level designs. The areas will include but are not limited to signoff of power and signal analysis, power intent verification, formal verification, mixed-signal simulation, and signoff of IP for reuse.\n\nYou will also contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibility also includes directly interfacing with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200462828": {"jobID": "200462828", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Sr. Product Manager: App Shopping Experience, Apple Store Online", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462828/sr-product-manager-app-shopping-experience-apple-store-online?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Completion of an undergraduate or graduate degree, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "7-10+ years Product Management leading consumer-facing products and experiences; strong preference for iOS app product experienceConsistent track record of successfully launching new concepts or programs in a fast-paced, collaborative, omni-channel retail environmentExperience building and delivering iOS shopping app roadmapsExperience leveraging data and insights to improve digital retail shopping experiencesStrong technical competence and ability to dive into the technical details; fluency with iOS and other Apple operating systemsAbility to draw inspiration from industry technology, pushes the envelope on relevant innovationStrong analysis, decision making, problem solving, and prioritization skillsStrong partnership and excellent communication skills, including executive-level communicationsSkilled at influencing and inspiring a cross-functional matrixed team to successfully deliver against multi-track roadmapsPossesses strong time management and organizational skills; ability to balance multiple projects of varying lengths, while meeting quality standards and timelines; have experience leading all aspects of managing complex production schedulesAbility to thrive in a constantly evolving environment where ambiguity and short turnaround schedules are the normUnwavering ethicsMotivated, curiousCompletion of an undergraduate or graduate degree, or equivalent experience", "jobDescription": "As Steve Jobs said in 1997 when introducing the Apple Store Online: “We make awesome products. We should have an awesome purchasing experience.” Twenty-five years on, the Apple Store Online is one of the world’s biggest and most successful e-commerce sites. Our global mission is to bring a seamless, high-quality, digital retail experience to all of our customers. If you love crafting groundbreaking experiences, collaborating with coworkers, and making lasting connections, come join us to build the future of Apple’s vision for e-commerce and ensure that Retail is \"where the best of Apple comes together\".\n\nApple is looking for a dynamic Sr. Product Manager with a passion for innovation and fluency in native apps to join the Apple Store Online team. As a member of the Shopping Experience Product Management team, you’ll be part of the group responsible for defining, developing, and launching app shopping experiences across channels and platforms — directly and measurably impacting Apple and its customers. In this role, you will partner closely with Retail, Marketing, Engineering, Operations, and other cross-functional teams to deliver amazing customer experiences and ground breaking capabilities to power them."}, "200458511": {"jobID": "200458511", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Cellular PHY Systems Engineer – System Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458511/cellular-phy-systems-engineer-system-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "-  Hands-on experience in lab testing, characterization, and field certifications.-  Experience in chip bring-up and lab equipment such as protocol tester, spectrum analyzers, signal generators, power meters, etc.-  Experience with multiple 4G/5G protocol test equipment (e.g., Keysight/Anritsu/R&S etc.) along with their test automation interfaces.-  Deep-knowledge of communication system theory and signal processing to be able to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.-  Understanding of multi-antenna techniques and MIMO, mmWave Beamforming and Beam Acquisition, mmWave mesh networks.-  In-depth knowledge of cellular communication standards: 5GNR, 4G LTE, and the corresponding L1/MAC/RRC procedures such as PLMN/Cell search, hand over, reselection, measurements, random access procedures, registration, etc.-  Full-stack system-level understanding and ability to comprehend and affect an improvement to multi-disciplinary processes of RF/PHY/L1/L2.-  Experience with Matlab, C/C++, and/or Python for algorithm modeling (floating-point and fixed-point), link-level simulation, and lab testing environments.-  Demonstrate clarity of thought and strong analytical and problem-solving skills (probability, digital signal processing, linear algebra, random processes, detection and estimation).-  Good understanding and debug capabilities of a mixed HW/FW multi-processor PHY/L1 implementation.-  Ability to work well both independently and within a team.BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here! At Apple, innovative ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The Wireless Communication group at Apple is a rapidly growing, high energy and result oriented team. \n\nThe team focuses on the system design integration of a Wireless IC solution. We are interested in a forward-thinking, motivated and hardworking System Engineer to be a part of Apple’s new product introduction process from prototype to mass production. If you are intrigued about Wireless technologies and want to make an impact and have a desire to work on groundbreaking wireless technologies, then this is for you!"}, "200450017": {"jobID": "200450017", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Baseband Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450017/baseband-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "BSEE and 3+ years of relevant industry experienceStrong electrical engineering fundamentalsExperience with schematic capture, layout design and reviewExperience with mobile platform system design, system integration and/or high-volume consumer electronics designExperience with voltage regulators, LDO, switch mode power supplies (SMPS) preferredExperience with high-speed and low-speed digital interfaces, e.g. PCIe, SPMI, I2C, UART etc preferredBench-level design verification experience with high-speed oscilloscopes preferredSignal/Power integrity simulation experience with Matlab, PowerSI, SIwave, HFSS, etc. preferredStrong problem solving and analytical skillsPosition will require some international travel when approved to do soBS and 3+ years of relevant industry experience", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nBe a part of a premier design team responsible for the architecture, design, implementation, and integration of the baseband system for all Apple products. The applicant should be familiar with computer system architecture and digital design. The candidate will work proactively with other crossi-functional engineering groups."}, "200448951": {"jobID": "200448951", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sr. Industrial Hygienist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448951/sr-industrial-hygienist?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Portland", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS or MPH in Industrial Hygiene. CIH Certification."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years Industrial Hygiene experienceMS or MPH in Industrial HygieneCIH CertificationSubject matter expertise in exposure assessment, noise, industrial ventilation, ionizing and non-ionizing radiation, respiratory protection, and personal protective equipmentExperience with the design and evaluation of exposure controls for areas of IH expertiseExperience with IH & safety program development and implementationExperience with EHS auditing and compliance assuranceExperience in semiconductor R&D, laboratory R&D, chemical manufacturing, microelectronic manufacturing, or other chemically or high complexity industryDemonstrated experience with project management and process improvement methodologies (Lean Six Sigma, Agile, Other)Experience with enterprise wide health and safety data systemsStrong communication skills (Oral, written, & presentation) with the ability to interact with all levels of the company.A passion for teaching, training, and growing the IH skills of othersStrong sense of curiosityMS or MPH in Industrial Hygiene. CIH Certification.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Environment Health & Safety (EHS) and Occupational Health teams at Apple are growing, and we need upbeat, dedicated and flexible professionals to join a dynamic team committed to protecting the environment, health, and safety of our employees, customers, and the global communities where we operate, while supporting our team members in their mission to develop amazing products.\n\nApple is looking for a senior Industrial Hygiene professional to join the Industrial Hygiene team. This position will support global R&D, manufacturing, TV+, Data Centers, Retail Operations, and special project teams by providing subject matter expertise and consultation. This position will serve as a subject matter authority for all IH fields including exposure assessment, noise control, industrial ventilation, respiratory protection, personal protective equipment, ionizing/non-ionizing radiation, and IH technology solutions. You will be responsible for assisting and enabling operations teams around the world by performing complex exposure assessments, developing and implementing IH sampling plans, designing and evaluating engineering controls, and coaching facility leads. This position will aid in the implementation and assessment of global programs across all lines of business and all geographies. The senior Industrial Hygienist will be responsible for developing and delivering training materials for Apple Employees, EHS generalists, and IH specialists. \n\nThis position may require between 15-45% domestic and international travel with a target of 25%."}, "200458842": {"jobID": "200458842", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Production Design Lead, Apple TV", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458842/production-design-lead-apple-tv?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Graphic Design or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$218,000,"}, "benefits": null, "requirements": "Possesses knowledge and passion for sportsDemonstrates an organized strategic approach to production designTrack record of creating innovative production solutions with cross functional teamsExperience leading design work effectively and encourage them to implement the most desirable design solutionExperience delivering broadcast graphicsExtensive experience with global localization on static and motion graphicsExperience adapting artwork across various template sizesPossesses acute attention to detail and ability to adhere to design guidelines and specificationsProactive problem-solving and the ability to work independently to troubleshoot technical and process related issuesAbility to be flexible, adapt quickly to change, and to focus and prioritize in a dynamic environment5+ years of related experience within a streaming platform, digital agency, and / or in-house creative groupCommand of visual design and typography principlesClear and concise communication and organizational skillsBachelors Degree in Graphic Design or equivalent experiencePortfolio demonstrating relevant production design case studies5+ years of experience in production design and 2+ years in production design managementProficiency in Photoshop, Illustrator, After Effects or Premier, Sketch, and Keynote.Proficiency in project management software such as Asana or WrikeAll resumes must be accompanied by portfolio and/or website link", "jobDescription": "The Media Products Design team conceptualizes, crafts, and builds content experiences for some of Apple’s most visible products, including Apple Music, TV, Maps, News, and more! Your ideas and vision impact the way people consume media products, what they look and feel like, and how they’re used by millions of people across the globe.\n\nThe Content Production Design team is searching for an exceptional Production Design Lead to lead Sports Production on the TV App. Our ideal candidate for the role is a strategic design planner with an unwavering commitment to excellent design execution. You will partner with a global network of designers, editors, technologists, and producers to create a world-class Sports viewing experience."}, "200456900": {"jobID": "200456900", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Systems Software Engineer, Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456900/systems-software-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 10+ years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS with 10+ years of experienceBackground in both software and system architectureKnowledge of cloud technologies/networking/storage is an advantageKnowledge in distributed system is an advantageStrong programming skills in either C/C++ Java or GO requiredStrong software debugging skillsIndependent, versatile and fast learner.BS with 10+ years of experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products very quickly. Bring passion and dedication to your job and there's no telling what we can accomplish together. \n\nDo you love crafting elegant solutions to highly complex challenges? Can you intrinsically see the importance of every detail? At Apple, our Platform Architecture group is responsible for connecting our hardware and software into one unified system. Join this team, and you'll collaborate with engineers across Apple to build and deploy forward-looking prototype systems that contribute to the development of our world renowned hardware and software architecture.\n\nThe Platform Architecture cloud team develops advanced modern cloud services. These services include networking, storage and compute for the cloud customers. A Platform Architecture cloud team member is responsible for architecting and implementing the various cloud services. Some of the services are pure distributed systems and some are more “low” level dealing with various hardware resources (storage, network etc.). The individual needs to be adept in software development and system architecture. Knowledge in networking, storage, virtualization and security are not mandatory but can help in shortening the learning curve."}, "200229115": {"jobID": "200229115", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "iPhone Display Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200229115/iphone-display-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in Electrical Engineering or Physics."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "An in-depth understanding of display measurement & performance evaluation, display technologies, display module construction, process development and display systems.Excellent project management, communication and collaboration skills required.Willingness and ability to travel.PhD or MS in Electrical Engineering or Physics.", "jobDescription": "Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.\n\nApple Inc. is looking for a Display Engineer for the development and qualification of Displays for iPhone products. This individual will be working on flat panel displays both at the component and system level, serving as a focal point between the system design team, the display EE team, display mechanical team, the supply base management team, and the display suppliers, managing all activities vital to deliver displays into final products from initial concept to production."}, "200448248": {"jobID": "200448248", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Reliability Engineer Lead – Custom Silicon Management", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448248/reliability-engineer-lead-custom-silicon-management?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS+10 Years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS+10 Years of relevant industry experienceSemiconductor engineering experience in the Reliability and/or Quality/Product Engineering role from multinational companies,Outstanding communication skills required.Experience in JEDEC reliability and quality related standards, ISO, and the science behind them.The ideal background will have experience of silicon product level reliability qualification and lifetime behavior model.You will know reliability fail modes of silicon/packaging technologies and fail mechanisms with respect to reliability.Prior experience defining hardware setups and equipment for life, environmental, ESD, Latch-Up and other tests.Validated auditing of supplier sites, materials and processes.Confirmed experience driving suppliers in the areas of silicon Fab process / packaging / assembly, test, ongoing reliability monitoring, post-production qualification.Familiar with process flows, specifications, and supervising supplier performance (process Cpk, yield, qualification report, etc.)Possess knowledge on practice of FAI to validate the work suppliers are doing prior to production stage.Travel is required for this role.BS+10 Years of relevant industry experience", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will craft and build the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \nAt Apple, we go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product. \nJoin Apple as a Silicon Component Reliability Engineer and work closely with multi-functional groups and third parties to lead introduction and qualification of new products with high quality."}, "200449758": {"jobID": "200449758", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Broadcast Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449758/broadcast-engineer?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "8 years of proven experience in a broadcast engineering role in live broadcast environments, such as television studios, remote trucks, or other live event venues.3 years of experience working with professional video routing over IP (Evertz and Ross experience preferred) and production switchers (Grass Valley, Ross, and Sony experience preferred).You have deep experience with signal routing and monitoring and are familiar with workflows required for transmission to outside broadcast trucks and master control rooms.Expertise operating LEDs, image processors, and other broadcast, live-event, and screening room technology to showcase content (e.g. movies, television shows, and Keynote presentations) in critical viewing environments.Strong color measurement and calibration skills, with ability to provide supporting data reports. Experience with HDR workflows.Hands-on experience with content creation and post production workflows, including knowledge of common recording and playback formats and standards.Able to expertly maintain all production equipment in campus venues. This includes audio and video routers, fiber transport systems, frame sync converters, LEDs, video production switchers, captioning encoders/decoders, robotic cameras, audio mixers, etc. You proficiently use test equipment, such as scopes, analyzers, and digital multimeters.You have CAD skills and are able to update and maintain drawings.Project management experience required for technical upgrades, venue renovations, and maintenance projects. Able to dive into the details and collaborate with integrators to ensure the right equipment and solutions are in place for the needs of the business.Refined communication skills: verbal, written, presentation, and listening—able to frame issues, summarize information, and connect across all levels.Extraordinary influencer who is skilled at connecting the dots at the organization, strategy, program, project, and event levels. You’re able to persuade and change the thinking of others without damaging relationships.Comfort working in a fast-paced, growth environment with minimal direction, delivering under tight deadlines while multitasking, prioritizing projects, and communicating priority updates to team members.Able to operate with limited resources, exhibit dispassionate critical-thinking, and creatively solve problems. Motivated and inventive, always finds a way forward—eternal optimist with a committed drive for contributing and making a difference.You are able to bend, lift, and carry up to 30 pounds and climb ladders, step-stools, and stairs to maintain equipment.Capable of business travel, when needed.Bachelor’s degree", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you can accomplish! \n\nWe’re seeking an experienced Broadcast Engineer for our Production Services team. Production Services is part of the Conference & Production Services team that manages and operates Campus Conference Center spaces (theaters, conference rooms, and outdoor event spaces) and provides services (video production, event management, and conference room coordination) for internal-facing meetings and events that help Apple employees stay connected. We achieve this through in-person, virtual, and hybrid experiences. \n\nAre you a doer who thrives in an environment of complexity, is passionate about delivering impactful customer services, and is amazing at connecting strategy to execution? Are you someone who has high energy, loves collaboration, and is always reaching for something better? If so, come and do your life’s best work at Apple."}, "200448310": {"jobID": "200448310", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics (GPU) RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448310/graphics-gpu-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong understanding of computer architectureLogic design, including simulation and debugUnderstanding of timing analysis, and familiarity with synthesis, placement, and routingUnderstanding of hardware performanceAbility to code using System Verilog HDLExperience with scripting languages such as Python, Ruby, or PerlAbility to work well in a team in order to be productive under aggressive product schedulesMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Do you love working on challenges that no one has solved yet? Join us to help deliver the next groundbreaking product containing an Apple designed GPU. \n\nAs a member of Apple’s GPU Shader Core team, you will develop power efficient, high performance 3D graphics processor microarchitectures targeted for low power mobile devices and high-performance personal computers that are used by millions of people every day."}, "200464318": {"jobID": "200464318", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Power Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464318/power-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in design and analysis of product power supply solutionExperience in PI/SI methodology development, PDN modeling from system to die, and lab correlation/validationUnderstanding of power supply architecture covering voltage regulator technologies, PCB and package design trends and trade-offs, and chip supply design including low-power design methodologiesSolid understanding on PCB technologies including socket integration and its electrical performance in system environmentGood knowledge in 3D/2D EM simulation tools, electromagnetic and transmission line theoryFamiliar with lab equipment including but not limited to VNA, real-time scope, spectrum analyzerAbility to work and communicate efficiently in a multi-functional team-  BS and +10 years of relevant industry experience", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for precision to work towards an outstanding result? We are looking for a dedicated and passionate Power Integrity Engineer to join our team! In this role, you will be responsible for the development, implementation, and verification of Power Integrity solutions for SoCs used in Apple devices. You will work with multi-functional teams to develop of droop targets, design and implement a power supply network solution, and verify the quality of the power supply using lab measurements."}, "200450604": {"jobID": "200450604", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "CAD Custom EM/IR Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450604/cad-custom-em-ir-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are counting on your expertise in developing EM and IR related flows and automation for better accuracy and efficient runsYou are experienced in usage of EMIR analysis tools and knowledgeable on their working principles and methods, including hierarchical AOT (Analog-on-Top) analysis.You are familiar with custom design environment and flows, such as schematic/layout design, simulation, extraction, physical verification and timing analysis.You have experience in supporting design teams with ramping the work environment, correct settings and reliable runsYou can work directly with the tool vendors, and drive them to resolve tools bugs as well as implement required improvementsYour communication skills are excellent, and like the rest of us at Apple you love working in an open and multi-cultural environmentMinimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products very quickly. Do you want to bring passion and dedication to your job? There's no telling what you could accomplish at Apple.\n\nThe people who work here have reinvented entire industries with Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices - we continue to strengthen our commitment to leave the world better than we found it!\n\nAs a key member of our best-in-class CAD Group, you will be part of building innovative designs. We will apply your hands-on experience in power EM/IR analysis to define, develop and refine the methodologies and flows which enable transistor-level as well as gate level analysis. Major tasks will include functional static / dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, SigEM, power switch modeling, design abstraction and reuse for EM/IR purposes, IP / SoC level EMIR sign-off / ECO, and much more.\n\nAre you ready to join some of the world's leading engineers, and help us deliver the next generation of ground-breaking Apple products?"}, "200451397": {"jobID": "200451397", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Mixed Signal Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451397/mixed-signal-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Knowledge about industry standards and practices in SPICE Experience in developing and implementing Circuit specificationsProven understanding of all aspects of Circuit Design of PHY. IO's, DLLs, RX, TX etc.Deep knowledge of Basic SoC Architecture and HDL languages like Verilog to be able to collaborate with logic design teamSolid understanding of Extraction and STA methodology and tools Good understanding of Circuit Verification tools like EMIR, Noise, SigEM, clocks etc.Generate block/chip level spec for circuits. Work with the layout team to come up with efficient layout design for the circuits including floor plan, pin placement and power grid etc.Develop and validate high performance Circuit requirements using SPICE. Perform block level verification to close the design to meet timing, area and power constraints.Implement ECOs to fix timing, noise and EM IR violations when needed.Participate in establishing CAD and physical design methodologies for correct by construction designs.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and extraordinarily hardworking PHY circuit designer. As a member of our multifaceted group, you will have the unique and great opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nIn this role, we are the center of a PHY design effort collaborating with architecture, CAD, timing and logic design teams, with a critical impact on delivering best in class PHY designs. You will be required to do physical designs of industry leading PHY design. The ideal candidate will have significant experience in  Circuit Design experience on high performance PHY Circuit designs."}, "200441173": {"jobID": "200441173", "origin_search": null, "posted": "Nov 2, 2022", "jobTitle": "Thin Film Modeling Technologist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441173/thin-film-modeling-technologist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "-  Ph.D. or Masters in Physics, Electrical engineering, Mechanical engineering, or Materials science"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Understanding in one of the following : gas/fluid dynamics, heat transfer, and plasma physics, and expertise in modeling and simulation of CVD/ALD processes and equipmentModeling/Finite Element Analysis on one of the following : Thin Film FEA or Molecular Dynamics or Chemical Interface ModelingUnderstanding of fundamental physics behind the targeting modeling methodologyAbility to characterize and calibrate against analytical characterization tools [TEM, EELS, XRD, AFM etc..]Top notch critical thinking and analytical abilityAbility to have a technical debate and communicate-  Ph.D. or Masters in Physics, Electrical engineering, Mechanical engineering, or Materials science", "jobDescription": "Come work for the Apple’s OLED Encapsulation team comprising of amazing engineers who make the best OLED displays in the world. We make the worlds most reliable thin film encapsulation for OLEDs with the world's best electrical, optical and mechanical characteristics while achieving the smallest display bezels with ideal front of screen performance.\n\nIn this position, you will play a meaningful role in pushing the boundaries of OLED Industrial Design by using FEA and/or Molecular Dynamics models. The FEA and/or molecular dynamics models would define thin film process, thin film mechanical & moisture diffusion properties for future thin film technologies and its behavior when integrated with a display module. \n\nWith this core tool as springboard, you will be crafting next generation OLED displays with outstanding product design and the best optical and mechanical characteristics. You will be working on these technologies with Apple’s OLED display vendors across the globe to bring them from prototyping to mass production."}, "200451922": {"jobID": "200451922", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "RF PHY Test Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451922/rf-phy-test-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Solid verification skills in problem solving, constrained random testing, and debugging. Bring up and test wireless SoC, Perform system integration, characterization, and optimization.Work with different teams (Design, HW board teams and Firmware) within apple. Have proficiency with measurement automation tools and scripting languages such as Python and shell scripts.Experience with lab equipment such as network analyzer, spectrum analyzer, oscilloscopes, DMM’s etc.Knowledge of wireless protocols such as Bluetooth, WLAN, UWB or others Experience with MAC or PHY Verification is a plus.BS required.Additional Requirements:Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We invite you to join us, if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position. Individuals will work with Phy, Mac, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200456973": {"jobID": "200456973", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "SoC Low Power DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456973/soc-low-power-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  Exposure to low power verification and low power design principles is desired.-  Experience with IEEE-1801 (UPF) or CPF based digital simulation flows is desired-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Experience with C is desired-  Excellent interpersonal skills and the dream to take on diverse challengesMinimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new insights have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200463542": {"jobID": "200463542", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "GNSS Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463542/gnss-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "BS and 10+ years of relevant industry experience is required. M.Sc. or PhD degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Wireless/DSP block/System-on-Chip verification experience.Advanced knowledge of SystemVerilog and in-depth understanding in UVM methodology.Solid verification skills in problem-solving, constrained random testing, and debugging.Knowledge of SOC subsystem and low power verification experience is desirable.Experience with SystemVerilog Assertion (SVA) is a plus.Knowledge of scripting (like Shell, Python, and Perl…) is desirable.Experience in mixed-signal modeling and simulation is a plus.Strong verbal and written communication skills are needed.BS and 10+ years of relevant industry experience is required.BS and 10+ years of relevant industry experience is required. M.Sc. or PhD degree preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Global Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. Our GNSS team is part of Apple's wireless SOC team. We are a vertically integrated engineering team spanning RF, mixed signal analog design, systems engineering, Design Verification, RTL design, firmware and software engineering, Test, and Validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of our GNSS IP and SoC subsystem. As part of our DV team, you will develop reusable testbench and verification environment deploying the latest methodology, working closely with GNSS and SoC front-end designers and Systems Engineers."}, "200461794": {"jobID": "200461794", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "GNSS Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461794/gnss-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "BS and 3+ years of relevant industry experience is required. M.Sc. or PhD degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Wireless/DSP block/System-on-Chip verification experience.Advanced knowledge of SystemVerilog and in-depth understanding in UVM methodology.Solid verification skills in problem-solving, constrained random testing, and debugging.Knowledge of SOC subsystem and low power verification experience is desirable.Experience with SystemVerilog Assertion (SVA) is a plus.Knowledge of scripting (like Shell, Python, and Perl…) is desirable.Experience in mixed-signal modeling and simulation is a plus.Strong verbal and written communication skills are needed.BS and 3+ years of relevant industry experience is required.BS and 3+ years of relevant industry experience is required. M.Sc. or PhD degree preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Global Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. Our GNSS team is part of Apple's wireless SOC team. We are a vertically integrated engineering team spanning RF, mixed signal analog design, systems engineering, Design Verification, RTL design, firmware and software engineering, Test, and Validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of our GNSS IP and SoC subsystem. As part of our DV team, you will develop reusable testbench and verification environment deploying the latest methodology, working closely with GNSS and SoC front-end designers and Systems Engineers."}, "200408052": {"jobID": "200408052", "origin_search": null, "posted": "Aug 1, 2022", "jobTitle": "Sense Evaluation Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200408052/sense-evaluation-engineer-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "• BA or MS in Computer Science, Engineering or related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent coding skills in Python. Working knowledge of C++.Experience developing in Linux and cloud environments.Ability to debug complex software stacks.Experience with robotic perception systems and 3D geometry.Experience writing evaluation and testing systems.Working knowledge of statistics.Excellent verbal and written communication skills.Works effectively as part of a team.• BA or MS in Computer Science, Engineering or related field.", "jobDescription": "The Sense Metrics team builds dedicated testing frameworks to evaluate the team’s robotic perception system. The perception system operates in challenging real-world environments, and for rapid progress, needs extensive testing. The testing frameworks we build are used by development teams for critical decision making, and to communicate to leadership and external teams.\n\nBy joining the Sense Metrics team, you will play a key role in architecting, implementing and scaling our testing framework capabilities. Your work will be used by partner teams for deep introspection and decision making, and regularly viewed by senior leadership. You will join a team of highly talented software engineers, and work with multiple cross-functional teams. The testing systems you build are a key measure of program capabilities, and your decisions will directly impact how and what we test."}, "200452957": {"jobID": "200452957", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "Regulatory Project Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452957/regulatory-project-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Engineering, Biomedical Science or equivalent science degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$162,800,"}, "benefits": null, "requirements": "5+ years of program/project management experience in a regulated industry, preferably in medical products and/or digital healthSolid track record of driving regulatory submissions, approvals, and launches with multi-disciplinary teamsOutstanding communication and organizational skills. Ability to effectively lead multiple projects simultaneouslyExcellent analytical and problem-solving capabilities, with a keen eye to detect and mitigate risksIndependent self-starter who thrives in ambiguous environmentsHands-on experience in the use of project management and reporting softwareBS/MS in Engineering, Biomedical Science or equivalent science degree.-  Experience with Design Controls and Quality Systems-  Solid understanding of regulatory process for different classes of medical devices in both the US and internationally-  May require occasional travel", "jobDescription": "Our ever-evolving suite of Heath and Wellness products for iPhone and Watch are helping our users live more active, healthier lives. Be ready to make something great when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same dedication to innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it.\n\nDo you want to help deliver the next amazing Apple product? Project Managers (PMs) are responsible for leading a broad, multi-functional team in developing projects across the Engineering, Regulatory, and Clinical organizations. In this critical, highly visible role, you will lead projects requiring regulatory approval to help launch ground breaking technologies for Apple. Our teams feature a collaborative environment with creative people who care deeply about getting great products in the hands of our users. Are you passionate about truly changing health? Come, join us in crafting solutions the world doesn’t know of yet!"}, "200442561": {"jobID": "200442561", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensing Hardware Lab Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442561/sensing-hardware-lab-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "3-5 years of relevant experience is required. The ideal candidate will have a technical Bachelors degree or its equivalent in technical or vocational training. Equivalent experience in lieu of education will be considered (minimum 8-10 years)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$171,000,"}, "benefits": null, "requirements": "The ideal candidate is a capable technical generalist with relevant experience with most of the following:Prior Lab Management experienceProven track record of lab setup, organization, management, and continuous improvementFamiliarity with industrial health and safety risk assessments and safety protocol enforcementSolid understanding of MacOS and Windows configurationHands on experience with mechanical/environmental test equipment (thermal test chambers, small industrial robots/actuators etc.)Hands on experience with basic electrical test tools (power supplies, multimeters, oscilloscopes, DAQs, function generators, etc.)Hands on experience with sensors and metrology equipment (microscopes, thermocouples, accelerometers, pressure sensors, etc.)Hands on experience with basic fabrication tools (hand tools, drill press, band saw, etc); designing, assembling, and documenting basic test fixturesFamiliarity with industrial facilities and with basic equipment troubleshootingExperience with Apple product or other electronics disassembly / repair is a plusScripting skills (Python preferred) are a plusAbility to prioritize and multi-task in a very busy, sometimes chaotic environment; go getter attitude and willingness to go the extra mile to get the job doneEffective written and interpersonal communication skills, proven ability to work cross-functionally, harness the power of teamwork, and relate to technical partners.Ability to travel to Cupertino, CA periodically (est 5% travel)3-5 years of relevant experience is required. The ideal candidate will have a technical Bachelors degree or its equivalent in technical or vocational training. Equivalent experience in lieu of education will be considered (minimum 8-10 years)", "jobDescription": "Apple’s Imaging & Sensing Hardware engineering team is looking for a passionate, self-motivated, electro-mechanical generalist Lab Manager. As part of the Lab Management team you will be directly responsible for supporting the Motion Sensing, Touch Hardware, and TouchID engineering teams along with the care and upkeep of multiple engineering lab spaces. Your responsibilities will include equipment purchase, organization, maintenance, calibration, and support. You will help train engineers on specialized equipment usage and safe working practices within the lab environment. Other areas of responsibility include Mac/PC host management, basic test fixture fabrication, and leading the continued organization, cleanliness, and industrial health and safety compliance of lab spaces. You will also coordinate project work with internal and external facilities and equipment vendors, author laboratory documentation, and clearly and concisely communicate updates to the larger team.\nWe’re looking for a talented professional and leader who enjoys tackling tough challenges, taking initiative, and enabling world-class hardware engineering in a fast-paced and demanding product development climate."}, "200458837": {"jobID": "200458837", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Production Design Technical Lead, Apple TV", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458837/production-design-technical-lead-apple-tv?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Graphic Design or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$218,000,"}, "benefits": null, "requirements": "Hands on production design experience in a high volume fast-paced environmentExpert Graphic Design and solid motion production experienceStrong knowledge of digital design production processes and pipeline/workflow; ideally within a subscription services business modelDirect experience with Video and broadcast design workflowsExperience developing design automation solutionsExperience with production design workflows including retouching, and localizationAbility to specify efficient workflows and identify additional tools requiredWorking knowledge of Adobe Photoshop, After Effects, and SketchComfortable and confident working in a dynamic environment, partnering with teams to move through the unknown.Ability to learn new processes and technology quicklyA hands-on, can-do approach to solving problemsAbility to multi-task in a fast-paced environmentAbility to work well with others. We are a very collaborative teamKnowledgeable about Apple Services ecosystemPhotoshop - ExpertAfter Effects - IntermediateCinema 4D or Other 3D design softwareSketch - IntermediateKeynote - IntermediateSlack - IntermediateNumbers, Pages - IntermediateBachelors Degree in Graphic Design or equivalent experiencePortfolio demonstrating relevant production design case studies7+ years of experience in production designExpert knowledge of Photoshop, IllustratorProficiency in After Effects or Premier, Sketch, and KeynoteAll resumes must be accompanied by portfolio and/or website link.", "jobDescription": "The Content Studio and Production team within the Media Products Content Design creates and maintains the ways Content brands and features reach more customers. We are looking for an experienced Production Design Technical Lead skilled in defining and innovating production design tools. You will work closely with the production team and other cross functional groups to gather requirements to create tools that power massive design scale."}, "200458020": {"jobID": "200458020", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "STA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458020/sta-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree + 10 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Have deep knowledge of the ASIC design timing closure flow and methodology.Deep experience in ASIC timing constraints generation and timing closure. Expertise in STA tools (Primetime) and flow.Good knowledge of timing corners/modes, process variations and signal integrity related issues.Hands on experience in timing/SDC constraints generation and management.Proficient in scripting languages (TCL and Perl).Familiarity with synthesis, logic equivalence, DFT and backend related methodology and tools.Understand and implement improving existing methodologies and flows. Experience in reducing the number of timing signoff corners by merging different timing modes is highly desired.Strong background in Constraint analysis and debug, using industry standard tools such as Synopsys GCA (Galaxy Constraint Analyzer).Detailed understanding and experience in timing closure of various test modes such as scan shift, scan capture, atspeed and Bist testing.Self-starter and highly motivatedBachelors Degree + 10 Years of Experience", "jobDescription": "Imagine what you could do here at Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next phenomenal Apple product. \n\nDo you enjoy working on challenges that no one has solved yet? As a member of our dynamic group, you will get the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Are you ready to join a team redefining hardware technology? We are searching for a hardworking engineer to join our exciting team of problem solvers. Join our team and be responsible for groundbreaking IP development and coordinating with multiple SOC teams. In this role, you will work collaboratively with various SOC teams to complete design and integration tasks for the high quality IP deliverables."}, "200442870": {"jobID": "200442870", "origin_search": null, "posted": "Nov 18, 2022", "jobTitle": "Display Architecture / Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442870/display-architecture-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. (or equivalent experience) in Electrical Engineering, Physics, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years hands-on detailed experience with analog circuits, display backplanes, display IC, or similarStrong direct experience with circuit simulation tools (Cadence, Virtuoso, VerilogA, etc)Strong hands-on experience in electronic lab measurement setup (using Python, LabView, or similar)Knowledge of device physics and integrationStrong communication and presentation skillsAbility to operate in highly cross functional environment and to drive workGood data analysis skillsM.S. or Ph.D. (or equivalent experience) in Electrical Engineering, Physics, or equivalent", "jobDescription": "Apple is looking for a world-class Design Engineer with analog circuit design,  experience to join the Advanced Display Engineering team.\n\nThis position requires a highly motivated and creative individual with a strong technical background in relevant technical fields including analog, ASIC design, circuit simulation, or display backplane. Display and/or semiconductor processing knowledge are a plus. A successful candidate will execute design projects independently from design to port-typing and finally test."}, "200458491": {"jobID": "200458491", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Emulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458491/emulation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience with Verilog, VHDL designExperience with Design Verification and System Verilog, UVM, and C/C++ verification environmentsCandidate should have emulation experience on available platforms, Palladium, Veloce, or Zebu, including compilation, debug, performance and throughput tuning.Experience writing scripts using Perl, Python, Makefile Experience with waveform debug tools, Verdi/SimVisionStrong communication skills and ability to work as a team.Bachelor's degree and a minimum of 10 years relevant industry experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.  \nAre you passionate about changing the world ? We have a critical impact on getting high quality functional products to millions of customers quickly. We are looking for you to join our emulation team focusing on the creation, deployment, and support of advanced emulation environments. In this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines."}, "200462752": {"jobID": "200462752", "origin_search": null, "posted": "Feb 11, 2023", "jobTitle": "Emulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462752/emulation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with Verilog, VHDL designExperience with Design Verification and System Verilog, UVM, and C/C++ verification environmentsEmulation experience on available platforms, Palladium, Veloce, or Zebu, including compilation, debug, performance and throughput tuning.Experience writing scripts using Perl, Python, Makefile Experience with waveform debug tools, Verdi/SimVisionStrong communication skills and ability to work as a team.Bachelor's degree and a minimum of 3 years relevant industry experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, inspiring, and innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.  \n\nWe have a critical impact on getting high quality functional products to millions of customers quickly. We are looking for you to join our emulation team focusing on the creation, deployment, and support advanced emulation environments. In this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines."}, "200451003": {"jobID": "200451003", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Senior Motion Control Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451003/senior-motion-control-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Engineering, Robotics or CS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "8+ years of related experience and skilled in the development, theory, design, modeling and implementation of motion control algorithms with emphasis on servo control and actuation systems.Experienced in control system state management (gain scheduling, bumpless transfers, state machine development).Experienced in state-space design, traditional controls methods (PID, observer/compensator) and modern control techniques such as MPC/LQR.Experience in both linear and non-linear estimation.Hands on experience prototyping control algorithms and demonstrating capability at an executive level.Confident with source control (eg. GIT) on multi developer projects.MS or PhD in Engineering, Robotics or CSNice to Haves:-  Experience with human machine interface (HMI).-  Experience with haptics and input device integration.-  Experience in rapid prototyping for actuated systems", "jobDescription": "One of Apple’s R&D groups is currently seeking a senior motion control systems engineer. This engineer will develop custom control algorithms, optimization routines and drive implementation for a host of dynamic motion systems and applications. This highly cross-functional team is working hands on to prototype and develop unique dynamic systems. We are looking for passionate and creative individuals to push the performance bounds of actuated systems. \n\nDoes working on new technology excite you? Innovation is in your hands! We are ready to help you help us grow."}, "200451520": {"jobID": "200451520", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Gate-level 3DIC EM/IR Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451520/cad-gate-level-3dic-em-ir-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are counting on your expertise in developing EM and IR related flows for better accuracy and efficient runsYou are experienced in usage of EMIR analysis tools and knowledgeable on their working principles and methods.You are familiar with gate level and custom design environment and flows, such as place-and-route, schematic/layout design, simulation, extraction, physical verification and timing analysis.You have experience in supporting design teams with ramping the work environment, correct settings and reliable runsYou can work directly with the tool vendors, and drive them to resolve tools bugs as well as implement required improvementsYour communication skills are excellent, and like the rest of us at Apple you love working in open and multi-cultural environmentMinimum requirements of BS degree + 3 years of industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products very quickly. Do you want to bring passion and dedication to your job? There's no telling what you could accomplish at Apple.\n\nThe people who work here have reinvented entire industries with Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices - we continue to strengthen our commitment to leave the world better than we found it!\n\nAs a key member of our best-in-class CAD Group, you will be part of building innovative designs. We will apply your hands-on experience in power EM/IR analysis to develop, define and refine the methodologies and flows for gate-level, as well as transistor level designs. Major tasks will include functional static / dynamic IR analysis, scan mode IVD analysis, package and interposer model handling, 3DIC and multi die analysis, power EM analysis, SigEM, power switch modeling, design abstract and reuse for EM/IR purposes, IP / SoC level EMIR sign-off / ECO, and much more.\n\nAre you ready to join some of the world's leading engineers, and help us deliver the next generation of ground-breaking Apple products?"}, "200452043": {"jobID": "200452043", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CAD Gate-level 3DIC EM/IR Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452043/cad-gate-level-3dic-em-ir-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "We are counting on your expertise in developing EM and IR related flows for better accuracy and efficient runs.You are experienced in usage of EMIR analysis tools and knowledgeable on their working principles and methods.You are familiar with gate level and custom design environment and flows, such as place-and-route, schematic/layout design, simulation, extraction, physical verification and timing analysis.You have experience in supporting design teams with ramping the work environment, correct settings and reliable runs.You can work directly with the tool vendors, and drive them to resolve tools bugs as well as implement required improvements.Your communication skills are excellent, and like the rest of us at Apple you love working in open and multi-cultural environment.Minimum requirements of BS degree + 3 years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products very quickly. Do you want to bring passion and dedication to your job? There's no telling what you could accomplish at Apple. The people who work here have reinvented entire industries with Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices - we continue to strengthen our commitment to leave the world better than we found it!\n\nAs a key member of our best-in-class CAD Group, you will be part of building innovative designs. We will apply your hands-on experience in power EM/IR analysis to develop, define and refine the methodologies and flows for gate-level, as well as transistor level designs. Major tasks will include functional static / dynamic IR analysis, scan mode IVD analysis, package and interposer model handling, 3DIC and multi die analysis, power EM analysis, SigEM, power switch modeling, design abstract and reuse for EM/IR purposes, IP / SoC level EMIR sign-off / ECO, and much more.\n\nAre you ready to join some of the world's leading engineers, and help us deliver the next generation of ground-breaking Apple products?"}, "200451127": {"jobID": "200451127", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Software Engineer: Board Firmware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451127/software-engineer-board-firmware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proficient in C or C++Experienced with embedded software, bare metal.BS and a minimum of 3 years relevant industry experienceFamiliar with boot code, low-level OS code, device drivers, and IO devicesExperience with computer initialization, SoC bring-up, debuggers, and networkingExperience with FPGA, Verilog, HDLUnix system-level programming, embedded LinuxScripting (Python, Bash, Perl, TCL, Lua)Experience with Xilinx Zynq or Altera SoC platformWorking knowledge of schematics and lab equipment", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.\n\nFirmware and systems engineer for board management controllers and related projects. Platforms: Embedded Linux, bare metal, and Mac/Linux controlled laboratory devices. Secondary responsibilities include but are not limited to: hardware specification and schematic review, embedded Linux infrastructure, regression and release systems, utilization tracking, regression/release systems, and manufacturing support for a cross-functional team.\n\nApple designs many product-destined SoCs and test chips each year; each one has multiple complex bring-up and characterization boards designed for them; our team enables our full suite of firmware for each board to enable both in-person and remote bring-up, analysis, and debug of the silicon in person and at scale."}, "200451430": {"jobID": "200451430", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer - EMIR Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451430/cad-engineer-emir-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Solid understanding of circuit design principles and EMIR analysis at the transistor and gate level for multiple modes such as static and dynamicIn-depth knowledge in industry leading tools, like Redhawk, Voltus, and TotemExperience in developing CMOS analog and mixed signal designs is a plusExperience in simulation and power analysis to verify circuit performanceStrong understanding of CAD flowsProficiency in programming/scripting languages (Perl and Python)Excellent communication skills and ability to collaborateMinimum requirements of BS + 10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on innovative designs. You’ll use your hands on experience in power EMIR analysis to develop/define & refine the signoff methodologies for gate-level, as well as transistor level designs. The areas will include but are not limited to signoff of functional static/dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, Signal EM, power switch modeling, and IP for reuse.\n\nYou will contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibilities also includes directly collaborating with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200451431": {"jobID": "200451431", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer - EMIR Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451431/cad-engineer-emir-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Solid understanding of circuit design principles and EMIR analysis at the transistor and gate level for multiple modes such as static and dynamicIn-depth knowledge in industry leading tools, like Redhawk, Voltus, and TotemExperience in developing CMOS analog and mixed signal designs is a plusExperience in simulation and power analysis to verify circuit performanceStrong understanding of CAD flowsProficiency in programming/scripting languages (Perl and Python)Excellent communication skills and ability to collaborateMinimum requirements of BS + 10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on innovative designs. You’ll use your hands on experience in power EMIR analysis to develop/define & refine the signoff methodologies for gate-level, as well as transistor level designs. The areas will include but are not limited to signoff of functional static/dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, Signal EM, power switch modeling, and IP for reuse.\n\nYou will contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibilities also includes directly collaborating with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200462227": {"jobID": "200462227", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "CAD Engineer - EMIR Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462227/cad-engineer-emir-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 0 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Solid understanding of circuit design principles and EMIR analysis at the transistor and gate level for multiple modes such as static and dynamicPrevious exposure to industry leading tools, like Redhawk, Voltus, and TotemExperience in developing CMOS analog and mixed signal designs is a plusExperience in simulation and power analysis to verify circuit performance is a plusStrong understanding of CAD flowsProficiency in programming/scripting languages (Perl and Python)Excellent communication skills and ability to collaborateMinimum requirements of BS + 0 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on innovative designs. You’ll use your hands on experience in power EMIR analysis to develop/define & refine the signoff methodologies for gate-level, as well as transistor level designs. The areas will include but are not limited to signoff of functional static/dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, Signal EM, power switch modeling, and IP for reuse.\n\nYou will contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibilities also includes directly collaborating with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200418502": {"jobID": "200418502", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Senior Communications and Creative Services Manager, Employee Experience & Productivity", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200418502/senior-communications-and-creative-services-manager-employee-experience-productivity?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree (or equivalent)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$163,000", "max": "$291,000,"}, "benefits": null, "requirements": "10+ years developing and presenting communications plans and strategies within a media, marketing, publishing, or PR environment. With several years of experience leading functional teams of strategists, creatives, and editors.Shown passion for the audience experience, design, written and rich media communications, and knowledge for how to use each to achieve communications goals.Ability to ‘see around corners’ and think about the long term needs, goals and strategies for effective engagement and communications.Ability to fluidly navigate between strategy and execution (can develop high-level strategic plans and also produce crisp, clear communications).Outstanding writing skills and strong ability to craft messages or communication campaigns that motivate behavior change and mobilize our people.Experience working with international extended teams to define global communication strategies and support the needs of our regions.Extraordinary ability to grow internal relationships, work optimally within multi-functional teams and lead through ambiguity as a leader and directly responsible individual.Validated ability to understand business challenges and formulate effective communication strategies that support the audience needs and business goals.Strong learning agility and curious attitude; ask questions, listen, learn and apply insights to changing conditions.Deep experience in executive and business communications, with a preference for operations and tech focusExcellent interpersonal and communication skillsBachelor’s degree (or equivalent).", "jobDescription": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nThe Strategy and Programs team within IS&T leads strategic multi-functional initiatives across IS&T, including how we inform and collaborate with our employees. We are looking for an authoritative leader for the Communications and Creative Services team who will develop and implement communications strategies to inform, engage, align and encourage employees. In this role you are part strategist, part coach, part editor. You are a capable people leader who can recognize, develop and cultivate others’ talents to help them succeed. You are especially savvy navigating a large multi-functional organization with gravitas and clarity. You have a passion for nurturing relationships with business partners and senior leaders, while never losing your footing and rooting in the day to day work. Being a leader of strategy, you are able to adapt and flex to different types fo people and ways of working to successfully get to a shared outcome. This means setting the example for others and bringing them along. This is an exciting time for the organization when we are crafting the future for how we communicate and connect with our IS&T employees and the rest of Apple!"}, "200464047": {"jobID": "200464047", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Apple Professional Learning Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464047/apple-professional-learning-specialist?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Philadelphia", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor's degree required\n- Master's degree or Doctorate preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven experience as both a teacher and leader at the K-12 level;  Instructional design and coaching experience in a Higher Education setting or one-to-one learning environment is a plus.Familiarity with Common Core State Standards and content standards.Clear understanding of the fundamentals of instructional design.Exemplary leadership skills in the successful implementation of digital resources in instructing and classroom learning across multiple curricular areas.Experience improving basic skills and achievement across core content areas.Experience developing creative curriculums, specifically infusing digital resources to promote learning.Experience with professional development activities such as mentoring colleagues, offering workshops locally or nationally, presenting at conferences, etc.Experience delivering training and programs for students and parents on basic technology skills, the ethical and secure use of the Internet, and collaboration tools.Strong understanding of technology with hands-on knowledge of Apple products, software applications, and other education-related third party apps.Excellent knowledge and use of peripherals and apps to improve learning in areas such as math, science, social studies, English language arts and Special Education.Understanding of trends in the use of technology and national trends in education in general.- Bachelor's degree required\n- Master's degree or Doctorate preferredProven experience as a classroom teacher, instructional coach and/or curriculum consultant", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nFor over 40 years, we’ve had the privilege of working alongside educators around the world. From that experience, we know that educators with powerful technology can unlock the unique genius in every learner, so they can make a difference.\n\nAs an Apple Professional Learning Specialist, you will help educational institutions transform their teaching and learning environments with Apple products. You will provide leadership and planning support, build professional learning plans, and offer hands-on instructional coaching and mentoring to support teachers in advancing their technology skills with an emphasis on innovation—to engage students in deeper learning.\n\nThis is a full-time corporate position with Apple for approximately one year. This annual support position is based onsite in the posting location."}, "200461223": {"jobID": "200461223", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "System Performance Architect Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461223/system-performance-architect-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven understanding and experience in computer architecture, the broader the betterPrior experience in system performance modeling,Ability to analyze software/OS behavior, power, thermal, and acoustics aspects of performanceGood coding skills in some subset of (C, C++, System C, Python, shell, etc.)Strong communication and mentoring skillsMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you.", "jobDescription": "At Apple, our products touch millions of lives each day with consistency and dependability. Ever wonder how we achieve this? \n\nThe Mac system performance and architecture team is responsible for all aspects of Mac performance spanning hardware (CPU, GPU, DRAM, storage), software (OS, drivers, Applications), and other system characteristics (thermals, power, acoustics). This spans performance modeling, guiding architecture tradeoffs, performance verification, performance debug, and workload characterization. This team is a group of interdisciplinary performance architects and expert content creation professionals who explore real production workflows and discover opportunities to enhance and improve customer experiences on current hardware and software. \n\nWe are looking for a Systems Performance Architect Lead capable of taking a technical leadership role in all of the above."}, "200400053": {"jobID": "200400053", "origin_search": null, "posted": "Oct 26, 2022", "jobTitle": "Software Quality Engineering Manager, Apple Pay", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200400053/software-quality-engineering-manager-apple-pay?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS, or Ph.D. in Computer Science or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven experience developing and testing customer-facing restful web services, using structured query language, and relational and non-relational databasesStrong background in designing and architecting automation solutionsExpertise with continuous deployment systems; define branching, tagging, and code merging strategiesGood understanding of security fundamentals; authentication, authorization and cryptographyAbility to communicate within the team and cross-functionallyBS, MS, or Ph.D. in Computer Science or equivalent industry experience", "jobDescription": "Apple Pay is growing! Envision what you could do here.  At Apple, new ideas have a way of becoming excellent products, services, and customer experiences very quickly.  Bring passion and dedication to your job and there's no telling what you could accomplish. The Apple Pay organization strives to build payment solutions that are easy to use, secure, and a private way to pay on the iPhone, iPad, Apple Watch, and Mac.  \n\nYou’ll be joining a team of extraordinary engineers and interacting every single day with teams that span across Apple including iOS software and hardware engineering, iCloud engineering, iTunes engineering, and our network and banking partners. We are looking for a dedicated leader in software quality engineering who strongly believes in “good enough is never enough” to take our capabilities in automation, tools, process, and effectiveness to the next level.  \n\nThis position will provide management leadership, technical leadership, and strategic direction to the quality engineering team. In this role, you will have an opportunity to improve quality and accelerate the delivery of Apple Pay software and be involved in all phases and layers of the application having a direct impact on the experience of millions of customers."}, "200447898": {"jobID": "200447898", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Cellular Layer1/Firmware Triage and Target Support Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447898/cellular-layer1-firmware-triage-and-target-support-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS + 3 years of relevant industry experienceExperience with embedded real-time software system bring-up, debug, and testProficiency in debugging embedded multi-mode software systemsFamiliarity with ETM, ETB, JTAG, HW breakpoints, Lauterbach, TRACE32 andany other trace and debug SW/toolsExperience in real-time tracing systemsExperience in scripting languages like Perl and PythonUnderstanding of 5G and 4G 3GPP standards, or similar Wireless standards(2G,3G, WiFi) and proficient knowledge on Physical Layer control is a plusMinimum BS + 3 years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, we'll diagnose sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world.\n\nAs a Cellular Layer 1 Firmware Engineer on this team, you will be at the center of the 5G/4G/multimode cellular firmware effort within a silicon design and firmware development group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to challenge what exists openly, and is flexible enough to shift on constantly evolving requirements."}, "200450178": {"jobID": "200450178", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "AMS Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450178/ams-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience in Analog Mixed Signal design with advanced CMOS technology nodes. The candidate should have a focus and background in AMS modeling and verification, basic digital design, timing closure, and analog to digital interface. We are open to multiple experience levels.Understanding of analog and mixed signal circuit design.Direct tape out experience with one or more of the following blocks: ADCs, DACs, PLLs, SERDES, source synchronous digital interfaces, and custom digital circuits.Familiarity with the integration flows and integration challenges of Analog and Mixed Signal circuits with the Digital portion in an SOC.Experienced in timing analysis (STA) of analog to digital interface.Familiarity with STA tools like NanoTime and PrimeTime.Working knowledge of RTL, System Verilog, PnR, Modeling and Design verification flows is a plus.Experienced with mixed-signal mode verification methodologies including Verilog-AMS and behavioral modeling in Verilog-A and Verilog-D.Having coding experience in Python is a plus.Experience in wireless SoC products is highly desirable.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an Analog Mixed Signal (AMS) Integration Engineer, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200465855": {"jobID": "200465855", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Sr. AMS Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465855/sr-ams-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Experience in Analog Mixed Signal design with advanced CMOS technology nodes. The candidate should have a focus and background in AMS modeling and verification, basic digital design, timing closure, and analog to digital interface. We are open to multiple experience levels.Understanding of analog and mixed signal circuit design.Direct tape out experience with one or more of the following blocks: ADCs, DACs, PLLs, SERDES, source synchronous digital interfaces, and custom digital circuits.Familiarity with the integration flows and integration challenges of Analog and Mixed Signal circuits with the Digital portion in an SOC.Experienced in timing analysis (STA) of analog to digital interface.Familiarity with STA tools like NanoTime and PrimeTime.Working knowledge of RTL, System Verilog, PnR, Modeling and Design verification flows is a plus.Experienced with mixed-signal mode verification methodologies including Verilog-AMS and behavioral modeling in Verilog-A and Verilog-D.Having coding experience in Python is a plus.Experience in wireless SoC products is highly desirable.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an Analog Mixed Signal (AMS) Integration Engineer, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200461936": {"jobID": "200461936", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Health Software Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461936/health-software-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or related field, or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Experience working on mobile automation, app development, or iOS development.Knowledge of scripting languages such as Python, Swift, JavaScript, or Shell.Knowledge of Object-Oriented programming and how to build and use frameworks.Passion for quality and desire to push forward Apple product quality through deeply technical UI and low-level automation.Creative and critical thinker with strong problem-solving skills to investigate and debug difficult issues.Experience with device automation, including developing, triaging, and maintaining tests.Excellent written and verbal communication skills are needed to facilitate close interaction with development teams, management, and other organizations within Apple.Highly organized, creative, motivated, and passionate about achieving results.BS degree in Computer Science or related field, or equivalent work experience.", "jobDescription": "The Health Software QA team is seeking an Automation Engineer to help ensure that our Health-related applications are high quality and user-focused. We're looking for critical thinkers who would like to play a key role in qualifying iOS and watchOS applications and the frameworks that support them. As a member of our fast-paced group in Apple Health, you will have the unique and rewarding opportunity to shape and improve the software that allows our products to delight and inspire millions of Appleʼs customers every day."}, "200451615": {"jobID": "200451615", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Top Level Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451615/cpu-top-level-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.You should have experience in verification methodology.Verification tool and verification development experience.Strong assembly and CPU architecture knowledge.Strong in C, C++, Verilog, and scripting languages.You should be a collaborative teammate with excellent interpersonal skills and be able to work independently.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nAs a CPU Top-Level Verification Engineer, you will be responsible for developing test infrastructure and triaging CPU failures in our validation environment."}, "200451614": {"jobID": "200451614", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Top Level Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451614/cpu-top-level-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.You should have experience in verification methodology.Verification tool and verification development experience.Strong assembly and CPU architecture knowledge.Strong in C, C++, Verilog, and scripting languages.You should be a collaborative teammate with excellent interpersonal skills and be able to work independently.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nAs a CPU Top-Level Verification Engineer, you will be responsible for developing test infrastructure and triaging CPU failures in our validation environment."}, "200439921": {"jobID": "200439921", "origin_search": null, "posted": "Oct 29, 2022", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439921/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Derby Street", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200462263": {"jobID": "200462263", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462263/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Glendale Galleria", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$36.15", "max": "$54.20/hr,"}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200465897": {"jobID": "200465897", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465897/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Mall of Georgia", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200463797": {"jobID": "200463797", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463797/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "City Creek Center", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200462285": {"jobID": "200462285", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "DFT CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462285/dft-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate will have demonstrated DFT experience, and should have been involved in DFT efforts for large processor and/or SOC designs.Knowledge about industrial standards and practices in DFT, including ATPG, JTAG and MBIST.Knowledge of Verilog and/or VHDL, and experience with simulators and waveform debugging tools preferred.Experience in debugging Compressed ATPG patterns, MBIST, and JTAG/1500 related issues.Experience with Perl or Tcl or Python scripting languages.Exposure to industry standard DFT and ATPG Tool required.Familiarity with synthesis tools preferred.Minimum requirements of BS + 10 years of industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day."}, "200380172": {"jobID": "200380172", "origin_search": null, "posted": "May 17, 2022", "jobTitle": "Global Supply Manager (GSM) - Mechanical Enclosures", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380172/global-supply-manager-gsm-mechanical-enclosures?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSME or BSIE, or equivalent. MBA a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$190,000,"}, "benefits": null, "requirements": "5+ years of experience in supply chain development, sourcing management, or strong mechanical engineering background in product developmentTop-notch analytical/negotiation skillsAbility to toggle between strategic and detail orientated thinkingTenacious problem solving & issue resolution skillsExcellent presentation and interpersonal skillsAbility to influence across multiple functional teamsFlexibility to adapt to dynamic and rapidly changing environmentsExcellent communicators, capable of working in multinational environments, driven and motivated by accomplishing extraordinary objectivesHands-on experience in any of the following: mechanical engineering, mechanical development, manufacturing practices/techniques involving CNC Machined parts, sheet metal, enclosures, casings, jigs, tooling, fixtures, injection molding, vacuum forming, plastic parts, ceramics, etc.Ability to travel Internationally 25%BSME or BSIE, or equivalent. MBA a plus.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Imagine what you could do here.  At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries.  It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts.  Join Apple, and help us leave the world better than we found it.\n\nApple GSMs own the commercial relationship with our enclosure manufacturing partners and are responsible for cost negotiations, continuity of supply, risk management, driving operational and cost efficiencies through process or design change, as well overall project execution.  GSMs sit at the intersection of Apple's business activities and engineering communities, and effectively balance the needs of both groups to ensure successful product launches.  Enclosure components (such as the housing) define the look, feel and expression of Apple’s globally recognized industrial and product design.  GSMs work in concert with operations, supply quality, and supply base engineers as well as Apple’s Product Design and Industrial Design teams.  Together, these teams execute and scale both new and existing manufacturing processes, materials, technologies, finishes and form factors."}, "200447286": {"jobID": "200447286", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "OS Power and Performance - Software QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447286/os-power-and-performance-software-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters degree in CS/CE or Equivalent Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Experience with Unix based systemsExperience with SQL or other database structures3+years experience with test automation and frameworks including scripting languages such as Python, Ruby, or Bash, etc.3+ years of proven experience leading cross-functional, technical projects and initiativesExcellent ability to triage and debug problems, QA experience or exposure to good testing methodologies preferredExcellent communication and collaboration skillsBachelors or Masters degree in CS/CE or Equivalent Experience", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. Apple has a world-class reputation for product quality and we need your help to keep those high standards for iOS battery life. We're looking for critical thinkers who would like to play a key role in our engineering process, working in a fast-paced environment across a range of technologies to help us ensure all of our iOS devices have best-of-class battery life.\n\nWe are looking for candidates who desire to qualify groundbreaking hardware and software features that truly scope the future of Apple’s software, hardware and platforms through vital telemetry pipelines in compliance with Apple's mission to protect user privacy."}, "200456744": {"jobID": "200456744", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "CAD Engineer - Custom Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456744/cad-engineer-custom-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Solid understanding of circuit design principlesStrong understanding of CAD flowsExperience in developing CMOS analog and mixed signal designs with emphasis on simulation, extraction, and layout.Experience with chip integrating and analog IP verification at the block and chip level is a plus.Proficiency in programming/scripting languages (Python and Perl)Strong verbal and written communications skillsMinimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on innovative designs. You’ll use your hands-on experience in Custom analysis to develop/define & refine the signoff methodologies for transistor level as well as gate level designs. The areas will include but are not limited to signoff of power and signal analysis, Power-intent verification, Formal verification, mixed-signal simulation, and signoff of IP for reuse.\n\nYou will contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibility also includes directly communicating with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200456754": {"jobID": "200456754", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "CAD Engineer - Custom Signoff", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456754/cad-engineer-custom-signoff?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid understanding of circuit design principlesStrong understanding of CAD flowsExperience in developing CMOS analog and mixed signal designs with emphasis on simulation, extraction, and layout.Experience with chip integrating and analog IP verification at the block and chip level is a plus.Proficiency in programming/scripting languages (Python and Perl)Strong verbal and written communications skillsMinimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nThe Signoff Engineer ensures that all necessary and appropriate verification and analysis work has been performed on a complex mixed-signal design prior to tapeout. In this highly visible role as a core team member in our advanced Signoff CAD Group, you will enhance your career working on innovative designs. You’ll use your hands-on experience in Custom analysis to develop/define & refine the signoff methodologies for transistor level as well as gate level designs. The areas will include but are not limited to signoff of power and signal analysis, Power-intent verification, Formal verification, mixed-signal simulation, and signoff of IP for reuse.\n\nYou will contribute to the definition of signoff requirements early in the project, work with other teams in the organization (Design, CAD and Technology) to verify that the EDA flows and tools are set up and run correctly during the project, and all signoff criteria are met at the end of the project. Responsibility also includes directly communicating with design groups and providing frontline support for enablement / enhancement / debug requests."}, "200451164": {"jobID": "200451164", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Site Reliability Engineer, Payments at Apple", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451164/site-reliability-engineer-payments-at-apple?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience and proficiency in event-based and log-based monitoring systems, deployment tools, Unix and AWS.Experience supporting and scaling large enterprise applications in a critical \"follow-the-sun\" environment.Excellent code-debugging/optimisation, analytical problem solving and analytical thinking skills.Ability to clearly and accurately communicate day-to-day operations to ensure detailed hand-off to regional SRE teams.Proven record of taking ownership of exciting problems and optimally delivering results.Interest in designing, analysing and solving problems large-scale distributed systems.Application development experience in object-oriented and functional programming languages.Drive high levels of engagement through discovery sessions, enablement and solution positioning with executives and technical partners.Excellent communication and collaboration skills.Fast learner who is generous with their knowledge.Self-directed, demonstrates leadership skills, and a phenomenal teammate.Experience with container orchestration systems like Kubernetes, and Continuous Delivery platforms like SpinnakerOperational experience with supporting large scale Banking or Payments systems, is a plus.", "jobDescription": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. We bring passion and dedication to our jobs. We, Wallet & Payments Engineering team, are looking for a Site Reliability Engineer who can be responsible for an emerging team of SREs to design, deliver and support the next generation systems powering Payments at Apple. \n\nYou would join a complementary team responsible for providing scalability, reliability and maintainability solutions for our ever growing business and data processing needs. We are seeking someone interested in solving the most sophisticated and high scale challenges in the world today. Do you like the idea of running critical financial services that are used by millions of people all over the globe? Do you want to contribute to how the world uses their wallet and money? If you love to address internet scale challenges on critical financial systems then come join the team and be part of this initiative."}, "200451107": {"jobID": "200451107", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CPU Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451107/cpu-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BSIn-depth academic knowledge of digital logic design, chip architecture and microarchitectureSolid programming knowledge in C/C++Internships or other academic project experience in hardware verification and/or designShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designMinimum BS", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200458425": {"jobID": "200458425", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Graphics Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458425/graphics-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 0 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Familiar with Verilog.Familiar with various HDL simulators and waveform viewers like IES, VCS, DVE, Verdi.Familiar with Perl, Shell scripting, Makefiles, TCL.Experience with low-level programming of complex computer systems in C, C++.Excellent communication skills and ability to learn.Good knowledge of Computer Architecture; graphics architecture is a plus.Exposure with code repositories; Perforce is a strong plus.Experience with verification language such as System Verilog/UVM/OVM is a plus.Understanding of constrained random verification process, functional and code coverage, assertion methodology is a plus.We are looking for candidates with a minimum of BS + 0 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nIn this highly visible role, you will be at the heart of the chip design effort collaborating with a variety of fields with critical impact in getting products to millions of customers quickly.\n\nThe Graphics Verification Engineer will be responsible for the pre-silicon RTL verification of blocks in low power embedded graphics cores. This includes deep understanding of the micro-architectural details of their block and how it works within the broader GPU design. A strong computer architecture background, preferably in graphics, and a solid foundation in verification methodology will be required to close testing coverage with high confidence."}, "200460990": {"jobID": "200460990", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Apple Watch HW EPS", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460990/apple-watch-hw-eps?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree preferred, but NOT required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "Experience managing, organizing and maintaining large quantities of dataDetail oriented accuracyExcellent communication (written and verbal)Proficient in Excel/Numbers/Keynote/Quip/iCal/AgileUnparalleled multi tasking abilitiesTop notch critical thinking skill-setAbility to react to resets and changes in a time sensitive environmentStrong interpersonal skills and ability to work with a large cross-functional teamBA/BS degree preferred, but NOT requiredApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Apple's Engineering Program Management Team is looking for a resourceful, inclusive HW Engineering Project Specialist (EPS) to assist with BOMs, budgets, and Material Management in support of our WATCH EE design group. The preferred candidate is a fearless organizer! Someone who can prioritize issues and track details to handle the risks associated with NPI SMT builds."}}