{"200461793": {"jobID": "200461793", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "AR/VR Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461793/ar-vr-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Up to 1 year of experience in the following:C++ programming3D math (linear algebra)BS / MS in Computer Science OR equivalent degree- Background in 3D rendering is a plus- Deep experience with at least one of Apple’s Rendering Frameworks (Core Animation, Core Graphics, Core Text, etc)Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR Software Development Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV). As a member of our organization you will assist us in exploring future products that will delight, inspire and empower millions of people."}, "200446047": {"jobID": "200446047", "origin_search": null, "posted": "Jan 3, 2023", "jobTitle": "iOS Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446047/ios-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science (or equivalent experience) will be considered"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Coding experience in Objective-C or SwiftStrong grasp of software design principlesDemonstrated expertise in building and shipping high quality softwareEnthusiastic about working on a cross functional teamExcellent communication and collaboration skillsExcited to build products that impact the lives of our usersBS in Computer Science (or equivalent experience) will be considered", "jobDescription": "Apple’s Technology Development Group (TDG) is helping to build the next generation of interactive applications. This team is working with some of Apple’s most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML), and computer vision (CV). Join us in crafting future products which utilize these technologies to delight, inspire, and empower our users’ lives."}, "200156495": {"jobID": "200156495", "origin_search": null, "posted": "Mar 3, 2020", "jobTitle": "Apple Engineering Opportunities", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200156495/apple-engineering-opportunities?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in Computer Science, Electrical Engineering, Computer Engineering, Data Science, Design, or related fields."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Different together. At Apple, we’re not all the same. And that’s our greatest strength.We are looking for talented engineers across teams at Apple such as:BS/MS/PhD in Computer Science, Electrical Engineering, Computer Engineering, Data Science, Design, or related fields.", "jobDescription": "Discover Apple.\n\nWe’re looking for people like you.\n\nApple is a place where people from all backgrounds get together to do their life’s best work. Come join us.\nAt Apple, great ideas have a way of becoming great products, services and customer experiences very quickly. Bring your passion to your job and there’s no telling what you could accomplish. Apple offers a collaborative work environment that fosters creativity and innovation."}, "200449017": {"jobID": "200449017", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Shader Subsystem Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449017/graphics-shader-subsystem-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Computer Engineering or Computer Science backgroundStrong OOP coding skillsStrong CPU or GPU architectureMachine learning experience is a bonusMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices. \n\nAs part of the GPU shader core verification team, you will be involved in end-to-end functional and architectural verification of Apples next generation GPUs. If you enjoy GPU/CPU architecture, verification, graphics rendering, and programming, this will be an exciting role for you. We use cutting edge verification methodologies, and emphasize innovation to enable Apple's silicon leadership."}, "200363468": {"jobID": "200363468", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AIML - Sr Product Manager, Search Quality", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200363468/aiml-sr-product-manager-search-quality?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "Bachelors, Master or PhD degree in Computer Science or a related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of experience in driving large scale program building machine learning powered productsStrong obsession of products quality and user empathy, deep understanding of what success means for search quality, good grasp of right methodology of hill climbingStrong ability to drive team to complete the vision and deliver stronglyHave personally orchestrated the delivery of multiple significant client/server software products requiring large organizations (100+) to implementStrong analytical abilities and a curiosity to peel the onion to discover opportunities for impact and better user experienceCapability to work across a large number of teams to enforce process and efficient outcomes in a data-driven environmentSelf-motivated and proactive, with demonstrated creative and critical thinking capabilities required to forge a path to successStrong leadership skills, including coaching, team-building, conflict resolution and managementStrong verbal and written communication skills, including negotiation, presentation and influenceAbility to independently draft and present results, recommendations and communication strategiesBachelors, Master or PhD degree in Computer Science or a related field", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? Are you passionate about empowering many ground-breaking intelligent experiences to be made? The AIML org Search team is building groundbreaking technology... and we are looking for people like you! \n\nWe’re looking for a strong Senior Product Manager with technical chops and a proven track record of building and maintaining complex software platforms, tools and processes that deliver compelling end-to-end experiences that delight customers. The PM will lead projects in search quality to serve our over 1 billion customers actively using our search products. You will work with world level deep learning and AI engineers applying groundbreaking machine learning and data science technologies to solve challenges on search relevance, both on-device and server side."}, "200460815": {"jobID": "200460815", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "AIML - Software Engineer, Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460815/aiml-software-engineer-siri-and-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS in Computer Science, Mathematics, Statistics, or a related field, or equivalent industry experience. Masters/PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Experience with one or more general purpose programming languages including but not limited to: Go, C/C++, Java or Python.Experience with search engine, information retrieval, machine learning, NLP is a plus.Experience working with large data sets and pipelines (e.g. MapReduce, Spark) is a plusExcellent analytical and problem solving skillsCan write clean and effective code following modern software engineering best practicesAppetite to dig into data/logs and features to figure out why something does not work as expected2+ years experience writing code which runs in containerized (Kubernetes/Mesos/Borg) environment a plusBS in Computer Science, Mathematics, Statistics, or a related field, or equivalent industry experience. Masters/PhD preferred.", "jobDescription": "The Siri and Information Intelligence teams are creating groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we create are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Siri's universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. As part of this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every day."}, "200320646": {"jobID": "200320646", "origin_search": null, "posted": "Dec 6, 2021", "jobTitle": "AR/VR Frameworks Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200320646/ar-vr-frameworks-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "We are looking for someone with a track record of API and framework developmentExperience building real-time multi-user applications or frameworksYou're familiar with peer-to-peer networking architecture, security and protocols used for real-time communicationsYou have strong object-oriented programming skills in at least one language like; Objective-C, C++, Java, or SwiftYou demonstrate strong communication, collaboration, and social skillsYou have proven expertise in building and shipping high quality softwareYou're self-directed and can solve problems independentlyBS/MS in Computer Science or equivalent experienceAn interest and passion for AR/VR technologiesExperience with iOS development is a plusExperience in 3D graphics, real time graphics, or 3D math is a plus", "jobDescription": "Apple's Technology Development Group is seeking a Software Engineer to help architect and implement networking frameworks and APIs for our next-generation interactive computing platforms. This engineer will enhance the capabilities and performance of AR/VR systems through the development of distributed systems, and a broad range of applications, including machine learning, computer vision, and multimedia processing. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day."}, "200448088": {"jobID": "200448088", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "AIML - Sr Program/Product Manager, Privacy Enablement", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448088/aiml-sr-program-product-manager-privacy-enablement?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Computer Science/Information Science or equivalent experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Strong interpersonal and leadership skills, including team-building, conflict resolution, and managementAbility to communicate clearly and effectively partner, influence, and instill confidence with key partnersExcellent project management skills to structure, track, and handle on-time work streams across multiple teamsKnowledge of standard software engineering methodologies (familiarity with cloud infrastructure and machine learning a plus!)Passion for continuous process improvement and smooth user experiencesData-driven analytical abilities and good judgment to extract insights and prioritize opportunitiesBachelors or Masters in Computer Science/Information Science or equivalent experience preferred", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? Are you passionate about privacy? Then we are looking for people like you!\n\nThe AIML Privacy Enablement Team is driving tools and technologies which allow Apple engineers to fulfill the promise of incredible user experiences and rock solid data privacy. Working cross-functionally between engineering, product, legal, and privacy teams you will develop solutions to novel problems and help drive their implementation. Success requires understanding of data and privacy concepts, as well as an ability to work within a diverse multidisciplinary team."}, "200444205": {"jobID": "200444205", "origin_search": null, "posted": "Nov 20, 2022", "jobTitle": "Data Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444205/data-engineering-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Track record of building and leading high-performance software engineering teams.Strong sense of ownership of the development process and the will to drive the team toward constant code, application and process improvements.Excellent interpersonal skills and ability to collaborate effectively across multiple business and technical teams.Excellent problem solving, critical thinking, and social skills - Lead by example to empower and challenge the team to deliver their best.Multiple years of Data Engineering management experience leading and supporting the development and maintenance of applications, tools and processes.Experiencing architecting, building and maintaining complex, multi-component big data systems.Shown ability to work under pressure while maintaining a high level of quality and integrity.B.S. in Computer Science or equivalent experienceExpert level experience with Data Engineering tools and frameworks, processes, goals and methodologies.Expert level experience with at least two of the following languages and related development tools: (Python, Ruby, Java, Scala, Swift, Objective C).Experience with one or more of the following platforms: HDFS, Yarn, Spark, Impala, Kafka, HBase, MapReduce, Kubernetes, Object Store, Flink.", "jobDescription": "Apple is seeking an experienced, empathetic and quality focused Data Engineering Manager to own the Data and Distributed Computing engineering efforts inside the Data Analytics team. This group leads the development of our big data applications and pipelines in addition to various distributed computing services and supporting applications. This team is a critical component in building, deploying, and running our important applications upon which all of Apple Software Engineering depends. \n\nSWE Data Analytics collects, stores, and analyzes diagnostics and usage data from Apple devices across the world, always keeping user privacy at the forefront. Our data is used to generate insights that advise and drive product strategies across all of software and hardware development.\n\nWe develop and operate a variety of on device software and Big Data products and applications in support of these goals. These systems process multiple petabytes and tens of billions of messages per day across many different data types"}, "200363645": {"jobID": "200363645", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Camera Machine Learning Engineer — Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200363645/camera-machine-learning-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in Electrical Engineering, Computer Science, Statistics, Math, Physics or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expertise in machine learning and deep neural network, with experience in the fields of denoising, semantic segmentation, object detection, image inpainting or generative models.Proficiency in Python and experience with at least one of the major machine learning frameworks, preferably PyTorch or TensorFlow.Experience in computation photography or computer vision, and knowing how to choose between a machine learning or conventional approachFamiliarity with version control and contributing to a large code baseFamiliarity with digital image processing, image quality analysis or video processing.Knowledge of the image signal processor and camera systems (such as auto-exposure, auto-focus and auto white balance).Familiarity with the principles of optics is a huge plus.MS/PhD in Electrical Engineering, Computer Science, Statistics, Math, Physics or equivalent.", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n \nThe Camera Product Engineering group is responsible for the image quality and design validation of camera hardware for Apple products. This team is seeking exceptional Machine Learning Engineers to take leadership roles in development of algorithm and deep neural networks that solve real world hardware problems. Engineers in this role will take leadership and ownership of machine learning projects from concept to production tools for Apple scale. This multidisciplinary role requires engagements with a range of product and technology teams covering many areas of expertise."}, "200287954": {"jobID": "200287954", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "3D Graphics SWE (C++ and Swift)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200287954/3d-graphics-swe-c-and-swift?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD or Master of Science degree in Computer Science or similar, alternatively a comparable industry career with a proven track record of successful projects."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years experience in software development for a shipping productProficient in C/C++, Swift is a plusExcellent object oriented programming and design skillsExperience developing reusable public or private APIsPassion on cutting edge computer vision/machine learning technologies and product deliverySelf motivatedExcellent problem solving skillsExcellent communication skillsPhD or Master of Science degree in Computer Science or similar, alternatively a comparable industry career with a proven track record of successful projects.", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering team responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We focus on a balance of research and development to deliver Apple quality, state-of-the-art experiences. As a member of the Video Computer Vision group you will develop software solutions for exciting new technologies running on Apple’s next generation hardware. We have contributed to the FaceID and FaceKit project in the past and more recently the new LIDAR iPad sensor and Object Capture. We are looking for the right computer vision software engineer to help us take our efforts to the next level."}, "200425958": {"jobID": "200425958", "origin_search": null, "posted": "Sep 16, 2022", "jobTitle": "Machine Learning Engineer, Framework (Planning) - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425958/machine-learning-engineer-framework-planning-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors, Masters, or PhD Degree in Computer Science or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong programming background, with extensive experiences in Python. Experience with C++ is a plus.Background in building distributed systems, data pipelines, working with various cloud technologies.Experience with developing large scale machine learning, reinforcement learning infrastructure is a plus.Previous experience in developing production DL models and familiarity with common DL frameworks is a plus.A strong desire to learn new things and to become an expert at what you do.Bachelors, Masters, or PhD Degree in Computer Science or equivalent professional experience.", "jobDescription": "Apple is looking for Machine Learning engineers to develop ML frameworks for various robotics applications. Your work will directly enable researchers and engineers to build state-of-the-art ML models tackling extremely complex problems that can be deployed into the physical world. \n\nYou’ll join a fantastic team of world-class engineers and researchers with extensive experience and reputation in robotics and machine learning to work on very complex and exciting AI projects. We strive to develop innovative and industry-leading solutions for every challenging problem we work on."}, "200352765": {"jobID": "200352765", "origin_search": null, "posted": "Mar 17, 2022", "jobTitle": "HID Algorithms Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200352765/hid-algorithms-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. or M.S. in CS, EE, Physics, Statistics, Mathematics, or another engineering or technical field\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \n\nApple benefits programmes vary by country and are subject to eligibility requirements.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "TECHNICAL EXPERIENCE:You should have significant experience with the following:Programming C / C++ in a professional environmentImplementing algorithms in production codeSoftware architectureWorking with embedded or resource-constrained systemsWorking with continuous integration and automated build systemsExcellent communication, presentation, and documentation skillsWE WOULD APPRECIATE ADDITIONAL EXPERIENCE WITH:Familiarity with Python or other high-level languagesExperience developing infrastructure for large-scale data processing and annotationFamiliarity with filtering techniques, statistical analysis, noise modeling, and signal processingInterest in optimizing data processing workflows through cloud-based storage and analysisB.S. or M.S. in CS, EE, Physics, Statistics, Mathematics, or another engineering or technical field\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \n\nApple benefits programmes vary by country and are subject to eligibility requirements.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "Join the innovative engineering team that uses sensor signal processing to produce the next generation of human interfaces for iPhone, iPad, Mac, Apple Watch, and exciting new products. Our team comes from diverse backgrounds, including signal and image processing, statistics, machine learning, controls, physics, firmware and software development, neuroscience, and human factors. We are looking for a hardworking software engineer who works well in cross-disciplinary teams over a full product cycle.\n\nHID operates at the intersection of hardware, software, and design. This means that the wide variety of problems you will solve have many interesting facets and you will get to work with specialists from all across Apple."}, "200423357": {"jobID": "200423357", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Swift SW Eng - API Test", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200423357/swift-sw-eng-api-test?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S./M.S. in Computer Science, Electrical Engineering, Computer Engineering or equivalent preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "3+ years of experience in a software development or testing roleExcellent knowledge of software testing methodologies & practicesExperience with Python or equivalent object-oriented scripting languageExperience with iOS application development using SwiftExcellent knowledge of key iOS development concepts, such as protocols, delegates, memory management, and async/await functionalityFamiliar with Xcode debugging tools and utilizing Instruments to further debug applicationsFamiliar developing and testing multithreaded applicationsAble to triage problems, prioritize, and propose resolutionsExperience with version control systems, such as GitB.S./M.S. in Computer Science, Electrical Engineering, Computer Engineering or equivalent preferred", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with hardware, software and machine learning teams to influence the sensor and silicon roadmap that brings our vision to life. Examples include FaceID, Animoji/Memoji, 3D Reconstruction, RoomPlan, and Positional Tracking (VIO/SLAM)."}, "200457505": {"jobID": "200457505", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Vision Framework QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457505/vision-framework-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree in computer science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$40.52", "max": "$67.54/hr,"}, "benefits": null, "requirements": "Strong written and verbal communication skillsExperience with white or black-box testingProven bug detection and regression skillsProficient in Python, Javascript or similar scripting languageSelf-motivated, critical thinking, and demonstrated creativityFundamental understanding of Apple’s platforms - macOS and iOSAbility to multi-task well and change focus quicklyBachelors degree in computer science or equivalent", "jobDescription": "Do you think Computer Vision and Machine Learning can change the world? Do you think it can transform the way millions of people capture, discover and share the most special moments of their lives? We truly believe it can, and we are looking for an enthusiastic QA engineer who can implement the software framework necessary to make these exciting technologies available and drive widespread adoption!\n\nThe Vision Framework team within the System Intelligence and Machine Learning (SIML) group, as part of the ISE organization in Apple, is responsible for imaging, computer vision and machine learning for Apple's image and video products. This team provides the building blocks for a diverse array of technologies, including new exciting features such as Live Text and Photos Memories on macOS and iOS. The group combines research and development in a fast-paced environment. We are looking for critical problem solvers with a sharp eye for detail who would like to play a key role in qualifying these features and helping ensure Apple software is of the highest quality."}, "200435770": {"jobID": "200435770", "origin_search": null, "posted": "Oct 14, 2022", "jobTitle": "Machine Learning Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435770/machine-learning-manager?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. or M.S. in Computer Science, Computer Engineering or a closely related field+ 8yrs of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$269,000,"}, "benefits": null, "requirements": "Experience in managing/leading small engineering teamExperience in leading ML initiatives and proven record of shipping CVML based productsSolid background in ML and deep learning with expertise in computer visionStrong coding skills in C++ or Python and experience in modern deep learning modeling and development using ML frameworks such as Tensorflow and PyTorchExcellent communication and presentation skillsExperience in biometrics/face tracking/gaze tracking (preferred)Ph.D. or M.S. in Computer Science, Computer Engineering or a closely related field+ 8yrs of relevant industry experience", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life. \n\nWe're looking for an exceptional machine learning manager/lead to provide engineering expertise and lead a small team of CVML engineers. Candidates should have broad technical skills including CV/ML and deep learning as well as experience in leading projects and teams and excellent communication skills."}, "200461232": {"jobID": "200461232", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Software Engineer (ML Implementation/Integration)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461232/software-engineer-ml-implementation-integration?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. in Computer Science or relevant fields with 5+ years of experience\nM.S. in Computer Science or relevant fields with 3+ years of experience \nPhD in Computer Science or relevant fields with 1+ years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum 3 years of professional software development experience in modern C++ & Python (Objective C/C++, Swift is a plus).Familiar with algorithm implementation and optimization with platform constraints.Experience in computer vision / machine learning product development and delivery. Experience in working with complex software stacks.Creativity and curiosity for solving highly sophisticated problems.Excellent communication and collaboration skills.Experience in biometrics/face tracking/gaze tracking (preferred)B.S. in Computer Science or relevant fields with 5+ years of experience\nM.S. in Computer Science or relevant fields with 3+ years of experience \nPhD in Computer Science or relevant fields with 1+ years of experience", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life. \n\nIn this role, you will work together with similar minds in a unique development team where your skills and expertise will be put into the Apple products. This role is highly multi-functional and you will work very closely with various highly skilled machine learning and software development teams developing groundbreaking algorithms."}, "200457607": {"jobID": "200457607", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Software Development Engineer in Test — Thermal Control Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457607/software-development-engineer-in-test-thermal-control-systems?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Master's or Bachelor's degree in Computer Science or a related field, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "3+ years of relevant experience as a Validation or Software QA Engineer.Excellent knowledge of software development lifecycle, testing methodologies, and testing tools.Experience developing and understanding test automation frameworks and libraries using scripting or other languages: Python, Perl, Ruby, JavaScript, Objective C, etc.Hands on experience testing consumer products in lab environment, thermal control systems related experience is a plus.Experience in developing test plan, assessing risk, filing appropriate defects, and providing relevant data for test reporting.Ability to make data driven decisions on a regular basisAbility to work cross-functionally, with strong organizational and communication skills- Master's or Bachelor's degree in Computer Science or a related field, or equivalent experience.Nice to have:- Understanding of Cellular Radio Technologies (5G NR, LTE etc)- Exposure to commercial test systems like Keysight, R&S callboxes etc for lab validation.- Experience with visualization tools to analyze large data sets", "jobDescription": "Would you like to join a key team helping to drive and improve the quality of future Apple products?   \n\nWe are the Thermal SQA Team, and we are looking for an ambitious, highly motivated and experienced Software Development Engineer in Test with excellent analytical and problem solving skills. In this role, you'll develop test plans, test cases, running tests and analyzing results to validate Thermal Control Systems on Apple products.   You should have a strong interest for learning new technologies, crafting and running well thought out tests and experiments and effectively analyzing data produced. \n\nYou will be contributing to automated test development, collaborating with many different teams within Apple to further improve the quality of our products.   \n\nCome join our team!"}, "200323231": {"jobID": "200323231", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AR/VR Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200323231/ar-vr-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree and at least 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid knowledge and experience with C++Good understanding and comfort with 3D math (linear algebra).BS / MS in Computer Science OR equivalent degree and at least 3 years of experience- Background in 3D rendering is a plus- Deep experience with at least one of Apple’s Rendering Frameworks (Core Animation, Core Graphics, Core Text, etc)Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR Software Development Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV). As a member of our organization you will assist us in exploring future products that will delight, inspire and empower millions of people."}, "200451074": {"jobID": "200451074", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "AIML - Sr Engineering Program Manager, On-Device Understanding and Adaptation Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451074/aiml-sr-engineering-program-manager-on-device-understanding-and-adaptation-technologies?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors or Master’s degree in Computer Science or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "8+ years in a role leading cross-functional efforts in software development with a strong focus on executionFamiliar with both client-side and server-based software delivery cyclesHands on program/project management experience to manage complex programs with dexterityPreferred experience in data governance, data & user privacy implementation frameworks, and experience leading programs to implement security and privacy compliance requirementsKnowledge of large-scale data products and data analytics tools, including storage, data processing pipelines, large- scale and high-throughput backend services, and/or user-facing applications that use those servicesExperience leading cross functional security and privacy initiatives and collaborating with Legal, Privacy Engineering, Security and other teams across the organization to ensure compliance with privacy policies and security mandatesPassionate about delivering the best user experienceAbility to use data and metrics to back up assumptions, make recommendations and drive actionsSelf-motivated, independent, and proactive; demonstrated creative and critical thinking capabilities; can quickly (real-time) triage, prioritize, drive consensus and lead cross- functional teams under pressureOutstanding communication and presentation abilities, written and verbalDrive to improve how things work, with a track record of driving improvements for team quality, performance, agility and efficiencyBachelors or Master’s degree in Computer Science or related field", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? Are you passionate about empowering many ground-breaking intelligent experiences to be made? The AIML team is building groundbreaking technology... and we are looking for people like you! \n\nThe AIML On-Device Understanding and Adaptation Technologies team at Apple is seeking a Senior Engineering Program Manager. In this role you will work cross-functionally within AIML and across Apple to develop privacy-first strategies for on-device evaluation and experimentation of machine-learning powered Apple features. You will support ML engineers and scientists through systems that combine the latest in ML innovation and deep integration with Apple silicon and infrastructure, unlocking the creation of customer experiences that surprise and delight!"}, "200431996": {"jobID": "200431996", "origin_search": null, "posted": "", "jobTitle": "Software QA Engineer - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431996/software-qa-engineer-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200355876": {"jobID": "200355876", "origin_search": null, "posted": "Mar 30, 2022", "jobTitle": "Deep Learning Research Engineer, 3D Computer Vision - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200355876/deep-learning-research-engineer-3d-computer-vision-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors, Masters, or PhD Degree in Computer Science/Machine Learning or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Build high-performing deep learning models: Implement custom deep learning models in PyTorch or Tensorflow; define careful metrics; perform error analysis and data deep dives. Familiar with network architectures such as convolutional networks, recurrent architectures, Transformers, etc.Deep learning domain expertise: Familiar with some tasks such as 3D object detection (camera, lidar, radar), tracking, panoptic segmentation, self-supervised learning, or behavior prediction. Expertise with other deep learning domains (generative modeling, audio recognition, etc) can also be considered.Software engineering: Strong background in Python development with Linux. You write clean, correct code while iterating on experiments in Python. Ability to understand and contribute to C++-based software is a plus.Excellent verbal and written communication skills. You collaborate effectively with other teams and communicate clearly about your work.Bachelors, Masters, or PhD Degree in Computer Science/Machine Learning or equivalent professional experience.", "jobDescription": "Apple is looking for deep learning engineers and research scientists to build the future of perception for autonomous systems. The machine learning technologies you design and contribute to will power the complex hardware and software systems we work on.\nYou’ll join a fantastic and motivated close-knit team of talented engineers and researchers with deep experience in robotics, machine learning, and software engineering. We hope you’re excited about the values that drive us: \n• Mission: We’re here to build something incredible, and we’ll do whatever work we need to to make our vision happen.\n• Humility: Getting to the right answer is more important than being right. We work as a team and strive to learn from each other. \n• Excellence: The details matter. Building deep expertise and paying attention to the details is how we achieve excellence and get astounding results."}, "200445739": {"jobID": "200445739", "origin_search": null, "posted": "Nov 29, 2022", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445739/ar-vr-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science (or equivalent experience) will be considered"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Strong command of object-oriented programming (C / C++ / Obj-C / Swift preferred)Strong grasp of application software design principlesDemonstrated expertise and independence in building and shipping high quality softwareEnthusiastic about working on a cross functional teamExcellent communication and collaboration skillsBS in Computer Science (or equivalent experience) will be consideredDeep knowledge of UI Animations in either UIKit or SwiftUI (preferred)Comprehensively unit-tested your codebase using XCTest (preferred)", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer who wants to meaningly impact the lives of our users through first party applications. This team is working with some of Apple’s most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML), and computer vision (CV). Join us in crafting future products carefully designed to empower our users."}, "200149514": {"jobID": "200149514", "origin_search": null, "posted": "Jul 19, 2022", "jobTitle": "Machine Learning Research Engineer (Text Recognition) - ISE, SIML", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200149514/machine-learning-research-engineer-text-recognition-ise-siml?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Ph.D or MA in Computer Science, Computer Engineering, or a closely related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with modern machine learning algorithmsExperience with image processing and computer vision algorithmsFamiliarity with deep learning toolkitsStrong programming, debugging and design skillsExcellent problem solving, critical thinking, and communication skillsAbility to work independently and with othersAbility to produce creative and innovative solutions to hard problemsPh.D or MA in Computer Science, Computer Engineering, or a closely related fieldDESIRED EXPERIENCE:• Detailed knowledge of C, C++, Objective-C or Swift programming • Experience developing with OpenCV or similar toolkits", "jobDescription": "Are you interested in building products that utilize machine learning and computer vision technologies? Are you looking to apply your state-of-the-art knowledge to produce high-visibility features?   Apple’s Text Recognition group is responsible for building best-in-class Text Recognition technologies that fuel innovative and user experiences. We are an R&D team that develops core machine learning technologies and pushes the limit of those technologies to produce amazing features like Live Text, Apple Pay Credit Card Capture, and iTunes Gift Card Camera Redemption across all Apple Platforms, including iOS and macOS.  \n\nWe are looking for an exceptional machine learning engineer to help research and develop our next generation of text recognition solutions that will enrich the lives of millions of people!  \n\niOS 15 Live Text: https://support.apple.com/en-us/HT212630"}, "200446206": {"jobID": "200446206", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446206/ar-vr-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science (or equivalent experience) will be considered"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Strong command of object-oriented programming (C / C++ / Obj-C / Swift preferred)You have a strong grasp of application software design principlesYou have demonstrated expertise in building and shipping high quality softwareYou are enthusiastic about working on a cross functional teamYou have excellent communication and collaboration skillsBS in Computer Science (or equivalent experience) will be consideredYou have experience navigating command line UNIX shellsYou have experience writing unit tests and maintaining production code", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer who wants to meaningly impact the lives of our users through first party applications. This team is working with some of Apple’s most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML), and computer vision (CV). Join us in crafting future products carefully designed to empower our users."}, "200356608": {"jobID": "200356608", "origin_search": null, "posted": "Mar 14, 2022", "jobTitle": "Senior Machine Learning Engineer, Simulation - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200356608/senior-machine-learning-engineer-simulation-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors, Masters, or PhD Degree in Computer Science or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years experience in python and expertise in a common deep learning framework (PyTorch, TensorFlow, etc)Industry experience bringing a deep learning system from advanced research to productionExperience with any of the following domains: reinforcement learning, agent modeling, 3D graphics, 3D mapping and reconstruction, raytracing, computational geometry, robotics algorithmsProficient in software development practices including design, estimation, code reviews, and automated testing.Excellent multi-functional collaboration skills: demonstrated ability to work across an organization with algorithm designs, verification engineers, and other technical departments.Bachelors, Masters, or PhD Degree in Computer Science or equivalent professional experience.", "jobDescription": "Apple’s Special Project Group is seeking Senior Machine Learning engineers to help advance state-of-the-art simulation for autonomous technologies. You will directly play a role in integrating machine learning techniques into the core of our simulation efforts. Your work will advance our ability to develop, test, and verify mobile autonomous systems."}, "200465043": {"jobID": "200465043", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "AIML - Machine Learning Engineer, Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465043/aiml-machine-learning-engineer-siri-and-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Cambridge", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS In computer science, computer engineering, or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "2+ years of experience in software development in Python2+ years of experience in product development and deploymentUnderstand full software product life cycleMachine learning knowledge and experience in areas such as speech recognition or NLP is highly desiredFamiliarity with large-scale data processing and distributed systemsFamiliarity with containerization and with cloud servicesDetail oriented and not afraid of tackling tough problemsBS/MS In computer science, computer engineering, or equivalent degree", "jobDescription": "Want to join the team building an intelligent assistant that helps millions of people get things done? You will be part of a cross-functional team of software engineers and machine learning scientists who are responsible for a wide variety of ASR related, data-driven research and ML development activities, including infrastructure and tools that make Siri better every day. To succeed, you must be passionate about building phenomenal products, be a strong collaborator, enjoy learning new things, and solve problems creatively."}, "200457986": {"jobID": "200457986", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "AIML - Engineering Manager, Data Privacy Platform Team (ML Platform & Infrastructure)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457986/aiml-engineering-manager-data-privacy-platform-team-ml-platform-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S., M.S., or Ph.D. in Computer Science, Computer Engineering, or equivalent practical experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Experience in delivering distributed systems and data infrastructure in a production setting.Strong experience leading and growing successful infrastructure teams that consist of multiple software engineers and managers.Experience with building privacy-preserving secure data infrastructure and the data governance framework to register, manage, and control data lifecycle to meet privacy compliance requirements.A passion for building and maintaining systems that scale with a focus on high availability and ease of useExperience managing expectations and relationships with multiple collaborators and project teams across various functional areasExcellent communication and leadership skillsDemonstrated ability to partner with recruiting to grow technical teamsB.S., M.S., or Ph.D. in Computer Science, Computer Engineering, or equivalent practical experience", "jobDescription": "The Machine Learning Platform & Infrastructure (MLPI) group builds the platform that enables the next generation of intelligent experiences on all Apple products & services. MLPI makes it possible for Apple engineers to innovate ML-driven product features rapidly and at scale. Within MLPI, the Data Privacy Platform team provides solutions for Data Governance, Compliance, and Privacy-Preservation of all analytics, experimentation, and ML feature engineering.\n\nWe are looking for an experienced leader who wants to bring their passion for infrastructure & distributed systems to build world-class data privacy platforms/products at scale and across different cloud environments. Our platform is built using a variety of systems and services, from bare metal to managed infrastructure services, and everything in between. We use existing and open-source systems when possible, but do not shy away from building new products ourselves.\n\nAs the Engineering Manager for the Data Privacy Platform team, you will work closely with many cross-functional teams and lead the planning, execution, and success of technical projects with the ultimate purpose of ensuring data privacy and compliance with our data. This role requires strong technical expertise as well as relationship management, program creation and management, and multi-functional coordination."}, "200458002": {"jobID": "200458002", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "AIML - Engineering Manager, Data Privacy Platform Team (ML Platform & Infrastructure)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458002/aiml-engineering-manager-data-privacy-platform-team-ml-platform-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S., M.S., or Ph.D. in Computer Science, Computer Engineering, or equivalent practical experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$269,000,"}, "benefits": null, "requirements": "Experience in delivering distributed systems and data infrastructure in a production setting.Strong experience leading and growing successful infrastructure teams that consist of multiple software engineers and managers.Experience with building privacy-preserving secure data infrastructure and the data governance framework to register, manage, and control data lifecycle to meet privacy compliance requirements.A passion for building and maintaining systems that scale with a focus on high availability and ease of useExperience managing expectations and relationships with multiple collaborators and project teams across various functional areasExcellent communication and leadership skillsDemonstrated ability to partner with recruiting to grow technical teamsB.S., M.S., or Ph.D. in Computer Science, Computer Engineering, or equivalent practical experience", "jobDescription": "The Machine Learning Platform & Infrastructure (MLPI) group builds the platform that enables the next generation of intelligent experiences on all Apple products & services. MLPI makes it possible for Apple engineers to innovate ML-driven product features rapidly and at scale. Within MLPI, the Data Privacy Platform team provides solutions for Data Governance, Compliance, and Privacy-Preservation of all analytics, experimentation, and ML feature engineering.\n\nWe are looking for an experienced leader who wants to bring their passion for infrastructure & distributed systems to build world-class data privacy platforms/products at scale and across different cloud environments. Our platform is built using a variety of systems and services, from bare metal to managed infrastructure services, and everything in between. We use existing and open-source systems when possible, but do not shy away from building new products ourselves.\n\nAs the Engineering Manager for the Data Privacy Platform team, you will work closely with many cross-functional teams and lead the planning, execution, and success of technical projects with the ultimate purpose of ensuring data privacy and compliance with our data. This role requires strong technical expertise as well as relationship management, program creation and management, and multi-functional coordination."}, "200342793": {"jobID": "200342793", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "AIML - Senior Software Engineer, Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200342793/aiml-senior-software-engineer-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Design and build infrastructures to support features that empowers billions of Siri-search users Perform language processing, statistical analysis, and query analysis to support your hypothesis for how to improve product-outcomes. Leverage proprietary MapReduce platform to process web scale data to deliver product features and improvements. Design & run/deploy various metrics and evaluations of features/improvements using a variety of tools like grading, logs processing, pre-launch and holdback A/Bs. Present results of analysis to team and leadership across Apple."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience with one or more general purpose programming languages including but not limited to: Go, C/C++, Java or Python.Experience with search engine, information retrieval, machine learning, NLP is a plus.Experience working with large data sets and pipelines (e.g. MapReduce, Spark) is a plusExcellent analytical and problem solving skillsCan write clean and effective code following modern software engineering best practicesAppetite to dig into data/logs and features to figure out why something does not work as expected2+ years experience writing code which runs in containerized (Kubernetes/Mesos/Borg) environment a plusDesign and build infrastructures to support features that empowers billions of Siri-search users Perform language processing, statistical analysis, and query analysis to support your hypothesis for how to improve product-outcomes. Leverage proprietary MapReduce platform to process web scale data to deliver product features and improvements. Design & run/deploy various metrics and evaluations of features/improvements using a variety of tools like grading, logs processing, pre-launch and holdback A/Bs. Present results of analysis to team and leadership across Apple.", "jobDescription": "The Information Intelligence team is creating groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we create are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Siri's universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. As part of this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every day."}, "200448300": {"jobID": "200448300", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "AIML - ML Research Scientist, Biosignal Intelligence Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448300/aiml-ml-research-scientist-biosignal-intelligence-group?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Computer Science or related fields, an equivalent qualification obtained through other avenues, or a strong track record of ML Research in industry"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience with implementing and training deep learning models with 1-D or multi-channel time-series signalsStrong Python skills and relevant libraries like numpy, scipyExperience with deep learning frameworks such as PyTorch, TensorFlowFamiliarity with software design principles and data structuresExperience in prototyping hardware/software is a plusExperience working with biosignals is a plusExperience in signal processing (filtering & spectrograms) is a plusExperience in working with wearables is a plusMS or PhD in Computer Science or related fields, an equivalent qualification obtained through other avenues, or a strong track record of ML Research in industry", "jobDescription": "At the Biosignal Intelligence Group, we bring together experts from a wide range of disciplines to craft new experiences through machine learning that power novel sensors. We are looking for an ML Research Scientist to implement cutting edge deep learning algorithms to power the next generation of Apple products. In this role, you'll be part of a team of researchers from ML, HW and SW backgrounds and work cross functionally with engineers, designers and prototypers to enable experiences with new sensors through deep learning."}, "200460403": {"jobID": "200460403", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "AIML - Release Engineering Manager, Siri & Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460403/aiml-release-engineering-manager-siri-information-intelligence?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Computer Science, a related field, or equivalent work experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$157,000", "max": "$238,500,"}, "benefits": null, "requirements": "6+ years in roles as DevOps, SRE and at least 2 years leading an engineering team or operations teamLeadership skills such as making presentations to leadership, running war rooms, inspiring teams, and influencing the organization to improve quality and coding best practicesHave a deep understanding of release engineering, branching and software configuration managementExperience working with engineering and project management teamsExperience in troubleshooting large distributed applications or mobile client applicationsTrack record of empowering your team to deliver results independently as part of a geographically diverse teamTroubleshooting and debugging skills: Analyze and investigate test failures, errors, infrastructure and build issuesBachelor’s degree in Computer Science, a related field, or equivalent work experience is required.", "jobDescription": "The AIML Integration and Delivery team is looking for exceptional leaders who are excited about leading a team to operate and automate the delivery of new experiences on Siri. \n\nWe are working to take future releases of Siri to the next level. As an organization, we are responsible for running release management and deploying all Siri server and client code, as well as machine learning models for Siri that affect 1 billion+ customers. If you are excited about the challenges of making development and releases more efficient while every part of the system is advancing, come help us solve these problems and be part of improving efficiency across the Siri and AIML organization! \n\nIn this role, you will lead a distributed team playing a part in ensuring the quality and delivery of groundbreaking technology for large-scale systems, natural language, big data, and artificial intelligence to end users. You will be leading conversations with various multi-functional teams of engineering and project management. You will lead them to identify issues and root causes, fix and prevent build and infrastructure failures, ensure frictionless delivery of features, and make the lives of our AIML organization better."}, "200420852": {"jobID": "200420852", "origin_search": null, "posted": "Sep 1, 2022", "jobTitle": "Autonomy Verification Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420852/autonomy-verification-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. or M.S. in Computer Science, Engineering, Robotics or a related field\nMinimum of 5 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong computer science and mathematics fundamentalsExperience with designing and delivering complex software systemsComfort with the interplay between hardware and software systemsExcellent skills in modern C++ (C++11 or newer), and Python 3.xExperience with Linux / macOS development environmentsA history of driving projects through the entire development lifecycleB.S. or M.S. in Computer Science, Engineering, Robotics or a related field\nMinimum of 5 years of relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "How do you verify an AI? Join a team of talented engineers who are defining verification and validation for safe autonomous technology.\nThe Special Projects Group at Apple is seeking an accomplished software engineer to serve as an Autonomy Verification Software Engineer. In this role, you will develop methods and tools to enable analysis and verification of complex software and hardware systems. You will need to think broadly, connecting ideas across multiple domains: software design, machine learning, data science, simulation – to name a few. You will structure these ideas into robust software designs. You will work with a team of domain experts to turn designs and prototypes into internal software products that are reliable, scalable, and maintainable. You will use a variety of testing methodologies to ensure the quality of your products meets the high standards expected by the team. You will be expected to view problems from multiple perspectives and at different levels of abstraction, and to tackle them from multiple directions. We expect successful candidates to demonstrate an ability to solve such problems efficiently, and to communicate about them effectively with a variety of audiences."}, "200439208": {"jobID": "200439208", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AR/VR Systems Frameworks Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439208/ar-vr-systems-frameworks-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proficiency in writing production quality C/C++ codeExperience with multi-threaded and multi-process designs, performance analysis and optimizationDeep understanding of operating system fundamentalsCreative and critical thinking capabilities and debugging skillsBS in Computer Science/Computer Engineering or equivalent experience/skillsWhile we don't expect you to have familiarity with following technologies, we’re looking for candidates eager to learn and innovate in these areas:-  Experience real-time, safety-critical systems or virtualization technologies is a plus-  Familiarity with system software stack for complex compute nodes (GPU, Neural Engine etc)", "jobDescription": "Are you interested in working on augmented reality (AR) and virtual reality (VR) technology and product space? Are you driven by innovation? Are you passionate about creating and delivering ground-breaking products and services? Do you want to work on something impactful that enhances the life of millions of customers? If that sounds like you, look no further! \n\nWe are looking for an exceptional engineer to help architect and implement latency-critical system software. As a member of our fast-paced and collaborative group, you will have the unique and exciting opportunity to design and build core foundational frameworks for Apple's revolutionary AR/VR roadmap."}, "200268477": {"jobID": "200268477", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "AR/VR Systems Frameworks Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200268477/ar-vr-systems-frameworks-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proficiency in writing production quality C/C++ codeExperience with multi-threaded and multi-process designs, performance analysis and optimizationDeep understanding of operating system fundamentalsCreative and critical thinking capabilities and debugging skillsBS in Computer Science/Computer Engineering or equivalent experience/skillsWhile we don't expect you to have familiarity with following technologies, we’re looking for candidates eager to learn and innovate in these areas:-  Experience real-time, safety-critical systems or virtualization technologies is a plus-  Familiarity with system software stack for complex compute nodes (GPU, Neural Engine etc)", "jobDescription": "Are you interested in working on augmented reality (AR) and virtual reality (VR) technology and product space? Are you driven by innovation? Are you passionate about creating and delivering ground-breaking products and services? Do you want to work on something impactful that enhances the life of millions of customers? If that sounds like you, look no further! \n\nWe are looking for an exceptional engineer to help architect and implement latency-critical system software. As a member of our fast-paced and collaborative group, you will have the unique and exciting opportunity to design and build core foundational frameworks for Apple's revolutionary AR/VR roadmap."}, "200464720": {"jobID": "200464720", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Product Management Leader, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464720/product-management-leader-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science, Statistics, Operations Research, Economics, Business or related areas"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$157,000", "max": "$276,000,"}, "benefits": null, "requirements": "8+ years of product management experience building ML software products5+ years of building advertising technology including platforms (ad exchange, or supply side platform), ad networks (mobile), and search advertising in particular3+ years of experience managing a high-performing Product Management teamExperience building large scale ad platform yield optimization systemsStrong track record of collaborating with engineers and ML scientists on technical design discussions and proposing simple, creative solutions to complex problemsStrong analytical skills with the ability to analyze opportunities from many angles (both quantitative and qualitative) and to drive appropriate performance trackingOutstanding written and verbal interpersonal skillsAbility to influence without authority, sell concepts internally and actively drive decision-making across partnersBS or MS in Computer Science, Statistics, Operations Research, Economics, Business or related areas", "jobDescription": "At Apple, we work every day to create products that enrich people's lives. Advertising Platforms makes it possible for people around the world to easily access informative and imaginative content on their devices while helping advertisers promote and monetize their work. Our technology and services power advertising in Apple News, Search Ads in the App Store across 60 countries. Our platforms are highly performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy! \n\nWe are looking for a curious and passionate product management leader who will help hire and develop a team of Product Managers, and guide them to build the next generation of marketplace optimization algorithms using latest ML technology. A successful leader will be able to maximize platform value by optimally allocating ad opportunities across our demand partners. \n\nIn this role, you’ll set the product vision and roadmap, and oversee development of yield management capabilities for our ad placements. You will need to understand the world of ML, optimization systems development, and data driven product management, orchestrate a product plan and schedule, successfully lead execution from development to launch, and continue to improve existing products."}, "200195528": {"jobID": "200195528", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "AIML - Software Engineer Opportunities, Machine Learning Platform & Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200195528/aiml-software-engineer-opportunities-machine-learning-platform-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS, Ph.D. in a related field , or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong coding skillsStrong background in computer science: algorithms and data structuresExperience with AWS Services such as Amazon S3 EC2 EKS / KubernetesExcellent interpersonal skills able to work independently as well as in a teamExperience with Information Retrieval Large Scale Data-Mining and/or Machine learning are a plusExperience Web Crawling is a plusMS, Ph.D. in a related field , or equivalent experience", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.\n\nDo you want to make Siri and Apple products smarter for our users? Our teams are building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how hundreds of millions of people use their computers and mobile devices to search and find what they are looking for. Our universal search engine powers search features across a variety of Apple products, including Siri, Spotlight, Safari, Messages and Lookup. As part of this group, you will work with one of the most exciting high performance computing environments, with petabytes of data, millions of queries per second, and have an opportunity to imagine and build products that delight our customers every single day."}, "200447723": {"jobID": "200447723", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Senior Sensor Simulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447723/senior-sensor-simulation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree and minimum of 5 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of experience working on game development, computer graphics, visual effects projectsProficiency with game and rendering engines, (Unreal, Unity, etc.)Proficiency with C++ and PythonBonus points for experience with sensors common to autonomous systems; 3D design tools (Blender, Maya)Proficient in software development practices including design, estimation, code reviews, andautomated testing.Excellent multi-functional collaboration skills: proven ability to work across an organization with algorithm designs, verification engineers, and other technical departments.Bachelor’s Degree and minimum of 5 years of relevant industry experience.", "jobDescription": "Apple’s Special Project Group is seeking a Senior Sensor Simulation Engineer to help advance state-of- the-art simulation for autonomous technologies. You will directly play a role in simulating sensors core to our simulation efforts. Your work will advance our ability to develop, test, and verify mobile autonomous systems."}, "200467470": {"jobID": "200467470", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467470/qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.19", "max": "$67.78/hr,"}, "benefits": null, "requirements": "Passion for quality, exceptional attention to detailProven hands on experience with manual testingStrong knowledge of software development lifecycle, testing methodologies, QA terminology and processesExcellent written and verbal communication skills, be able to describe and document clearlyAbility to multi-task and manage tasks with varying prioritiesAbility to work cross-functionally with other teams and groupsExperience with developing, running, and triaging automated test suitesExperience in implementing initiatives across teamsAbility to investigate, debug and triage difficult problems and independently work towards resultsExperience in maintaining/enhancing test framework in scripting languages (e.g. Python)Experience with computer vision/machine learning algorithms preferredBS (or equivalent)Experience in test automation frameworks that involve HW & SW subsystemExperience with macOS, iOS and Xcode", "jobDescription": "The Technology Development team is looking for a QA Engineer to enhance our capabilities to track and improve the quality for new and exciting technologies. We’re seeking an excellent communicator and problem solver who can help evaluate and uphold our software testing processes to ensure the highest quality and best practices towards delivering the algorithms that will shape the future of AR. You would be instrumental in helping us maintain Apple’s high quality and attention to detail for future products by ensuring the code we write is well tested and integrated. As a member of our fast-paced group, you will have the unique and rewarding opportunity to be part of and shape upcoming products that will delight and inspire millions of Apple’s customers every day. \n\nIf you are a highly motivated engineer with passion for quality and exceptional attention to detail who wants to make an impact across teams at Apple that is crafting the future of augmented reality technology in Apple product platforms, we want to hear from you!"}, "200309959": {"jobID": "200309959", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AR/VR Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200309959/ar-vr-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree and at least 3 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid knowledge and experience with C++Good understanding and comfort with 3D math (linear algebra).BS / MS in Computer Science OR equivalent degree and at least 3 years of experience.- Background in 3D rendering is a plus- Deep experience with at least one of Apple’s Rendering Frameworks (Core Animation, Core Graphics, Core Text, etc)Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR Software Development Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV). As a member of our organization you will assist us in exploring future products that will delight, inspire and empower millions of people."}, "200461798": {"jobID": "200461798", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "AR/VR Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461798/ar-vr-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "2-15 years of experience in the following:C++ programming3D math (linear algebra)BS / MS in Computer Science OR equivalent degree- Background in 3D rendering is a plus- Deep experience with at least one of Apple’s Rendering Frameworks (Core Animation, Core Graphics, Core Text, etc)Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR Software Development Engineer to help us push the limits on the next generation of interactive computing for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV). As a member of our organization you will assist us in exploring future products that will delight, inspire and empower millions of people."}, "200463905": {"jobID": "200463905", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Camera Experience Application Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463905/camera-experience-application-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You love building and implementing outstanding user interfaces and customer experienceYou possess a deep understanding of object oriented design, memory management, and performance optimizationYou have hands-on experience shipping high quality iOS applicationsYou excel at solving and debugging hard problemsYou are an effective communicator and love working closely with othersYou thrive working in a dynamic environment and learning new technologiesBachelor's Degree in Computer Science or equivalent experience", "jobDescription": "iPhone is the most popular camera in the world. The seamless integration of software and hardware has led to features like Cinematic Mode which deliver experiences that are magical! The Camera Experience team focuses on user-experience by demonstrating computer vision and image processing through machine learning. We work hard on products that ship to millions of people and are looking for people who want to do the same. Are you looking to contribute to a product that is redefining digital photography? We are growing, and want to speak to gifted engineers who are passionate about, building applications and crafting the future of the world's most popular camera."}, "200466350": {"jobID": "200466350", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "AIML - Sr Software Engineer, AIML Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466350/aiml-sr-software-engineer-aiml-siri-and-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MSc in Computer Science or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Systems programming experienceStrong Swift/Objective C coding skillsC++ coding skills desirableAPI design & developmentiOS SDK knowledgeFamiliarity with embedded system environmentsKnowledge of machine learning environments is desirableBS or MSc in Computer Science or equivalent work experience.", "jobDescription": "Siri is fast becoming the best way to get things done, by talking to our machines through artificial intelligence. Hundreds of millions of people now use Siri to send a message, play their favourite song, or even take a selfie. Now imagine what you could do here! Work on groundbreaking technology and build components with machine learned models, shipped to Apple products to redefining the way people and devices interact."}, "200347541": {"jobID": "200347541", "origin_search": null, "posted": "Oct 21, 2022", "jobTitle": "Senior Engineering Manager - Experimentation, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200347541/senior-engineering-manager-experimentation-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced Degree in Computer Science, Statistics, Applied Math or related field.\n\n10+ years of industry experience building scalable micro services and data driven platforms.\n\n5+ years of experience in engineering management.\n\n2+ years of experience with Experimentation & Multivariate Testing."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$299,000,"}, "benefits": null, "requirements": "Expertise in building Multivariate Experimentation platforms.Proven success in leading and building high-caliber, data focused teams with diverse technical strengths.Skilled at operating in a multi-functional organization.Ability to condense complex concepts and analysis into clear and concise takeaways that drive action.Curious business attitude with a proven ability to seek projects with a sense of ownership.Excellent communication, social and presentation skills.Extensive background in statistical methods and data mining.Experience working with structured and unstructured data stored in distributed files systems such as HDFS and S3.Knowledge in distributed processing frameworks such as Spark.Desire to work in a fast-paced and challenging work environment.Prior experience in advertising industry is a plus.Advanced Degree in Computer Science, Statistics, Applied Math or related field.\n\n10+ years of industry experience building scalable micro services and data driven platforms.\n\n5+ years of experience in engineering management.\n\n2+ years of experience with Experimentation & Multivariate Testing.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in the App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. \n\nAds ML Platform team is looking for a Machine Learning Engineer to build the next generation of software platform and systems to advance algorithms that connect millions of global users to content from publishers and developers. Your work will drive the experimentation and development of machine learned algorithm at scale. You will build sophisticated systems essential in the end-end development of predictive algorithms, from experimentation to productization. You will design and engineer tools that support the end-end ML lifecycle of raw data exploration, feature extraction, automated computation of feature values and for serving on-line prediction that reacts to real-time signals, while preserving privacy of our customers."}, "200462677": {"jobID": "200462677", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Camera API Test Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462677/camera-api-test-engineering-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Strong knowledge of software development lifecycle, testing methodologies, QA terminology and processes.Persistent and inquisitive problem solver, committed to driving quality forward.Detail oriented, analytical, and creative problem solver with passion for quality processes.Outstanding organizational and communication skills (oral, written and interpersonal) including the ability to communicate technical concepts to a non-technical audience.Comfortable and adaptable in a fast-paced, dynamic, schedule-driven environment.Established pattern of building strong teams – hiring, motivating, mentoring and retaining the best engineers.Camera experience preferred.Bachelor's degree in Computer Science or equivalent experience.Experience with Python, Objective-C, and/or Swift programming languages (desired but not required)Experience building and maintaining test frameworks. Automation and tools development experience desirable. Familiarity with SQA Methodologies and debugging skills. Thrive in a collaborative and dynamic environment. Clearly communicate while expertly driving multiple projects with multi-functional team. Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.", "jobDescription": "iPhone is the most popular camera in the world. The Camera & Photos team focuses on user experience by leveraging computer vision and image processing through machine learning. Our team works hard on products that ship to millions of people. We are looking for people who want to do the same. The Camera & Photos group is looking for a dedicated software QA and automation engineering manager to lead its Camera Foundation Test Engineering team, which designs, develops, and tests Camera APIs for the latest innovative Apple products. This team is embedded within the engineering organization, and directly contributes to running and maintaining API tests for public and private Camera Capture APIs. This is a dynamic role with influence over both software quality and development cycles."}, "200349247": {"jobID": "200349247", "origin_search": null, "posted": "Feb 23, 2022", "jobTitle": "System Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200349247/system-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Genuine interest in SOC and system architectureKnowledge of hardware-software interfacesStrong programming and scripting skillsStrong analytical skills to extract meaning from collected metricsExcellent communication skills for cross-functional collaborationBS in Computer Science/Computer Engineering or equivalent experience/skillsKnowledge of simulation technologies like SystemCFamiliarity with CV/ML algorithms and HW acceleration blocksFamiliarity with schedulers and memory subsystemsExperience dealing with large data sets and data visualization", "jobDescription": "The Technology Development Group at Apple is looking for a highly motivated engineer to work on system-level modeling of HW/SW interactions in Augmented Reality (AR) and Virtual Reality (VR) experiences. As a member of our fast-paced group, you will have the unique ability to influence architectural and implementation trade-offs focusing on power and performance."}, "200427048": {"jobID": "200427048", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Car Experience Certification EPM", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200427048/car-experience-certification-epm?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science, Electrical Engineering, or related degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Project management expertise in embedded systems engineeringAbility to focus and prioritize a heavy workload while achieving extraordinary quality. Experience to triage, filter, prioritize and follow through.Multitasking multiple projects and programsTechnical project experience in automotive systems development (infotainment, telematics, wireless technologies) is an ideal prerequisite for this role.Experience to assess usability concepts, to provide design feedback and constructive improvement suggestions.Track record in driving program improvementsStart-to-end: identifying opportunities, conceptualizing, driving and completing program level initiatives.Experience in automating manual tasks, i.e. using Python scripts for validation or data extraction.Ability to learn & understand technical requirements and integration guidelines.Self-starting and independent, working with limited supervision.Bachelor's degree in Computer Science, Electrical Engineering, or related degree3-5 years development experience in systems engineering, technical program management, automotive software development", "jobDescription": "The Car Experience team is looking for a hardworking, highly motivated engineering program manager to collaborate with automotive partners, and to assist product engineering teams in completing certification with Apple. This is a hybrid role between technical engineering and program managing - you will be responsible to provide technical design and development guidance, to handle certification records across the Car Experience programs (inc. CarPlay, digital car keys in Apple Wallet) and to facilitate communication between Apple and global automotive industry engineering."}, "200466207": {"jobID": "200466207", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "AI/ML Next Generation Wireless Systems Research Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466207/ai-ml-next-generation-wireless-systems-research-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Research experience on solving interdisciplinary problems via technologies based on Artificial Intelligence and Machine Learning (AI/ML).Publications in prestigious machine learning conferences/journals such as ICML, NeurIPS, JMLR, ICLR, ACL, and CVPR.Solid mathematical foundation including Linear Algebra, Probability Theory and Statistics, Estimation Theory, and Information Theory.Working knowledge in Algorithms, Optimization, and Object Oriented Programming.Deep understandings of classical neural network architectures and learning methods such as CNN, RNN, Graph Neural Networks, Self-supervised Learning, Transformer, Federated Learning, Reinforcement Learning, and GAN.Experience on prototyping AI/ML concepts via hardware/software, model analysis, and developing varied perspectives to solve problems.Abilities to make independent contributions as well as promote team collaboration.Good programming and code management skills.Familiarity with ML frameworks such as PyTorch and TensorFlowBS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation wireless solutions by groundbreaking AI/ML techniques. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will experience the unique and rewarding opportunity to craft next generation wireless technologies that will generate deep impact on future Apple products and inspire global Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part in all Apple devices that delight our customers. In our unit, our mission is to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will participate on defining system level ideas, proposing, and developing innovative concepts & algorithms, performing sophisticated system simulations, and working on prototyping platforms to quickly prove your ideas for current and next generation (5G/6G) cellular systems via innovative AI/ML paths."}, "200460260": {"jobID": "200460260", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Manager, Apple Silicon GPU UserMode Drivers - PreSilicon", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460260/manager-apple-silicon-gpu-usermode-drivers-presilicon?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$343,500,"}, "benefits": null, "requirements": "Ability to motivate people, instill accountability, and achieve resultsStrong organizational skills and adaptive approach to problem solvingTrack record of building collaborative working relationships across large organizationsStrong communication skills with the ability to influence up, down, and cross-functionallyExperience hiring engineers and technical leaders and helping grow their careersExtensive experience with GPU APIs (Metal, DirectX, Vulkan, CUDA, Direct Compute, OpenGL, OpenCL, console, etc)Knowledge of GPU hardware architectures, capabilities and performance characteristicsExcellent software design, problem solving, debugging, and performance analysis abilityExcellent Presentation skillsBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experiencePrior GPU driver development (UMD, KMD, Compiler) experience is a huge advantagePrior game development experience is a huge advantageYour knowledge of modern real-time rendering techniques is an assetExposure to Metal, Vulkan or Direct3D12 will be idealExposure to GPGPU (General-Purpose GPU) algorithms & machine learning will be idealExposure to Silicon Bringup will be idealExposure to OS level power, performance and scheduling management will be ideal", "jobDescription": "Apple’s GPU Software team provides the graphics software foundation across all of Apple’s innovative products, including iPhone, iPad, Apple TV, Mac, and Apple Watch. Our responsibilities encompass the frameworks, developer tools, and hardware drivers for the GPU and Display devices on all of Apple’s hardware.\n\nMetal provides a platform-optimized, low-overhead API for developing the latest 3D pro applications and games using a rich shading language, tight integration between graphics and compute, and an unparalleled suite of advanced GPU profiling and debugging tools. The foundation of many acceleration technologies, Metal unleashes the full potential of Apple Silicon through advanced features and compiler tools. \n\nJoin the team that made the groundbreaking graphics performance, efficiency and feature set of the groundbreaking Apple M1 processor possible! The Apple Silicon GPU PreSilicon Driver Team within GGD (Graphics, GPU and Display) Software is directly responsible for the development of the PreSilicon GPU drivers for all future generations of Apple Silicon GPUs. \nThe Apple Silicon UserMode driver team within the PreSilicon driver team is responsible for developing the user mode drivers and the driver’s compiler layer for future Apple Silicon GPUs. We are looking for a manager with a strong engineering background who is excited to work with engineers and other leaders at Apple to ship Apple GPUs across all Apple devices, build exciting new GPU focused features, work with other teams to prototype future HW and SW GPU features. This manager has the interpersonal skills, the diligence to drive, and the perseverance to ship products."}, "200446034": {"jobID": "200446034", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog IP Lab Software Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446034/analog-ip-lab-software-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE\nMinimum 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The ideal candidate should possess the following qualifications:Excellent Python and C/C++ programming skillsMATLAB or other numerical processing code expertiseData post processing algorithms knowledgeBSEE\nMinimum 3 years of industry experience", "jobDescription": "In this highly visible role, you will develop software to support the lab characterization, validation and debug of embedded circuits; collaborating with many fields to launch the world’s premiere mobile computing chips.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially hardworking IP Validation Lab Software Developer! As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will surprise and delight millions of Apple’s customers every day."}, "200461354": {"jobID": "200461354", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Senior Site Reliability Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461354/senior-site-reliability-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or Equivalent (5+ years of software development or production operations experience in a large-scale environment)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 5 years in a Reliability Engineering, DevOps or infrastructure focused rolePassion for designing and building reliable systemsAdvanced experience with programming languages (GoLang, Python, Java, C++)Deep systems and infrastructure knowledgeAutomation advocate - you truly believe in removing operation load with softwareExperience with deploying, supporting and monitoring new and existing services, platforms, and application stacksExcellent troubleshooting and problem solving skillsExperience with scale testing, disaster recovery, and capacity planningFamiliarity with microservices architecture and container orchestration with KubernetesDemonstrated ability to deliver results on time with high qualityBS/MS in Computer Science or Equivalent (5+ years of software development or production operations experience in a large-scale environment)", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.\nThanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, forward-thinking, and cross-functional, offering greater exposure to the array of opportunities here."}, "200455664": {"jobID": "200455664", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Human Factors Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455664/human-factors-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree required (Master’s or doctorate preferred) with a concentration or extensive work in human factors, industrial engineering, cognitive engineering, human-computer interaction, or experimental psychology."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Excellent communication and interpersonal skills, attention to detail, patience, and aesthetic sensibilityPassion for assessing and enhancing usability of productsCurious about human interaction with technology and novel featuresExpertise in creating thorough experimental designs, utilizing scientific methodsExpertise in conducting usability studies and interview techniques related to product use is requiredMixed methods expertise to combine quantitative and qualitative research approachesAbility to customize data collection tools, as well as manipulate, analyze and visualize outputsRelevant proven experience in human factors and/or consumer product usability evaluation is required.Ability to distill research insights into presentations for engineers and designers in a concise wayBachelor’s degree required (Master’s or doctorate preferred) with a concentration or extensive work in human factors, industrial engineering, cognitive engineering, human-computer interaction, or experimental psychology.At least two from the following list:Expertise of survey development and deploymentExpert in extracting insights from qualitative interview dataExperience with scripting/programming for data manipulation and research applications (e.g., R, Matlab, Python)Expertise with motion capture systems", "jobDescription": "Apple is looking for a Human Factors engineer/UX researcher to apply user-centered design principles to the design and development of Apple products.\n\nThis role requires working at the intersection of many disciplines, on a variety of projects and with multiple partners. Curiosity to delve into new domains, the ability to learn from cross- functional, often highly technical partners and quick thinking are key.\n\nIdeal candidates have 2+ years industry experience focused on software and hardware usability with products, with the ability to anticipate, study and observe user interactions. They are technical, able to utilize and customize quantitative log collection, while also intuitively relating to the user and applying their intuition."}, "200443128": {"jobID": "200443128", "origin_search": null, "posted": "Nov 11, 2022", "jobTitle": "Camera Machine Learning Engineer - ISP Algorithms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443128/camera-machine-learning-engineer-isp-algorithms?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Computer Science, Computer Engineering, Imaging Science, Electrical Engineering, Statistics, Physics, Math, or related fields"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Self driven and passionate for image quality excellence!Strong machine learning and deep learning fundamentals, ideally in fields related to image processing and restoration, such as de-noising, super-resolution, semantic segmentation, GANs, saliencyStrong proficiency in Python and at least one major deep learning framework (Pytorch or Tensorflow preferred)A keen interest towards real-time performance optimization, previous experience taking approaches from research papers and successfully deploying them in a resource-constrained, mobile computing environmentUnderstanding of the Physics and Math being the digital imaging formation process, from image capture and imaging sensor characteristics, optics fundamentals, image signal processing; and their influence to final image and video quality would be a plusSolid programming skills in C / C++, Matlab is a bonusPrevious experience with network compression, quantization, performance and memory profiling and optimization is a bonusMS or PhD in Computer Science, Computer Engineering, Imaging Science, Electrical Engineering, Statistics, Physics, Math, or related fields", "jobDescription": "Apple's Camera Algorithm team is looking for an extraordinary ML algorithm engineer to work on the image capture and processing/rendering algorithms that serve all Apple product cameras. \n\nAs part of the team, you will work on core camera and low-level vision technologies, using Apple’s leading real-time neural inference processor (Apple Neural Engine) and powerful custom image signal processing engine. You will have the opportunity to demonstrate your Machine Learning skills and expertise to help re-define and push the boundaries of image quality, to render outstanding still image and video quality. \n\nOur close-knit team fosters an environment of product innovation, rapid product iteration and collaboration; both at team and multi-functional levels, granting you a liberating amount of autonomy. \n\nWe work closely with various teams at Apple, like the Silicon Design, Camera HW, Camera SW and QA."}, "200462069": {"jobID": "200462069", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "iPhone Data Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462069/iphone-data-analysis-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS/PHD EE Required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Data analysis and automation - Significant expert at processing large volume of data, analysis, visualization analytics.A deep understanding of probability, statistics, algorithms and mathematics.Practical modern machine learning experiences in regression, classification and clustering.Strong software skills (Matlab, C/C++, R, Python).Excellent communication, persuasion and negotiation skills.Proven self motivation and ability to work independently.Understanding of control theory and how it relates to modeling Li-on batteries is a plus.Understanding embedded system architecture is a plus.Deep knowledge in key system-engineering architectural and implementation tradeoffs is a plus.BS/MS/PHD EE Required", "jobDescription": "Apple’s iPhone Hardware Engineering organization is looking for a highly motivated engineer with a real passion in both hardware and software.\n\nAs a member of the iPhone modeling and algorithm team, you will work on opportunities to extend iPhone/iPad user experiences and improve battery life by studying data from the field, internal data sources and vendors. \n\nYou will have the opportunity to influence the architectural roadmaps and high-level system specifications for the future iOS devices. This is an extraordinary cross-disciplinary opportunity and it requires intensive team collaboration effort coupled with proven system-engineering background."}, "200460591": {"jobID": "200460591", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Sr Analytics Development Engineer, HomeKit", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460591/sr-analytics-development-engineer-homekit?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science, Electrical Engineering, Software Engineering or Systems Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong programming skills including on-device development for data collection and processing (e.g. Java, C++, obj-C).5+ years of proven experience building data science driven solutions to tackle business and quality problems.Ability to dive into the details on product features and underlying architecture in order to help define success criteria and the ways we can measure that via metrics and other approaches. This will involve close collaboration with the engineering teams that develop those features.Ability to work multi-functionally with other Apple organizations including Marketing, Data Analytics, User Studies, Siri and application development teams.Strong interpersonal skills and the ability to naturally explain difficult technical topics to everyone from data scientists to engineers to business partners and leaders.BS or MS in Computer Science, Electrical Engineering, Software Engineering or Systems Engineering", "jobDescription": "The HomeKit team provides the foundation that enables an entire ecosystem of secure and intelligent home connectivity. We are developing technologies and crafting experiences that revolutionize the way people harmonize with the accessories around them. The team is seeking a hardworking Analytics Engineer to push the boundaries of data collection, processing and visualization and building a foundation of data driven decision-making for a growing team."}, "200462789": {"jobID": "200462789", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Software Engineer - System Scheduling Performance", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462789/software-engineer-system-scheduling-performance?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor, Master degree or equivalent experience in computer science or a related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Strong programming backgroundFoundational understanding of operating system components and responsibilitiesAbility to deliver high quality work on tight schedules consistentlyProfessional and collaborative with outstanding communication and presentation skillsFamiliarity with statistics, data analysis, or machine learning and the enthusiasm to learn moreBachelor, Master degree or equivalent experience in computer science or a related field", "jobDescription": "Are you excited by the thought of making your battery last longer or your apps launch faster? \n\nHandling resource consumption and contention is a key differentiator for Apple products and the System Scheduling Performance team focuses on solving these key resource tradeoff problems. The team develops technologies to intelligently schedule workloads in optimal device conditions to balance feature responsiveness with constraints such as battery life, thermals, network efficiency, memory, and more. This technology is at the foundation of features like Background App Refresh, Exposure Notifications, iCloud Photo Library, and many more!\n\nThe team is looking for innovative candidates to design and implement new capabilities to manage process runtime and resource utilization across our diverse product lines. In this highly visible role, you will be driving the development of a scalable architecture for resource management, as well as influencing and assist cross-functional teams with the adoption of these new operating system concepts. Through the combination of data and performance analysis, software prototyping, and systems engineering, you will push the boundary of what's possible at the core of the operating system!"}, "200445942": {"jobID": "200445942", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445942/ar-vr-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science (or equivalent experience) will be considered"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Strong command of object-oriented programming (C / C++ / Obj-C / Swift preferred)Strong grasp of application software design principlesDemonstrated expertise and independence in building and shipping high quality softwareEnthusiastic about working on a cross functional teamExcellent communication and collaboration skillsBS in Computer Science (or equivalent experience) will be consideredDeep knowledge of UI Animations in either UIKit or SwiftUI (preferred)Comprehensively unit-tested your codebase using XCTest (preferred)", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer who wants to meaningly impact the lives of our users through first party applications. This team is working with some of Apple’s most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML), and computer vision (CV). Join us in crafting future products carefully designed to empower our users."}, "200461222": {"jobID": "200461222", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "HID - Signal Processing and Machine Learning Algorithm Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461222/hid-signal-processing-and-machine-learning-algorithm-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS in Computer Science, Computer Engineering, or related field; PhD is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Algorithm design and development for classification, filtering, noise modeling, signal processing, or controlStrong theoretical knowledge of fundamental DSP concepts such as Adaptive filtering, linear algebra, and statisticsProficiency in C/C++ coding and a mathematical modeling language (e.g. Matlab/python)User interface design, graphics programming, or linguistic modeling (a plus )User studies and data analysis (a plus)MS in Computer Science, Computer Engineering, or related field; PhD is preferred", "jobDescription": "Join the engineering team crafting next-generation touch interfaces for iPad, Pencil, iPhone, Watch and more. We are an eclectic group with backgrounds in signal processing, machine learning, computer science, estimation algorithms, human factors, and more, dedicated to inventing new ways of interacting with Apple products and shipping amazing products every year. We are looking for a signal processing/ imaging engineer with a strong background in signal processing, machine learning or related fields. Your good communication skills, and ability to drive discussions with cross-functional teams would come in very handy. If you have gained any experience with user interface design or graphics programming skills it will further help broaden your role and efficiency in this position. To summarize, you will be working on innovative projects and will be responsible for productizing algorithmic solutions, and you will be part of the team shipping products to millions of users every year."}, "200375087": {"jobID": "200375087", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "Machine Learning CPU Compiler Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200375087/machine-learning-cpu-compiler-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree or equivalent experience in Computer Science, Computer Engineering, or a related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent coding skills with C++ programmingExperience working on CPU backends and/or compilers for machine learningGood understanding of micro-architecture of NEON on ARM or AVX on Intel CPU cores from a vector programming perspective and writing in assemblyStrong verbal and written communication skills.Ability to handle multiple tasks and self-prioritize.Ability to work with multi-functional teams.Bachelor’s degree or equivalent experience in Computer Science, Computer Engineering, or a related field", "jobDescription": "Are you a big-picture problem solver who loves setting daring goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group we ensure that the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully coordinated operating systems that combine hardware, software, and apps into a single Apple experience.\n\nYour dedication to cross-disciplinary collaboration will help develop groundbreaking technologies for iOS, macOS, watchOS, and tvOS. By crafting these distinct, multidisciplinary user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices.\n\nThe Vector and Numerics Group within Core OS is tasked with designing, enhancing and improving various subsystems running on iOS, macOS, watchOs and tvOS. Most of this support is encapsulated in the Accelerate framework, a well used library serving many technologies, such as machine learning."}, "200456633": {"jobID": "200456633", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Lab Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456633/lab-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical field, such as Computer Science or Engineering or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "5+ years experience administrating software services in Unix environment and automated provisioning of systemsExperience with shell scripting or PythonExperience with QA and writing Python test libraryKnowledge of Puppet, Ansible or other configuration management toolsExperience with using/administrating macOS, iOSFamiliarity with Git or other source control systemsProven ability to plan and communicate priorities to managementExcellent communication skills are a requirement due to the high level of interaction with engineering teams, management, and other organizations within AppleCreative thinker and strong problem solver with meticulous attention to detailHighly organized, creative, motivated, and passionate about achieving resultsBS degree in technical field, such as Computer Science or Engineering or equivalent work experience- Experience working in fast paced engineering environments- Experience working with RESTful services- Core understanding of LAN network infrastructure- Experience with common data center infrastructure (HVAC, power distribution, copper and fiber cabling, rack types and capacities etc…)", "jobDescription": "The Software Delivery (SD) Operations team is seeking a results driven and meticulously organized lab engineer. We manage a fleet of thousands of Apple devices used in a centralized, automated test system which is a critical tool used by engineers developing for iOS, watchOS, tvOS, and macOS.\n\nThis position will provide the opportunity to work with the latest Apple hardware and software and be part of a rapidly growing organization. In this position, you will be responsible for supporting lab automation used by Software Engineering testing code changes to components."}, "200380042": {"jobID": "200380042", "origin_search": null, "posted": "Jun 6, 2022", "jobTitle": "Machine Learning Engineer - TDG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380042/machine-learning-engineer-tdg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors, Masters or PhD degree with a focus on machine learning or AI planning."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Bachelors plus four years of relevant work experience or Masters with two years of relevant work experience or Ph.D in relevant fieldKnowledge and experience in machine learning, with specific expertise in reinforcement learning, imitation learning, and deep learning algorithms.Experience with at some of the major machine learning frameworks: DeepRL, Caffe, TensorFlow, Torch, Keras, CoreML, Espresso, or CreateML.Solid mathematical foundation to understand and advance our understanding of machine learning techniques.Practical experience in C, C++, and Objective C, Swift, and Python.Creativity and curiosity for solving highly complex problems, and a team-oriented attitude (you need to work well with others) — must also be an excellent communicator.Bachelors, Masters or PhD degree with a focus on machine learning or AI planning.TDGDRUMMOND", "jobDescription": "Are you passionate about artificial intelligence and machine learning? Do you wonder how augmented reality and mixed reality will change how people interact with information and with each other?\n\nHave you worked on applications of reinforcement learning to interesting control problems? Have you studied AI planning, including means-ends analysis, and have you used deep learning to guide the search of a planner (as an example)? Are you interested in how language is used in reasoning, and to guide action (as another example)?\n\nThe Technology Development Group is working on systems related to all these ideas. We’re passionate about the construction of effective and easy-to-use software systems that exhibit intelligent behavior. \n\nWe’re looking for a driven and self-motivated software engineer to join us in this work. As a member of a small and fast-paced team, you’ll have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of people every day."}, "200399375": {"jobID": "200399375", "origin_search": null, "posted": "Jul 7, 2022", "jobTitle": "System Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200399375/system-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Genuine interest in SOC and system architectureKnowledge of hardware-software interfacesStrong programming and scripting skillsStrong analytical skills to extract meaning from collected metricsExcellent communication skills for cross-functional collaborationBS in Computer Science/Computer Engineering or equivalent experience/skillsKnowledge of simulation technologies like SystemCFamiliarity with CV/ML algorithms and HW acceleration blocksFamiliarity with schedulers and memory subsystemsExperience dealing with large data sets and data visualization", "jobDescription": "The Technology Development Group at Apple is looking for a highly motivated engineer to work on system-level modeling of HW/SW interactions in Augmented Reality (AR) and Virtual Reality (VR) experiences. As a member of our fast-paced group, you will have the unique ability to influence architectural and implementation trade-offs focusing on power and performance."}, "200465481": {"jobID": "200465481", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "SOC Cache Architecture Performance Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465481/soc-cache-architecture-performance-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. and 10+ years of relevant industry experience. Masters, or PhD in EE, CS, or related field preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ideally, you will have a B.S. and 10+ years of relevant industry experience and posses:Good written and verbal communication skills.Deep understanding of cache micro-architecture, data coherency protocols, and on-chip interconnect architecture.Good knowledge of C++, including templates and the STL.Experience in writing and using SoC performance models, and transforming the simulation results into compelling performance analysis.Ability and enthusiasm to work with experts in other domains, such as CPU, GPU, Display, Camera, and Machine Learning, to understand their cache usage requirements, and help them apply good performance modeling practices to drive architecture and design decisions.Proficiency in scripting languages, ideally Python.B.S. and 10+ years of relevant industry experience. Masters, or PhD in EE, CS, or related field preferred.", "jobDescription": "Do you love crafting elegant solutions to complex problems? Do you enjoy learning how systems work from the big picture down to the smallest detail? As part of the SoC Performance group, you’ll work with a diverse set of cross-functional teams to help architect, optimize, and ship our industry-leading SoCs powering Apple products from iPhone to Apple Watch, iPad, Macs, and more! \n\nYou’ll join a team of performance architects who deeply analyze the way our SoCs are used by real software, in order to ensure that software can harness the full power of our chips and to drive the design of future SoCs to be an even better match for real-world use cases. We’re looking for experienced, passionate, and highly motivated individuals to help us set the standard on the performance, efficiency, and hardware/software integration of Apple’s products!\n\nYou will enjoy this role if:\n\n-  You're interested in hardware design, hardware/software co-design, hardware/software optimization, and power/performance tradeoffs.\n\n-  You derive satisfaction from not only performing the analysis, but using your interpersonal skills to use your analysis to influence the direction of the organization.\n\n-  You enjoy doing deep-dives into hardware and software parts that are outside of your immediate area of responsibility, to establish relationships across the organization and apply the findings to innovate the parts you own."}, "200465474": {"jobID": "200465474", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "SOC Cache Architecture Performance Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465474/soc-cache-architecture-performance-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. and 10+ years of relevant industry experience. Masters, or PhD in EE, CS, or related field preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Ideally, you will have a B.S. and 10+ years of relevant industry experience and posses:Good written and verbal communication skills.Deep understanding of cache micro-architecture, data coherency protocols, and on-chip interconnect architecture.Good knowledge of C++, including templates and the STL.Experience in writing and using SoC performance models, and transforming the simulation results into compelling performance analysis.Ability and enthusiasm to work with experts in other domains, such as CPU, GPU, Display, Camera, and Machine Learning, to understand their cache usage requirements, and help them apply good performance modeling practices to drive architecture and design decisions.Proficiency in scripting languages, ideally Python.B.S. and 10+ years of relevant industry experience. Masters, or PhD in EE, CS, or related field preferred.", "jobDescription": "Do you love crafting elegant solutions to complex problems? Do you enjoy learning how systems work from the big picture down to the smallest detail? As part of the SoC Performance group, you’ll work with a diverse set of cross-functional teams to help architect, optimize, and ship our industry-leading SoCs powering Apple products from iPhone to Apple Watch, iPad, Macs, and more! \n\nYou’ll join a team of performance architects who deeply analyze the way our SoCs are used by real software, in order to ensure that software can harness the full power of our chips and to drive the design of future SoCs to be an even better match for real-world use cases. We’re looking for experienced, passionate, and highly motivated individuals to help us set the standard on the performance, efficiency, and hardware/software integration of Apple’s products!\n\nYou will enjoy this role if:\n\n-  You're interested in hardware design, hardware/software co-design, hardware/software optimization, and power/performance tradeoffs.\n\n-  You derive satisfaction from not only performing the analysis, but using your interpersonal skills to use your analysis to influence the direction of the organization.\n\n-  You enjoy doing deep-dives into hardware and software parts that are outside of your immediate area of responsibility, to establish relationships across the organization and apply the findings to innovate the parts you own."}, "200463923": {"jobID": "200463923", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "AIML - Machine Learning Engineer, Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463923/aiml-machine-learning-engineer-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS in Computer Science, Mathematics, Statistics, or a related field, or equivalent industry experience. Masters/PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Experience in natural language processing, machine learning or deep learningMastery of one of following languages: Python Go Java C++, demonstrating strong background in algorithms and data structuresExcellent interpersonal skills ability to work independently as well as in a teamExcellent knowledge and good practical skills in major machine learning algorithmsBS in Computer Science, Mathematics, Statistics, or a related field, or equivalent industry experience. Masters/PhD preferred.", "jobDescription": "Do you want to make Siri and Apple products smarter for our users? The Web Answers team is redefining how hundreds of millions of people use their devices to get their questions answered. We are an R&D team pushing the limits of question answering technologies, responsible for a production service powering part of Siri. We are part of a wider effort to power search and answers across a variety of Apple products – including Siri, Spotlight, Safari, Messages, and more. \n\nAs part of our team, you will be leveraging and improving upon the latest deep learning models in order to understand queries, rank documents, and find useful answers to users’ questions. Our team is responsible for deploying these models at scale, using the latest advances in model compression and inference-optimized hardware."}, "200466245": {"jobID": "200466245", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Software Engineer - Big Data Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466245/software-engineer-big-data-technologies?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S., M.S. or Ph.D. in Computer Science, Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Great programming skills in C, C++, Python or JavaStrong analytical thinkingSelf-motivated and able to work independentlyExcellent spoken and written communication skillsB.S., M.S. or Ph.D. in Computer Science, Electrical Engineering or equivalent", "jobDescription": "Meaningful insights require a solid infrastructure that is able to scale with the large amount of data coming in. Our team is responsible for discovering such great insights from a sea of data, and our infrastructure needs innovative ideas to improve its performance and ease-of-use. Would you like to help understand the challenges of building and maintaining a large-scale analytics infrastructure? Are you excited about identifying areas for improvement and creating out-of-the-box solutions? If this describes you, we would love to hear from you!"}, "200242305": {"jobID": "200242305", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "HID - Interaction Algorithms Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200242305/hid-interaction-algorithms-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in Human Computer Interaction (HCI), Computer Science (CS), Electrical Engineering (EE), or a related field / equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "2+ years SW development experience (or equivalent internship / research experience)Proficiency in C++ and PythonExperience developing interactions or input technologiesExperience with signal processing, such as applying filtering to noisy signalsAble to communicate clearly and collaborate with cross-functional teamsExcellent problem solving and root cause analysis skillsBS/MS/PhD in Human Computer Interaction (HCI), Computer Science (CS), Electrical Engineering (EE), or a related field / equivalent experienceThe following are not required, but are a plus and may help you be more successful in this role:- Experience with Objective-C and/or Swift- Experience developing software for Augmented Reality (AR) / Virtual Reality (VR) (ex. ARKit)- Experience with 3D mathematics and/or simulation/physics/game engines such as RealityKit or Unity3D- Experience with linear algebra and statistics", "jobDescription": "The Human Interface Devices (HID) team is looking for an Interaction Algorithms Engineer to develop algorithms for next generation human-computer interactions."}, "200381903": {"jobID": "200381903", "origin_search": null, "posted": "Jun 1, 2022", "jobTitle": "Senior AI / ML engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200381903/senior-ai-ml-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD degree with a focus on machine learning and reinforcement learning; alternatively, a comparable masters degree and at least five years of practical industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Masters plus five years of relevant work experience or Ph.D with two years of relevant work experienceKnowledge and experience in machine learning, with specific expertise in using machine learning for animation, reinforcement learning, imitation learning, or other deep learning algorithms.Experience in at least one major machine learning framework: DeepRL, Caffe, TensorFlow, Torch, Keras, etc.Knowledge and experience with general-purpose AI, knowledge representation, and reasoning.Solid mathematical foundation to understand and advance our understanding of machine learning techniques.Practical experience in Python, C, C++. Objective-C and Swift experience would be extremely useful as well.Creativity and curiosity for solving highly complex problems, and a team-oriented attitude (you need to work well with others) — must also be an excellent communicator.PhD degree with a focus on machine learning and reinforcement learning; alternatively, a comparable masters degree and at least five years of practical industry experience.", "jobDescription": "Have you worked on applications of reinforcement learning to interesting applications in control? Are you fascinated by the connection between perception and action? Have you used sample behaviors, in an imitation learning system, to get an algorithm to more quickly learn to “do the right thing”? Have you studied AI planning, including means-ends analysis, and have you used deep learning to guide the search of a planner? Are you interested in how language is used in reasoning, and to guide action?\n\nThe Technology Development Group is working on systems related to all these ideas. We’re passionate about the construction of effective and easy-to-use systems that exhibit intelligent behavior.\nWe’re looking for a driven and self-motivated software engineer to join us in this work. As a member of a small and fast-paced team, you’ll have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of people every day."}, "200459523": {"jobID": "200459523", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Software Engineering Manager, HomeKit", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459523/software-engineering-manager-homekit?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent domain with 5+ years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Past experience mentoring junior team members, building/growing a strong and diverse team, promoting healthy team culture, driving process improvements, and supporting career growth of team members.Proven track record of owning and leading delivery of projects, providing subject matter expertise in a functional domain, and running engineering processes.Experience in building strong partnerships with product owners, cross-function partners and business stakeholders, and demonstrating an ability to influence, resolve conflicts, and drive results.Technical experience with native iOS development and a strong grasp of computer science fundamentalsAbility to drive forward through various constraints and ambiguity on difficult problems to make sound decisionsStrong communication skills and the ability to influence cross functionally.A passion for solving everyday problems in innovative waysAn understanding and interest in the smart home spaceBachelor's degree in Computer Science or equivalent domain with 5+ years experience", "jobDescription": "The HomeKit team provides the foundation that enables an entire ecosystem of secure and intelligent home connectivity. We are developing technologies and crafting experiences that revolutionize the way people interact with the accessories around them. The team is seeking a hands on, hardworking engineering manager to help build take Home automation platform to the next level."}, "200431664": {"jobID": "200431664", "origin_search": null, "posted": "Oct 18, 2022", "jobTitle": "Senior Software Quality Manager, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431664/senior-software-quality-manager-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in computer science or equivalent field with 5+ years experience managing a quality engineering team."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "You have strong experience in integrated, end to end systems and testing methodologies.Demonstrated ability to achieve results through people and across an organization, forming relationships, collaborating with and influencing cross-functional teams.Ability to drive and support automation test strategy implementation.Experience developing in Python or Java, familiar with databases, SQL, and scripting languages.Understanding of Big Data technologies like Hadoop, Kafka, Spark, Cassandra.Practical understanding of modern machine learning and its components.You enjoy working closely with operational teams on deployment, monitoring, and management concerns.Experience managing the performance of a team reporting to you, and take ownership to drive positive outcomes!BS/MS in computer science or equivalent field with 5+ years experience managing a quality engineering team.", "jobDescription": "At Apple, we work every single day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and visionary content on their devices while helping publishers and developers promote and monetize their work. We are a team of passionate scientists and technologists, dedicated to helping publishers and developers find their audience, and changing the way advertising works with data.   Our technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy!  This position will focus on making sure our advertising systems deliver relevant, performant ads at scale, with quality. As such, these are some of the key qualifications below."}, "200461850": {"jobID": "200461850", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "RF System Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461850/rf-system-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE (or relevant major) required. MSEE preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Intuitive understanding in one or all of the following areas: RF Transceiver Blocks, Communications theory, RF ParametersFamiliarity with RF/wireless test equipment and associated RF measurementsAbility to read and write clean, clear, efficient and understandable code in one or more relevant programming languages (C, C++, Python)Critical problem solving and debugging skillsAbility to break down complex problems and evaluate tradeoffs between proposed solutionsEnergy and aim to thrive in a start-up like environmentExcellent written and verbal communication skillsBSEE (or relevant major) required. MSEE preferred-  3+ Years of industry experience or equivalent-  Knowledgable of Object Oriented Programming and scalable software design principles-  Recent experience in developing test solutions for current and upcoming wireless RF standards (e.g. WiFi 802.11xx, Bluetooth 5.0, 5G, NFC, UWB).-  Recent experience developing new software applications or drivers-  Familiarity with tools that enable high volume manufacturing of these technologies-  Experience with data analytics is a plus", "jobDescription": "Do you have a passion for wireless technologies? Do you want to impact the wireless experience for billions of users? Come and join us! You will become part of a hands-on development team that furthers engineering perfection, creativity, and innovation with a prime focus on wireless accuracy and performance. Dynamic, encouraging people and innovative technologies are the norm here. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nYou will have the opportunity to contribute to the design and validation of RF and wireless systems across Apple’s newest products including iPhones, Watches, iPads and others. You will help advance a system that guarantees the most efficient, consistent wireless performance across all of Apple’s products in large volumes. To design such a system requires excellent fundamentals in wireless systems and communications theory as well as sound programming practices."}, "200459019": {"jobID": "200459019", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "iOS Software Engineer (AR/VR Applications)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459019/ios-software-engineer-ar-vr-applications?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "2+ years of experience developing iOS appsProficiency in a systems programming language, such as C/C++, Objective-C, Swift, etc.Experience using iOS frameworks like UIKit, AVFoundation, Core Motion, Core ML, CloudKit, SiriKit, StoreKit, etc.Experience with Unix development, daemons, cross-process communication, etcBS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceInterest or proficiency in UI/UX designFamiliarity with ARKit", "jobDescription": "The Technology Development Group (TDG) is looking for iOS Applications Engineers to help us build the next generation of interactive applications for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV). As a member of our organization you will assist us in crafting future products that will delight, inspire and empower millions of people."}, "200465898": {"jobID": "200465898", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Senior Data Scientist - Apple Maps Eval", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465898/senior-data-scientist-apple-maps-eval?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "PhD in Computer Science, Statistics, Physics, Operations Research, or similar quantitative domain; (will consider MS or BS with related experience)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "You have 4+ years experience with data analysis at web scale.You're experienced with at least one programming/scripting language (e.g., Python, Scala, Java).Your background includes at least one database language (e.g., SQL).You have strong communication and presentation skills.Nice-to-have ExperienceExperience writing Scala for automating analytic tasks at scale.You bring background in AB testing.You have prior industry experience with large data sets using technologies like Hadoop, Hive, and Spark.You have proven experience in information retrieval.Domain-specific knowledge of the mapping/transportation industry.PhD in Computer Science, Statistics, Physics, Operations Research, or similar quantitative domain; (will consider MS or BS with related experience).", "jobDescription": "Apple Maps is changing, and data is in the driver’s seat. Our mission is to build the best map in the world! We work in a dynamic data-focused environment where Data Scientists are given runway to own big projects and drive impact across the Maps organization.\n\nWe are looking for a talented, experienced Data Scientist to join our cross-functional team, focusing on the deep evaluation of Maps services and features. We work directly with the Engineering and Product teams responsible for quantifying, measuring and monitoring usage and user experiences across Maps platform. Our day-to-day work crosses many functional areas, including experiment design, AB testing, exploratory data analysis, generative analytics, data mining, and more."}, "200459955": {"jobID": "200459955", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Sr. Software Engineer, Data Management & Governance - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459955/sr-software-engineer-data-management-governance-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science/ Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Extensive professional software development experience building services at high scaleProficiency in Java requiredStrong ownership and track record of delivering results in a teamAbility to communicate with users and drive adoption, to troubleshoot and diagnose issues, and to work effectively with teams adopting our tools.Experience with database and Big Data technologies (SQL, NoSQL, Spark, Hadoop, Parquet)Experience with modern software engineering practices: Agile methodology, CI/CD, GitB.S. in Computer Science/ Engineering or equivalent experienceExpertise in the following areas is a huge plus but not required:• Awareness of data privacy and compliance regulations (GDPR, CCPA/ CPRA)• Knowledge of security practices (applied cryptography, data encryption at rest)", "jobDescription": "Apple is looking for an experienced Java engineer with hands-on experience developing highly available and scalable systems, as part of a friendly cross-geo team, towards the goal of meeting Apple’s belief that privacy and security are paramount."}, "200464718": {"jobID": "200464718", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "AIML - Machine Learning Engineer, MLR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464718/aiml-machine-learning-engineer-mlr?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. or M.S. in Computer Science (or related fields) or related fields or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expert in C++ and Python programmingExperience with CUDA programming, and/or High Performance ComputingExperience with distributed computingExperience maintaining an open-source projectExcellent communication skillsExperience and passion to circumvent unexpected roadblocksPast research experience is a plusB.S. or M.S. in Computer Science (or related fields) or related fields or equivalent experience.", "jobDescription": "As part of Apple’s Machine Learning Research organization, we do world-class scientific research and build the technologies that will power future products at Apple. The ML Research Team does world class research and development across a wide range of domains including understanding and improving ML, addressing bias and fairness in algorithms, privacy and federated learning, embodied and interactive ML systems, computer vision, and more. The techniques and tools we create will impact ML solutions across Apple, which in turn power most of the features we deliver to billions of consumers worldwide. The vast diversity of humans that interact with our technology expect and deserve features that work for them, not just for a select few — fairness is how we work to ensure that. A software engineer in this position will work with researchers across the Machine Learning Research group to build scalable, distributed training and research pipelines. Candidates will need strong communication skills to work with a diverse set of partners and customers to determine the right solutions for the problems. They will learn industry standard and custom tools/infrastructure to build these solutions. This work will directly benefit the researchers across the our team and all of Apple. We are looking for highly motivated, result-oriented engineers with a strong background in system engineering and software development to join our team. In this position you will help build and deploy software to solve a variety of high performance computing needs including large distributed ML training and research into large scale ML training."}, "200391864": {"jobID": "200391864", "origin_search": null, "posted": "Jun 14, 2022", "jobTitle": "ISE, Input Experience - iOS Software Engineer, Keyboard UI", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200391864/ise-input-experience-ios-software-engineer-keyboard-ui?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Engineering, Computer Science, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in building apps using Apple’s UI frameworksExperience with Objective-C, C, Swift, or C++ programmingExposure to modern software development standard methodologies, such as source control, unit testing, and debuggingFamiliarity with software optimization and performance measurement toolsAbility to effectively contribute to several concurrent projectsAbility to thrive in a highly collaborative environmentExcellent verbal and written communication skillsPassion to improve Apple’s productsPassionate about architecture and UIBachelor's degree in Computer Engineering, Computer Science, or equivalent experience", "jobDescription": "Are you passionate about helping people communicate all over the world? The iOS Keyboard is one of the most-used software applications on the planet and is used to type billions of messages every day. We build the keyboard and text editing experience for iPhone & iPad, including features such as QuickType, QuickPath, Emoji, AutoFill, etc. as well as text input technologies on all Apple platforms—iOS, macOS, tvOS, and watchOS—including frameworks and developer APIs. \n\nWe are looking for a creative and hardworking software engineer to help craft the next generation of Keyboard and Text Input experiences that are intuitive, personal, and inclusive of people all over the world, across many different languages and cultures, all while respecting each user’s privacy."}, "200392306": {"jobID": "200392306", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Estimation Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200392306/estimation-scientist?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in relevant location or estimation field (angle-of-arrival, WiFi, GPS/GNSS, Bayesian estimation, Computer Science, etc, or related field)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Deep theoretical and practical understanding of estimation, especially as it applies to localization (e.g., least squares, Kalman filter, robust estimation)Strong background in mathematical fundamentals, including geometry, linear algebra, and statistics.Strong software developer and prototyping experience in C++, Matlab/Python.Good understanding of location techniques, e.g., ranging, TOA, RTT, AOA, and TDOA.Experience in at least one of the following: indoor positioning, dead-reckoning, surveying, computer vision, or network adjustment.Experience with data analysis and testing.Understanding of Machine Learning/Deep Learning is a plusiOS, OS X, application, and/or unix system development a plusMS or PhD in relevant location or estimation field (angle-of-arrival, WiFi, GPS/GNSS, Bayesian estimation, Computer Science, etc, or related field)Interested in creating new technologies and solving the algorithmic challenges that come with it.Passion for actively learning new skills, techniques, and programming languages/libraries/frameworks.Desire to be exposed to all aspects of development; prototyping, planning, designing, productizing, launching, and scaling.Thrive in a collaborative environment and communicate effectively.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.", "jobDescription": "We live in a world where knowledge of the physical world around us is undeniably critical. We rely on this knowledge to get around, explore, and interact with devices around us. Apple is meeting those needs as robustly and creatively as possible and is interested in people who want to help meet that commitment. The success we strive for will result from very skilled people working in an environment that cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment you find intriguing, then let's talk.\n\nOur team uses radio signals such as Ultra-Wideband (U1) to develop features and experiences such AirTag precision finding, Handoff, Nearby Interaction API, and digital car key. We focus on innovating, building, and productizing new ways for our devices to be spatially aware of each other to enable new, more intuitive forms of interaction. We are a dynamic, collaborative group with a hands-on environment in the interdisciplinary areas of UWB/WiFi/BT localization, inertial fusion, network adjustment, and AI/ML. \n\nWe are looking for an enthusiastic and creative Estimation Scientist with a background in computer science, electrical engineering, or geomatics engineering to help craft the next generation of spatial awareness experiences leveraging Apple’s technologies."}, "200455366": {"jobID": "200455366", "origin_search": null, "posted": "Jan 4, 2023", "jobTitle": "AIML - Sr Engineering Manager, Siri Orchestration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455366/aiml-sr-engineering-manager-siri-orchestration?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$309,500,"}, "benefits": null, "requirements": "8+ years of software development experience3+ years managing engineering teams that design complex software engineering projectsDemonstrable experience leading cross functional projects which have had tangible impact to the direction of the orgAdvanced programming skills in Java, C++, Objective C or SwiftStrong examples of driving product feature end-end and shipping them to customersExcellent problem solving/critical thinking skillsStrong computer science fundamentals including familiarity with basic algorithmsBS/MS/PhD in Computer Science and EngineeringNice to have:Mobile software development experience is a huge plus!Experience in machine learning and natural language & understanding Experience with machine learning workflowsExperience working on conversational systemsApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Siri Runtime Platform team is looking for an exceptional engineering manager to help build next generation of Siri platform on Apple devices. As Apple continues to ship more devices, providing a consistent and cohesive Siri experience becomes very critical for our users. This is a rare and unique opportunity to define the strategy and roadmap for Siri platform to enable customer facing experiences from the ground up. These experiences will help power Siri and drive innovative experiences to our upcoming products!"}, "200212608": {"jobID": "200212608", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Health Sensing HW - Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200212608/health-sensing-hw-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "M.S. degree in electrical engineering, physics, or related field, or industry experience equivalent.\nMinimum of 3 years of relevant consumer electronics or research experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "3+ years of hands-on experience and proven track record in electrical or system hardware engineering.Strong electrical engineering background on analog, mixed signal, system design, simulation and modelingProficiency in SPICE, Matlab, Python, COMSOL, or similar simulation tools.Proficiency in data processing and analysis. Experience in automation and data engineering is a plus.Excellent written and verbal communication skills, as well as solid teamwork and leadership skills.Experience in system engineering, machine learning or firmware development is a plus.Experience in working with overseas manufacturers and vendors to drive failure analysis and streamline manufacturing is a plus.M.S. degree in electrical engineering, physics, or related field, or industry experience equivalent.\nMinimum of 3 years of relevant consumer electronics or research experience required.", "jobDescription": "The Health Sensing team conceives, designs, develops, and launches innovative and exciting health sensing technologies for Apple’s future products, while expanding an impactful new domain for the company.\n\nThe people on the team don’t just build products. They deliver inspiring technology and information to users on the most critical area of their lives - their health. Dynamic, smart people and inspiring, innovative technologies are the norm here, not to mention letters of how these features helped improve or save people’s lives.\n\nImagine what you could do here! \n\nThe position will be responsible for hardware design and development for health features, such as ECG, in the Apple Watch. The role’s responsibilities will encompass health sensing circuit and system design, simulation and modeling, data processing/analysis, failure analysis, validation, manufacturing support and laboratory work, along with crafting well-documented specifications, rationale, and test limits."}, "200466809": {"jobID": "200466809", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "AI/ML Next Generation Wireless Systems Research Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466809/ai-ml-next-generation-wireless-systems-research-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Research experience on solving interdisciplinary problems via technologies based on Artificial Intelligence and Machine Learning (AI/ML).Publications in prestigious machine learning conferences/journals such as ICML, NeurIPS, JMLR, ICLR, ACL, and CVPR.Solid mathematical foundation including Linear Algebra, Probability Theory and Statistics, Estimation Theory, and Information Theory.Working knowledge in Algorithms, Optimization, and Object Oriented Programming.Deep understandings of classical neural network architectures and learning methods such as CNN, RNN, Graph Neural Networks, Self-supervised Learning, Transformer, Federated Learning, Reinforcement Learning, and GAN.Experience on prototyping AI/ML concepts via hardware/software, model analysis, and developing varied perspectives to solve problems.Abilities to make independent contributions as well as promote team collaboration.Good programming and code management skills.Familiarity with ML frameworks such as PyTorch and TensorFlowBS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation wireless solutions by groundbreaking AI/ML techniques. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will experience the unique and rewarding opportunity to craft next generation wireless technologies that will generate deep impact on future Apple products and inspire global Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part in all Apple devices that delight our customers. In our unit, our mission is to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will participate on defining system level ideas, proposing, and developing innovative concepts & algorithms, performing sophisticated system simulations, and working on prototyping platforms to quickly prove your ideas for current and next generation (5G/6G) cellular systems via innovative AI/ML paths."}, "200466209": {"jobID": "200466209", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "AI/ML Next Generation Wireless Systems Research Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466209/ai-ml-next-generation-wireless-systems-research-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Research experience on solving interdisciplinary problems via technologies based on Artificial Intelligence and Machine Learning (AI/ML).Publications in prestigious machine learning conferences/journals such as ICML, NeurIPS, JMLR, ICLR, ACL, and CVPR.Solid mathematical foundation including Linear Algebra, Probability Theory and Statistics, Estimation Theory, and Information Theory.Working knowledge in Algorithms, Optimization, and Object Oriented Programming.Deep understandings of classical neural network architectures and learning methods such as CNN, RNN, Graph Neural Networks, Self-supervised Learning, Transformer, Federated Learning, Reinforcement Learning, and GAN.Experience on prototyping AI/ML concepts via hardware/software, model analysis, and developing varied perspectives to solve problems.Abilities to make independent contributions as well as promote team collaboration.Good programming and code management skills.Familiarity with ML frameworks such as PyTorch and TensorFlowBS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation wireless solutions by groundbreaking AI/ML techniques. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will experience the unique and rewarding opportunity to craft next generation wireless technologies that will generate deep impact on future Apple products and inspire global Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part in all Apple devices that delight our customers. In our unit, our mission is to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will participate on defining system level ideas, proposing, and developing innovative concepts & algorithms, performing sophisticated system simulations, and working on prototyping platforms to quickly prove your ideas for current and next generation (5G/6G) cellular systems via innovative AI/ML paths."}, "200451466": {"jobID": "200451466", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "SRAM Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451466/sram-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for applicants with work experience within a SoC design cycle, developing circuits and SRAM/Register File for low power, low voltage and high performance.Knowledge of Cache design/architecture, memory hierarchy is a huge plus.Working knowledge of RTL modeling.Solid understanding of industry-standard design tools.Deep understanding of nanometer device physics, leakage mechanisms, technology interactions with device behavior.Ability to devise experiments and analyze data for silicon debug.Machine Learning algorithms (ML) and scripting is a big plus.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? \n\nBe a part of a world-class silicon design team which delivered an incredible high performance M1 chip for our Mac line of products and chips for our flagship products (iPhone, iPad, Mac, Airpods, HomePod and Watch). \nAs part of our Digital Custom Group (DCG), you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the foundation that allows us to bring customers experiences they’ve never before envisioned!\n\nThis is a highly visible role at the heart of a silicon design effort, making a critical impact delivering products to market quickly. Your designs will strongly influence CPU / GPU / SoC / Neural Engine / Camera designs in Apple's Custom Silicon group."}, "200459480": {"jobID": "200459480", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Location Estimation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459480/location-estimation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Applicants should have a graduate degree in Engineering, Computer Science or a related field or a Bachelor’s degree with equivalent experience in positioning and Bayesian estimation."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proficient in Bayesian estimation concepts and Kalman filteringProficient in statistics concepts and statistical data analysisProficient in C++Familiar with modern object-oriented programming concepts and design patternsInterested in location technologies and eager to experiment with state-of-the-art techniquesGood collaborator and communicatorApplicants should have a graduate degree in Engineering, Computer Science or a related field or a Bachelor’s degree with equivalent experience in positioning and Bayesian estimation.Nice to have, but not requiredProficient in GPS / GNSS / radionavigation theory and technologyFamiliar with inertial navigation systemsExperience processing real-world data at scale, server-side, for example with Spark or HadoopComfortable implementing complex mathematical algorithms", "jobDescription": "Develop and improve multi-sensor navigation technology as a location estimation engineer. Craft the next generation of location-aware mobile experiences by working on state-of-the-art technologies to seamlessly integrate people’s digital and physical lives. Are you passionate about building technology that will make a difference? Do you flourish with good creative challenges? Do you love attention to detail? If so, we might just be the team for you."}, "200441916": {"jobID": "200441916", "origin_search": null, "posted": "Nov 4, 2022", "jobTitle": "Computer Vision Data Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441916/computer-vision-data-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or Masters in Computer Science, Electrical Engineering, Machine Learning, Computer Vision, Mathematics, or similar. Alternatively, a comparable industry career, with significant experience in large-scale data analytics."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Solid background in Data science, Data mining, Multivariate statistics, Computer vision or Machine learningExperience in building datasets for computer vision tasksExperience with in depth failure analysis of algorithmsStrong Python and Bash script experienceExperience working with and creating data structuresExperience with big data tools such as prestoProficiency in Jupyter/pandas/numpy/MatplotlibExperience in at least one major computer vision machine learning framework/library such as OpenCVAbility to analyze and debug complex algorithmsExperience presenting data to stakeholdersCreativity and curiosity for solving highly complex problemsExcellent verbal/written communication and collaboration skillsPhD or Masters in Computer Science, Electrical Engineering, Machine Learning, Computer Vision, Mathematics, or similar. Alternatively, a comparable industry career, with significant experience in large-scale data analytics.-  C++ knowledge or Matlab experience is a plus-  3D computer vision or cloud infrastructure experience is a plus", "jobDescription": "Do you have a passion for computer vision and deep learning problems?\n\nThe Video Engineering group is looking for a data scientist with a strong emphasis on deep system understanding through data analysis. In this role, you will collaborate with multiple teams (machine learning, quality assurance, cloud infrastructure support, user studies). We work on multiple, related projects requiring a bit of creativity and resourcefulness. You will be able to demonstrate your skills and expertise as we work together to innovate. We are an unusual team in how we operate, and we are looking for creative engineers, physicists, mathematicians, and anyone with room to grow to join us. We are unusual in the sense that our initial work was filling a gap between Face ID Algorithms, Quality Assurance, and User Studies, and we now continue to partner with other Video Engineering teams."}, "200456583": {"jobID": "200456583", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "ML Engineering Manager - ISP Algorithms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456583/ml-engineering-manager-isp-algorithms?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/Ph.D. in a relevant field with a minimum of 5 years or more of relevant machine learning work experience with an emphasis on research and development\n\n-  2+ years leading and running highly technical teams working on and developing machine learning models and technologies in camera imaging field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$299,000,"}, "benefits": null, "requirements": "Strong machine learning and deep learning fundamentals. Strong proficiency in Python and at least one major deep learning framework, hands on development experience up to dateConsistent track record of delivering machine learning solutions in camera imaging field with clearly defined customer facing image quality and video quality benefitSelf-motivated, self proactive; and passionate for image quality excellenceAbility to quickly (real-time) triage, prioritize, and lead multi-functional teamsDemonstrated experience of strong people management which includes hiring, mentoring, and leading high functioning development teamsEffective and clear communication and presentation skills, written and verbalBS/MS/Ph.D. in a relevant field with a minimum of 5 years or more of relevant machine learning work experience with an emphasis on research and development\n\n-  2+ years leading and running highly technical teams working on and developing machine learning models and technologies in camera imaging field-  Solid programming skills in C / C++, Matlab is a bonus-  Previous experience with network compression, quantization, performance and memory profiling and optimization", "jobDescription": "The ISP algorithm team in Video Engineering is seeking an ML Engineering Manager to lead low level ML algorithm research and development in video capture and rendering space. As part of the team, you will work on core camera and low-level vision technologies, using Apple’s leading real-time neural inference processor (Apple Neural Engine) and powerful custom image signal processing engine. You will have the opportunity to demonstrate your Machine Learning skills and expertise to help re-define and push the boundaries of image quality, to render outstanding still image and video quality. You also will have opportunity to work with Apple SOC team toward future generation of image / video processing HW.\n\nWe value people with a strong sense of ownership. Individuals who feel a personal stake in everything they do, thrive in fast-paced environments and enjoy working with complex technologies. You have self-starter attitude, know how to cultivate strong relationships, build trust, and work for the success of the entire team. We look forward to meeting you.\n\nOur close-knit team fosters an environment of product innovation, rapid product iteration and collaboration; both at team and multi-functional levels, granting you a liberating amount of autonomy. We work closely with various teams at Apple, like the Silicon Design, Camera HW, Camera SW and QA."}, "200410355": {"jobID": "200410355", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Mac OS/iOS Developer, Wireless", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200410355/mac-os-ios-developer-wireless?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor/Master Degree in Electrical/Computer Engineering or Computer Science or relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with Objective-C or Swift development on Apple platforms (macOS, iOS, etc.) requiredUnderstanding and ability to orchestrate core computer science conceptsBroad exposure to UI frameworks (UIKit, AppKit, CoreAutomation)Collaborative approach; experience with Git and Github/Bitbucket a mustExperienced in software development lifecycle, test methodologies and passion for quality processesAbility to develop and ship high quality software products on scheduleStrong Analytical, Problem solving and debugging skillsPrior experience with data cleaning, visualization, & reportingGood understanding of Analytics & Machine learning techniquesExcellent Communication SkillsYou are upbeat, adaptable, and results oriented with a positive attitudeBachelor/Master Degree in Electrical/Computer Engineering or Computer Science or relevant experience.", "jobDescription": "The people here at Apple don’t just build products they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\nImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\nIf you are passionate about software development, tools and automation we have the job for you. We are looking for a Software Automation & Tools Engineer, with a desire to \"automate all the things,\" and identify areas that can be vastly improved with automation, and provide well-documented, well-tested, and well-written software solutions.\nYou will join the Carrier Technologies team within the Wireless Software and Technologies Engineering organization and drive innovation that matters. We are responsible for successful launches of Apple Products on Wireless Operator Networks worldwide."}, "200445734": {"jobID": "200445734", "origin_search": null, "posted": "Nov 29, 2022", "jobTitle": "Neural Rendering Research Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445734/neural-rendering-research-scientist?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD in computer vision, computer graphics, machine learning, or a related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong publication record at top conferences such as CVPR/ECCV/ICCV/SIGGRAPH/NeurIPS.Solid foundation in 3D geometry and deep learning.Good experience in Python and deep learning frameworks (PyTorch or similar).Excellent problem solving and analytical thinking skills.Ability to drive early-stage research projects with risks and ambiguity.Communication and collaboration skills in a cross-functional setting.Bonus for experience in neural rendering and 3D graphics.PhD in computer vision, computer graphics, machine learning, or a related field.", "jobDescription": "The Neural Rendering Research Team’s mission is to build fully immersive 3D experiences in AR/VR. We believe neural rendering will be the foundational enabler for these experiences in the next decade. As an applied research team, we lead neural rendering research at Apple with a practical focus, developing and exploring cutting-edge algorithms for applications such as reconstruction, view synthesis, animation, editing, and auto-generation of photorealistic 3D scenes and avatars. We push the state-of-the-art, create demos to executive leadership, and publish to top-tier conferences. We were among the first in the industry to deploy neural rendering techniques in production, and we aim to expand the impact to the daily experiences of millions of Apple users in the future."}, "200442275": {"jobID": "200442275", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "AIML - Senior Engineering Manager, Cloud Infrastructure (ML Platform & Infrastructure)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442275/aiml-senior-engineering-manager-cloud-infrastructure-ml-platform-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced degree in Computer Science, Electrical Engineering, or equivalent software engineering experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$299,000,"}, "benefits": null, "requirements": "You have designed, operated, and implemented externally facing Cloud deployed applications and infrastructure at a very large scale and you will be well-versed in the operation of complex architectures.You know distributed systems and how to avoid engineering yourself into a corner through innovative design.You realize you can accomplish more with an open mind than you can by dictating architecture. You will have to understand historical architectural choices and drive the “right” changeYou are an authority at partnering with and guiding senior staff-level engineers to do their best work.Advanced degree in Computer Science, Electrical Engineering, or equivalent software engineering experience• 8+ years of engineering management/leadership experience• Prior production large-scale experience for external facing applications and services• Expertise with cloud computing services (AWS, GCP) and Kubernetes-based deployments• Experience with Modern Observability tooling (Prometheus, DataDog, Splunk, Jaeger, Grafana, etc)• Track record of cross-functional leadership fostering good engineering practices, respect at all levels, and inclusivity• Track record as a manager building teams and the careers of your direct reports• Show experience in mentoring and coaching and having a people-focussed mindset• Experience building, supporting, and maintaining full-stack deployments• Experience working with and leading globally dispersed teams• Strong experience with large complex data ecosystems• You understand and have exposure to high scale, highly available 4 9’s systems• You are a change agent for good• Proven track record of understanding what matters and the ability to identify the “important work”", "jobDescription": "As a senior engineering manager, you will help build on our Cloud Infrastructure practice at Apple within the ML Platform & Infrastructure (MLPI) and AIML. You will be responsible for the existing team and growing the program. The AIML Cloud Infrastructure team is responsible for the core infrastructure that Apple AIML properties run on, this includes Siri and Search The team provides tools, scaling strategies, deployment mechanisms, best practices, and multi-cloud support as both a service and consultants to leadership. The team will additionally have a heavy focus on cost control and efficiencies across properties.\n\nAs our applications and systems become more sophisticated our user experience becomes paramount and a partnership with our observability, services, security, and privacy teams will be a part of your charter. You will be a direct link between developers and our customers so a focus on understanding how code and infrastructure make or break customer experience will be a focus. \n\nWe are looking for a best-in-class leader who can move between engineering lead and cross-functional seer who can identify gaps and bring together teams to focus on improving our applications and services through efficient scalable infrastructure and driving results."}, "200442272": {"jobID": "200442272", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "AIML - Senior Engineering Manager, Cloud Infrastructure (ML Platform & Infrastructure)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442272/aiml-senior-engineering-manager-cloud-infrastructure-ml-platform-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced degree in Computer Science, Electrical Engineering, or equivalent software engineering experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$269,000,"}, "benefits": null, "requirements": "You have designed, operated, and implemented externally facing Cloud deployed applications and infrastructure at a very large scale and you will be well-versed in the operation of complex architectures.You know distributed systems and how to avoid engineering yourself into a corner through innovative design.You realize you can accomplish more with an open mind than you can by dictating architecture. You will have to understand historical architectural choices and drive the “right” changeYou are an authority at partnering with and guiding senior staff-level engineers to do their best work.Advanced degree in Computer Science, Electrical Engineering, or equivalent software engineering experience• 8+ years of engineering management/leadership experience• Prior production large-scale experience for external facing applications and services• Expertise with cloud computing services (AWS, GCP) and Kubernetes-based deployments• Experience with Modern Observability tooling (Prometheus, DataDog, Splunk, Jaeger, Grafana, etc)• Track record of cross-functional leadership fostering good engineering practices, respect at all levels, and inclusivity• Track record as a manager building teams and the careers of your direct reports• Show experience in mentoring and coaching and having a people-focussed mindset• Experience building, supporting, and maintaining full-stack deployments• Experience working with and leading globally dispersed teams• Strong experience with large complex data ecosystems• You understand and have exposure to high scale, highly available 4 9’s systems• You are a change agent for good• Proven track record of understanding what matters and the ability to identify the “important work”", "jobDescription": "As a senior engineering manager, you will help build on our Cloud Infrastructure practice at Apple within the ML Platform & Infrastructure (MLPI) and AIML. You will be responsible for the existing team and growing the program. The AIML Cloud Infrastructure team is responsible for the core infrastructure that Apple AIML properties run on, this includes Siri and Search The team provides tools, scaling strategies, deployment mechanisms, best practices, and multi-cloud support as both a service and consultants to leadership. The team will additionally have a heavy focus on cost control and efficiencies across properties.\n\nAs our applications and systems become more sophisticated our user experience becomes paramount and a partnership with our observability, services, security, and privacy teams will be a part of your charter. You will be a direct link between developers and our customers so a focus on understanding how code and infrastructure make or break customer experience will be a focus. \n\nWe are looking for a best-in-class leader who can move between engineering lead and cross-functional seer who can identify gaps and bring together teams to focus on improving our applications and services through efficient scalable infrastructure and driving results."}, "200463912": {"jobID": "200463912", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Sr Software Engineer, ML Systems Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463912/sr-software-engineer-ml-systems-engineering?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS in Computer Science or equivalent practical experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of experience building production software systems within large engineering projects for consumer products on mobile SoCs, specially iOS devicesHands-on experience with at least one compiled language (C/C++/Objective-C, Swift, Go, Java, Rust, etc.), and multi-threaded applicationsFamiliarity with modern mobile development frameworks (e.g., Flutter, Xamarin, Swiftic) and tools (e.g., IoC/DI, analytics, A/B testing, CI-CD and build systems like Bit, Buck, Bazel)Excellent written and verbal communications skillsMS in Computer Science or equivalent practical experienceExperience with profiling and tracing toolsFamiliarity with Core ML, Apple's framework for deploying ML models on iOS devicesExperience with Model Compression techniques (Quantization, Pruning, Distillation)Experience with PyTorch Mobile, Tensorflow Lite or other similar Edge Inference frameworksExperience with techniques to offload compute to GPU, DSP etc.Experience developing Machine Learning models, especially for resource constrained computing environments", "jobDescription": "At Apple, creative ideas grow into extraordinary products, services, and customer experiences. Here is your opportunity to be part of an incredible engineering team building features to surprise and delight customers on the iPhone, Mac, Apple Watch, iPad, and more.\n\nProactive Intelligence aims to deliver phenomenal personalization features using machine learning systems that run on-device in Apple platforms for high performance and to protect user privacy. We are looking for inquisitive and creative software engineers who will design & build software that enables us to train, deploy, and monitor state of the art machine learning models on resource-constrained edge devices. Experience with embedded programming and designing software that is easy for others to extend and use will broaden your role and effectiveness in this position."}, "200463409": {"jobID": "200463409", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Manager, Data & Analytics - Apple Retail Online", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463409/manager-data-analytics-apple-retail-online?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced degree in a quantitative field, such as statistics, applied social sciences, engineering, or mathematics."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$157,000", "max": "$276,000,"}, "benefits": null, "requirements": "Ability to build and operate a center of excellence team to deliver business insights at scale using the latest data architecture & re-usable analytics assets for broader consumption within team.Expert level knowledge of applied regression techniques including, but not limited to: Linear, Logistic, Mixed models, Distributed Lags, Time Series, GLM & Simultaneous Equations.Experience with big data computing and machine learning techniques (e.g., Spark, Hadoop, Scikit-learn in Python, etc.).Experience with advance analytic solutions focused on performance measurement, customer insights & media planning (attribution, forecasting, base & incremental analysis, market basket analysis, purchase probability, etc.).Expertise in the development of marketing mix models to analyze and simulate the incremental impact of digital and offline marketing.You can conceptualize and deploy the analysis to measure interaction effects of various marketing channels during product launches, promotions and business as usual time periods.Demonstrated proficiency in synthesizing sophisticated analysis into simple, meaningful and measurable insights.Validated ability to be effective in virtual team leadership, and leading through influence. Outstanding collaborator.Experience building, motivating, developing and encouraging a team.Consistent track record of initiating and leading cross-functional and cross-organizational projects, building relationships with partners, and influencing decision makers.Strong verbal and written communications skills.Outstanding ability to problem solve, develop creative solutions, and demonstrate resourcefulness, while maintaining utmost attention to detail.Experience supporting eCommerce and Digital Marketing partners.Advanced degree in a quantitative field, such as statistics, applied social sciences, engineering, or mathematics.-  10+ years of experience in the Marketing Science & Advance analytics space.-  5+ years of experience with big data computing and machine learning techniques-  5+ years of people management experience.", "jobDescription": "The people here at Apple don’t just create products — we build the kind of wonder that has revolutionized entire industries. It’s the diversity of our people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it!\n\nJoin Apple Retail as a key member of the Apple Online team, reporting to the head of Retail Online DE&E Analytics. As the Manager of Online Data & Analytics, you will lead a team of Data Scientists, Data Architects and Data Engineers that are responsible for supporting the Apple Online business and marketing teams, as well as the broader Retail Stores organization with outstanding data driven insights."}, "200462115": {"jobID": "200462115", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "ISE, Special Projects - Sr. Machine Learning Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462115/ise-special-projects-sr-machine-learning-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Masters or PhD in Machine Learning, Natural Language Processing, Computer Vision, Computer Science or related field with 4+ years experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong and proven research and software development skillsDeep understanding of machine learning conceptsExperience delivering consumer-facing solutions to new industry problems at scaleProficiency in C, C++ or PythonExperience with and knowledge of a wide variety of machine learning libraries/ packagesCreative, collaborative, and product-focusedExcellent communication skillsMasters or PhD in Machine Learning, Natural Language Processing, Computer Vision, Computer Science or related field with 4+ years experience.", "jobDescription": "Are you passionate about user experience? Do you enjoy rapidly exploring and iterating new, sometimes astonishing, ideas? The Intelligent System Experience Special Projects team explores and prototypes new, novel, and paradigm shifting ideas in system experience, with emphasis on motivating future technologies in computer vision, machine learning, natural language processing, input, sense, and system intelligence.   \n\nWe are a new and growing team. This is an exciting time to join and have impact across our entire portfolio. We are especially looking for people who love to collaborate across subject areas and teams, and are motivated and inspired by the potential to help shape the future of system experiences across the entire Apple ecosystem."}, "200458815": {"jobID": "200458815", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "AIML - Platform Engineer, Siri Understanding", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458815/aiml-platform-engineer-siri-understanding?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. OR M.S. IN COMPUTER SCIENCE, OR EQUIVALENT EXPERIENCE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with one or more scripting languages Python and Perl Working familiarity with programming such as C++, Objective C, Java, etc.Proven troubleshooting and debugging skills: analyze and investigate test failures, errors, and build issuesExperience with developing large scale data pipeline; working on machine learning pipeline is a plusExpert knowledge of Linux OS and shell environment such as BASHExperience working in a continuous delivery pipeline using job scheduling tools such as TeamCity or JenkinsB.S. OR M.S. IN COMPUTER SCIENCE, OR EQUIVALENT EXPERIENCE", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Build groundbreaking technology for large scale systems, spoken language, machine learning, and artificial intelligence. Work with the talent dense team who crafted the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri team at Apple."}, "200466534": {"jobID": "200466534", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "AIML - Platform Engineer, Siri Understanding", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466534/aiml-platform-engineer-siri-understanding?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. OR M.S. IN Computer Science, or Equivalent Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with one or more scripting languages Python and Perl Working familiarity with programming such as C++, Objective C, Java, etc.Proven troubleshooting and debugging skills: analyze and investigate test failures, errors, and build issuesExperience with developing large scale data pipeline; working on machine learning pipeline is a plusExpert knowledge of Linux OS and shell environment such as BASHExperience working in a continuous delivery pipeline using job scheduling tools such as TeamCity or JenkinsB.S. OR M.S. IN Computer Science, or Equivalent Experience", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Build groundbreaking technology for large scale systems, spoken language, machine learning, and artificial intelligence. Work with the talent dense team who crafted the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri team at Apple."}, "200460707": {"jobID": "200460707", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Sr. Camera ISP Algorithms Prototyping Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460707/sr-camera-isp-algorithms-prototyping-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD in imaging fields, or PhD in a non-imaging field but with deep practical camera imaging experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "PhD in imaging fields, or PhD in a non-imaging field but with deep practical camera imaging experience10+ years imaging industry experienceAbility to independently perform rapid algorithm formulation from open-ended problem descriptionsBackground/experience in ISP pipeline and consumer camera developmentBackground in human visual processing and modeling, and ability to apply it on practical solutions to difficult imaging problemsSelf driven and passionate for both camera technologies as well as prototyping and productization of themAbility to learn quickly and become familiar with multiple different technology areasAlgorithm prototyping in Matlab requiredA strong plus would be Python or C/C++ experience, or willingness to pick up and work on on-device C/C++ prototypingPhD in imaging fields, or PhD in a non-imaging field but with deep practical camera imaging experience", "jobDescription": "Apple's Camera algorithm team is looking for extraordinary algorithm prototyping engineers to work on the prototyping of image capture and processing/rendering algorithms that serve all Apple product cameras. As part of the team, you will work on camera/ISP/Machine learning technologies based on Apple crafted image signal processing pipeline and HW components, such as the Apple Neural Engine. Here you will have the chance to define the way the Apple camera captures, processes, and renders outstanding still image and video quality. Our close-knit team fosters an environment of algorithms innovation, rapid product prototyping, and collaboration at both team and multi-functional levels. We work closely with various teams, such as Silicon Design, camera hardware, camera software and QA. Our team environment is multifaceted, fast-paced and requires a self-starter attitude."}, "200188526": {"jobID": "200188526", "origin_search": null, "posted": "Aug 27, 2020", "jobTitle": "SW Development Engineer – Instrument Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200188526/sw-development-engineer-instrument-engineering?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS EE or CS required, MS EE or CS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent fundamentals and proven track record of developing applications in one or more of Swift, C++, Objective-C, Python, Ruby, Java ScriptRelevant experience of Object Oriented Analysis & Design (OOAD) concepts & scalable software design principlesRelevant experience of SW test techniques and methodologiesGood working knowledge of RF fundamentalsEnergy and drive to succeed in a start-up like environmentBasic understanding of a Wireless standard3+ years of industry experience or equivalentRecent experience in any of the following areasDeveloping and deploying distributed software systemsDeveloping new software applications or drivers on any platformRelational and/or Non-Relational databasesMachine learning/data analyticsWeb technologies/Web application developmentExperience of Unix Server administration.Basic knowledge of RF lab equipment including: spectrum analyzers, vector signalgenerators, power sensors, switch controllers, combiners, etc.BS EE or CS required, MS EE or CS preferred", "jobDescription": "We strive to optimize the quality of Apple’s newest products through use of automation, analysis and robotics. We are looking for an experienced Software Engineer, capable of delivering high quality bespoke software solutions in a fast paced environment, to join our team."}, "200461803": {"jobID": "200461803", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "AI/ML - Sr. Software Engineer, ML Systems Evaluation Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461803/ai-ml-sr-software-engineer-ml-systems-evaluation-engineering?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA in Computer Science or equivalent experience required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "6+ years of proven expertise in software development with Java, Python, Swift or Objective-CExperience working on large scale products and leveraging cross-functional partnershipsAbility to independently learn new technologies in a fast paced environmentUnderstanding of an ML-based product lifecycleExperience with analyzing user behavior and designing test strategies, automation frameworks is a plusDemonstrated depth of knowledge and application of statistics-based evaluation methodologies or user success metricsExperience with automation fixtures, robotics and lab environments a plus.BS/BA in Computer Science or equivalent experience required", "jobDescription": "Do you want to play a part in building a groundbreaking technology for large scale systems, natural language, big data, and artificial intelligence? Do you want to improve the user experience of Siri and other AIML products that help millions of people get things done, across the globe? Join the ML Systems Evaluation Engineering (ML SEE) team at Apple! Be part of a highly accomplished team which evaluates AIML products, that will delight and inspire millions of people.\n\nYou will lead the quality initiatives of AIML products and collaborate with the most innovative product development teams in the world. This team designs and builds evaluation tools, automation frameworks and methodologies that enable product teams across Apple to develop machine-learning solutions that power amazingly intelligent user experiences. You will engage with exciting new-product teams around Apple, bringing your expertise and passion for innovation to solving technical problems for our next-generation products."}, "200204012": {"jobID": "200204012", "origin_search": null, "posted": "Oct 4, 2022", "jobTitle": "Vision Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200204012/vision-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Ph.D. in Vision Science, Psychology, Imaging, Color, Computer Science, Optometry or Optics"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Deep and broad knowledge of human visionStrong background in mathematical/computational modeling of visionExperience in design, conduct, and analysis of human perception experimentsKnowledge of linear systems theory, Fourier analysis, and digital filteringProficiency in Mathematica, MATLAB or similar simulation and modeling toolsBasic understanding of digital imaging and display software and hardwareStrong analytical & critical thinking and problem-solving skillsExcellent written and verbal communication skills in EnglishPh.D. in Vision Science, Psychology, Imaging, Color, Computer Science, Optometry or OpticsThese would be desirable, but are not a requirement:Understanding of human visual optics and their relation to visual experienceEngineering background in digital image processing, color processingFamiliarity with optometric methods, procedures and practiceExperience with Psychophysics Toolbox, PsychoPy, QUEST+, or similar toolsExperience with eye-tracking technologyExperience in developing apps for iOS", "jobDescription": "The Vision Group is looking for a hardworking vision scientist to support the development of ground breaking imaging and display solutions and technologies for future Apple products. \n\nThis position is passionate about the development, prototyping, and flawless execution of technologies to enable the best front-of-screen user experience of Apple products including iPhone, iPad, Watch, Mac and more. The team features a highly collaborative and hands- on environment that cultivates scientific and engineering perfection, creativity, and innovation in the interdisciplinary areas of vision science, image processing, color science, neuroscience, and optics."}, "200458799": {"jobID": "200458799", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "AIML - Software Development Engineer in Test, ML Systems Evaluation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458799/aiml-software-development-engineer-in-test-ml-systems-evaluation?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S or M.S in Computer Science, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "7+ years of proven ability to define/design/develop/maintain end-to-end as a SDET or SDE to support automation using any combinations of Swift (XCTest), Objective-C, Python or JavaSolid proven ability to define/design/execute/maintain product evaluation planning with clear quality metricsExperience with CI/CD automation and deployment tools such as TeamCity, Jenkins, Docker, Kubernetes + Git, GitHubExperience in logging and debugging tools i.e., Grafana, Splunk, shell scriptingExperience working on embedded devices as well as how those devices work across massively distributed systemsExcellent written and verbal communication and interpersonal skills, including achieving team goals, negotiation and getting stakeholder buy-in.B.S or M.S in Computer Science, or equivalent experienceAdditional languages such as Shell, Javascript are recommendedExperience with Apple ecosystem. Experience with iOS, macOS development, XcodeExperience with troubleshooting automation runs in 24/7 lab environment", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Build groundbreaking technology for large scale systems, natural language, big data, artificial intelligence. Partner with the people who built the intelligent assistant that helps millions of people get things done — just by asking.\n\nCome join the Machine Learning System Evaluation Engineering team at Apple. We are a diverse, international and passionate group about quality engineering and crafting innovative test and automation strategies to help us understand the quality of Siri while every part of the system is advancing.\n\nWe are looking for highly motivated Software Engineer who can own and drive test planning and automation development for to join our team. Join the team responsible for ensuring the quality of Siri languages across all Apple Products, and other cloud based services."}}