{"200462437": {"jobID": "200462437", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Triage Engineer, AR/VR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462437/triage-engineer-ar-vr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science, or equivalent degree—and 5+ years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Technical and Debug Expertise: Have great problem-solving skills, analytical, tools & development experience, and ability to evaluate and identify issues at a code level. Familiarity with Swift, Python, Javascript or other scripting/coding languages is key—preferably low-level experience with C/C++Customer focused: Passionate about the customer experience and how we can improve itPriority driven: Comfortable working in a continually changing, fast-paced environment and driving top issues to resolutionTechnically agile: Ready to deep dive into technical areas daily, but also discuss and represent these topics to a non-technical audienceGreat communicator: Excellent written/verbal skills, able to summarize key points and tie them back to product quality. Able to work with others to cut through ambiguity and to figure out how to bring issues to resolutionWorking with others: A history of working with cross-functional teams to ensure successful products. Able to work with other groups to improve quality and set priorities. Able to influence even without direct authorityInnovation: Able to bring creativity to engineering, leading development of new and better ways of testing, automation, and other improvementsBS/MS in Computer Science, or equivalent degree—and 5+ years of industry experience", "jobDescription": "Would you like to make an impact on the quality of Apple’s products? We’re looking for a passionate Triage Development Engineer to work on tool development and triage engineering on some of Apple's most advanced emerging technologies, including augmented reality (AR) and virtual reality (VR). As part of TDG, you’ll work cross-functionally to build tools, systems, and use engineering analysis to solve challenging debug problems and improve system debug-ability. You’ll be working in a dynamic environment, facing exciting new challenges daily. You have strong communication and interpersonal skills, problem-solving skills, curiosity, debugging and/or white box experience and attention to detail."}, "200443814": {"jobID": "200443814", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "PHY Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443814/phy-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be essential for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc..Knowledge of cellular communication standards: 5GNR, 4G LTE, 3G (HSPA), 2G GSM.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? We are searching for a talented engineer with years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200448953": {"jobID": "200448953", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "IC Package Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448953/ic-package-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for someone with experience in Semiconductor Packaging Design, Process & Technology DevelopmentGood understanding of cross-functional packaging areas: Si floor plan, package layout and architecture, enabling process technologies, thermal, mechanical, SI/PI, material, component & system level reliability, testing, and FAKnowledgeable in advanced packaging technologies: Knowledge and insight to deliver high density / high performance interconnects in various form factor, thermo-mechanical, reliability, and cost constraintsExcellent problem solving with strong physics and fundamentalsExcellent communication skills that enable the candidate to work well with internal cross functional teams and overseas suppliersMulti-functional coverage on package layout (Cadence APD/Allegro), critical signal integrity / power integrity, thermal, design rules, BOM, design for manufacturing, reliability, and costAbility to work independently and take on projects with minimum supervisionAbility to lead and manage teamsKnowledge of Cellular packaging and systems a plus-BS and +10 years of relevant industry experience", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! We are looking for a hardworking, and passionate IC Packaging Engineering Lead to join our team."}, "200450254": {"jobID": "200450254", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless RF Compliance Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450254/wireless-rf-compliance-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline +0 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Working experience of antenna design and tests, in particular hands-on experience for compliance measurements is desirable.Working Experience with different wireless communication systems such as GSM/UMTS/LTE, 802.11xx, Bluetooth etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working Experience with regulatory requirements and certification process for wireless consumer devices, including FCC, PTCRB, CTIA, ETSI, 3GPP etc.Excellent communication skills required, both written & verbal.Experience with 5GmmWave standard and/or hands-on chamber/system level understanding is a plus.Experience with Antenna/EM simulation tools is a plus.BS degree in technical discipline +0 years of experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple SAR Engineering team is looking for an engineer to work on RF Exposure (SAR/MPE) characterization across different wireless technologies for Apple’s wireless products"}, "200463847": {"jobID": "200463847", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch EE Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463847/iphone-touch-ee-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "•Bachelor’s degree + 2 years of experience\n•Master’s degree in Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Strong electrical engineering background in board-level analog and mixed-signal design.Demonstrated experience in all phases of circuit design, development and validation.Schematic design and layout experience (SPICE or Cadence experience a plus).Circuit simulation experience (LCR extraction, signal integrity, etc.).Proficient with using lab equipment (DMM, SMU, Oscilloscope, etc.).Proficiency in MATLAB and Python scripting tools.Excellent written and verbal communication skills and solid teamwork.•Bachelor’s degree + 2 years of experience\n•Master’s degree in Electrical Engineering", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including Electrical Engineering, Manufacturing process, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200459872": {"jobID": "200459872", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Analog Mixed Signal Micro Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459872/analog-mixed-signal-micro-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You should have architecture, design, and production expertise in the following areas:High-speed wireline transceiver architectures and circuits. High-speed memory interface architectures and circuit.High-speed data converter architectures and circuits. Ultra-low-power analog circuits.Digitally-assisted analog circuits.You should be highly skilled in the following areas:Matlab/Simulink/Verilog A modeling.Data converter architectures and design trade-offs. Low-power and high-precision analog techniques.Architect circuit solutions that achieve challenging noise, linearity, power consumption, and silicon area requirements.AMS design flows and chip assembly techniques.Working with design, layout, and production test engineers.Excellent communication skills is a huge plus.BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented Architect. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Architect low-power high-performance AMS solutions."}, "200458743": {"jobID": "200458743", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Formal Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458743/formal-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Interest in learning and becoming an expert in SoC/CPU/GPU/Cellular designs, VLSI, and digital logic design and verification techniquesDetail oriented mindset and desire to overcome challenges is requiredBS and a minimum of 3 years relevant industry experience.-  Formal Method or Formal Verification technologies experience and abstraction techniques-  Knowledge and experience in interpreting hardware specifications and using-  Temporal logic assertion-based languages such as SVA or PSL-  Experience in using EDA formal tools and tool development experience is a plus-  Proficiency in any scripting language with excellent debugging skills-  Extraordinary teammate with excellent interpersonal skills-  Passionate about developing world-class/innovative formal verification solutions", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nLearn from the best Formal Verification team in the world and acquire experience being at the center of a System-on-a-chip (SoC) design verification effort collaborating with design. Are you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly."}, "200402471": {"jobID": "200402471", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "CAD Librarian", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200402471/cad-librarian?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor of Science in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum 5 years working knowledge of Cadence Schematic Capture, Allegro PCB Board Design and Symbol EditorMinimum 5 years of experience working with CAD librariesMechanical background is a plusExperience in 3D modeling is a plusBasic drafting skills is a plusBachelor of Science in Electrical Engineering or equivalent", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry- leading environmental efforts. Are you up for the challenge?\n\nWe are seeking qualified candidates for an ECAD Librarian to support all projects in development at Apple. The successful candidate will be the primary focal point for leading library development activities. Will be working very closely with Electrical Engineers, Component Engineers and Multi-functional groups such as DFM, ICD, PD and MCAD to ensure high reliability of the library. Additionally, this candidate will chip in to the evolution of the design process and tools as our organization continues to grow and will be part of testing and evaluating new tools or tools features.\n\nCome join us!"}, "200370039": {"jobID": "200370039", "origin_search": null, "posted": "May 19, 2022", "jobTitle": "Opto-Mechanical Process Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200370039/opto-mechanical-process-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Mechanical Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Optomechanical background with strong working knowledge of high precision alignment process development of imaging optical assemblies.8+ years of experience designing and deploying high precision assembly tools and processes for optical/imaging devicesExperience in design of high precision alignment mechanisms, motion control systems, automated dispensing.Knowledge of image processing, MTF, contrast, geometric distortion, etc.Experience working with equipment vendors and contract manufacturersExperience in designing for low particle environments/cleanroomsBS or MS in Mechanical Engineering or equivalent experience-  Travel is required ~25%", "jobDescription": "Apple is looking for optomechanical process engineer to join Panel Process and Optics (PPO) module team.  Engineers in the PPO-module team are responsible to develop new innovative manufacturing process technologies and equipment system designs to solve complex design challenges that have direct impact to future product, quality, and delivery of Apple Displays & Touch. This will be a technical lead role where the individual in this role will work closely with product design engineers, optical design engineers, software developers, project managers, validation engineers, operations, and suppliers to develop methods / stations / tools to support display module assembly and calibration from the concept/architecture definition stage through product engineering validation builds. We work at a fast pace and require everyone to be highly self-motivated. The individual should demonstrate strong ability to continuously develop personal knowledge and expertise in new technology for optical device calibration, assembly process design, manufacturing, and scalability."}, "200423388": {"jobID": "200423388", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Engineering Program Manager, OS Security", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200423388/engineering-program-manager-os-security?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's/Master's Degree or equivalent work experience in project management"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Self-motivated and proactive with demonstrated creative and critical thinking capabilitiesAble to focus and simplify, balancing the details with the high-level goalsExceptional verbal and written communication skillsAbility to filter and distill relevant information for the right audienceProven ability to work effectively with and influence multiple stakeholders across a highly-matrixed, cross-functional organizationPast experience in defining processes and executing on themProject management experienceBachelor's/Master's Degree or equivalent work experience in project management", "jobDescription": "Apple’s Software Program team is looking for a motivated Project Manager to drive forward security engineering initiatives. Security is at the heart of each of the products that Apple ships and gives our customers confidence when using their devices. We are searching for an individual with strong communication and project management skills. You will work with and influence colleagues across Apple to implement new features and ensure security continues to be at the forefront of our software.  You will join a team of project managers committed to and passionate about driving forward our security technologies. As security is integral through the entire software stack, you will have the opportunity to work with a wide variety of engineering teams.\n\nAs an Engineering Project Manager (EPM) on the team, we’ll help you grow your autonomy here and invest your time into the most promising areas to make a difference. You will be able to see your impact on every product Apple makes, and watch your impact grow with your career here."}, "200461424": {"jobID": "200461424", "origin_search": null, "posted": "Feb 11, 2023", "jobTitle": "iOS Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461424/ios-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years experience as a software developerExpert in Swift and PythonProficient in DjangoExperience with XCTest frameworkExcellent object-oriented designFamiliarity with computer system architectureMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you.", "jobDescription": "At Apple, our products touch millions of lives every single day with consistency and dependability. Ever wonder how we achieve this? \n\nOur System Architecture & Design team is a group of interdisciplinary performance architects and expert content creation professionals who explore real production workflows and discover opportunities to enhance and improve customer experiences on current hardware and software. \n\nThe iOS Developer role requires a broad knowledge of system architecture from a hardware and software perspective. You must be skilled in solving sophisticated problems and work on evaluating and improving the performance of Mac systems under development. Responsibilities in this role will include but are not limited to, developing system automation, frameworks, and tools used to measure and analyze performance. You will support existing automation environments and integrate new internally and externally developed benchmarks, applications, and analysis tools used for analyzing hardware and software performance. \n\nIf this role sounds like a fit, we would love to hear from you!"}, "200451410": {"jobID": "200451410", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451410/cpu-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceStrong electrical engineering fundamentals in logic design, digital circuits, and deep sub-micron technology along with timing, power, and area implicationsProficiency in using industry standard logic Synthesis, PnR, STA and Power analysis tools along with floor-planing, physical design partitioning, and timing budgeting knowledge to converge complex designsKnowledge of low power and high frequency design techniquesFamiliarity with high performance CPU microprocessor architecture and memory sub-systemBasic scripting/programming skillsAbility to work independently and/or lead a physical design partition in collaboration with x-functional teamsExcellent communication and interpersonal skillsMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level implementation."}, "200449030": {"jobID": "200449030", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics (GPU) RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449030/graphics-gpu-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + Minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for minimum of 3 years of relevant experience and the below:Deep understanding of the design and analysis of hardware and software graphics pipeline.Expertise in performance measurement and analysis of GPU micro-architectureKnowledge of logic design principles along with timing and power implications and an understanding of low power microarchitecture techniquesProficiency with vendor synthesis tools and understanding of PNR flowExpert knowledge of System Verilog hardware description languageGeneral knowledge of computer architecture and SIMD architecturesGPU RTL experience preferredBS + Minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In this highly visible role, team members will develop power efficient, high performance 3D graphics processor microarchitectures targeted for low power mobile devices and high-performance personal computers."}, "200459129": {"jobID": "200459129", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "SoC Audio Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459129/soc-audio-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "We'd like you to have:Experiences in low power digital IP related designProficiency in ASIC logic design and SoC integrationSystem architecture knowledge including one or more of the following:Bus fabric, especially APB/AHB/AXITiered memory systemsSystem debug architectureSerial communications like UART/SPI/I2C, etc.Hands-on skills in Shell and Perl scripting, Python is a plusPerformance analysis experience desirableEmbedded firmware development knowledge would be an advantageStrong skills in solving complex problems on the flyExcellent communication for collaboration across different functionsBS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. In this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}, "200459741": {"jobID": "200459741", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Salesforce Business Analyst & Admin", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459741/salesforce-business-analyst-admin?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor's degree or equivalent experience required.\n- Master's Degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$128,000", "max": "$196,000,"}, "benefits": null, "requirements": "Strong knowledge of B2B sales; Experience in sales operations, partner management, and enablement preferredProven experience as a business analyst and admin role leading enterprise-scale CRM and PRM projectsDeep expertise in Salesforce Platform functionality and best practices; Experience with the Salesforce AppExchange and a deep understanding of both this ecosystem as well as native Salesforce capabilitiesProven experience in implementation, including the ability to determine configuration, customization, and/or integrations with external systemsHands-on experience with the configuration of platform features including user management, profiles, permission sets, role hierarchy, org-wide defaults, sharing rules, territories, custom objects, new page layouts, custom fields, formula fields, validations, workflows rules, email templates, process builder, flows, lightning pages, managed packages, etc.Excellent organization skills, with a natural inclination for both strategic and tactical planning, and the ability to turn strategy into tangible resultsSolid understanding of Agile / Scrum delivery modelsPrior experience in SDLC project management and analysis including scoping / timeline management, documenting use cases, process flows/swim lane diagrams, requirements, user acceptance testing, change management, etc.Working knowledge of process documentation and project management softwareExperience working with large-scale, complex datasets and using Salesforce data tools; Ability to design and implement dashboards in Einstein Analytics and Tableau CRM requiredStrong communication and presentation skills with the ability to quickly establish trust, credibility, and influence across a variety of cross-functional and multi-directional partnersExperience collaborating on global projects with a geographically dispersed team in a highly-matrixed, fast-paced environment- Bachelor's degree or equivalent experience required.\n- Master's Degree preferred.- Salesforce Administrator Certification (required)- Agile SCRUM Master Certification (preferred)- Salesforce Sales Cloud Consultant Certification (preferred)- Salesforce Marketing Cloud Consultant (preferred)", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer, partner and employee experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nAre you a strategic thinker who excels at tactical execution? Do you love to solve problems and have an uncanny knack for analytics? As part of our WW Sales Excellence & US Business Process Re-engineering (BPR) group, you and your team will be responsible for implementing strategies, programs, tools, and processes that enable the business to drive sales, improve the Apple employee and Partner experience, and innovate the way we lead and support one of the largest channel operations in the world. \n\nThese solutions are typically new technical capabilities and/or the transformation of business processes to support continuously evolving sales motions, expanding Geo coverage and routes-to-market, and growing complexity of sales plays. As a Salesforce Business Analyst & Admin, you will deliver key initiatives that support a broad, cohesive sales solution strategy."}, "200442548": {"jobID": "200442548", "origin_search": null, "posted": "Nov 16, 2022", "jobTitle": "Wireless Bluetooth Triage Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442548/wireless-bluetooth-triage-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "- Skilled at assessing large numbers of tasks and software bugs to determine priority and severity- Passion for the customer experience, and obsessive about details- Strong cross-functional communication and relationship-building skills, both internal and with external vendors- Constantly seek to improve and automate workflows to deal with an ever expanding slate of products and features- C, C++, Objective-C, Python and/or other automation language experience- Familiarity with Bluetooth is preferred, but not requiredBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "jobDescription": "Join us in the Core Bluetooth Software Engineering team and develop the next generation of cutting edge products and technologies! As a triage engineer, you’ll be at the center of it all: identifying software bug trends, quickly assessing severity and priority of bug reports, and assigning them to the correct engineering teams both near and far to deliver the best user experience to our customers. You’ll work closely with the Core Bluetooth engineering team, cross-functional engineering teams within Apple, as well as external partners, to identify and resolve software issues. If you are a passionate advocate for customer experience, are detail oriented, and love identifying trends and finding ways to automate workflows, then this is your dream job!"}, "200461814": {"jobID": "200461814", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Hardware Systems Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461814/hardware-systems-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5-7 years experience with strong fundamental EE experience.Hands-on prototype bring-up, debugging, and functional verification is preferred, but we encourage you to apply with any level of experience.Excellence in the following areas: system integration, embedded system design, and various communication protocols (especially PCIe, USB, SPI, I2C, and UART). We solve problems related to sensor and module product integration, signal integrity, RF coexistence, and EMC.Experience in one or more of the following areas: sensor design, low-power mobile design, battery technology, high-density PCB design techniques, and general consumer electronics product designMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you.Your responsibilities will include some international travel. It's one of the most exciting aspects of the job.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Do you want to impact millions of users by developing an extraordinary product with a prime focus on the performance and quality of the product? You will become part of a hands-on development team that furthers engineering perfection, creativity, and innovation. Energetic people and innovative technologies are the norm here. We want you to join our team if you are a resourceful engineer with the desire to develop solutions that do not yet exist. Bring passion and dedication to your job; there's no telling what you could accomplish. \nYou will engage in a collaborative, fast-paced environment to integrate new technologies into Appleʼs products. Join us in developing solutions the world doesnʼt know of yet. You will join a hands-on development team that fosters engineering excellence, creativity and innovation. \nThis Hardware Systems Integration Engineer position empowers you to engage with cross and multi-functional groups to continually question the limitations of technology implemented in wearable products. Will you help us design the next generation of Apple Watch? Come join us in developing solutions the world doesn't know of yet."}, "200450056": {"jobID": "200450056", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Silicon Timing Correlation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450056/cpu-silicon-timing-correlation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceGood all round hardware and data analysis skillsGood understanding of VLSI design practice and static timing analysisData analysis skills and experience using Python/JMPUnderstanding of SoC/CPU architecture is desirableGrasp of structural test (ATPG, MBIST) methods is highly desirableLab experience (system, board or tester platform) desiredExcellent teamwork and communication. Ability to work with multiple teams in delivering a solution.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role, you will be at the center of a chip design effort interfacing with many disciplines, with a critical impact on getting functional products to millions of customers quickly. You will be a member of a silicon timing characterization team. In this highly cross disciplinary role you will execute tasks that contribute to debugging physical issues in silicon and correlating silicon timing behavior with pre-silicon models."}, "200344958": {"jobID": "200344958", "origin_search": null, "posted": "Aug 10, 2022", "jobTitle": "TFT Panel Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200344958/tft-panel-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$171,000,"}, "benefits": null, "requirements": "Hands-on experience, in-depth technical knowledge, and proven track record in the design and development for display (OLED, LCD) or related electronics.Ability to perform circuit layout, parasitic RC extraction, circuit modeling and SPICE simulationUnderstanding the basic TFT and panel processPh.D. degree in Electrical Engineering, or M.S degree in Electrical Engineering plus 4 years TFT or relative industry experience.Excellent written and verbal communication skills are requiredPhD or MS in Electrical EngineeringExperience in display touchExperience in measuring and characterizing IV and CV of TFT devicesExperience in developing, designing and manufacturing high volume displayExperience in characterizing panel optical and electrical performanceExperience in gate, column driver IC and other display electronics designs", "jobDescription": "Apple is looking for a world-class Thin Film Transistor (TFT) panel design engineer to design, develop and launch the next display technologies for the portable, laptop and desktop displays in Apple products. The TFT panel design team is responsible for delivering the advanced TFT panel designs and technologies to enable the world’s best display performance in Apple Products. Individual will serve as a focal point in architecting and developing the total TFT pixel and panel designs. This includes display panel modeling, simulation, integrated circuit-on-glass design, panel architecture, and whole panel function simulation."}, "200458867": {"jobID": "200458867", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "CAD Engineer – Design Verification Flows and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458867/cad-engineer-design-verification-flows-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Familiarity with Verilog and SystemVerilog is a plus.Familiarity with Xcelium or Modelsim or Synopsys VCS is required.Good communications skills are required and prior customer support experience is a plus.Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.Familiarity with Verdi, Indago and/or SimView is a plus.Scripting/coding abilities in Python/Perl is required.Good communications skills are required.Knowledge of C/C++ or any other OOP programming language is a plus.Proven track record dealing with customers internal or external would be a plus.Minimum requirement of BS + 10 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world."}, "200460993": {"jobID": "200460993", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Metal Game Ecosystem Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460993/metal-game-ecosystem-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS in Computer Science or related field or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Working on rendering and graphics in gamesIn depth knowledge of modern computer graphics techniquesIn depth knowledge of at least one modern graphics API (DirectX 12, Vulkan, Metal, etc.)Proficient in C/C++MS in Computer Science or related field or equivalent experience.", "jobDescription": "Apple's Metal Game Ecosystem team is looking for an engineer to join our team with a passion for performance, optimization and game development. \n\nYou will work closely with 3rd party high end game developers as they optimize and port their games for Apple's platforms including Mac, iPhone and iPad. You will be the technical voice of the game ecosystem back to Apple and help to inform future features and projects."}, "200405180": {"jobID": "200405180", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Xcode Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200405180/xcode-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Clear, maintainable, and testable coding practices.Passion for improving productivity through better tools.Experience writing concurrent and asynchronous code.Positive and respectful attitude in a diverse environment.BS degree in Computer Science or equivalent experience", "jobDescription": "Do you want to improve developer tools used by millions of people? Our team’s mission is to drive Xcode’s project model and enable developers around the world to make the best software.\n\nWe believe that every engineer brings unique skills and perspective. Far more than any specific experience, we are looking for engineers with a passion to build great software, learn and develop their skills, and ultimately enable others to develop amazing applications.\n\nYou’ll join a small, focused team, but also work closely with the larger developer tools organization colocated with us. Here you’ll find that we:\n\n* Have a wide range of experience, from engineers who’ve just joined to those who’ve thrived at Apple their whole careers.\n* Provide a peaceful work environment where you can choose when to socialize and when to close your office door and focus.\n* Have an encouraging and growth-focused workplace culture.\n* Value integrity and respect for others, and take the safety and comfort of our employees seriously.\n* Encourage use of vacation time to maintain a healthy work-life balance.\n* Offer excellent benefits."}, "200461571": {"jobID": "200461571", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Software Engineer, Mail Platform", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461571/software-engineer-mail-platform?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong object-oriented programming experience. Experience with Objective-C and Swift is a plus!Highly productive, and excitement for working on products with large user bases.Attention to detail, and a passion for producing professional code.Ability to thrive in a highly collaborative environment focused on learning.Ability to diagnose performance, memory, and other issues by digging into lower levels of the stack.Knowledge of Internet Mail standards (MIME, IMAP, SMTP, POP, etc) is a plus, but not a requirement.BS in Computer Science or related field or equivalent.", "jobDescription": "The Mail team is looking for an engineer to help us shape the future direction of Mail on iOS and macOS. You’ll be part of a team focused on building the APIs and frameworks that support features like Remind Me, Undo Send, Scheduled send and many more. Your impact will extend beyond Mail, as you help drive the iOS and macOS platforms forward."}, "200449639": {"jobID": "200449639", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Silicon Timing Correlation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449639/cpu-silicon-timing-correlation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceGood all round hardware and data analysis skillsGood understanding of VLSI design practice and static timing analysisData analysis skills and experience using Python/JMPUnderstanding of SoC/CPU architecture is desirableGrasp of structural test (ATPG, MBIST) methods is highly desirableProven ability to lead a broad team towards successful closure on timing debug issuesTrack record of innovation in the area of silicon timing correlationLab experience (system, board or tester platform) requiredExcellent teamwork and communication. Ability to work with multiple teams in delivering a solution.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role, you will be at the center of a chip design effort interfacing with many disciplines, with a critical impact on getting functional products to millions of customers quickly. You will be a member of a silicon timing characterization team. In this highly cross disciplinary role you will execute tasks that contribute to debugging physical issues in silicon and correlating silicon timing behavior with pre-silicon models."}, "200442560": {"jobID": "200442560", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Hardware Engineering Program Manager- Apple Watch", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442560/hardware-engineering-program-manager-apple-watch?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS EE/CE degree required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Project/Program management experienceExcellent communication skills, both verbal and writtenExperience with portable consumer electronics devices a plusStrong technical background including electrical engineeringExperience creating project schedules and work breakdown structuresAbility to travel internationally to support builds, when safe to do so.-  BS EE/CE degree required", "jobDescription": "Are you passionate about extraordinary engineering? Will you help us build the next generation of Apple products? Join us in this highly collaborative The Apple Watch Hardware Engineering Program Manager is responsible for the technical management and support of engineering development projects within Apple’s Watch division. The EPM will manage and lead a cross functional team of skilled EE, SW and ME engineers. This role manages and tracks schedules and communicates risks and priorities. This EPM will follow up on day to day activities with the engineering team having the top level project goals in sight at all times.\n\nThe Watch Hardware EPM role is highly technical. This EPM will utilize a solid EE/CE background to understand technical details of cross-functional issues and risks. This will enable you to set the proper priorities and put risk mitigation plans in place."}, "200460987": {"jobID": "200460987", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Engineering Program Manager (streaming apps, web services) - Apple TV Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460987/engineering-program-manager-streaming-apps-web-services-apple-tv-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "A BS/MS in Computer Science, Engineering or similar technical field preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "10+ years of professional experience in software program/project/product managementProven experience in building and leading high performing teams and individualsSolid track record in managing and deploying large, complex programsStrong relationship management and facilitation skills both within diverse engineering teams and cross functional organizationsProven self-starter, who is dedicated and demonstrates creative and critical thinking abilitiesGreat attention to detail and organizedExcellent written and verbal communication skillsOverall, a highly driven, results-oriented, problem solver who will drive programs to deliver value quickly to our customers--- Desired Experience ---Understanding of web services developmentUnderstanding of native application developmentUnderstanding of how hardware and software interactA BS/MS in Computer Science, Engineering or similar technical field preferred.", "jobDescription": "What happens when the world’s most innovative engineers and dedicated Program Managers collaborate with the world’s most creative storytellers? TV gets reinvented! Meet the reinventors: The Apple TV Services teams created and manage the Apple TV app as well as tvOS, which redefined and refined the way people watch their favorite shows, movies, and so much more — including everything they love from the major subscription services. Today, these teams also manage one of the most exciting new realms at Apple: They bring viewers the critically acclaimed and award-winning Apple Originals in Apple TV+. And they’ve engineered it so Apple TV+ can be enjoyed not only on Apple devices, but also directly on many new televisions and third-party streaming devices. To deliver Apple-level quality on a global scale, our Program Management team drives cross-functional Apple TV app feature work to deliver a best-in-class, seamless customer experience on any screen. Join them to see what else is possible."}, "200451609": {"jobID": "200451609", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Memory Subsystem Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451609/memory-subsystem-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Experience with digital logic design, CPU and SOC architecture/micro-architecture and memory subsystem is preferredStrong programming (C/C++, Verilog, Scripting), software optimization, and performance improvement skillsExperience in unit and full chip level test benchesExperience in developing testplans, assertions, and developing stimulusShould be a great teammate with excellent communication skills and be able to work independently on the verification efforts for a block/area of the designExperience with emulation and developing synthesizable transactors is a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort collaborating with all subject areas, with a critical impact on getting functional products to millions of customers quickly."}, "200464593": {"jobID": "200464593", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Formal Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464593/formal-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Expert in SoC, CPU, GPU, and/or Cellular designs, as well as VLSI and digital logic design and verification techniques, or expert in formal tools and methodology and their application in and industrial settingDetail oriented mindset and desire to overcome challenges is requiredBS and a minimum of 10 years relevant industry experience.-  Formal Method or Formal Verification technologies experience and abstraction techniques-  Knowledge and experience in interpreting hardware specifications and using temporal logic assertion-based languages such as SVA or PSL or theorem provers-  Experience in using EDA formal tools and tool development experience is a plus-  Strong proficiency in any scripting language with excellent debugging skills-  Extraordinary teammate with excellent interpersonal skills-  Passionate about developing world-class/innovative formal verification solutions", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nWork with the best Formal Verification team in the world and acquire experience being at the center of a System-on-a-chip (SoC) design verification effort collaborating with design. Are you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly."}, "200457457": {"jobID": "200457457", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Systems Engineer - Cellular", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457457/systems-engineer-cellular?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "In-depth knowledge of physical layer and impact to modem design and trade-offsDeep understanding of wireless radio standards (including but not limited to 5G-NR, LTE, 802.11ax, 802.11ad) and their implications on cross layer modem design and procedures.Proven background in modem feature evaluation and trade-off analysisStrong analytical and problem solving skillsProficiency in leading technical initiatives across functional organization and with external partnersExcellent communication and documentation skillsBS + 10 years of equivalent experience.", "jobDescription": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. \n\nJoin us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? Are you ready to join a team redefining hardware technology? We are searching for a hardworking engineer with 10+/- years’ experience to join our exciting team of innovators."}, "200449014": {"jobID": "200449014", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "GPU Cache Hierarchy Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449014/gpu-cache-hierarchy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Solid understanding of computer and cache architectureExperience developing a unit or subsystem testing environment from start to closureExperience with memory/cache sub-system micro-architecture, which could include multiple levels of cache, coherent interconnects, MMUs or related blocks is a plusExpertise in crafting software solutions applying object oriented programming concepts, preferably with SystemVerilogExperience with a verification methodology such as UVM/OVM, and a hardware description language such as Verilog/VHDLExperience with HDL simulators and waveform viewersExperience defining coverage space, writing coverage models, and analyzing resultsProven success working under strict schedule deadlines with the ability to manage multiple prioritiesExcellent interpersonal skills and ability to collaborateGPU experience, especially in the cache/memory hierarchy area, is a plusBS + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices. \n\nThe GPU Cache Design Verification Engineer is responsible for the pre-silicon RTL verification of cache hierarchy and related units in a low power GPU design. This includes deep understanding of the micro-architectural details of these units, interactions between the units, and the connection of the uarch to the larger architectural intent of the GPU. A strong computer architecture background, experience in cache and memory subsystem verification, software engineering skills, and a proven foundation in verification methodology will be used to close testing coverage with high confidence."}, "200451383": {"jobID": "200451383", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer – Design Verification Flows and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451383/cad-engineer-design-verification-flows-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 3 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "-  Familiarity with Verilog and SystemVerilog is a plus.-  Familiarity with Xcelium or Modelsim or Synopsys VCS is required.-  Good communication skills are required and prior customer support experience is a plus.-  Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.-  Familiarity with Verdi, Indago and/or SimView is a plus.-  Scripting/coding abilities in Python/Perl is a plus.-  Knowledge of C/C++ or any other OOP programming language is a plus.Minimum requirement of BS + 3 years of relevant industry experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world."}, "200451515": {"jobID": "200451515", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer – Design Verification Flows and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451515/cad-engineer-design-verification-flows-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Familiarity with Verilog and SystemVerilog is a plus.Familiarity with Xcelium or Modelsim or Synopsys VCS is required.Good communication skills are required and prior customer support experience is a plus.Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.Familiarity with Verdi, Indago and/or SimView is a plus.Scripting/coding abilities in Python/Perl is a plus.Knowledge of C/C++ or any other OOP programming language is a plus.Minimum requirement of BS + 3 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world."}, "200457836": {"jobID": "200457836", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "CoreMedia Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457836/coremedia-performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "2+ years experience with software developmentCoding skills in C/C++, ideally on embedded platformsExperience with and understanding of real-time multithreaded programming systemsKnowledge of memory and compute performance analysis and characterizationBS or MS in Computer Science or equivalent.", "jobDescription": "The Audio & Media Technologies (AMT) team provides the media foundation across all of Apple's innovative products, including iPhone, AppleTV, Apple Watch, iPad, iPod, Macs as well as professional and consumer applications from Final Cut to TV and iWork. AMT takes the media experience to the next level with technologies such as AVFoundation, CoreMedia, CoreAudio and VideoToolbox.\nOur team is responsible for implementing software services around linear audiovisual media. This includes local media playback, video-on-demand and live streaming of multimedia content. Our media engine is used across Apple products such as Safari, TV, Photos, Music, as well as 3rd party applications.\nOur team is looking for a motivated software engineer with a technical and programming background with some experience in performance optimization. Experience with media playback and export (transcoding) systems is preferred."}, "200458366": {"jobID": "200458366", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Wireless PHY Systems Scientist/Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458366/wireless-phy-systems-scientist-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS +10 years of relevant experience. Focus on Dig. Comm’s & Signal Proc., or equivalent is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Expertise in Digital Signal Processing, Wireless Communications, and wireless chip development.Proven grasp of complex wireless systems with strong capability to comprehend dependencies between system components and protocol layers and their interactions.Extensive hands-on SW programming skills for modeling and simulation of sophisticated systems from RF/PHY layer signals and channel modeling. All the way to MAC protocol/networking simulations; corresponding proficiency with Matlab/C/C++ required.Experience with fixed-point design and RTL vector generation. HLS experience is a plus.Experience with handling and processing large amounts of field and simulation data, including user-friendly visualization of complex test setups and simulation results, including measurement accuracies, system latencies, etc.Some familiarity with common analog/RF impairments encountered in wireless systems.Experience with and/or knowledge of industry standards such as Bluetooth, Ultra-Wideband, GPS, and/or other wireless protocols.Experience in lab FPGA/silicon bring-up, PHY/RF/MAC testing and debugging and usage of lab equipment.Some experience in IMU and/or camera/image signal processing, and/or some prior engagements in standards organizations or industry consortia are strong pluses.BS +10 years of relevant experience. Focus on Dig. Comm’s & Signal Proc., or equivalent is preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "As a Wireless PHY Systems & Simulation Engineer, you will be a core member of our highly innovative and visible Wireless System-on-Chip (SoC) design team! What does that mean? You will help define modem architectures, develope physical-layer algorithms, and invent embedded DSP algorithms for chips enabling exciting new wireless applications! One emphasis of your specific role will be end-to-end simulation of sophisticated systems, modeling components from a multitude of signal processing fields. Including but not limited to propagation channel modeling, RF/antenna abstractions, PHY & MAC protocols and algorithms, and sensor fusion schemes to fuse wireless and non-wireless metrics. Application areas include ultra-wideband sensing and specialized wireless audio; products enabled or enhanced by our team’s SoC’s include specialized audio headsets (such as AirPods) and iPhones."}, "200451956": {"jobID": "200451956", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Silicon Camera Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451956/silicon-camera-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Analog and/or digital design experienceFamiliar with IP blocks development and verification requirementsExperience with driving feature set for new silicon, and the silicon design processExperience with international OEM/ODM silicon foundry partnersUnderstanding of high volume production and test processesAbility to travel internationally (<10%) to support our sensor and module partnersExtraordinary listening, presentation and interpersonal skillsA real passion for photography, digital imaging and consumer productsOne or more of the following:Familiar with CMOS sensors and SoCsFamiliar with VCSEL technologyGood knowledge of sensor performance metrics, including pixel performance parametersBS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products! \n\nSilicon & semiconductor components enable all the camera systems. To meet the expected performance and enable flawless integration into the Apple architecture, the majority of these components are custom designed and fabricated to our needs. The long lead times means that doing it right the first time is key to success. This holds true for image sensors, drivers, and VCSELs alike. The Apple Camera Team is looking for an Engineering Project Manager (EPM) to support the design, development and integration of imaging sensors and projectors into camera modules for our iPhone, iPad, Mac, and iPod products. In this highly multi-functional role, leveraging your design background, you will oversee the efforts to drive new technologies from technology development to concept - oftentimes aligning with Camera Module Design, SoC, SW, Sensor engineering and procurement teams. This role may also entail driving Apple suppliers to design, manufacture and integrate the world's best imaging sensors and depth technology for Apple's entire product line."}, "200459335": {"jobID": "200459335", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Product Design Engineer - Battery", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459335/product-design-engineer-battery?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Strong mechanical engineering fundamentals and problem-solving skills.Design and 3D CAD experience required.Excellent written and verbal communication skills; ability to interact with management, team members and external vendors.Ability to create and drive innovative mechanical or product designs, using tools such as FMEA, design of experiments, GD&T including datum establishment and tolerance analyses, and collaborate with FEA team.Ability to define and complete design validation activities (testing, metrology, failure and statistical analysis), make data-driven decisions, be detailed focused, and collaborate in multi-functional team environments.Knowledge of high-volume manufacturing processes and/or automation is preferred.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Battery Engineering group, you’ll help craft creative battery solutions that deliver more energy in smaller spaces than ever before! You’ll work across subject areas to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new battery technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what batteries can do and improve the product experience for our customers across the world.\n\nThe Battery Product Development team at Apple produces high-energy and highly reliable embedded battery systems for all product teams. Tightly integrated with Product Development, Operations, Industrial Design and Reliability Testing groups, we own battery module development from initial system architecture through ramp. \n\nThe Battery Cell Product Design Group works within the Battery Product Development organization. We are responsible for the mechanical engineering design of our battery cells, which are integrated into battery modules and then into products. In this role, you will coordinate and execute mechanical characterization of the cells to understand and improve the overall functionality of the cells for our customers."}, "200389043": {"jobID": "200389043", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Haptics PD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200389043/haptics-pd-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "• M.S. or PhD in Mechanical Engineering, Solid Mechanics or Physics \n• Minimum of 3 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with 3D CADExperience in 2D drafting, GD&T, and tolerance analysisStrong engineering fundamentals (solid mechanics, kinematics, dynamics)Master of problem-solving including the use of the scientific method, root cause analysis, and DOE creationApplied knowledge of electrical circuits, material science, and basic chemistryExcellent written and verbal communication and leadership skillsTeam Oriented: be able to thrive in a collaborative multi-functional environments• M.S. or PhD in Mechanical Engineering, Solid Mechanics or Physics \n• Minimum of 3 years of relevant industry experience.", "jobDescription": "The Haptic Engineering team develops state of the art haptic solutions that are central to Apple’s products, including the iPhone and Apple Watch. Our key goal is to enable the world’s best user-experience and explore the possibilities using haptics. We are a highly multi-functional team working in a hands-on environment that values creativity, engineering excellence, and passion for innovation. New challenges arise every single day that require the sharp analytical skills of talented and forward-thinking individuals.\n\nWe are seeking a Product Design / Mechanical Design Engineer to lead the design, development, and validation of next-generation haptic actuators and experiences."}, "200441189": {"jobID": "200441189", "origin_search": null, "posted": "Nov 2, 2022", "jobTitle": "Hardware System Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441189/hardware-system-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors or Master’s degree in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "2+ years relevant industry experience designing consumer electronics and/or embedded systemsStrong Electrical Engineering fundamentals (analog/digital design, signal/power integrity, etc.)Must have hands-on experience in prototyping, bring-up, debug and validationComfortable in a lab environment using oscilloscopes, spectrum analyzers, frequency counters, etc.Experience designing high volume products from beginning to end and dealing with contract manufacturers is highly desired.Familiar with PCB design and common electrical interfaces: PCIe, USB, Display Port, MIPI and I2C/SPI/UART busesKnowledge in one or more of the following areas: CPU/SOC, power(DC-DC converters, battery, power management, low power design), analog circuits, audio/camera/display/ wireless integration and measurement, sensor design and integration.Experience working with mechanical design and software development teamsBachelors or Master’s degree in Electrical Engineering or equivalent", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it! We are seeking a hardworking electrical engineer to join our Engineering Team and work on revolutionary products. This is a design engineering position that entails working with cross- functional groups to continually open up the boundaries of technology implemented in Apple’s products."}, "200449206": {"jobID": "200449206", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "iOS/iPadOS System UI Multitasking", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449206/ios-ipados-system-ui-multitasking?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of proven ability developing applications for iOS or macOSExcellent application architecture programming skillsCreativity and enthusiasm for designPassion for UI prototyping and implementationPassion for product quality and attention to detailExcellent communication and collaboration skillsComfortable with rapid development cycles and tight schedulesCommitted to writing concise, maintainable, and testable codeBS/BA or equivalent work experience", "jobDescription": "To iPhone and iPad users, SpringBoard is iOS. The SpringBoard Multitasking team is looking for a passionate and hard-working software engineer to help us craft users' experiences with Apple's most popular products!"}, "200273254": {"jobID": "200273254", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Display Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200273254/display-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS, or PhD in EE or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "3+ years work experienceStrong communication and teamwork skillsHands on experience with schematics, PCB layout, oscilloscope debugging, EMC, power managementAbility to travel internationally up to 10% of the timeBS, MS, or PhD in EE or related field", "jobDescription": "Imagine what you could do at Apple. This is a place where great ideas have a way of becoming great products that delight millions of customers all around the world. Bring passion and dedication to your work and there’s no limit to what you could accomplish.\n\nJoin us in crafting solutions the world doesn't know of yet. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200458646": {"jobID": "200458646", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "IC Package Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458646/ic-package-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "As the IC Package Design Engineer, you demonstrate fundamental knowledge or proven experience in the following:BS and 3+ years of relevant industry experience.Proven fundamentals in the electrical/material/thermal/ or mechanical engineering field(s).Familiarity with various sophisticated package configurations and assembly/ substrate technology (wirebond, POP, etc.).Experience in package design and proficient in Cadence Allegro platform tools (PCB Editor, Advanced Package Designer, APD/SiP) or Mentor Xpedition platform tools.Basic understanding in some SI/PI tools (XtractIM, PowerSI, HFSS, Q3D, etc.), package model extraction, S-parameters and RLGC model.Basic knowledge of substrate manufacturing process, structure, design rules and material property.Proven understanding of high-speed interfaces, including DDR, PCIe, NAND, etc.Exposure to Unix environment, scripting languages (PERL, Python, TCL and or shell) and methodology.Preferred Skills:Familiarity with CAM350/Valor or Calibre and CAD and experience with package design reviews.Knowledge of high-speed layout constraints (crosstalk mitigation, differential pairs, EMI/RFI, PCB/package resonance).Design experience with RFIC and 5G packages, SIP or module schematic and layout design experience.Solid understanding of Design Rules Check and Design for Manufacturing.- BS and 3+ years of relevant industry experience.", "jobDescription": "Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nOur Hardware Technology Packaging team invents, designs, develops and integrates electronic packaging solutions for Apple’s internal and custom external components of hardware for its consumer electronic products such as iPhone, iPad, Mac, Apple Watch, Apple TV, etc.\n\nIn this highly visible role, you will own and drive sophisticated package selection, new generation product package structure and configuration optimization. You will be responsible for Package/SIP/module physical design and layout, optimization, DV and tape out; and work with multi-functional teams to achieve optimized mechanical/electrical/ thermal performance for various types of chips."}, "200458375": {"jobID": "200458375", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Virtuoso Custom CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458375/virtuoso-custom-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in analog and digital new product development IC CAD support using EDA toolsExpert in Cadence Composer Virtuoso, Layout tools, VXL, PCELLs, and CDFsDeep knowledge of programming languages such as DFII, Skill, Perl, TclProficient with Unix / Linux OS, utilities, and scriptingStrong communication skills both oral and written.Minimum requirements of BS + 10 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient display and image sensors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows.\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows."}, "200465346": {"jobID": "200465346", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Silicon Validation Software Engineer - High Speed IO Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465346/silicon-validation-software-engineer-high-speed-io-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Familiar with SoC and System architecture.Knowledge and experience working with board schematics.Experience with Embedded system is required.Experience with using test equipment and analyzers (USB, PCIe, DP, I2C) is required.High knowledge and experience with High Speed interfaces such USB-PD, USB2.0, USB3.0, Thunderbolt 3, USB4.0, PCIE or DP is required.BS and a minimum of 10 years relevant industry experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nJoin us to help deliver the next groundbreaking Apple product. We have a critical impact on getting high quality functional products to millions of customers quickly. We are looking for candidates with at least 10 years of relevant experience."}, "200452569": {"jobID": "200452569", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Next Generation Wireless Modem Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452569/next-generation-wireless-modem-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proven track record in design and prototyping of 4G/5G or IEEE 802.11/WiFi wireless systems.Experience with design and/or implementation of processing steps/algorithms for OFDM PHY receiver like channel estimation, Demodulation, Decoding and packet processing (e.g., MAC/RLC).Experience in defining system partitioning, control plane and data processing partitions, design mapping to different processing elements.Experience with prototyping or emulation of wireless designs using FPGA’s.Experience with performance benchmarking including resource utilization and power analysis for FPGA systems.Experience with AXI-based fabrics and high-speed interface protocols including MIPI, PCIe, Ethernet.Experience in memory sub-system architecture for baseband modem is a plus.BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Smart people and inspiring, innovative technologies are the norm here. Are you ready to be part of a team transforming wireless technology? Come and work on challenges that no one has solved yet! We invite you to join us to help deliver the next groundbreaking Apple product."}, "200450240": {"jobID": "200450240", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Analog Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450240/analog-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong track record of delivering silicon IPs with complete architecture, design, verification and validation experienceUnderstanding of data converter architectures and design trade-offs.Solid experience with bandgaps, bias, opamps, switched-cap circuits, LDOs, low power oscillators, PLLs, VGAs, feedback and compensation techniques.Experience in design for ESD compliance and safety.In-depth knowledge and analytical understanding of mixed-signal design techniques.Good knowledge of high precision techniques in presence of device mismatchExperience in chip integration working with Digital Design and Physical Design teamsExperience in understanding top level verification methods incorporating block level schematics and behavioral modelsExperience in ASIC design experience in different application fields is a plusExperience in C/Matlab/VerilogA modelingStrong device physics knowledge as it applies to analog IC design.Hands-on experience in using spectrum analyzers, oscilloscopes, signal generators, etc. to validate analog designs.Experience in working with production test engineers to produce test plans and design for testability details.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "Imagine what you could do here at Apple! Together we could help craft the next generation of the world’s finest devices. New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish.   The team is searching for a self-motivating, passionate electrical engineer for the role of AMS Design Engineer. As a team, we will be working on the leading-edge technology nodes to build elite custom analog designs used to connect ourworld-class products to the physical world as well as enable optimizing their performance.   You will become part of a hands-on development team that fosters engineering excellence, creativity and innovation. Collaboration across teams is a key component of success at Apple. Dynamic, smart people and inspiring, innovative technologies are the norm here.   Will you help us design the next generation of revolutionary Apple products?"}, "200452365": {"jobID": "200452365", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452365/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a Bachelor's Degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusUnderstanding of embedded software development, RTOS and/or LinuxUnderstanding of computer architecture, operating systemUnderstanding of boot code, CPU & SOC initialization, device driversGood troubleshooting skills in embedded software debuggingExperience with script language such as Python, Perl, or TclMinimum requirement of a Bachelor's Degree", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers ready to join the field and enter a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200452374": {"jobID": "200452374", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452374/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a Bachelor's Degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusUnderstanding of embedded software development, RTOS and/or LinuxUnderstanding of computer architecture, operating systemUnderstanding of boot code, CPU & SOC initialization, device driversGood troubleshooting skills in embedded software debuggingExperience with script language such as Python, Perl, or TclMinimum requirement of a Bachelor's Degree", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers to join a fast-paced environment. In this role, you will help contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200458159": {"jobID": "200458159", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Graphics Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458159/graphics-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Expertise with Verilog.Expertise with various HDL simulators and waveform viewers like IES, VCS, DVE, Verdi.Experience with Perl, Shell scripting, Makefiles, TCL.Experience with low-level programming of complex computer systems in C, C++.Familiar with System Verilog.Familiar developing test bench components in UVM including checkers and monitors.Good experience working under strict schedule deadlines with the ability to manage multiple priorities.Excellent communication skills and ability to collaborate.Good knowledge of Computer Architecture; Graphics architecture is a plus.Experience with code repositories; Perforce.Experience with verification languages such as System Verilog/UVM/OVM.Clear understanding of constrained random verification process, functional and code coverage, assertion methodology is a plus.We are looking for candidates with a minimum of BS + 3 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nIn this highly visible role, you will be at the heart of the chip design effort collaborating with a variety of fields with critical impact in getting products to millions of customers quickly.\n\nThe Graphics Verification Engineer will be responsible for the pre-silicon RTL verification of blocks in low power embedded graphics cores. This includes deep understanding of the micro-architectural details of their block and how it works within the broader GPU design. A strong computer architecture background, preferably in graphics, and a solid foundation in verification methodology will be required to close testing coverage with high confidence."}, "200455263": {"jobID": "200455263", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455263/soc-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 0 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Knowledge of computer architecture and digital design fundamentals-  Knowledge of Verilog or SystemVerilog, digital simulation and debug-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to take on diverse challengesMinimum of BS + 0 years relevant industry experience", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200449025": {"jobID": "200449025", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "GPU Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449025/gpu-performance-analysis-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + Minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong hardware and software debug skillsProficient in scripting languages such as Python, Perl, and RubyProficient in C/C++Experience with RTL - System Verilog or VHDLWaveform analysisGPU hardware and architectural knowledgeExperience with visualization tools (Tableau, Bokeh, Matplotlib)Excellent written and verbal communication, excellent organization skills, and highly self-motivatedAbility to work well in a team and be productive under aggressive schedules.BS + Minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nIn this role, you will be responsible for performance analysis, tuning, and debug of Apple’s GPU products. As a member of our Hardware design team, you will collaborate closely with other GPU Design and Software Engineers to study, debug and improve the performance of Apple’s mobile GPUs."}, "200408937": {"jobID": "200408937", "origin_search": null, "posted": "Aug 5, 2022", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200408937/ar-vr-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Familiarity with Virtual Production and/or Video WorkflowsFamiliarity with USD or similar systemsExperience working in sophisticated codebasesExperience creating plugins for DCC applications (Houdini, Maya, Blender, Final Cut Pro, Logic Pro X, etc)A passion for enabling individual artistic expressionBS/MS in Computer Science or related field.", "jobDescription": "Apps and experiences are at the core of unleashing the potential of AR/VR on Apple’s platforms. As a member of our team, you will be at the forefront of ideating, developing, and shipping groundbreaking experiences that build on top of the unique capabilities of AR and VR across a variety of areas. Our applications engineering team is uniquely positioned at the intersection of design, frameworks, operating systems, and low-level software — by joining us you will work closely with peers across these functions to deliver life-changing products to our customers."}, "200450656": {"jobID": "200450656", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Radio Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450656/radio-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.This position requires thorough knowledge of the ASIC design flow, synthesis, static timing analysis, scripting, and netlist generation.Relevant design experience in SoC and/or radio/transceiver, PLL ControllerExperience with Digital Mixed Signal digital designExtraordinary leadership skills and ability to inspire team members with an innate ability to see the bigger picturePassion for owning and driving design schedules using well-defined metricsExperience working in a high-energy multi-disciplined engineering environment, strong at multi-tasking, and real-time crisis managementAbility to understand and extract action plans from complex technical discussions and translate into succinct messaging for multi-functional and executive status reportingExcellent debugging skills. Shown ability to drive resolution of critical problemsBS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture, and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. We encourage you to apply if you enjoy a fast-paced and challenging environment, collaborating with people across different functional areas, and thriving during crisis times."}, "200459972": {"jobID": "200459972", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Sr. Depth Module Characterization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459972/sr-depth-module-characterization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD degree in Optics, Physics or Electrical Engineering\n5+(PhD) or 10+(MS) years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong lab experience in designing and characterizing hardware systems such as depth sensors, cameras, or compact imaging optical systemsExpertise in ground-up development of custom characterization setups involving optical, laser, mechanical and electrical hardwareExpertise with laser optical lab equipment – imaging sensors, lasers, power measurement, metrology tools, electronics hardware, and opto-mechanical hardware.Expertise with display components, design and performanceStrong skills using Matlab, Python, C/C++, JMP for automation, data acquisition, and statistical analysisExperience with image processing and quantitative analysis is a plusExperience with 3D CAD mechanical design is a plusExperience with board level circuit build and debug is a plusExperience supporting volume manufacturing and flow (IQC, OQC, DVT to PVT) is a plusMS or PhD degree in Optics, Physics or Electrical Engineering\n5+(PhD) or 10+(MS) years of industry experience", "jobDescription": "The Camera Hardware group at Apple develops depth-sensing hardware such as the revolutionary TrueDepth camera that powers FaceID, and the breakthrough LiDAR scanner.  This multi-disciplinary group of engineers is responsible for architecture, research, and manufacturing development of these highly complex sensing systems for Apple products.  The Depth Hardware team is seeking a Sr. Level laser-optical and display characterization engineer to support R&D and characterization depth sensors for future products."}, "200459337": {"jobID": "200459337", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "CPU Processor Performance Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459337/cpu-processor-performance-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.The ideal candidate should have performance modeling, processor verification, or RTL design experienceIn-depth knowledge of digital logic design, CPU architecture and microarchitectureExperience in performance modeling for advanced CPU designsExperience in developing performance test plans and writing/debugging assembly tests for performance correlation and verificationGood programming skills in assembly, C/C++, Verilog, System Verilog, and scriptingProven experience in benchmarks and workload analysisExperience in CPU performance profilingGood knowledge in compiler techniques and OS for performance optimizationProven knowledge with developing instruction profiling tools on siliconAbility to work across teams to optimize silicon performanceExperience in silicon validation is a plusShould be a great teammate with excellent communication and presentation skills and able to work independently on the owned unitMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \nIn this highly visible role, you will be at the center of a chip design effort collaborating with all subject areas, with a critical impact on getting functional products to millions of customers quickly. \nYou will be responsible for silicon performance verification, correlation, characterization and tuning for CPUs. The role involves pre-silicon performance verification as well as developing tests to characterize CPU performance, analyzing and profiling software/applications, correlating and comparing performance across silicon/system software version, and working with OS and compiler teams on performance debug and tuning."}, "200426998": {"jobID": "200426998", "origin_search": null, "posted": "Nov 9, 2022", "jobTitle": "HID - Apple Watch & Audio Sensors Firmware Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200426998/hid-apple-watch-audio-sensors-firmware-quality-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CE/EE/CS/ME or related degrees"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$94,000", "max": "$171,000"}, "benefits": null, "requirements": "Have a real passion for quality, able to think outside the box and enjoy breaking things through creative testingThrive in uncertain, early prototype stages of a project when not all features are working yet, and enjoy putting energy into identifying/classifying issues as a way to improve qualityEnjoying learning and teaching, building on existing knowledge and developing new skillsStrong coding skills, including strong fundamentals in a scripting language (Python or equivalent)Have skill in building new processes or fixing old processes to improve quality of Apple products and efficiency of teamExperience with embedded systems, microcontrollers, and sensorsGood fundamentals in serial communication (I2C, SPI, UART)Excellent written and verbal communication skillsBS or MS in CE/EE/CS/ME or related degreesHELPFUL/USEFUL EXPERIENCE:•Experience writing and/or testing firmware, building embedded systems•Knowledge of Mac systems and MacOS/iOS or UNIX variant•Track record of shipping great consumer products•Testing automation using scripting languages - Python or equivalent•Strong knowledge of debugging serial communication; familiarity with I2C, SPI drivers & protocols•Experience with hardware debugging tools - logic analyzer, oscilloscope•Familiarity with C/C++ or object-oriented programming•Testing tool development•Continuous integration systems•Algorithm analysis and validation", "jobDescription": "Be part of the Apple Watch & Audio Sensor’s Firmware QE team, focused on testing firmware and developing automation to ensure ultra-high quality for Apple's next generation devices. You will be a motivated individual who cares and thinks about user experience, is able to collaborate with other engineers, as well as develop test plans & problem solve."}, "200437317": {"jobID": "200437317", "origin_search": null, "posted": "Oct 18, 2022", "jobTitle": "Display Module Lab Support", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437317/display-module-lab-support?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in mechanical, electronics, or materials engineering.  Will also consider candidates with relevant certifications/industrial experiences."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Demonstrated hands-on experience in setting up and running high precision manufacturing equipment and process including, but not limited to, flex/IC bonding, lamination, and laser equipmentKnowledgable about visual or microscopic inspection for identifying defectsExperience working with materials characterization equipmentAbility to work with engineering drawings to generate mechanical fixtures to support high quality analysis and fabricationExperience working in a laboratory and development environmentFlexible and collaborative, willing to work in fast paced product and technology development labAttentive to detail, with demonstrated ability to produce professional, high-quality prototypesExperience working with backend semiconductor/display manufacturing equipment preferredAbility to work on multiple projects with tight deadlinesExperience with Numbers/Pages/Keynote/ExcelBS in mechanical, electronics, or materials engineering.  Will also consider candidates with relevant certifications/industrial experiences.", "jobDescription": "Apple is looking for a highly motivated technical contributor to join Panel Process and Optics (PPO) Engineering team. \n\nSuccessful candidate will be responsible for prototype display module assembly and characterization. Individual in this role will run equipment for completion of prototype display and optical modules, as well as utilizing a suite of metrology and characterization tools. They will assist engineers to conduct experiments for evaluating and developing innovative technologies and new methods. We work at a fast pace and require everyone to be highly self motivated. A successful candidate needs to be flexible, receptive to ideas from others, team oriented, and willing to work with technologists, engineers and others for continuing to push the technology envelop."}, "200461512": {"jobID": "200461512", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Acquisition and Broadcast Delivery Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461512/acquisition-and-broadcast-delivery-architect?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Image Science, Color Science, CS/CE, or equivalent experience\n\nAt least 10 years of experience in broadcast television production and engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Demonstrated proficiency related to installing, operating and developing live encoding systems for wide scale, international broadcastingDeep knowledge of broadcast standards, camera and capture systems, transmission, formats and delivery methodologyDeep knowledge of Hybrid Log-gamma, HDR10 and PQ color space maintenance and deliveryExperience with new acquisition approaches including lidar and volumetric as well as feature film workflowsGeneral knowledge of video remote truck and video studio SDI and IP signal flowGeneral knowledge of OETF and EOTF Linear and non-linear transfer functionsStrong interest in developing new features in media timed events using SCTE-35, WebVTT and othersLead contributor/developer of an enterprise media ingestion system and author of its input specificationsExcels in subjective/objective image quality evaluationStrong interpersonal and written communication skillsBS or MS in Image Science, Color Science, CS/CE, or equivalent experience\n\nAt least 10 years of experience in broadcast television production and engineering", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\n\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.\n\nThanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here."}, "200390142": {"jobID": "200390142", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Desktop System Hardware Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200390142/desktop-system-hardware-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS EE w/ 8 years; MS EE w/ 5 years overall experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$343,500,"}, "benefits": null, "requirements": "BS EE w/ 8 years; MS EE w/5 years overall experience in developing consumer products,Must have hands-on experience in prototype bring-up and debugging, functional verification, and manufacturing support.Ability to navigate compliance requirements (including EMC, Safety, and Environmental Engineering)Must have created and influenced system specification documents for electrical, power delivery, thermal, and physical fit requirementsAbility to navigate hi-speed design and layout rules of modern interfacesMust have created, defined, and successfully presented material to upper management and influenced decision-makersDemonstrated innovative, critical thinking and troubleshooting skills; have proficient written, verbal, negotiation, and communication skills.Provide technical leadership and mentorship to engineering team membersPreferred Tools experienceSchematic Capture and Layout (Cadence Concept & Allegro, constraint management)PCB Simulation & Signal integrity tools; FPGA developmentProductivity (e.g., Keynote, Numbers, Pages; Powerpoint, Excel, Word; Omnigraffle)Analysis and Automation: Matlab, Simulink, Perl, Python, VBABS EE w/ 8 years; MS EE w/ 5 years overall experience.", "jobDescription": "Architecture team. The position is as a highly multi-functional individual contributor, design engineer, and systems architect. The ideal candidate has core competencies and subject matter expertise in various aspects of computer systems & product design, and has successfully influenced decision-makers, product features, & the customer experience!\n\nThe candidate will provide HW architectural guidance to x-functional engineering teams to establish new product definition requirements & commitments.\n\nThe position requires the candidate to define, guide, and own aspects of system electrical architecture product definition. Experience is expected in analyzing key system trade-offs and proposing solutions including but not limited to: design of high performance / low power / high-quality products; guiding system electrical & mechanical layouts, feature integration feasibility; identifying enabling technologies; developing pre-net list PCB floorplan & stack-up feasibility considering component package & thermal design; navigating signal integrity, EMC, and RF challenges; power budgeting; negotiating x-functional stakeholder requirements. The position requires strong analytical, communication, persuasion, and negotiation skills."}, "200458598": {"jobID": "200458598", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC Physical Design Engineer, Electrical Analysis", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458598/soc-physical-design-engineer-electrical-analysis?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Solid background and knowledge on low-power circuit design, computer architecture, and digital systems.Multi-year hands-on experience working on ASIC or AMS physical implementation and analysis flow for IP blocks as well as SoC fullchip.Proficient in automating and debugging verification flows for digital VLSI design.Knowledge with industrial EDA backend tools like Redhawk, PrimeRail, Voltus, or a similar tool is required. Experience with Innovus, Design Compiler, PrimeTime and Tempus is preferred.Familiar with voltage drop budgeting, low-power design techniques, and sign-off criteria for solid-state digital circuit systems.You have engaged in multiple design tape-outs regarding power integrity signoff.Circuit design background and SPICE experience are a plus.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nAs a Physical Electrical Analysis Engineer on our SoC team, you will be driving the electrical analysis and verification of an SoC."}, "200460195": {"jobID": "200460195", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "SoC Physical Design Engineer, Electrical Analysis", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460195/soc-physical-design-engineer-electrical-analysis?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Solid background and knowledge on low-power circuit design, computer architecture, and digital systems.Multi-year hands-on experience working on ASIC or AMS physical implementation and analysis flow for IP blocks as well as SoC fullchip.Proficient in automating and debugging verification flows for digital VLSI design.Knowledge with industrial EDA backend tools like Redhawk, PrimeRail, Voltus, or a similar tool is required. Experience with Innovus, Design Compiler, PrimeTime and Tempus is preferred.Familiar with voltage drop budgeting, low-power design techniques, and sign-off criteria for solid-state digital circuit systems.You have engaged in multiple design tape-outs regarding power integrity signoff.Circuit design background and SPICE experience are a plus.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nAs a Physical Electrical Analysis Engineer on our SoC team, you will be driving the electrical analysis and verification of an SoC."}, "200458126": {"jobID": "200458126", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Cellular Modem Firmware Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458126/cellular-modem-firmware-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Demonstrated ability working in the development or verification of cellular baseband modem firmware / algorithms.Understanding of end to end system involving the UE and network is desired.Good knowledge of wireless communications (OFDM/MIMO, etc.).Experience in wireless standards a significant plus (5G-NR/4G LTE/ UMTS/GSM/CDMA).Experience in high tech industry with a track record of hands-on product development, program management, project management or engineering management.Experience in leading Layer 1 / RF Firmware development, and/or verification.Good understanding of cellular modem baseband building blocks.Extraordinary teammate and creative problem solver with ability to lead technical teams and multi-functional groups against plans.Excellent written and verbal communication.BS and 10+ years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nApple seeks a technical leader to program manage our groundbreaking cellular baseband modems to meet performance, quality and schedule requirements for Apple products. You will be responsible for multi-functional team coordination, communication and representation across the cellular engineering ecosystem from concept to production. Technical background in embedded firmware engineering will be key to your success in this role. Ideally, you will also have validated project management experience in some aspect of RF Firmware / Layer 1 development, integration and/or verification towards production. You will work in a dynamic engineering environment, using sophisticated multi-tasking skills and real-time crisis management are all desired strengths for this position."}, "200451541": {"jobID": "200451541", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451541/cpu-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceStrong electrical engineering fundamentals in logic design, digital circuits, and deep sub-micron technology along with timing, power, and area implicationsProficiency in using industry standard logic Synthesis, PnR, STA and Power analysis tools along with timing budgeting, floor-planing, and physical integration and verification to converge complex designsSolid understanding of low power, high frequency physical design techniques leveraging advanced syn/PnR tool features and best in class physical design methodologyProgramming and scripting ability (Perl, TCL) with strong fundamentalsAbility to work independently and/or lead a physical design partition in collaboration with x-functional teamsExcellent communication and interpersonal skillsMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) is hiring hardworking engineers for CPU block-level physical design."}, "200451395": {"jobID": "200451395", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Clock Implementation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451395/cpu-clock-implementation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceThe ideal candidate will have physical design, analysis, and verification experience working on a large processor and/or SOC designsKnowledge of industrial standards and practices in physical design, analysis, and physical verificationExperience in developing and implementing powergrid and clock specificationsSolid knowledge of low power design, physical construction, Spice, EM/IR-Drop/Noise, SIGEM analysis, formal verification, physical verification, and DFMStrong communication skillsProven understanding of CMOS circuit designLayout design background is a plusWorking knowledge of extraction and STA methodology and toolsWorking knowledge of computer architectureSolid understanding of scripting languages such as Perl/TclAbility to work well in a team, problem solver, and self-motivatedMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) is hiring skilled engineers for CPU. As a CPU Clock Implementation Engineer, you will be driving the planning, design, implementation, and analysis of clock."}, "200450241": {"jobID": "200450241", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Analog Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450241/analog-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong track record of delivering silicon IPs with complete architecture, design, verification and validation experienceUnderstanding of data converter architectures and design trade-offs.Solid experience with bandgaps, bias, opamps, switched-cap circuits, LDOs, low power oscillators, PLLs, VGAs, feedback and compensation techniques.Experience in design for ESD compliance and safety.In-depth knowledge and analytical understanding of mixed-signal design techniques.Good knowledge of high precision techniques in presence of device mismatchExperience in chip integration working with Digital Design and Physical Design teamsExperience in understanding top level verification methods incorporating block level schematics and behavioral modelsExperience in ASIC design experience in different application fields is a plusExperience in C/Matlab/VerilogA modelingStrong device physics knowledge as it applies to analog IC design.Hands-on experience in using spectrum analyzers, oscilloscopes, signal generators, etc. to validate analog designs.Experience in working with production test engineers to produce test plans and design for testability details.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "Imagine what you could do here at Apple! Together we could help craft the next generation of the world’s finest devices. New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish.   The team is searching for a self-motivating, passionate electrical engineer for the role of AMS Design Engineer. As a team, we will be working on the leading-edge technology nodes to build elite custom analog designs used to connect ourworld-class products to the physical world as well as enable optimizing their performance.   You will become part of a hands-on development team that fosters engineering excellence, creativity and innovation. Collaboration across teams is a key component of success at Apple. Dynamic, smart people and inspiring, innovative technologies are the norm here.   Will you help us design the next generation of revolutionary Apple products?"}, "200458620": {"jobID": "200458620", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Semi-Custom Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458620/semi-custom-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Significant Physical Design experience on mixed-signal and/or SOC designs-  Deep knowledge of industry standards and practices in Physical Design, including physically aware synthesis, Floor-planning, and Place & Route-  Deep knowledge or experience with digital signal processing filters design, analog-on-top mixed signal physical and timing interface implementation techniques, and a passion to pursue out-of-the-box physical implementation techniques to achieve uncompromised design goals-  Validated experience in developing and implementing Power-grid and efficient Clock Distribution Networks-  Significant understanding of all aspects of physical construction, Integration, Design-For-Test (DFT), and Physical Verification-  Confirmed knowledge of Basic SoC Architecture and HDL languages like Verilog to be able to collaborate with logic design teams for timing fixes. Power user of industry standard Synthesis, Physical Design, Timing & Power Analysis tools-  Deep understanding of scripting languages such as Perl/Tcl-  Deep understanding and knowledge of STA methodology, constraints, and tools-  Solid understanding of Physical Design Verification methodology to debug LVS/DRC issues at block levelBachelors of Science in Electrical Engineering and 3+ years experience preferred", "jobDescription": "At Apple, we work constantly to craft products that enrich people’s lives. Do you like changing the game and working on challenges that no one has solved yet? We have an opportunity for a forward-thinking and unusually hardworking Semi-Custom Physical Design Engineer! As a member of our dynamic group, you will have the rare and opening to craft upcoming products that will delight and encourage millions of Apple’s customers every single day!\n\nAs a part of the Analog Mixed Signal (AMS) team you will collaborate with architecture, Circuits, CAD, timing and logic design teams, with a critical impact on delivering outstanding Semi-Custom Physical Designs. You will be required to deliver semi-custom high speed and ultra-low power physical designs of innovative mixed-signal designs."}, "200376273": {"jobID": "200376273", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "WW Fraud Program Manager - Digital Goods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200376273/ww-fraud-program-manager-digital-goods?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA preferred, MBA desirable"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The successful candidate will be experienced in the co-development and co-delivery of fraud prevention specialist and workflow programs at a global level that deliver best in class customer experience. They should demonstrate a blend of creativity, customer service skills, analytical horsepower and a collaborative approach.Demonstrated experience of specialist & workflow program development that delivers specialist engagement and workflow efficiency through innovative problem solving / opportunity seeking to drive key metrics.With well developed analytical skills, this individual has experience quantifying results of strategic and tactical critical metrics and driving decisions based on data.Able to build and lead presentations with Senior Leadership across multiple teams (RCC, Strategic Data Solutions, Financial Fraud Ops, Finance, etc).Excellent conceptual, written and verbal communication skills at all levels is a necessity and the ability to establish relationships across channels and functions to drive success world-wide.Able to quickly gain credibility and motivate resources across a WW organization covering multiple time zones. Be able to make critical decisions, influence decisions and facilitate change management through collaboration and leadership.Customer focused self-starter with strong attention to detail and follow up and a flexible and adaptive approach.Thrive in a fast-paced and constantly evolving environment, drive innovation and continuous improvement for efficiency and sustainable growth, while maintaining deadlines and achieving goals.Great teammate with a positive demeanor, empathizing with multiple points of view but able to make the hard call and move on.BA preferred, MBA desirableMinimum of 8+ years experience in digital goods fraud prevention, e-commerce operations, and contact center environment required.", "jobDescription": "Imagine what you could do here. At Apple, amazing ideas have a way of becoming amazing products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! \n\nThe RCC Optimization organization is seeking a highly motivated professional to lead our Digital Goods fraud prevention program. Our WW contact centers support Apple order management across Web, Mobile, Wallet, and many different locations with varying payment methods."}, "200466718": {"jobID": "200466718", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Display Technologies Administrative Assistant", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466718/display-technologies-administrative-assistant?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "1+ year minimum professional service related experience required\nBS/BA Degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$27.75", "max": "$48.45/hr,"}, "benefits": null, "requirements": "Must be able to work with little supervision on daily assignments and must be able to take initiative in all tasks.Must be able to utilize good judgment to make appropriate decisions.Attention to detail, accuracy, and timeliness are required.Experience supporting larger teams is a plusDirect experience dealing with sensitive and confidential information with integrityExceptional problem solving, time management, and organizational skillsAbility to approach problems flexibly and demonstrate creativity in solving themExcellent written and verbal communication skillsExperience working in a team-oriented environment demonstrating positive demeanor regardless of changing work conditionsMust be very resourceful and have the ability to multi-task and prioritize projects in a constantly evolving environmentPrioritizing multiple deadlines, schedules, planned meetings and are accustomed to supporting executives with very fast paced schedulesCalm and confident during high stress situationsYou advocate for your decisions and can say \"no\" to support your executive's schedule when neededYou have experience with a Mac, as well as with Keynote, Numbers, Pages, Excel, Word, and other efficiency tools is plus1+ year minimum professional service related experience required\nBS/BA Degree preferred", "jobDescription": "Do you love helping people and acting as a trusted resource to others? Do you enjoy building deep expertise as well as navigating new and different tasks every day? We are looking for an organized self-starter with experience in a dynamic, fast-paced environment. The ability to work autonomously, take initiative, and follow through is crucial. Must be extremely resourceful and have the ability to multi-task and prioritize projects in a quickly changing environment. This position requires someone who enjoys a team-oriented environment and who projects a positive demeanor regardless of changes in working conditions. Must display excellent problem solving abilities when faced with challenging deadlines. This person will thrive in a fast-paced environment, and demonstrate flexibility in the face of change. This person is pro-active in nature and has an excellent sense of judgment while ensuring work is handled efficiently without the need for constant supervision."}, "200458774": {"jobID": "200458774", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Wireless System Integration & Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458774/wireless-system-integration-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS+3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "This is an individual technical contributor role that requires proven experience in system integration, bringing up, and productization of wireless communication systems!Understanding of communication theory and radio calibration algorithms (such as modulation, signal estimation/detection, gain control, and RF impairment estimation/correction).Experience, knowledge, and skills in system bring-up, integration, characterization, and debug of real wireless silicon in a lab.Experience using and understanding the theory of operation of lab equipment (spectrum analyzer, signal generator, network analyzer, power meter, etc).Experience developing test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Knowledge of existing wireless communication protocols: 802.11a/b/g/n/ac/ax/be, 802.11ad/ay, Bluetooth/BLE, or cellular technologies.Experience with Matlab, Python, Shell scripting, and/or C/C++.Experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI, database, reporting tools).Minimum qualification is BS+3 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before."}, "200449212": {"jobID": "200449212", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "iOS/iPadOS System UI Multitasking", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449212/ios-ipados-system-ui-multitasking?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of proven ability developing applications for iOS or macOSExcellent application architecture programming skillsCreativity and enthusiasm for designPassion for UI prototyping and implementationPassion for product quality and attention to detailExcellent communication and collaboration skillsComfortable with rapid development cycles and tight schedulesCommitted to writing concise, maintainable, and testable codeBS/BA or equivalent work experience", "jobDescription": "To iPhone and iPad users, SpringBoard is iOS. The SpringBoard Multitasking team is looking for a passionate and hard-working software engineer to help us craft users' experiences with Apple's most popular products!"}, "200452556": {"jobID": "200452556", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless System Integration & Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452556/wireless-system-integration-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS+10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "This is an individual technical contributor role that requires industry experience in system integration, bringing up, and productization of wireless communication systems.Deep understanding of communication theory and radio calibration algorithms (such as modulation, signal estimation/detection, gain control, and RF impairment estimation/correction).Extensive experience, knowledge, and skills in system bring-up, integration, characterization, and debug of real wireless silicon in a lab.Experience using and understanding the theory of operation of lab equipment (spectrum analyzer, signal generator, network analyzer, power meter, etc).Experience developing test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Knowledge in existing wireless communication protocols: 802.11a/b/g/n/ac/ax/be, 802.11ad/ay, Bluetooth/BLE, or cellular technologies.Extensive Experience with Matlab, Python, Shell scripting, and/or C/C++!Experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI, database, reporting tools).Minimum qualification is BS+10 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before.\n\nIntegrate golden calibration algorithms for wireless transceivers in automation infrastructure.\nValidate and characterize algorithms on real silicon alongside PHY, MAC, RFIC, and digital circuit designers.\nBring up and take to production state-of-the-art physical layer wireless communication system algorithms for very high data rate applications.\nDesign and implement the bring-up infrastructure including chip drivers, debug tools, and automation environment.\nBuild and implement test plans; collect and analyze test results; identify, root-cause, and debug issues.\nChampion the test campaigns through the bring-up, tuning, characterization, and other phases of post-silicon chip development."}, "200304261": {"jobID": "200304261", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Software Quality Engineer (Automation) - Media", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200304261/software-quality-engineer-automation-media?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in CS/CE/EE or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "3+ years of QA ExperienceHigh Proficiency in Python or similar OOP languagesAutomation experience (development & execution)Quality communication skills in listening, open-mindedness, cohesion and clarityProven technical leadership skills and a standout colleagueUnwillingness to settle for a product that is merely “good enough”BS in CS/CE/EE or equivalent experience• Creating Tools (Apps, scripts, etc) to help with validation efforts• Media Domain experience/knowledge is a plus", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we're looking for individuals like you!\n\nThe Media Frameworks QE team is seeking a self-motivated Software Quality Engineer to ensure a stellar Media Experience across the Apple Ecosystem. The Audio & Media Technologies Group (AMT) provides the media and graphics foundation across all of Apple's innovative products, including Mac, iPad, iPhone, iPod, TV, Watch and AirPods/Beats line of Products. \n\nWe are looking for someone with established QA automation experience, excellent interpersonal skills and a dream to work in a fast-paced environment. In this role you will develop automation using Python frameworks and execute tests for new Media related features."}, "200459157": {"jobID": "200459157", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Software Engineer: CPU Power, Clocks, and Time", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459157/software-engineer-cpu-power-clocks-and-time?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 3 years relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience with low-level CPU hardware/software interfaces, cycle- and time-sensitive programmingDeep understanding of CPU structure, pipeline flow and clock hierarchyExperience using low-power optimization design features and use of dynamic frequency and voltage controlsLow-level (assembly and C language) programming experienceOn-Chip Debug (JTAG-level debugging)Oscilloscope /instrument setup and reading schematics diagramsDeveloped rigor in identifying high quality validation scenarios, coverage gaps, and effective use of debugging toolsAbility to work well on a team, yet responsible and self-driven in planning and executionBachelor's degree and a minimum of 3 years relevant experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. We are looking for a device-level software engineer to develop test code to drive the CPU Power, Clocks and Time functions with the goal of post-silicon validation and identifying design issues."}, "200458648": {"jobID": "200458648", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Analog/Mixed-Signal Layout Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458648/analog-mixed-signal-layout-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Proven experience in analog/mixed-signal layout design of deep sub-micron CMOS circuits-  Experience in implementing analog layouts to achieve tight matching, low noise, and low power consumption. Layouts may include data converters, PLLs, analog blocks, resistors, capacitors, pad IOs, ESD structures, etc.-  High level of proficiency in custom and standard cell based floor-planning and hierarchical layout assembly.-  Must understand techniques for leading IR drop, RC delay, electro-migration, self heating and coupling capacitance.-  Must recognize failure prone circuit and layout structures, have experience with analog and DFM standard methodologies, and proactively work with circuit designer to identify the best approach to solving problems.-  Deep proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc. reports.-  Knowledge of MENTOR GRAPHICS or CADENCE layout tools.-  Scripting skills in PERL or SKILL are considered a plus, but not required.-  Excellent communication skills and able to work with multi-functional teams.Bachelors of Science in Electrical Engineering and 3+ years experience preferred", "jobDescription": "Together we could help craft the future's finest devices. New insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish! \n\nOur team is searching for a self-motivated engineer for the role of HSC Layout Designer. As a member of the HSC team, we will be working on the forefront of technology nodes to build outstanding custom analog and mixed-signal designs used to connect our world-class products to the world in the most efficient way possible.\n\nYou will become part of a development team that nurtures engineering excellence, creativity and innovation. Collaboration across teams is a key component of success at Apple. The right candidate will thrive in that type of environment. Multifaceted, thoughtful people and inspiring, innovative technologies are the norm here. \n\nWill you help us design the next generation of revolutionary Apple products?"}, "200458313": {"jobID": "200458313", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Touch Product Design - Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458313/touch-product-design-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSME required; MSME, PhD preferred (or equivalent)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 2+ years of hands-on experience designing for a production environment. High volume, consumer electronics or sensing experience is a plus.3D CAD experience is required.Excellent written and verbal communication skills.Able to craft clear engineering documentation.Able to effectively collaborate with diverse team members and external vendors to achieve project goals.BSME required; MSME, PhD preferred (or equivalent).", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Sensing Product Design team is looking for a talented mechanical engineer to develop great experiences and bring Apple products to life. We are the team developing many of the sensors that changed the way people interact with their technology. Touch redefined the phone and tablet, Touch seamlessly secured them, and the heart rate monitor let you keep tabs on yourself."}, "200401567": {"jobID": "200401567", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Concept Prototyping Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200401567/concept-prototyping-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS in mechanical, electrical engineering or technically similar field is required. 2-4 years of experience is desired."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "The ideal candidate will have many of the following qualifications:Exceptional problem solving skills.Demonstrated ability to fabricate and evaluate prototypes while attending to aesthetic details.Ability to balance speed and quality of work based on objectives.Independent, self-starter, with good interpersonal skills.Excellent communication skillsExperience with CAD software such as Solidworks, AutoCad, etc.Experience with rapid prototyping tools such as 3D printers, laser cutters and CNC machines.Some experience writing software for analysis and debugging.Some experience with Labview, Matlab and/or Simulink.A passion for doing the best possible work.- BS in mechanical, electrical engineering or technically similar field is required. 2-4 years of experience is desired.", "jobDescription": "In this creative role, you will work with a variety of disciplines and product groups within Apple to create novel devices and systems. You will play a central role in exploring interaction concepts and electromechanical subsystems for Apple products."}, "200467064": {"jobID": "200467064", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Touch and Sensing Product Design - Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467064/touch-and-sensing-product-design-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSME required; MSME, PhD preferred (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "At least 2+ years of hands-on experience designing for a production environment. High volume, consumer electronics or sensing experience is a plus.3D CAD experience is requiredExcellent written and verbal communication skillsAble to craft clear engineering documentationAble to effectively collaborate with diverse team members and external vendors to achieve project goalsBSME required; MSME, PhD preferred (or equivalent)", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Sensing Product Design team is looking for a talented mechanical engineer to develop great experiences and bring Apple products to life. We are the team developing many of the sensors that changed the way people interact with their technology."}, "200449024": {"jobID": "200449024", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Graphics Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449024/graphics-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Knowledge of graphics rendering algorithms and/or computer architecturesKnowledge of one or more GPU APIs like OpenGL/DirectX, OpenCL/CUDA, MetalSolid C/C++ programming skillsCache and memory hierarchy understanding is a strong plusExcellent interpersonal skills and ability to collaborate under bold schedulesMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We are seeking a Graphics Modeling Engineer will deliver high-quality GPU function and/or performance models to meet the needs of GPU hardware development. This includes writing models for functional development and verification of a GPU design, performance exploration, performance validation, and power estimation. You will collaborate closely with the architecture team, hardware design team, design and verification teams."}, "200443815": {"jobID": "200443815", "origin_search": null, "posted": "Dec 18, 2022", "jobTitle": "PHY Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443815/phy-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be essential for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc..Knowledge of cellular communication standards: 5GNR, 4G LTE, 3G (HSPA), 2G GSM.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? We are searching for a talented engineer with years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200460454": {"jobID": "200460454", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Wireless Power Magnetics Architect (FEA)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460454/wireless-power-magnetics-architect-fea?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. + 3 yrs experience or Ph.D. (preferred) in material science or power electronics (ECE) program, or related area (e.g. engineering physics)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with COMSOL and/or Maxwell FEA simulation toolsUnderstanding of physics of magnetic materialsExperience with transformer theory and modelingBackground in electromagnetics and a sound facility with Maxwell’s equationsStrong analytical/problem solving skillsFamiliarity with common lab equipment and measurement techniques including network analyzers, LCR meter, power supply/amplifiers, oscilloscopes, etc.Must be highly motivated, self-starter with innovation, integrity and attention to details.Excellent problem solving skillsWillingness to work in a fast paced innovative work environmentOutstanding verbal, written and interpersonal skills(Desired) Experience in circuit simulation and modeling and related software tools (e.g. Cadence)M.S. + 3 yrs experience or Ph.D. (preferred) in material science or power electronics (ECE) program, or related area (e.g. engineering physics).", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day."}, "200451123": {"jobID": "200451123", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451123/embedded-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in C or C++Experienced with embedded software, bare metal.BS and a minimum of 10 years relevant industry experienceFamiliar with boot code, low-level OS code, device drivers, and IO devicesExperience with computer initialization, SoC bring-up, debuggers, and networkingExperience with FPGA, Verilog, HDLUnix system-level programming, embedded LinuxScripting (Python, Bash, Perl, TCL, Lua)Experience with Xilinx Zynq or Altera SoC platformWorking knowledge of schematics and lab equipment", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.\n\nFirmware and systems engineer for board management controllers and related projects. Platforms: Embedded Linux, bare metal, and Mac/Linux controlled laboratory devices. Secondary responsibilities include but are not limited to: hardware specification and schematic review, embedded Linux infrastructure, regression and release systems, utilization tracking, regression/release systems, and manufacturing support for a cross-functional team.\n\nApple designs many product-destined SoCs and test chips each year; each one has multiple complex bring-up and characterization boards designed for them; our team enables our full suite of firmware for each board to enable both in-person and remote bring-up, analysis, and debug of the silicon in person and at scale."}, "200450086": {"jobID": "200450086", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "PHY RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450086/phy-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Ideally at least 7 years of industry experience in wireless PHY design engineeringStrong fixed-point knowledge and extensive experience with bit-true cycle-accurate verificationsUnderstanding of Decoders - Viterbi, LDPC, PolarUnderstanding of Filter design, multi-radix implementation and compromisesKnowledgeable in modern design techniques and energy-efficient/low power logic design and power analysisFamiliarity with power estimation (vector-less and vector-based), modeling, profiling, and post silicon power correlationSolid understanding of wireless standards, such as IEEE 802.11, 802.15, Bluetooth or 3GPP is a plusBackground in computer architectureBus fabric, especially APB/AHB/AXIPower management with multiple power domainsPower management with multiple power domainsProven track record of bringing logic designs into high volume productionAbility to work well in a team and be productive under ambitious schedulesShould exhibit excellent communication skills and be self-motivated and well organizedExperience with FPGA and/or emulation platform desiredExcellent communications skills – both written and oralBS and 10+ years of relevant industry experienceBS and 10+ years of relevant industry experience.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply.\n\nWe are looking for Physical Layer design engineers to design and implement advanced signal processing algorithms for Wireless LAN communication systems. Primary job responsibility is the architecture, design and verification of 802.11ac physical layer algorithms. In this role you will interact with protocol, software and systems teams to develop state-of-the-art wireless silicon for applications in Apple products."}, "200426504": {"jobID": "200426504", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "PHY RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200426504/phy-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "At least 7 years of industry experience in wireless PHY design engineeringStrong fixed-point knowledge and extensive experience with bit-true cycle-accurate verificationsUnderstanding of Decoders - Viterbi, LDPC, PolarUnderstanding of Filter design, multi-radix implementation and compromisesKnowledgeable in modern design techniques and energy-efficient/low power logic design and power analysisFamiliarity with power estimation (vector-less and vector-based), modeling, profiling, and post silicon power correlationSolid understanding of wireless standards, such as IEEE 802.11, 802.15, Bluetooth or 3GPP is a plusBackground in computer architectureBus fabric, especially APB/AHB/AXIPower management with multiple power domainsPower management with multiple power domainsProven track record of bringing logic designs into high volume productionAbility to work well in a team and be productive under ambitious schedulesShould exhibit excellent communication skills and be self-motivated and well organizedExperience with FPGA and/or emulation platform desiredExcellent communications skills – both written and oralBS and 10+ years of relevant industry experience.BS and 10+ years of relevant industry experience.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply.\n\nWe are looking for Physical Layer design engineers to design and implement advanced signal processing algorithms for Wireless LAN communication systems. Primary job responsibility is the architecture, design and verification of 802.11ac physical layer algorithms. In this role you will interact with protocol, software and systems teams to develop state-of-the-art wireless silicon for applications in Apple products."}, "200447819": {"jobID": "200447819", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Cellular Field Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447819/cellular-field-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor’s degree in Electrical Engineering, Master’s preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Hands-on experience with end to end testing of cellular technologies that includes test plan preparation, field testing, log analysis & debugging UE issues.You have working knowledge in at least one of the wireless technology 5G NR, LTE/LTE-A, UMTS.Deep understanding of cellular protocol stack from LTE PHY/MAC to higher layers, Call processing.Familiarity with RF test equipments i.e. R&S, Spirent, Agilent/keysight for wireless validation.You have experience owning a complete functional area of an application or product with clear communication across multiple levels in the organization.Excellent verbal and written communication skills, detailed oriented, analytical, able to work independently.Travel for work up to 50% (domestic and sometimes internationally)- Bachelor’s degree in Electrical Engineering, Master’s preferred.- Hardworking and ambitious, able to take on obstacles in innovative ways- Knowledge of Antenna/ RF design is a plus.- Basic scripting experience (Shell/Perl/Python/Matlab)", "jobDescription": "At Apple, new ideas have a way of becoming products, services, and customer experiences very quickly!   \n\nDo you want to impact millions of users by developing an extra-ordinary product with a prime focus on accuracy, understandability and performance of the product?   \n\nWe are the Apple Field Design Engineering team, and we are seeking a highly motivated and technical individual to work on testing unreleased apple products. You will be responsible for evaluating the latest iPhone, iPad and Apple Watch hardware systems, in the field, from early prototype to final products, on different network and wireless technologies, including performance metrics creation/evolution, post processing and analysis of device logs from the field.   \n\nCome join our team and become part of a hands-on team that fosters engineering excellence, creativity and innovation. We are a team of multifaceted, encouraging people and innovative technologies are the norm here. Bring passion and dedication to your job and there's no telling what you could accomplish, imagine what you could do here!"}, "200462302": {"jobID": "200462302", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Sensor Process Engineer - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462302/sensor-process-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "10-15 years’ experience with MSc/PhD in physics, electrical engineering, or a similar field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "You will have 10-15+ years of process integration experience:Design and manufacturing experience in optoelectronic devicesHands-on experience with modern 300mm Silicon or III-V semiconductor process technology. Assembly process experience is a plus.Ability to use contemporary and industry standard process monitoring tools to statistically evaluate the performance of a manufacturing cell or moduleAbility to define simulations and work with physicists in realizing realistic simulations of new ideasStrong device physics, excellent analytical and problem analysisAbility to work closely with others in a very multi-functional team environmentDemonstrated success with several designs fabricated in modern groundbreaking foundries or captive fabsExperience developing sensor specifications and working with new sensor developmentDeep knowledge of industry standards10-15 years’ experience with MSc/PhD in physics, electrical engineering, or a similar field.", "jobDescription": "Why Apple? \n\nWe live in a mobile and device driven world where knowledge of the physical world \naround us is needed. We rely on this knowledge to get around, to learn about our\nenvironment and to design and enable spectacular new and challenging features for \ncustom applications. \n\nApple is meeting those challenges as robustly and as creatively as possible and is looking \nfor people who want to be a part of our Camera Sensing Devices Hardware team. \n\nThe Camera Hardware team is responsible for all research, design, development, test, \nand qualification of camera hardware for Apple products. As a key member of the Camera \nSensing Devices team, you will be responsible for working with suppliers to help design \nand bring up new sensing devices to enhance performance and yields. You will work with \noperations engineering on yield issues, as well as work with suppliers on process \ndevelopment to enable next generation sensing technologies."}, "200458105": {"jobID": "200458105", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Software Developer in Test, File Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458105/software-developer-in-test-file-systems?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Strong computer science fundamentals required - no matter how you got them."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "A solid understanding of QA testing methodologies and practices preferred.Excellent understanding and ability in a scripting language such as Python, Bash, Ruby, LUA, Perl.Familiarity with CShould be able to use scripting ability to create new automation tests.Detail oriented, analytical, and creative problem solver with passion for quality processesComfortable working in a constantly evolving and dynamic environment and driving top issues to resolutionFamiliarity with Source Control Management such as svn or gitExcellent written and verbal communication skillsFamiliarity with iOS, macOS or other operating systems such as Unix/Linux desirableStrong computer science fundamentals required - no matter how you got them.", "jobDescription": "The Local File Systems QA  team within Apple's Core OS organization is looking for a talented and inspired Engineer to work on the Local File Systems Quality Team. \n\nThe team is responsible for validation and support of file systems on all platforms. This position’s primary focus will be supporting The APFS file system, but an understanding of our teams other deliverables will also be required. Successful candidates will work hands-on with a team of quality engineers on the validation of new features, protocols, and hardware, as well as provide world-class support for existing deployments!"}, "200452373": {"jobID": "200452373", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452373/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a Bachelor's Degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusUnderstanding of embedded software development, RTOS and/or LinuxUnderstanding of computer architecture, operating systemUnderstanding of boot code, CPU & SOC initialization, device driversGood troubleshooting skills in embedded software debuggingExperience with script language such as Python, Perl, or TclMinimum requirement of a Bachelor's Degree", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200451429": {"jobID": "200451429", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer – Design Verification Tools and Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451429/cad-engineer-design-verification-tools-and-infrastructure?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS Degree + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Familiarity with Verilog and SystemVerilog is a plus.Familiarity with Synopsys VCS, Xcelium or Modelsim is a plus.Good communications skills are required and prior customer support experience is a plus.Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.Familiarity with Verdi, Indago and/or SimView is a plus.Strong scripting/coding abilities in Python/Perl are needed.Good communications skills are required and prior customer support experience is a plus.Knowledge of C/C++, Java or any other OOP programming language is a plus.Minimum requirements of BS Degree + 3 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers create products for millions of customers across the world!\n\nAs a member of our CAD team, you will develop, maintain, and enhance existing sophisticated software systems for regression-testing Apple’s silicon designs in software simulation, to find and report defects in our chip designs, and thus ensure that Apple tapes-out world-class silicon. Your experience and innovative ideas will inform the design of the next generation of these regression systems. Your experience and insight, your skill at diagnosing the root cause of complex problems, and your ability to guide engineers who come to you with problems will be important contributions to an extended CAD team that comprehensively supports Apple’s DV and chip design engineering efforts. You will work closely with EDA vendors to incorporate new capabilities of their commercial tools, and to resolve problems."}, "200449875": {"jobID": "200449875", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CAD Engineer – Design Verification Tools and Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449875/cad-engineer-design-verification-tools-and-infrastructure?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS Degree + 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Familiarity with Verilog and SystemVerilog is a plus.Familiarity with Synopsys VCS, Xcelium or Modelsim is a plus.Good communications skills are required and prior customer support experience is a plus.Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.Familiarity with Verdi, Indago and/or SimView is a plus.Strong scripting/coding abilities in Python/Perl are needed.Good communications skills are required and prior customer support experience is a plus.Knowledge of C/C++, Java or any other OOP programming language is a plus.Minimum requirements of BS Degree + 3 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers create products for millions of customers across the world!\n\nAs a member of our CAD team, you will develop, maintain, and enhance existing sophisticated software systems for regression-testing Apple’s silicon designs in software simulation, to find and report defects in our chip designs, and thus ensure that Apple tapes-out world-class silicon. Your experience and innovative ideas will inform the design of the next generation of these regression systems. Your experience and insight, your skill at diagnosing the root cause of complex problems, and your ability to guide engineers who come to you with problems will be important contributions to an extended CAD team that comprehensively supports Apple’s DV and chip design engineering efforts. You will work closely with EDA vendors to incorporate new capabilities of their commercial tools, and to resolve problems."}, "200464764": {"jobID": "200464764", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Production Coordinator, Interactive Software", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464764/production-coordinator-interactive-software?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor Degree or relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$106,500", "max": "$160,500,"}, "benefits": null, "requirements": "Passion for creating imaginative experiences powered by innovative technologyExperience working on entertainment media and/or interactive digital consumer software projectsYou work effectively with creative, development, and cross-functional teamsYou deliver results and have a can-do demeanor when it comes to hitting achievements and meeting deadlinesYou are able to build positive relationships with colleagues and business partners, and you can communicate effectively one on one and in large groupsYou have strong communication and interpersonal skills and thrive working in a creative and dynamic environmentYou are highly organized and love to craft efficiencies to further streamline processesBachelor Degree or relevant industry experience", "jobDescription": "At Apple, we strive to achieve surprise and delight for every one of our millions of customers around the world. We are looking for people with proven track records of shipping sophisticated programs under demanding timelines.\n\nThis is a hands-on Production Coordinator position. In this position, you will work with the most creative people in the world to transform ground-breaking ideas and concepts into consumer experiences that enchant and inspire. \n\nYou will play a critical role in creating world-changing products from initial concept through delivery to customers. You should demonstrate high integrity, feel comfortable in constantly evolving environments, and have a talent for handling detailed project execution. You will need the ability to build strong relationships, empower teams and solve challenges. As a Production Coordinator, you will be involved in supporting creative and technical teams who build interactive software projects that blend creativity with technology in uniquely impactful ways. If you relish responsibility and are excited by the opportunity to build products that delight millions of customers then we want to hear from you - please apply!"}, "200452778": {"jobID": "200452778", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: Embedded and Low-level Programming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452778/silicon-validation-software-engineer-embedded-and-low-level-programming?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in C/C++, assembly a plusBackground in embedded software development, bare metal, RTOS and/or LinuxSolid understanding about ARM specification, computer architecture, operating systemExperience in boot code, CPU & SOC initialization, device driversFamiliar with IO protocols: I2C, SPMI, UART, GPIOExperience in lpDDR4/5, DRAM initialization and calibration a big plusGood troubleshooting skills in silicon bring-up and embedded software debuggingExperience with script language such as Python, Perl, or TclBS and a minimum of 3 years relevant industry experience", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. We are looking for software engineers with background in embedded software development to join a fast-paced environment. In this role, you will contribute to developing embedded software solution, debug and bring-up of the state-of-the-art next generation SOCs, supporting current and future Apple products. Your work will have a critical impact on getting high quality functional products to millions of customers quickly. You will be part of our core infrastructure team responsible for developing and improving our embedded silicon test software platforms, including Common Firmware Environment and RTOS."}, "200451543": {"jobID": "200451543", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Implementation Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451543/cpu-implementation-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceExperience in driving chip implementation (preferably CPUs) from definition phase to silicon correlationFamiliarity with high performance microprocessor architecture fundamentalsKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture and implementation techniquesDesign experience in deep submicron technologies and basic transistor level design and device physicsExperience using synthesis & place-route toolsExperience with scripting in Perl and/or TCLMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) is hiring experienced engineers for the CPU Implementation leadership team."}, "200355493": {"jobID": "200355493", "origin_search": null, "posted": "Mar 12, 2022", "jobTitle": "Pre-Silicon Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200355493/pre-silicon-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Masters's degree or higher in Computer Science or equivalent field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with SoC or/and GPU acceleration for AIExperience with hardware reference modelsExperience with hardware performance and power modelsExperience with SW/HW parallelism, and asynchronous processingExperience with embedded systems, and real time OS developmentExcellent programming skills of C/C++Excellent software design, problem solving and debugging skillsGood understanding of Deep Learning workloadsExcellent communication and teamwork skillsMasters's degree or higher in Computer Science or equivalent field.", "jobDescription": "We are looking for an engineer to join the ANE Compiler Pre-Silicon team, which is responsible for enabling new hardware features in our simulation environment and doing the initial chip bring up. The ideal candidate will enjoy working across our ANE hardware and software architecture to achieve this, and have a passion for squeezing the best possible performance out of the ANE hardware."}, "200384160": {"jobID": "200384160", "origin_search": null, "posted": "May 24, 2022", "jobTitle": "Sr. HID Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200384160/sr-hid-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in CS/EE/ME or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Expertise in C or C++ for Embedded SystemsStrong communication and collaboration skillsExperience with multithreaded programmingExperience developing complex architectures in RTOS environmentsWorking knowledge of inter-processor communication methodologies and SOC concepts such as MMU’s, caching strategies, and ARM architecturesExperience designing and implementing communication protocolsExperience optimizing for memory and execution time in resource constrained environmentsExperience with sophisticated debugging in embedded environments (e.g., coredumps, traces)Experience with NEON / SIMD or similar hardware acceleratorsDeep experience working with analog and digital sensorsProven capability to apply software standard methodologies to firmware designsExperience contributing to large software projectsExperience with unit testing, static analysis, and continuous integration8+ years of relevant experience preferredBS in CS/EE/ME or equivalent", "jobDescription": "The Human Interface Device (HID) group is looking for motivated engineers to join the multitouch development team. Firmware delivered by HID powers the amazing sensing interfaces used on iPhone, iPad, Mac, AirPods, health sensors, and more.\n\nOur engineers are involved in all phases of product development, from the earliest concept reviews all the way through first customer ship. This includes architecture development, custom silicon design, hardware bringup with our EE partners, firmware design/implementation, and working with our Algorithm/Software/Quality partners to deliver the user experience for which Apple products are so well known.\n\nJoin our team and help shape the future of the Apple Touch experience. With millions of customers, our team’s impact is felt around the world!"}}