{"200451353": {"jobID": "200451353", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Mixed Signal IP Post-Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451353/mixed-signal-ip-post-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in first silicon bring-up, debug, validation, characterization and reportExperience with data converter, PLL, filters, SerDes, DDRExperience developing automated testing script and instrument controls, Python preferred.Familiar with measurement equipment including signal generator, spectrum analyzer, scopeEmphasis on quality of work: should self-check scripts, test patterns, and reportsBachelors Degree\n3 years of experience", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a dedicated Mixed Signal IP Post-Silicon Validation Engineer! In this highly visible role, you will perform lab validation and characterization of coordinated circuits; and you will collaborate with many fields to launch the world's premiere mobile chips. As a member of our multifaceted group, we have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200459170": {"jobID": "200459170", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Sr. iPhone Hardware Systems Design Engineer - SOC", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459170/sr-iphone-hardware-systems-design-engineer-soc?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSEE/MSEE/PhD"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "3+ years proven experiencesStrong EE fundamentals and problem solving skillsDeep understanding of mobile SoC architecture and functionalityStrong experience and knowledge in SOC functionality and performance testing and validationHands-on experience in SoC/board/system-level bring up, issue debug, and testing, lab equipments to measure power/thermal/performanceHigh level of knowledge in mobile system power delivery and PMICConfirmed engineering passion, initiative, innovation, and creativityScripting languages (Python, Perl, Shell, etc.)BSEE/MSEE/PhD", "jobDescription": "The iPhone HW Engineering team is seeking a hardworking electrical hardware engineer to work on the iPhone system technologies areas. The ideal candidate will work with multi-functional teams to perform in-depth analysis, testing, and validation of iPhone SoC power and performance, and improvement of systems design."}, "200464481": {"jobID": "200464481", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Sr. Software Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464481/sr-software-integration-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or Master degree in Computer Engineering or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of SW development and system integration experienceHave a deep understanding of branching and software configuration management. Hands-on experience with GITFamiliar with automated build, continuous integration, and test automation systems. Experience with Jenkins or similar toolsExperience with administration and deployment of highly scalable, concurrent build systems. Experience with Docker and/or Kubernetes is a plusRich experience with Scripting languages (Python, Perl, or equivalent) and integration automation/tools developmentExperience with Web portal development and continuous integration KPI dashboard generation is a plusDomain knowledge expertise with how cellular network works and interacts with network, knowledge of protocol network layers, bands, etc., skill to setup network simulatorsKnowledge of system test automation execution and experience in isolating issues, both software/hardwareFamiliar with operating test equipment (CMW500, Anritsu, Keysight) are a plusExcellent written and verbal communication skills are needed to facilitate close interaction with development teams, management, project management, and other organizations within AppleObsessively passionate and inquisitive, and seek to pursue everyday problems in innovative waysLaser-focused on the smallest details that are important to our customersBachelor or Master degree in Computer Engineering or equivalent degree", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin our Wireless Technologies and Ecosystems(WTE) Engineering team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. We're a passionate and key team that helps drive design, develop and integrate cellular chipsets in Apple products. You will join a hands-on system integration team that nurtures creativity and generates novel solutions to deliver engineering perfection."}, "200455301": {"jobID": "200455301", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455301/soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  Good SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal and communication skills and the dream to take on diverse challengesMinimum of BS + 10 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200455222": {"jobID": "200455222", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455222/soc-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  Good SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal and communication skills and the dream to take on diverse challengesMinimum of BS + 10 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200310135": {"jobID": "200310135", "origin_search": null, "posted": "Apr 13, 2022", "jobTitle": "Senior Tools Software Engineer - iOS Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200310135/senior-tools-software-engineer-ios-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or related field, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Technical proficiency with software development (ideally with Swift, Objective-C, C++, or similar languages)Extensive expertise with Swift, iOS or macOS fundamentals and frameworksExperience with C++ or Metal is nice to haveStrong analytical and problem solving skills, including looking beyond the first answer for hidden issuesAbility to analyze large features and implement practical solutionsStrong communication skills and good teammateCreative and critical thinking, with attention to detailUnderstanding of real-time systemsBS degree in Computer Science or related field, or equivalent work experience5+ years experience with designing and implementing iOS apps in production 5+ years experience with Swift with a deep understanding of Swift Standard Library and designing Swift API’s Experience with multi-threading in Swift 2+ years experience with real-time systems", "jobDescription": "Join Apple’s Special Projects Group (SPG) and play a role in bringing autonomous technologies to the real world. We are looking for a hardworking, dedicated, and results-oriented engineer to help us build visualization tools. We work in a fast-paced environment, where your curiosity and creativity will have an opportunity to shine. Join Apple and help us leave the world better than we found it!"}, "200462418": {"jobID": "200462418", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "ASIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462418/asic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree + 3 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "RTL Logic Design experience of multi-million gate ASICsHands on experience in all aspects of the chip development process withProficiency in front end tools and methodologiesExperience writing specifications and converting them to designExperience with multiple clock domains and asynchronous interfacesExperience or knowledge of system architecture, CPU & IP Integration, andpower and clock management designs desirable.Ability to communicate optimally across all internal groupsFamiliarity with software and operating concepts a plusFamiliarity with scripting languages like Perl or Tcl a plusBachelor's Degree + 3 Years of Experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Sophisticated, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next excellent Apple product. Do you enjoy working on challenges that no one has solved yet? As a member of our complex group, you will get the outstanding and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Are you ready to join a team transforming hardware technology? We are searching for a dedicated engineer to join our exciting team of problem solvers."}, "200460113": {"jobID": "200460113", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Digital Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460113/digital-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.ASIC/VLSI design experience and a track record of developing complex ASIC functions in successful products.Excellent microarchitecture and logic design experience including high speed deep sub-micron design and power management/techniques for low power design.Experience with DSP hardware implementations including data path and control logic.Experience with cellular physical layer protocols. 3GPP is a plus.Familiarity with design tools for simulation, debugging, synthesis, timing analysis, and front-end RTL checking tools (e.g., Lint, CDC/RDC, LEC, etc.).Expertise in Verilog RTL development.Familiarity with low power design techniques at different levels is a plus.Knowledge of C/C++/SystemC and DSP algorithm modeling is a plus.Experience with backend interface, DFT, and silicon debug are pluses.BS and 10+ years of relevant industry experience.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our team, you’ll craft sophisticated digital baseband logic design in state-of-art cellular ICs that deliver more performance in our products than ever before! You’ll work across different fields to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations! By collaborating with our other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. \n\nAs a Digital IC Design Engineer on this team, you will be at the center of the digital logic design effort within a silicon design group responsible for designing and productizing innovative wireless SoCs. This position requires someone comfortable with all aspects of hardware and embedded software development, who thrives in a dynamic multi-functional organization, who is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200451393": {"jobID": "200451393", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Integration Engineering Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451393/wireless-systems-integration-engineering-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven experience in system design, integration, bringing up and productization of wireless communication systems.Experience in bringing up a wireless communication system chip including initial bringup/tuning of most of the key blocks, tuning of the tx, rx chains, and/or implementation and optimization of radio or phy communication or calibration algorithms.Substantial experience in system designs and integration, preferably leading projects or teamsDeep understanding of communication theory and signal processing related algorithms (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, etc.)Extensive experience, knowledge and skills on system design, integration, bring up, characterization and debug of real wireless silicon in labExperience using and understanding of the theory of operation of lab equipment (spectrum analyzer, signal generator, power meter, etc.).Experience bringing up a wireless chip form,  modem architecture, microprocessor architecture, hardware and software control.Experience with silicon prototyping, emulation systems, and virtual platforms is a plus.Experience with multi-radio coexistence management is a plus.Knowledge in existing wireless communication protocols: LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE.Experience with Matlab, Python, Shell scripting and/or C/C++BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Wireless System Engineer. As a member of our wide-ranging group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nIn this lead technical role, you will lead chip bringup and characterization efforts including physical layer system design, integration, and characterization of state-of-the-art wireless SoC products at the center of a silicon design group from conception to production."}, "200451805": {"jobID": "200451805", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CPU Post-Silicon Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451805/cpu-post-silicon-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience with CPU architecture and micro-architecture conceptsExperience working in a performance modeling environmentExperience with tracing on silicon for performance evaluationProficient in scripting languages such as Python or PerlComfortable with C and C++Knowledge and experience with common performance benchmarks and workloadsKnowledge of OS internals and compiler technology is a plusExperience in analyzing application performanceMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200448942": {"jobID": "200448942", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Sr. Cellular DevOps Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448942/sr-cellular-devops-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or Master degree in Electrical Engineering, Computer Engineering or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "6+ years relevant job experienceAdmin level experience with MacOS/Unix/LinuxExperience with a large scale configuration management and continuous integration system CI/CD solutions (Git, Gerrit, Jenkins, Artifactory)Strong experience with container technologies (Docker/Kubernetes)Strong experience with scripting languages (Python, JavaScript, Bash)Experience with Build systemsExperience with set up application monitoring (Nagios, Kibana, Splunk, Grafana, Prometheus, Graphite)Experience with following technologies is a plus: Networking, NFS Storage, Firewall, MySQL, MSSQL, Couch DB, mongoDBGood verbal and written English communication skillsFast learning and adapting to changing requirementsBachelor or Master degree in Electrical Engineering, Computer Engineering or equivalent degree", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nImagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Smart people and inspiring, innovative technologies are the norm here. Do you love working on challenges that no one has solved yet? Are you ready to be part of a team redefining wireless technology? Join us to help deliver the next groundbreaking Apple product. Wireless Technologies team is looking for highly motivated and creative engineer to work on our next generation products. The duties of this position will ensure stability, scalability and performance of the large scale development environment. You will work closely with developers and infrastructure team to set technical direction to improve overall user experience."}, "200451072": {"jobID": "200451072", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Sr. Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451072/sr-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Validated experience in firmware, device driver.Software development experience using C and assembly language, with ARM SoCs.FPGA development and test.Experience in developing low-level drivers and HW bring-up, using test tools and interacting with HW design teams.Exposure to multiple high-level programming languages, including C, C#, C++Experience using MS Visual Studio IDE, as well as (command line) gnu toolchain.Experience with Configuration Management tools (git, Subversion).Experience with scripting languages (i.e. Bash/shell, Perl, Python, VBA)Bluetooth and WIFI experience preferred.Experience with MCUs, peripherals, features, and development environments is also valuable.Proven track record to design and integrate code into a shipping product against ambitious timelines.Strong electrical system and software debugging skills are essential. ICE/JTAG experience is preferred.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nAs a Firmware Engineer, you will be developing embedded software solutions for our current and future products."}, "200284913": {"jobID": "200284913", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Mechanical Design Engineer - Sensing Product Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200284913/mechanical-design-engineer-sensing-product-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Bachelor/MS/PhD degree in engineering\nMinimum of 2 years of relevant industry experience or PhD degree in related area"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "2+ years of hands-on experience designing mechanical components or systems for a production environment.Proficiency in 2D drafting, 3D conceptual modeling (NX preferred), tolerance analysis, and design trade-offs.Strong mechanical engineering analytical skills. Experience using FEA to drive design decisions is strongly preferredAbility to collect and use data to inform decisions and fuel debate in an open and intellectually honest manner.Clear and concise communication skills  with ability to adapt written and verbal messaging for a variety of audiences.Cross-disciplinary approach to design; collaborates with a diverse team as well as external vendors to solve complex problems and achieve project goals.Demonstrated ability to drive failure analysis to determine root cause and develop effective corrective actions.Nice-to-have Skills:Consumer electronics knowledge is preferred; familiarity with capacitive sensing technology is a strong plusKnowledge of basic engineering materials (plastics and adhesives) and manufacturing processes, specifically in high-volume mass productionDetail oriented and capable of handling multiple assignments at onceCurious, willing to learn new skills, and share knowledgeWorking experience or academic training in:Sensors, electrical circuit design, thin film technologiesProgramming and scripting (MATLAB or Python preferred)Tolerance analysis and process capability analysisStatistical and regression analysis, response surface modeling (JMP or Minitab)Finite Element Analysis (FEA) of mechanical, thermal, static/dynamic environment (Ansys, Abaqus, Comsol)Nonlinear material characterizationBachelor/MS/PhD degree in engineering\nMinimum of 2 years of relevant industry experience or PhD degree in related area", "jobDescription": "The Sensing Product Design team is looking for a talented mechanical engineer to build great\nexperiences and bring Apple products to life. We are the team developing many of the sensors\nthat changed the way people interact with their technology. Touch redefined the phone and\ntablet, TouchID seamlessly secured them, and the heart rate monitor let you keep tabs on\nyourself.\n\nIn this role, you will be responsible for specifying, developing, characterizing and validating touch sensing systems.  You should be familiar with sensor technologies, along with related product integration and manufacturing technologies."}, "200452742": {"jobID": "200452742", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "5G/4G Cellular Layer1 Control Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452742/5g-4g-cellular-layer1-control-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS + 3 years of relevant industry experienceHands-on experience with PHY L1 Software/Firmware in 3G/4G and/or 5G.Good understanding of software engineering principles, and core computer science fundamentals.Proficiency with C and/or C++, compilers, build and source code control tools.Experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programming.Working knowledge of computer architecture with particular emphasis on the HW/SW interfaces of high-speed communication subsystems.Experience with silicon prototyping, emulation systems, and virtual platforms.Proficiency debugging embedded software systems.Familiarity with UARTs, JTAG, and oscilloscopes.Knowledge and experience of Matlab is a plus.Minimum BS + 3 years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible. As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. You’ll work across fields to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. \n\nAs a Cellular Physical Layer Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for designing and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to change directions on constantly evolving requirements."}, "200359595": {"jobID": "200359595", "origin_search": null, "posted": "Mar 23, 2022", "jobTitle": "System Architecture Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200359595/system-architecture-engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in electrical engineering or computer engineering \n15+ years work experience \n10+ years managing a team"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$299,000,"}, "benefits": null, "requirements": "You have phenomenal system architecture fundamentals: a deep understanding of how data flows in a system, developed intuition on product definition, and can apply it to new features through experienceMust have strong analytical skills to lead the team on key systems engineering architectural and implementation trade-offs including power and performance in a thermally constrained system, analyzing silicon, PCB, and interconnect floor plans while taking SI, EMC and RF into considerationBroad knowledge of technologies from fundamental theory of operation to system requirements to integration challenges in areas including displays, cameras, audio, sensors, wireless, and power.Experience designing high volume products from beginning to end as well as experience creating and influencing system specification documentsStrong verbal communication skills across organizations and at the executive levelExcellent written skills for clear reporting of data analysis and conclusionsBS/MS/PhD in electrical engineering or computer engineering \n15+ years work experience \n10+ years managing a team", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it."}, "200452735": {"jobID": "200452735", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF OTA Connectivity Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452735/wireless-rf-ota-connectivity-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree with 10 or more years of relevant work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Industry experience in development/characterization of RF/Antenna system for wireless technologies. Experience in commercializing wireless products is required.In depth understanding of wireless system concepts for performance evaluation in at least one of the following technologies: 802.11ax, 802.11ac, WiFi 6E, GNSS, UWB and Bluetooth.Solid understanding of end-to-end link budget and wireless propagation. Hands on experience in modeling using at least one tool - MATLAB, HFSS, CST, ANSOFT, etc.Working experience of RF characterization, Antenna Design and tests, anechoic chambers, and RF test equipment is a plus.Hands-on experience with throughput measurement tools like ixChariot, iPerf, Octoscope, etc. is preferredFamiliarity with industry conformance requirements for WLAN/BT/GNSS technologies is a bonus.Bachelor's Degree with 10 or more years of relevant work experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nApple Wireless System Engineering team is looking for an engineer to work on radiated system characterization across different connectivity technologies (WLAN, BT, UWB, GPS) for Apple’s wireless products!"}, "200452732": {"jobID": "200452732", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF OTA Connectivity Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452732/wireless-rf-ota-connectivity-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree with 3 or more years of relevant work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Industry experience in development/characterization of RF/Antenna system for wireless technologies. Experience in commercializing wireless products is required.In depth understanding of wireless system concepts for performance evaluation in at least one of the following technologies: 802.11ax, 802.11ac, WiFi 6E, GNSS, UWB and Bluetooth.Solid understanding of end-to-end link budget and wireless propagation. Hands on experience in modeling using at least one tool - MATLAB, HFSS, CST, ANSOFT, etc.Working experience of RF characterization, Antenna Design and tests, anechoic chambers, and RF test equipment is a plus.Hands-on experience with throughput measurement tools like ixChariot, iPerf, Octoscope, etc. is preferredFamiliarity with industry conformance requirements for WLAN/BT/GNSS technologies is a bonus.Bachelor's Degree with 3 or more years of relevant work experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nApple Wireless System Engineering team is looking for an engineer to work on radiated system characterization across different connectivity technologies (WLAN, BT, UWB, GPS) for Apple’s wireless products!"}, "200295347": {"jobID": "200295347", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AR/VR System UI Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200295347/ar-vr-system-ui-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or Equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "At least 3 years experience in software developmentTrack record for building complex applications that are functional and delightfulProficient in Swift, C++ or ObjCFamiliarity with SwiftUI and/or UIKitAttention to detail, creativity and passion.BS in Computer Science or Equivalent- Proficient in 3D mathematicsWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR System UI Engineer to help define and build the next generation user experiences on our platforms using Apple's latest technologies including RealityKit and ARKit."}, "200447659": {"jobID": "200447659", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "SoC Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447659/soc-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Strong Programming skills for writing and debugging test programs and test related hardware development (i.e. Teradyne UFlex/J750/ip750, Advantest 93k platforms.)Proficiency in programming with Scripting languages (i.e., PERL) and high level languages (i.e., C/C++ or Visual Basic.)Experience working on digital VLSI SoC.Expertise in Semiconductor Test Methodology.Deep understanding of Electronic Engineering Fundamentals, Design for Test and Manufacturing Concepts.In depth knowledge of Semiconductor Manufacturing Process.Understanding of semiconductor product life cycle.Able to work with test equipment (i.e., oscilloscope, logic analyzer, etc.)Travel is required.BS and a minimum of 3+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices! \n\nAs our SoC Test Engineer you will be crafting and debugging ATE programs and hardware for characterization, qualification, and production of SoC devices."}, "200466324": {"jobID": "200466324", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Battery Cell Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466324/battery-cell-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. plus 3 years of relevant industry experience. \nM.S. or Ph.D. in Material Science, Electrochemistry, Chemical Engineering, or related preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "B.S. plus 3 years of relevant industry experience.Substantial experience with direct battery material and design development including, process tracking and performance/safety characterization experience with emphasis on lithium ion or lithium polymer battery cells.Familiarity with applicable test equipment, test procedures, international standards, and certified agency requirements applicable to rechargeable lithium battery products.Familiarity with current innovative production processes applicable to lithium rechargeable cells.Experience in working with external vendors and contractors to develop and qualify battery designs for consumer applications.Experience with applying quality tools and their application to the production of lithium batteries including statistical analysis of performance results, process capabilities, and design of experiments.Experience with mathematical modeling of lithium-ion battery designs is also desired.Familiarity with applicable patent fields and patent application processes.B.S. plus 3 years of relevant industry experience. \nM.S. or Ph.D. in Material Science, Electrochemistry, Chemical Engineering, or related preferred.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Battery Engineering group, you’ll help craft creative battery solutions that deliver more energy in smaller spaces than ever before! You’ll work across teams to transform improved hardware elements into a single, integrated design. Join us, and help us innovate new battery technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what batteries can do and improve the product experience for our customers worldwide. The Battery Product Development team at Apple produces high-energy and highly reliable embedded battery systems for all product teams. Tightly integrated with Product Development, Operations, Industrial Design, and Reliability Testing groups, we own battery module development from initial system architecture through ramp. The Battery Cell Engineering Design Group works within the Battery Product Development organization and is seeking a technical leader focused on developing and qualifying advanced lithium-based rechargeable cell designs for new product consideration, developing performance and test specifications for batteries for new products, working to define cell designs that meet internal customer requirements and supervise failure analysis and root cause investigations."}, "200452701": {"jobID": "200452701", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "PHY Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452701/phy-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems (OFDM/MIMO, etc.)Experience in wireless design of 3GPP compliant modems (5G-NR/4G LTE) highly desired. Experience with millimeter wave technologies is a plus.Hands on experience with lab testing & characterization will be a plus. Experience with bringing up real silicon in lab and familiarity with lab equipment such as signal generators, spectrum analyzers, power meters a plus.Deep understanding of communication theory & signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, coding theory, etc.)Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.Experience on bring up of real silicon in lab, be able to efficiently use lab equipment (such as spectrum analyzer, signal generator, power meter, etc.).BS with 3+years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.   Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an experienced PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200452907": {"jobID": "200452907", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452907/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong software skills in C/C++.Familiarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is a huge plusExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is ideal experience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 10 years relevant industry experience", "jobDescription": "Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200435732": {"jobID": "200435732", "origin_search": null, "posted": "Oct 13, 2022", "jobTitle": "Senior Tools Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435732/senior-tools-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in CS or comparable degree or relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$250,000,"}, "benefits": null, "requirements": "At least 8 years of industry experience in the following areas:Strong sense for API developmentModern rendering techniquesAdvanced knowledge of Swift and/or C/C++3D math skillsGPU architecturesBS/MS in CS or comparable degree or relevant experience", "jobDescription": "Apple's Technology Development Group works with advanced technologies, including the augmented reality (AR) platform ARKit and Metal 2, to create ground-breaking new products. Do you want to push the limits of the best Augmented Reality platform in the world? Would you like to help craft Augmented Reality experiences for millions of people? In this position, you will have the opportunity to partner with our extraordinary team of technologists, artists and designers to build new software products that will change the way people experience their own reality!"}, "200353669": {"jobID": "200353669", "origin_search": null, "posted": "Mar 9, 2022", "jobTitle": "Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200353669/software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent.\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience developing software using C/C+, or Objective-CExperience with UNIX systems, and a deep understanding of operating system fundamentalsUnderstanding of TCP/IP suite of protocolsExcellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while driving multiple projects across teamsObsessively passionate and inquisitive, and seek to tackle everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersPreferred Qualifications:Experience developing iOS or macOS applicationKnowledge 802.11 technologies and standardsBachelor's degree in Computer Science or equivalent.\n\nMasters Degree is preferred.", "jobDescription": "Join our Sensing & Connectivity team and drive innovation that matters!\nWe build and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience.\n\nAs part of the WiFi software development team, we make decisions that influence the connectivity experience on products people use every single day, across the world.\n\nAre you a software development enthusiast?\nAre you passionate about Internet-enabled devices and networking protocols?\nDo you want to learn more about WiFi and other wireless technologies?\nIf your answer is yes, we may have the job for you."}, "200428238": {"jobID": "200428238", "origin_search": null, "posted": "Oct 4, 2022", "jobTitle": "Senior Architect - Data Governance Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200428238/senior-architect-data-governance-engineering?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Overall 10+ years experience in data architecture, modeling and management, with deep exposure to privacy principlesAssist in the definition, documentation and development of mapping rules for movement of data from disparate data sources and into the various components and subject areas of the data governance environmentExperience in multifaceted landscape of data domains and systems such as Spark, Snowflake, Hadoop, Kafka, and other distributed data lake systemsAdvanced skills using one or more scripting languages (e.g., Python, Javascript, bash, etc.), REST and RESTful services, hands-on experience with AWSDemonstrated ability to lead and build automation for multiple user experiences (mobile, web, desktop) as well as extensive API testing and documentation using OpenAPI and OpenTelemetryWorking experience utilizing CICD and observability concepts targeting streamlined production environmentsPossesses outstanding analytical and conceptual thinking skills, ability to influence partners and work closely with them to resolve acceptable solutionsMost importantly, a sense of humor and an eagerness to learn", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Ad Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices. Our platforms are highly performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy.\n\nThe Ad Platforms team is seeking a Senior Data Architect to support of our data governance objectives. You will play a crucial role in delivering on Apple's privacy commitments to our customers. You will partner across our engineering, product, privacy and reliability organizations to deliver on data access, use, protection, minimization, retention, and other data governance execution areas. You will define, design, and implement data governance platform strategies for operational, privacy, security, and other related control areas."}, "200452841": {"jobID": "200452841", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452841/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong understanding of micro-processor architectureGood knowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerExperience with scripting languages such as Python, Perl, or TclKnowledge of software tool chains including including compilers, assemblers, and source control toolsBackground in silicon bring-up and debug experience a plusAbility to work well in a team, but to be responsible and self-driven.BS and a minimum of 10 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world?   Join our team of experienced SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200461469": {"jobID": "200461469", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "AMR Fraud Prevention, Senior Manager - Apple Retail Customer Care", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461469/amr-fraud-prevention-senior-manager-apple-retail-customer-care?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree or equivalent. MBA is a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "A minimum of 7-10 years senior management experience leading a business operations team in global organization, preferably in fraud prevention, execution, or similar spaceCustomer focused, detail oriented with ability to maintain a positive attitude in a high-stress, and fast-paced work environmentDemonstrated ability to inspire change in a matrix organizationExcellent planning, organization, and implementation skillsStrong analytical ability and decision making skillsDemonstrated ability to work independently in areas of ambiguityAbility to build effective relationships in a cross-functional team environment with demonstrated success in managing international collaborationsExperience leading in a fast paced, dynamic, and multi-lingual environmentStrong collaborator who is able to motivate and influence all levels of managementAbility to work with a flexible schedule and embrace change enthusiasticallyExcellent verbal, written, and interpersonal communication skillsExperience in a Call Centre organization is a plusHigh level of ethics, values, integrity, and trustBachelor's Degree or equivalent. MBA is a plus.Must have Management and leadership experienceCustomer focused, detail oriented individual with ability to maintain a positive attitude in high-stress, and fast-paced work environmentDrive for quality results and demonstrates high degree of determinationExcellent verbal, written, and interpersonal communication skillsAdaptive to changing technologies, process, and environments", "jobDescription": "At Apple, we believe in hard work, a fun environment, and the kind of creativity and innovation that only comes about when talented people from diverse backgrounds approach problems from varying perspectives. We believe each customer interaction is an opportunity to delight, engage, and inspire. We achieve this by focusing on the smallest of details and can make big impacts with our customers.\n\nWe have an open position within Retail Customer Care for an enthusiastic, motivated, and hands-on professional to lead the Fraud Prevention Team in the AMR Region. Partnering with Apple’s Strategic Data Solutions (SDS) and Retail Fulfillment Operations (RFO) teams, this individual will be responsible for driving and flawlessly executing actions to mitigate fraud. These include analyzing purchases and accounts for fraudulent activities, reviewing refund requests for abusive behavior, and determining appropriate next steps in a wide range of scenarios. Priority and focus will be on driving a timely customer resolution within an agreed Service Level Agreement (SLA) while protecting customer experience and Apple’s interest.\n\nAn innovative and analytical problem solver, the AMR Fraud Prevention Manager will be championing process improvement efforts to optimize business processes while delivering best-in-class customer and employee experience. \n\nThis role is suitable for individuals who thrive in a fast paced, dynamic, and evolving environment."}, "200464176": {"jobID": "200464176", "origin_search": null, "posted": "Feb 18, 2023", "jobTitle": "Systems Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464176/systems-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Engineering, Computer Science or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proficient in Java/Kotlin with experience in scripting languages like bash and Python5+ years of professional software development experience, with strong software engineering practicesSolid understanding of distributed system design and event-driven architectureExperience with virtualization, containerization and orchestration like KubernetesExcellent problem-solving/debugging skillsBe a considerate, thoughtful, and collaborative contributorBS or MS in Engineering, Computer Science or equivalent industry experience", "jobDescription": "Xcode Cloud is a continuous integration and delivery service built into Xcode and designed expressly for Apple developers. It accelerates the development and delivery of high-quality apps by bringing together a variety cloud-based tools and services. You can learn more about Xcode Cloud at https://developer.apple.com/xcode-cloud/ (https://developer.apple.com/xcode-cloud/). We are seeking to add a Systems Software Engineer to a new team responsible for maintaining and building the future of Xcode Cloud’s worker infrastructure. Workers are critical to the function of Xcode Cloud. Members of the Worker Infrastructure team are responsible for the core components which dequeue builds, dynamically scale capacity and provisioning a virtualized environment where building, testing and deployment can happen."}, "200463821": {"jobID": "200463821", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Engineering Project Manager, Environmental Technologies (Ecological Design)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463821/engineering-project-manager-environmental-technologies-ecological-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  Bachelors/Masters in Mechanical or Electrical Engineering (or equivalent)\n-  Relevant experience in lieu of academic credentials will be considered as appropriate"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "7+ years of relevant industry experience.Strong leadership, communications and relationship-building skills. High capacity to relate to others and influence decisions.Consistent track record of execution and handling complex projects with multiple dependencies and complex designs while exercising meticulousness and critical-thinking skills.Manages timelines and drives deliverables in a fast-paced and schedule-driven environment, with ability to distill large datasets into conclusions under tight time constraints. Thrives under pressure.Knowledge and experience in Consumer Electronics product development, ideally with passion for the environment and understanding of eco-design regulations. Extensive experience engaging cross-functional teams to ensure compliance for consumer electronics products.Demonstrated experience in a fast-paced environment and passion for the convergence of innovative product design, and human/environmental health.High comfort levels with diving into technical details with domain experts and engineers, and distilling this information into streamlined messages for senior leaders.Demonstrated proficiency in core project/program management skills and methods not limited to driving actions, priorities, closing on deliverables, and managing complex schedules.-  Bachelors/Masters in Mechanical or Electrical Engineering (or equivalent)\n-  Relevant experience in lieu of academic credentials will be considered as appropriate", "jobDescription": "Imagine what you could do here! At Apple, our ambition is to make products without taking from the Earth. Getting there requires focus and innovation in three key areas: climate change, resources and more inquisitive chemistry. We believe that our products should be safe for anyone who assembles, uses, or recycles them.\n\nAs our Environmental Technologies Engineering Project Manager for Ecological Design, you will help drive the adoption of innovative solutions through product design and engineering directed at creating world-class products that are designed to leave the world better than we found it. You will achieve these ends in close collaboration with internal business groups (Engineering, Operations, AppleCare, Quality, and Procurement). Furthermore, you will collaborate with experts in toxicology, restricted substances, energy efficiency, and environmental product design to drive execution of Eco-design criteria and improvements. Central to your role will be representing our team in cross-functional settings and communicating with senior management while driving product design and influencing policies."}, "200452826": {"jobID": "200452826", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452826/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong understanding of micro-processor architectureMinimum of 3 years industry experienceKnowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerExperience with scripting languages such as Python, Perl, or TclKnowledge of software tool chains including including compilers, assemblers, and source control toolsBackground in silicon bring-up and debug experience a plusAbility to work well in a team, but to be responsible and self-driven.BS and a minimum of 3 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world?   Join our team of experienced SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200452813": {"jobID": "200452813", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452813/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong understanding of micro-processor architectureMinimum of 3 years industry experienceKnowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerExperience with scripting languages such as Python, Perl, or TclKnowledge of software tool chains including including compilers, assemblers, and source control toolsBackground in silicon bring-up and debug experience a plusAbility to work well in a team, but to be responsible and self-driven.BS and a minimum of 3 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world?   Join our team of experienced SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200456327": {"jobID": "200456327", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "Senior C++ Standard Library Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456327/senior-c-standard-library-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Advanced knowledge of C++ with the ability to write maintainable, high performance codeExperience developing and/or maintaining large C++ frameworksFamiliarity with recent C++ language evolution such as C++20Strong communication and teamwork skillsPositive and respectful attitude in a diverse environmentB.S. in Computer Science or equivalent experiencea plus but not required:- Experience working across organizational boundaries- Knowledge of LLVM/Clang/Libc++ and/or open source software development- Understanding of the design and implementation of compiler and related tools like linters and analyzers- Familiarity with security and exploitation techniques-If possible, we’d love to see an example of your relevant work, such as a personal project or open source contribution", "jobDescription": "The C Languages and Libraries team at Apple is looking for an experienced software engineer to develop and enhance Apple’s C++ standard library (“Libc++”) that ships on Apple’s platforms. Libc++ is a core part of Apple's developer tools and Xcode IDE, used internally to build Apple's software stack and externally by millions of developers. \n\nThe position provides the opportunity to learn and make complementary changes to the Apple ObjC/C++ compiler (\"Clang\"). We value communication skills, integrity, and creativity. We aspire to build a diverse, balanced, and dynamic team."}, "200435855": {"jobID": "200435855", "origin_search": null, "posted": "Oct 18, 2022", "jobTitle": "Optical Metrology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435855/optical-metrology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. or M.S. with 3 years of proven experience in Optics, Physics, Opto- mechanics, or Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "MINIMUM QUALIFICATIONS:Strong communication skills to communicate clearly and efficiently across a range of technical subject areas with a broad slate of partners, including management, peers, and suppliers.Ph.D. or M.S. with 3+ years of proven experience in development and high volume deployment of electro-optical modules in Optics, Physics, Opto-mechanics, Electrical Engineering, or related fields.PREFERRED QUALIFICATIONS:Experience in optical instrumentation and data collection & automation, familiar with tools like Matlab, Python, C#, C/C++ or LabVIEW or equivalentStrong optical simulation experience and system modeling experience, familiar with ray tracing tools such as LightTools, Zemax, CodeV etc. and perform optical simulation and experimental lab validation to close the loops.Strong quantitative data analysis abilities, using JMP, Matlab, or equivalent tools and familiar with relevant algorithm for image analysis and data analysis.Experience in mass volume manufacturing of consumer electronics (optical preferred), familiar with 6 sigma, P/T, design of experiment, failure analysis, risk management and system trade off study.Strong capability in design, setup and execution of sophisticated optical experiments either in house or with external vendor. Have experience in identify, define, develop, test and deploy state-of-the-art optics for display and optical system.Experience in one or more fields: in-line metrology and testing development, thin film fabrication and physics understanding/modeling, injection molding, diffraction optics manufacturing and testing, sensor manufacturing and testing.Ph.D. or M.S. with 3 years of proven experience in Optics, Physics, Opto- mechanics, or Electrical Engineering", "jobDescription": "The Panel, Process & Optics team features a collaborative environment with creative and best-in-class products and innovative technologies. Our team provides opportunities for individuals to contribute across a wide spectrum of fields. Best in class engineering excellence and thoroughness are expected and encouraged. Innovation, IP and patent creation are highly supported and valued. Opening up the boundaries to design and ship innovative products with outstanding technologies and user experiences are the main goals of our team!\n\nJoin us in crafting solutions the world doesn't know of yet. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200451487": {"jobID": "200451487", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451487/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "We are looking for an experienced Digital Circuit Design Engineer with:Strong understanding of CMOS device characteristics and design rules.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Experience in Circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits is a plus.Experience in RTL2GDSII flow and/or Static Timing Analysis (STA) is a plus.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Understanding of Timing characterization & modeling of Standard cell circuits is a plus.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200040591": {"jobID": "200040591", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Camera Systems Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200040591/camera-systems-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS, or PhD in Physics, Engineering, Computer Science, Imaging Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong communication, persuasion and negotiation skills in addition to being comfortable with working through ambiguities.Detailed understanding of mobile imaging systems & module designs (image sensors, optics, mechanics, auto-focus, optical image stabilization, assembly processes, etc).Good knowledge of state of the art ISP data-flows and processing blocks.Experience with modern imaging algorithms such as HDR, super resolution, image fusion, multi-camera registration, etc.Working knowledge of imaging system simulations and evaluation of simulation results.Good understanding of image quality metrics and image quality evaluation.Strong verbal communication skills across organizations and at the executive level.Excellent written skills for clear reporting of data analysis and conclusions.MS, or PhD in Physics, Engineering, Computer Science, Imaging Science or equivalent", "jobDescription": "Why Apple? \n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Camera System Architecture team initiates & fosters deep collaboration between all cross functional teams involved in delivering final camera performance and features. This is true for any Apple product, from the hardware level through to the user facing applications. The end goal is to successfully tie in highly optimized camera hardware solutions with state of the art software providing market leading imaging experiences.  \n\nApple is seeking an energetic and highly motivated Camera System Architect to drive future camera hardware requirements that meet product vision, including considerations for feature requirements, ISP & silicon capabilities, power budgets, optical & mechanical design requirements and solution cost. The ideal candidate would have the capabilities required to perform detailed system analysis and tradeoff evaluations while pushing boundaries in this wide technology space with the goal of arriving at the most optimal solution."}, "200449177": {"jobID": "200449177", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "JavaScript Virtual Machine Compiler Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449177/javascript-virtual-machine-compiler-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in computer science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Detailed knowledge of C and C++Excellent debugging, critical thinking, and interpersonal skillsDetailed understanding of data structures and algorithmsExperience with compilers, parsers, interpreters, and garbage collectorsBS in computer science or equivalent", "jobDescription": "The WebKit JavaScript Virtual Machine is responsible for executing the JavaScript and WebAssembly code found in web pages. It uses type inference, dynamic compilation, and sophisticated compilation optimizations to turn JavaScript programs into efficient machine code on x86 and ARM64! \n\nWe are looking for a JavaScript Virtual Machine engineer to work on all aspects of the compilation pipeline, including the parser and lexical analysis, the profile-guided speculative compiler, and the optimizing compiler backend. They also own and maintain the language runtime, the garbage collector, and the JavaScriptCore API for native apps!"}, "200243863": {"jobID": "200243863", "origin_search": null, "posted": "Jan 4, 2023", "jobTitle": "Touch ASIC Architect (Analog)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200243863/touch-asic-architect-analog?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in Electrical Engineering or industry experience equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands-on experience in design, development and launch of high volume IC designs in consumer products; \u2028direct experience with touch technology and / or flat panel display technology is beneficial.Strong electrical engineering background in signal processing, mixed-signal design, practical transceiver \u2028architecture design, filter design, and embedded system design.Hands-on experience in system-level design, requirements documentation, and IC micro-architecture definition of complex digital and mixed-signal ASICsProficiency in MATLAB, Verilog, or similar simulation, design and modeling tools.Excellent written and verbal communication skills and solid teamwork and leadership skills.Experience with Touch technology is a plus.Minimum of 5 years of relevant industry experience.  Analog ASIC design & architecture experience required.M.S. or Ph.D. in Electrical Engineering or industry experience equivalent.", "jobDescription": "Design, develop, and launch next-generation Touch Technologies in Apple products.\n\nThe Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the Touch Technology team is to enable the world’s best multi-touch user-experience. New challenges arise everyday that require the sharp problem- solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. \n\nAn Analog ASIC architect is a key engineer responsible for analyzing the application and coming up with the best analog front end (AFE) architecture for touch and other sensing ASICs. These designs include multiple channels with complex filtering and DSP.\n\nCome, join us in crafting best-in-class solutions!"}, "200441959": {"jobID": "200441959", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Layout Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441959/analog-layout-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in analog/mixed-signal layout design of deep submicron CMOS circuits and recent experience on advance nodes including FinFET technologiesHigh level of proficiency in interpretation of CALIBRE DRC, ERC, LVS, reportsExperience with CADENCE or MENTOR GRAPHICS layout toolsProgramming knowledge in SKILL, Perl, and/or Python is a bonus• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Silicon Engineering is seeking creative Layout Leads to design the next generation of Apple’s world-leading systems-on-chip (SOCs). Apple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad. Our Analog/Mixed-Signal (AMS) circuits connect them to the physical world! Examples of our AMS IPs include SERDES for data communication, PLLs for clock generation, and sensors for measuring all sorts of physical quantities.\n\nAnalog Layout is a crucial component of the hardware design process. Analog Layout Engineers work alongside circuit designers to transform design ideas into silicon. Apple’s world-leading SOCs are crafted using robust tool-suites, the most advanced nodes, and modern layout methodologies.\n\nThis job may be right for you if:\n\nYou want to accelerate your career. Thrive in a fast-paced, multifaceted, and results oriented environment. Are passionate about working with the world’s most advanced technology. Enjoy collaborating with a very talented and experienced team. Have a good understanding of engineering fundamentals. Actively seek out opportunities to work with cross-functional teams (SOC, Tech, CAD). Drive critical floor-planning decisions. Lead a team of people to produce complex AMS blocks with high-quality layout. Are always looking for ways to introduce new ideas and workflows that improve efficiency across a global team of layout engineers. Want opportunities to challenge yourself and broaden your skillset. Want to work every single day to craft products that enrich people’s lives."}, "200464524": {"jobID": "200464524", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Software Incubation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464524/software-incubation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A background in Computer Science fundamentals plus experience shipping software is ideal. If that’s not your background, but you can show a strong track record of curiosity, making, and learning, we’d love to talk to you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience writing software for either macOS and iOS using Swift and Objective-C.Able to deal with ambiguity, and a gut instinct for making things that will help bring clarity. We often work on projects where we need to create something to help understand the objectives & boundaries.A learning mentality and a willingness to try things that may fail. You should be able to learn from both success and failures.A sense for effective design. If you have design training or design experience, even better.Ability to communicate effectively with both technical and non-technical teamsA background in Computer Science fundamentals plus experience shipping software is ideal. If that’s not your background, but you can show a strong track record of curiosity, making, and learning, we’d love to talk to you.", "jobDescription": "We are a design-oriented engineering team focused on building the future of software on Apple’s devices. We take big, fuzzy ideas about what might be possible and turn them into concrete concepts, prototypes and livable software!\n\nWe are passionate about exploring new ideas using whatever tools help us make something tangible. Most often, we choose to modify or extend Apple’s existing software using Objective-C or Swift. But we’re open to using the best tools that help us learn: design tools, prototyping apps, ML, etc.\n\nWe are looking for a creative, learning-oriented, collaborative individual to come help us explore what the future could look like."}, "200438025": {"jobID": "200438025", "origin_search": null, "posted": "Oct 20, 2022", "jobTitle": "Embedded Systems Video Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438025/embedded-systems-video-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "M.S preferred or B.E/B.S in Electrical Engineering/Computer engineering and equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Excellent software design, problem solving and debugging skillsSolid programming skills- C/C++ coding abilitiesExperience in embedded real time multitasking software systemMinimum of 3 years direct related experience in embedded software developmentHave a consistent track record of development for large volume product shipment.Good written and oral interpersonal skillsM.S preferred or B.E/B.S in Electrical Engineering/Computer engineering and equivalent experienceApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.   Apple benefits programs vary by country and are subject to eligibility requirements.  Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Apple's industry leading media technologies is used by people all over the world and is looking for highly motivated and energetic developers! The Video Engineering group at Apple is responsible for creating the image/video core technologies used in all Apple products and services. In this role, you will develop embedded software for image and video compression, implement features for applications such as the iPhone/iPad Camera capture, Professional video editing, image processing pipeline and many more on a vast variety of devices. As an embedded software engineer, you will work on the video/image subsystem, new video compression/processing feature development, and performance/power optimization."}, "200449029": {"jobID": "200449029", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Performance and Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449029/graphics-performance-and-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We prefer to you have the following knowledge and skills:Strong C++ coding skillsKnowledge of computer architectureUnderstanding of GPU micro-architecture is a plusUnderstanding of Computer Graphics principles and modern Graphics APIs (e.g. DirectX, OpenGL, Vulkan, Metal) is a plusWe prefer that you exhibit excellent communication skills, demonstrate a sense of motivation and show a high level of organizationWe like people who are fast learners and are eager to solve technical challengesMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Hardware Technologies organization, you’ll help design our next-generation, high-performance, power-efficient graphics processor unit (GPU) and system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nIn this role, you will be delivering high-quality functionality and performance model for GPUs under aggressive product schedules. You will provide feedbacks to the design, triage problems and recommend solutions. To achieve this, you will work closely with multi-functional teams in architecture, micro-architecture, validation and GPU software."}, "200401574": {"jobID": "200401574", "origin_search": null, "posted": "Dec 2, 2022", "jobTitle": "AirPlay Audio - Streaming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200401574/airplay-audio-streaming?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong programming skills with C and/or C++Expertise in real time audio programming and/or audio driversExperience debugging problems in a highly concurrent environmentExperience with using and developing media libraries especially for mobile platformsBS/MS in Computer Science or equivalentExperience programming on embedded systemsExperience with using and developing media libraries especially for mobile platformsExcellent communication and reciprocal skillsFamiliarity with inner workings of media systems and audio/video codecsFamiliarity with network media streaming protocols such as RTP and RTSPFamiliarity with the TCP/IP suite of protocolsAn Upbeat, adaptable, and results oriented with a positive attitude", "jobDescription": "Apple’s Interactive Media Group (IMG) is looking for a creative, self motivated and dedicated software engineer to join the Connected Media Streaming AirPlay Audio team with a focus on building new audio features. This team builds the foundations of AirPlay, that powers the customer experience of iOS, macOS and tvOS real time AirPlay audio, and focuses on future directions. \n\nThe Interactive Media Group (IMG) provides the media and graphics foundation across all of Apple's innovative products including iPhone, iPad, Mac, AppleTV, and operating systems. Combining ground breaking software techniques with next-generation hardware, IMG takes the media experience to the next level.\n\nIf you are passionate about solving complex problems with elegant and creative solutions, then this job maybe a perfect fit for you"}, "200431270": {"jobID": "200431270", "origin_search": null, "posted": "Oct 19, 2022", "jobTitle": "Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431270/embedded-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.S preferred, B.E/B.S/PhD in Electrical Engineering, Computer Science or related majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Excellent software design, problem solving and debugging skillsSolid programming skills- C/C++ coding abilitiesExperience in embedded real time multitasking software systemMinimum of 3 years direct related experience in embedded software developmentGood written and oral interpersonal skillsM.S preferred, B.E/B.S/PhD in Electrical Engineering, Computer Science or related majors", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped deliver almost daily. At Apple, you will have the opportunity to work on incredible products. The Video Engineering group is responsible for creating the image/video core technologies used in almost all Apple products and services, including iPhone, iPad, Mac, Apple Watch, and iCloud. In this role, you will develop system software for image, video compression/processing, implementing features for applications such as the iPhone/iPad Camera capture, Live Photo, AirPlay, FaceTime, iMovie, and many more on a vast variety of devices. As an embedded software engineer, you will work on the video/image system, including new video compression and processing feature development, performance, and power optimization. We are looking for an extraordinary teammate with a proven consistent track record of development for large volume product shipment. Join us to explore and dive deeper into video technologies!"}, "200464583": {"jobID": "200464583", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Software Build Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464583/software-build-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "* Bachelors, Masters, or equivalent experience in Computer Science."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "macOS, iOS, or UNIX development experience.UNIX administration and strong software debugging skills.Knowledge of operating system, network, and compiler concepts.* Bachelors, Masters, or equivalent experience in Computer Science.Optional Experience:Willingness to learn and master these areas:* Programming in Python, JavaScript, Objective-C, or Swift* Familiarity with version control systems such as git or subversion* Proficiency with advanced text editors (Sublime, vim, emacs)* Authoring complex regular expressions* Experience with Xcode and/or Makefiles* Web systems development or web application development experience* Comfortable reading backtraces and stack traces", "jobDescription": "The Software Build & Integration team at Apple is at the core of the Apple software development process. We are responsible for delivering the state-of-the-art operating systems and applications to Apple customers. The role empowers build engineers to influence new feature integration into Apple software, by collaborating with engineers from Software, Hardware, Localization, QA, and Project Management teams. Software Build Engineers will have the opportunity to utilize and implement solutions using distributed computing, cloud services, and virtualization technologies to deliver Apple software to customers. This involves engineering innovative solutions for Apple's production build system in support of macOS, iOS, watchOS, tvOS, Xcode, and more!"}, "200458501": {"jobID": "200458501", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458501/embedded-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Engineering, Computer Science, Electrical Engineering or equivalent. 5+ years of industry experience in a similar role."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proficiency in C/C++, some embedded software experience is preferred.Understanding and experience with ARM platform and architecture/instruction set.Experience developing low level driversExperience with debuggers such as gdb, lidb, etc.Familiarity with scopes and logic analyzers.Able to comprehend hardware specs and schematics.Familiarity with standard hardware protocols (USB, UART, SPI, I2C, PCIe, MIPI, HDMI, DDR)Knowledge of real-time audio is preferred (sample rates, buffering, I2S, PCM, drivers)Familiarity with some form of scripting (lua, python).Should be a great team player.Excellent written and verbal communication skills.BS or MS in Computer Engineering, Computer Science, Electrical Engineering or equivalent. 5+ years of industry experience in a similar role.", "jobDescription": "The System Firmware and Diagnostics team is looking for an enthusiastic embedded software engineer to join our team. This is an individual contributor role to design and develop the software that gets used by various teams. You’ll have the opportunity to work on core technologies to make a major impact in the way that Apple develops, test and manufactures its products. Our environment encourages product innovation, rapid product iteration, collaboration and a liberating amount of autonomy."}, "200457656": {"jobID": "200457656", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "NAND ATE Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457656/nand-ate-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experienceWorking on all aspects of automated test equipment (ATE). (Advantest, Teradyne, etc.)Experience with memory systems, technologies, and processing - NAND a plusDemonstrated experience in coding scripts necessary to enable ATE test solutions.Proficiency in programming C or C++ and automation scripting (LUA, PYTHON, MATLAB, etc.).Deep understanding of Electronic Engineering FundamentalsAble to work with test equipment (i.e., oscilloscope, logic analyzer, etc.)Failure analysis and troubleshooting.Experience with embedded system integration and development a plus.Coding experience and understanding of SW FTL is ideal.Experience with PCIe, SSD controllers and firmware is a plus.BS and 3+ years of relevant industry experience", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? Do you intrinsically see the importance in every detail? As part of this group, you’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAs a NAND ATE Test Engineer you will lead and support the testing and qualification of various programs using SSD (solid-state drive). A strong candidate will have experience with NAND reliability testing, and validation.  You will be part of a world class team of HW Engineers who identify and resolve potential risks for all aspects of NAND qualification and testing, including generating test programs and scripts. You will have direct impact on Apple's future products by ensuring world-class solutions to demanding test and engineering challenges."}, "200448237": {"jobID": "200448237", "origin_search": null, "posted": "Dec 10, 2022", "jobTitle": "Hardware Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448237/hardware-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS plus 3 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "BS plus 3 years of relevant industry experience.Strong knowledge in electrical engineering fundamentals and principles with 3+ years of related industry experience.Experience in design, development, and deployment of a product or test equipmentExperience with estimating uncertainty in ammeters, voltmeters, and thermometers to settle if a gauge is fit for purpose.Experience with printed circuit board assembly design and manufacture including board layout, materials selection, and SMT.Effective in performing detailed electrical design reviews.Demonstrated experience working with fixtures, tools, and precision instrumentations.Hands-on experience in solving complex electrical apparatus at the component level.Knowledgeable in statistical analysis of data and tools for analytics.BS plus 3 years of relevant industry experience.", "jobDescription": "Do you have a passion for invention and self-challenge? Are you seeking to push the limits of what’s considered feasible? As part of our Battery Engineering group, craft creative battery solutions that deliver more energy in smaller spaces than ever before. We work across subject areas to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new battery technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what batteries can do and improve the product experience for our customers across the world! \n\nThis is an excellent opportunity to work on the forefront of Battery Qualification Labs! You will help to identify electrical equipment used to qualify cells and packs that will be included in the next generation of products. The ideal candidate has a background in electrical engineering, test equipment, and metrology. \n\nOur Engineering Team is responsible for architecting, specifying, and realizing advanced electromechanical test and automation apparatus. You will be a key technical contributor and will apply your in-depth electrical engineering skills to help realize and implement engineering or manufacturing test equipment in a production environment."}, "200420830": {"jobID": "200420830", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Firmware Quality Engineering Manager-Bluetooth", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420830/firmware-quality-engineering-manager-bluetooth?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree in Electrical or Computer Engineering \nMaster's degree is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$269,000,"}, "benefits": null, "requirements": "10+ years of experience in firmware testing, with deep understanding of FW validation processes and overall software development cycles5+ years leading a FW QA team, with track record of managing and delivering large scale projects including software features and new platformsIn-depth understanding and strong hands-on experience on building, deploying and updating test bedsStrong experience in system-level testing of radio co-existence (e.g., WiFi and BT co-ex) in embedded devicesProven excellence in leading the investigation efforts post product launchProficient understanding of the Bluetooth suite of protocolsExcellent analytical and debugging skillsSucceed in a collaborative environment and can clearly communicate while driving multiple projects across many teamsHighly organized, creative, motivated, and passionate about achieving resultsBachelor’s Degree in Electrical or Computer Engineering \nMaster's degree is preferred", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters! We craft and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience.\nThe Bluetooth Quality team is looking for a motivated, highly-technical Bluetooth Firmware Quality Engineering Manager."}, "200465805": {"jobID": "200465805", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Apple Advertising Platforms, Account Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465805/apple-advertising-platforms-account-manager?team=MKTG", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$107,000", "max": "$161,000,"}, "benefits": null, "requirements": "Must have Advertising Sales experiencePrior experience in strategic partnershipsStrong relationship building and diplomatic communication skillsExcellent written and verbal communication skillsMust be detail oriented and have exceptional organizational skillsProactive self-starter with a professional, positive demeanorMust have strong analytical and problem solving skills, and a solutions-oriented focusAbility to work independently and with a team in a fast paced, rapidly-changing environmentHigh level of technology experience, with an understanding of the latest advertising technology", "jobDescription": "Apple Advertising Platforms is redefining advertising on mobile devices while reaching hundreds of\nmillions of iPhone and iPad users around the world. With Apple News and Search Ads, advertisers and\npublishers get access to the most engaged consumers in the market. We're looking for a key contributor\nto join this exciting and fast-paced organization. We are seeking an experienced digital advertising expert\nto join our strategic partnership team for Apple News."}, "200462427": {"jobID": "200462427", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Technical UX Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462427/technical-ux-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Human Computer Interaction, Human Factors, Information Science, Graphic Design with emphasis on UI design, or Computer Science with emphasis on UI development"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Senior level experience (5+ years) crafting user experience solutions and applications for 3D application and/or gamesStrong abilities in sketching, mocking up, and evaluating interaction designReal passion for user experience and actioning user feedbackExcellent visual, written, and verbal communication skillsAbility to thrive in a joint working environment within your team and beyondSelf-starter and able to work independently, and can handle multiple projects under minimal supervisionBS or MS in Human Computer Interaction, Human Factors, Information Science, Graphic Design with emphasis on UI design, or Computer Science with emphasis on UI developmentDesign for Mac OS XSome experience in user research and usability testing Interactive prototyping skillsTechnical writing and communications design", "jobDescription": "Apple is working with advanced technologies to build ground-breaking new products. The Technology Development Group is seeking a Technical UX Designer to act as an interface between our product group and the design teams at Apple, and to help drive development of future facing products. We build technology that inspires people. What inspires you? We are looking for forward-thinkers to work with our group of innovators to help bring their ideas to life."}, "200183042": {"jobID": "200183042", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensor Digital Design Lead - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200183042/sensor-digital-design-lead-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS required / MS or PhD preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "10+ years of digital design experience with image sensors and cameras.Be familiar with silicon design methodologies and tool flows.Hands on experience with silicon bringup, characterization and debug necessary.Knowledgeable enough in all aspects of sensor usage that they can productively work with and support the camera team.Familiar with image sensor manufacturing technology, image sensor performance metrics, image sensor usage and integration into camera systems.BS required / MS or PhD preferredPreferred Experience:Familiarity with general industry trends and technical challenges.Experience beyond image sensors in ALS, Proximity, MEMS and other sensors is a plus.Some travel may be necessary.", "jobDescription": "Why Apple?\n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.\n\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\nThe Camera Hardware Engineering group is responsible for all research, design, development, test, and qualification of camera hardware for Apple products. The Camera Electronics team develops image sensor and other silicon solutions and technologies for Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the team is to enable the world’s best camera experience for our customers. New challenges arise every day that require the sharp analytical skills of talented and smart individuals. The team features a collaborative and hands-on environment that furthers engineering excellence, creativity, and innovation. The team is looking for an exceptional Sensor Digital Design Lead to join the team."}, "200451092": {"jobID": "200451092", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Signal Integrity - RF Integrity Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451092/signal-integrity-rf-integrity-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Excellent problem solving skills in a multidimensional and sophisticated environment.Passion for learning new technology and willingness to take risks to tackle problems.Adjust test plan and setup based on new findings in measurement and simulation to help root cause the issue.Broad experience with RF lab debug and characterization.Experience on bringing up sophisticated radio system and measuring all performance metrics of key sub-systems.Good understanding of board schematics and layout.Have experience with measurement automation tools and scripting languages such as Python or Matlab, etc.Experience with lab equipment such as RF spectrum analyzers, vector network analyzers, signal generators, phase noise analyzers, oscilloscopes, etc.Excellent written and verbal communication skills with ability to present ideas and perform independent research and development work.Preferred Qualifications:Define PCB requirement on schematic and layout to meet validation need.Knowledge on EM simulation tools and circuit simulation tools.Knowledge of RF front-end, PLL, and general wireless systems measurements (i.e. NF, Tx power, nonlinearity, phase noise, spur, etc.).BS and 10+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for perfection to work towards an outstanding result? We are looking for a talented and passionate Power Integrity Engineer to join our team.\n\nRFI (RF Integrity) team is responsible for developing novel methodologies to systemically address coupling, spur, and coexistence issues in highly integrated systems through simulation and lab debug. The engineering regime covers Si, package, module, PCB and device. The working methods are not limited by defined boundaries and evolving constantly. While the state-of-the-art technologies are developed here to meet the challenge, the journey is full of ups and downs as well as excitements and disappointments. If you are not easily discouraged by the ambiguity and uncertainty in such working process, you are at the right place. \n\nAs an RF Integrity Validation Engineer, you will be encouraged to address and resolve challenges that surface from the lab validation side. While crucial understandings of design and EM/circuit simulation are highly valuable on a smaller team. Due to the disciplinary nature of the position, you will be offered the freedom to work in various domains without clear boundaries or coverage on your daily workload. You may face challenges of many loose ends that you have to tighten them up. Your colleagues are pioneers on a new landscape; expectations are set high. If you are a dedicated professional who optimizes in a fast-paced environment and has flexible mentality, this position might be for you!"}, "200451368": {"jobID": "200451368", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "System Experience Essentials Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451368/system-experience-essentials-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor of Computer Science or equivalent skills and work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$260,000,"}, "benefits": null, "requirements": "You have stellar software engineering fundamentals and Objective-C or Swift proficiencyAs an exemplary owner, you consistently take initiative to design, commit to, and deliver solutions that achieve the needed outcomesAs a fast learner and proficient context-switcher, you’re comfortable with a high breadth of ownershipYou have outstanding problem solving, critical thinking, and interpersonal skillsYou’re a terrific cross-team and cross-functional partner — every project you participate in is better because of itYou make high-quality user experience-centric product decisionsYou’ve got 5+ years of software engineering experienceBachelor of Computer Science or equivalent skills and work experience", "jobDescription": "Apple devices have revolutionized how people live, connect, and work. It’s not by chance! By thoughtfully blending beautiful, premium hardware with intuitive, innovative system software, we design and build a uniquely impactful user experience. And at the leading edge of this user experience are the essential apps, components, and frameworks of the system experience.\n\nCome help define and build the essential pieces that complete Apple’s system experience—spanning iOS, iPadOS, macOS, and more. Work with an energetic, hard-working, fun team of managers, engineers, cross-functional teams, and world-class designers to deliver the best system experiences on the planet!"}, "200443544": {"jobID": "200443544", "origin_search": null, "posted": "", "jobTitle": "Cloud Services Supply Demand Analyst - Apple Cloud Services (ACS)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443544/cloud-services-supply-demand-analyst-apple-cloud-services-acs?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200449559": {"jobID": "200449559", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "RF Automation Software Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449559/rf-automation-software-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BSEE or equivalent degree with + 3 years experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong with OOP programming in Python.Proficiency with version control systems such as Git or SVN (GitHUB/GitLab).Proficiency with CI/CD frameworks such as BuildBot/Jenkins.Experience with virtual environment and application deployment.Excellent verbal and written communication skills.Comfortable working in a fast paced, challenging, and dynamic team environment.Minimum BSEE or equivalent degree with + 3 years experience is required.• Experience with RF Test Automation in any capacity for PHY layer measurements like EVM, ACLR, Sensitivity, BER, PER etc (Cellular, WIFI or other wireless technology).• Automation/Bench usage of Spectrum Analyzer, Network Analyzers, VST or Callboxes from Rohde and Schwarz, Keysight, National Instruments, LitePoint and others.• Experience with: GPIB/VISA, UART and RFFE.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. \n\nJoin us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Are you ready to join the RF Design – Platform Architecture team?"}, "200343857": {"jobID": "200343857", "origin_search": null, "posted": "Aug 10, 2022", "jobTitle": "TFT Panel Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200343857/tft-panel-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$190,000,"}, "benefits": null, "requirements": "Hands-on experience, in-depth technical knowledge, and proven track record in the design and development for display (OLED, LCD) or related electronics.Ability to perform circuit layout, parasitic RC extraction, circuit modeling and SPICE simulationUnderstanding the basic TFT and panel processPh.D. degree in Electrical Engineering, or M.S degree in Electrical Engineering plus 4 years TFT or relative industry experience.Excellent written and verbal communication skills are requiredPhD or MS in Electrical EngineeringExperience in display touchExperience in measuring and characterizing IV and CV of TFT devicesExperience in developing, designing and manufacturing high volume displayExperience in characterizing panel optical and electrical performanceExperience in gate, column driver IC and other display electronics designs", "jobDescription": "Apple is looking for a world-class Thin Film Transistor (TFT) panel design engineer to design, develop and launch the next display technologies for the portable, laptop and desktop displays in Apple products. The TFT panel design team is responsible for delivering the advanced TFT panel designs and technologies to enable the world’s best display performance in Apple Products. Individual will serve as a focal point in architecting and developing the total TFT pixel and panel designs. This includes display panel modeling, simulation, integrated circuit-on-glass design, panel architecture, and whole panel function simulation."}, "200446526": {"jobID": "200446526", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Web Services Engineer - Localization Automation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446526/web-services-engineer-localization-automation?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor’s or Master’s Degree in Computer Science (or equivalent experience)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Strong object-oriented programming and design skillsStrong analytical and problem solving skillsExperience with back-end frameworks (e.g. Ruby on Rails, Django)Experience with databases and indexing (e.g. Cassandra, SQL, Solr)A technical background in UNIX commands in TerminalExcellent written and verbal communication skills- Bachelor’s or Master’s Degree in Computer Science (or equivalent experience)Preferred Skills- Experience designing reusable API- Interest and background in translation, internationalization, localization, and international markets- Native level foreign language skills in reading, writing and speaking- Familiarity with Swift- Familiarity with version control systems such as subversion or git- A track record of shipping products", "jobDescription": "The Localization Automation Team is responsible for developing tools and technologies that allow Apple to localize and ship products such as iPhone, iPad, Apple Watch, Mac, Apple TV, and more across the world.\nWe are looking for a talented Software Engineer to take our localization process to the next level. You will be in charge of a crucial process that impacts every product with the objective of making it even better. You will also develop new tools and applications to enhance Apple's localization technologies."}, "200460174": {"jobID": "200460174", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Technical Program Manager- Mac", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460174/technical-program-manager-mac?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in related Engineering discipline, MBA a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$138,500", "max": "$208,500,"}, "benefits": null, "requirements": "7-15 years in an engineering role with experience in product design as well as design for manufacturability or manufacturing engineeringAbility to communicate effectively in a worldwide environmentNew product introduction and Manufacturing Operations experience desiredHave a solid working knowledge of DFM (DFx)Consistent record of cost reduction, project management and engineering designUnderstand and create tolerance stack ups for assemblies and part levelA strong plus would be knowledge of optics principles as they relate to CCD cameras, 2D and 1D lasers, and their use for positioning and critical alignment fixturesBasic understanding of adhesives, PSA’s and VHB’s a plusWorking knowledge of pneumatics, servo motors, PLC and and PC-based control systems a plusWorking knowledge of GD&T principles a plusNX2, NX4 or ProE CAD experiences a plusJMP, Minitab & Six Sigma experience a plusSelf-starter with innovation, integrity and attention to detailsBS or MS in related Engineering discipline, MBA a plus.", "jobDescription": "Imagine what you could do here. At Apple, we believe new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\nThe people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of our people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!\nIt takes deeply dedicated, intelligent and hard-working individuals to maintain and exceed the high expectations for the exciting brand at Apple. You will lead a team of engineers (DFx, DFm, test, SQE, PQE, etc.) and others in support of new product development as well as sustaining operations and ensuring the contract manufacturer readiness for very high volume production. You will bring your knack and thirst to drive all technical operational issues related to module assembly and system integration processes to ensure effective closure of all issues to enable operational success of the entire new product introduction cycle and into the mass production phase."}, "200357681": {"jobID": "200357681", "origin_search": null, "posted": "Jul 8, 2022", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200357681/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE or MSEE / Higher, or equivalent education  \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Knowledge of EM or RF or antenna designKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into productsKnowledge of RF schematic and PCB layout practices and guidelinesExcellent interpersonal skillsBSEE or MSEE / Higher, or equivalent education  \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits.", "jobDescription": "Join our wireless team and drive innovation that matters! At Apple, you will have a once-in-a-lifetime opportunity to deliver best in class performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for groundbreaking products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products.  We’re looking for hard-working and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration, & wireless communications."}, "200460310": {"jobID": "200460310", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460310/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE or, equivalent education\n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Knowledge of EM or RF or antenna designKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into productsKnowledge of RF schematic and PCB layout practices and guidelines.Excellent interpersonal skillsBSEE or, equivalent education\n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits.", "jobDescription": "Join our wireless team and drive innovation that matters! At Apple, you will have a once-in-a-lifetime opportunity to deliver best in class performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for groundbreaking products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products.\n\nWe’re looking for hard-working and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration, & wireless communications."}, "200460307": {"jobID": "200460307", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460307/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE or, equivalent education\n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Knowledge of EM or RF or antenna designKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into productsKnowledge of RF schematic and PCB layout practices and guidelines.Excellent interpersonal skillsBSEE or, equivalent education\n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits.", "jobDescription": "Join our wireless team and drive innovation that matters! At Apple, you will have a once-in-a-lifetime opportunity to deliver best in class performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for groundbreaking products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products.\n\nWe’re looking for hard-working and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration, & wireless communications."}, "200446453": {"jobID": "200446453", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Layout Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446453/analog-layout-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in analog/mixed-signal layout design of deep submicron CMOS circuits and recent experience on advance nodes including FinFet technologiesHigh level of proficiency in interpretation of CALIBRE DRC, ERC, LVS, reportsExperience with CADENCE or MENTOR GRAPHICS layout toolsProgramming knowledge in SKILL, Perl, and/or Python is a plus• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Silicon Engineering is seeking creative Layout Leads to design the next generation of Apple’s world-leading systems-on-chip (SOCs). Apple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad. Our Analog/Mixed-Signal (AMS) circuits connect them to the physical world! Examples of our AMS IPs include SERDES for data communication, PLLs for clock generation, and sensors for measuring all sorts of physical quantities.\n\nAnalog Layout is a crucial component of the hardware design process. Analog Layout Engineers work alongside circuit designers to transform design ideas into silicon. Apple’s world-leading SOCs are crafted using robust tool-suites, the most advanced nodes, and modern layout methodologies.\n\nThis job may be right for you if:\n\nYou want to accelerate your career. Thrive in a fast-paced, multifaceted, and results oriented environment. Are passionate about working with the world’s most advanced technology. Enjoy collaborating with a very talented and experienced team. Have a good understanding of engineering fundamentals. Actively seek out opportunities to work with cross-functional teams (SOC, Tech, CAD). Drive critical floor-planning decisions. Lead a team of people to produce complex AMS blocks with high-quality layout. Are always looking for ways to introduce new ideas and workflows that improve efficiency across a global team of layout engineers. Want opportunities to challenge yourself and broaden your skillset. Want to work every single day to craft products that enrich people’s lives."}, "200446705": {"jobID": "200446705", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Layout Lead Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446705/analog-layout-lead-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Experience in analog/mixed-signal layout design of deep submicron CMOS circuits and recent experience on advance nodes including FinFET technologiesHigh level of proficiency in interpretation of CALIBRE DRC, ERC, LVS, reportsExperience with CADENCE or MENTOR GRAPHICS layout toolsProgramming knowledge in SKILL, Perl, and/or Python is a bonus• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Silicon Engineering is seeking creative Layout Leads to design the next generation of Apple’s world-leading systems-on-chip (SOCs). Apple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad. Our Analog/Mixed-Signal (AMS) circuits connect them to the physical world! Examples of our AMS IPs include SERDES for data communication, PLLs for clock generation, and sensors for measuring all sorts of physical quantities.\n\nAnalog Layout is a crucial component of the hardware design process. Analog Layout Engineers work alongside circuit designers to transform design ideas into silicon. Apple’s world-leading SOCs are crafted using robust tool-suites, the most advanced nodes, and modern layout methodologies.\n\nThis job may be right for you if:\n\nYou want to accelerate your career. Thrive in a fast-paced, multifaceted, and results oriented environment. Are passionate about working with the world’s most advanced technology. Enjoy collaborating with a very talented and experienced team. Have a good understanding of engineering fundamentals. Actively seek out opportunities to work with cross-functional teams (SOC, Tech, CAD). Drive critical floor-planning decisions. Lead a team of people to produce complex AMS blocks with high-quality layout. Are always looking for ways to introduce new ideas and workflows that improve efficiency across a global team of layout engineers. Want opportunities to challenge yourself and broaden your skillset. Want to work every single day to craft products that enrich people’s lives."}, "200440010": {"jobID": "200440010", "origin_search": null, "posted": "Nov 2, 2022", "jobTitle": "Software Engineering Program Manager, Audio and Accessories", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440010/software-engineering-program-manager-audio-and-accessories?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "-  B.S. in Electrical Engineering, Computer Science or related disciplines\n\n-  M.S. is highly desired"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "4 + years of Engineering Program Management experience in the consumer electronics industry is highly desiredUnderstanding of development and manufacturing processes including test validationExperience in shipping products and leading them through the entire product life cycleExperience working with off-shore manufacturers and travel to manufacturing sitesSoftware development background (ability to read C/C++ code is a plus - writing code is not a job requirement)Understands and deals well with rapid development cyclesRemain calm and flexible in times of ambiguitySelf-motivated and high-energy with demonstrated creative and critical thinking capabilitiesExcellent written and oral communication skillsExcellent interpersonal skills, including the ability to work with diverse teams and interact, influence, collaborate, and negotiate effectively at all levels of managementKnowledgeable of one or more technologies: wireless and wired communications protocols (e.g. BT, USB), DSP, battery, UX/UI, embedded software, mobile software, electrical engineering-  B.S. in Electrical Engineering, Computer Science or related disciplines\n\n-  M.S. is highly desiredApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Are you passionate about exceptional engineering? Will you help us design the next generation of Apple products? We are hoping that you will join us in developing creative solutions to deep engineering challenges. You will become an integral part of our team. We champion engineering excellence, creativity and innovation. In this highly collaborative role, you will lead program management efforts between a variety of Apple engineering teams to build innovative technologies for world-renowned Apple products.\n\nThe Apple Accessories Engineering team is seeking an Engineering Program Manager to help drive collaboration between cross-functional engineering teams for embedded firmware development and coordination of features with OS teams and HW engineering."}, "200319176": {"jobID": "200319176", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "Product Manager Apple Pay", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200319176/product-manager-apple-pay?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.A./B.S./M.S. EE/CS or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Premier product professional with 7-10 years of experience, including product management for consumer offeringsAbility to synthesize complex topics and distill key business dynamicsAbility to collaborate with different teams including engineering, operations, using outstanding influencing skills, and strong senior-level communication abilities to drive decisionsAbility to contribute consistently and positively in a high-paced, fast-changing and sometimes unpredictable work environmentExperience developing high-growth technology platforms and servicesUpbeat and collaborative teammate who feeds off independent responsibilities and crafting the future of global paymentsAnalytical problem solver who is data driven, with a can-do attitude and flexibility to accommodate to evolving business needsFacilitate communication across a project and aggressively alert broader team of changes to scope, timelines and resourcesProficiency with Apple products and applications is preferredB.A./B.S./M.S. EE/CS or equivalent", "jobDescription": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re excited by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job.\n\nThe Apple Wallet, Payments, and Commerce team is rapidly growing, entering new markets and adding innovative new features to our products. We are seeking a top-flight product professional to help drive the growth of the Apple Pay. \n\nIn this role, you will help chart the future direction of Apple Pay and support execution against that long-term strategy. You will partner directly with the Wallet, Payments, and Commerce business, engineering, human-interface and other functional teams across Apple. You will work cross-functionally to deliver results, as well as working with external partners such as payment networks, bank issuers and other players to drive development. \n\nYou should have significant consumer product management experience and a track record launching of at-scale product launches. Ability to tackle an independent work stream and drive progress is key."}, "200432304": {"jobID": "200432304", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Engineering Project Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432304/engineering-project-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "4+ years experience leading multi-team organizationsExcellent communication skills, including breaking sophisticated technical problems down into understandable concepts.Shown experience delivering project status updates to executive audiences.Robust negotiation and presentation skills.Proven project management capabilities including strong leadershipStrong eye for businessAn innate drive to deliver resultsEnergetic and enthusiastic approach to leading teams through high pressure moments.In this position, you will deal with both local and global Apple partner application teamsYou will also develop, communicate, and train/implement project lifecycle and Process project management approachesPMI/PMP certification or other project certifications (i.g. Agile, Scrum, Sigma, Prince2 etc.) are a plus.", "jobDescription": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nTeam up with Apple, the most influential technology leader in the industry. Join the Business Process Management team in Apple Corporate Engineering and positively impact a company known for its impressive lineup of products, including Mac, iPhone, iPad, iTunes, and Apple Watch. At Apple, you can share in a commitment to excellence by partnering with world-class managers, all with one unified vision, to create innovative products that delight our customers. BPMP within Corporate Engineering is about supporting that innovative culture, accomplished by hiring quality individuals with integrity, personal accountability, teamwork, commitment to excellence, and proactive thinking. Contact us today if you exemplify our values and want to be part of something big.\n\nThe Business Process Management (BPMP) Team is looking for an energetic, innovative, and highly motivated strong software development project manager to support the highly sensitive projects."}, "200452451": {"jobID": "200452451", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Mixed Signal Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452451/mixed-signal-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Good understanding of protocol specifications for communication interfaces like PCIe, MIPI, I2C, SPI, UART etc.M.S.E.E. preferred, not requiredExperience with power supply/power managementHands on debug experience with usage of modern lab equipment (DSOs, Logic Analyzers, Protocol Analyzers)Experience in writing basic software routines and test scriptsStrong desire to investigate system level issues and drive problems to closure in a team-based environment with a proactive demeanorExperience with mobile and/or embedded processors and memory systemsExperience with schematic capture/layoutExperience interacting with offshore manufacturing partnersSuccessful track record of delivering highly innovative communications productsExperience with high volume, low power, mobile products.B.S. and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before.\n\nWe have built the best RF hardware design team on the planet! We’re looking for a dedicated individual to join our team. We support WiFi, Bluetooth, UWB, NFC, GPS, and emerging technologies. As a Mixed Signal Hardware Design Engineer, you will be responsible for the design, implementation and verification of digital and power portions of wireless designs across all Apple products. The applicant should be familiar with computer system architecture and digital design. The candidate will work proactively with other cross-functional engineering groups responsible for other blocks in the system."}, "200460189": {"jobID": "200460189", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "AR/VR Software Engineer, Server Development", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460189/ar-vr-software-engineer-server-development?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science/Engineering or related technical field, equivalent practical experience will be considered."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in server software programming languages such as JavaExperience with distributed systems design and developmentExperience with web services, RESTful APIExperience with test-driven developmentBS or MS in Computer Science/Engineering or related technical field, equivalent practical experience will be considered.BONUS QUALIFICATIONSExperience or interest in AR/VR applicationsExperience/knowledge of security and cryptographyExperience/knowledge of reactive programmingExperience with iOS / macOS development", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it.\n\nThe Technology Development Group is seeking a software engineer to help define and implement user experience paradigms for various compute environments across our platforms. This engineer will help architect and build the foundation of novel user experiences. Being successful in this area will result in a delightful experience for all users of our products. Are you passionate about building massively scalable services that surprise and delight? If you are passionate about solving challenging problems and enthusiastic about innovative and cool ideas, we want to hear from you."}, "200456014": {"jobID": "200456014", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Sensing Product Design - Mechatronics Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456014/sensing-product-design-mechatronics-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. +3 years of relevant industry experience or PhD (preferred) in Mechanical Engineering, Electrical Engineering, Solid Mechanics, or Physics"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Multi-disciplinary understanding of EE, ME, and Physics principles with hands-on experience in system-level designStrong mechanical engineering fundamentals with proven proficiency in 2D drafting, 3D conceptual modeling (NX preferred), GD&T, and design trade-offs.Demonstrated ability to drive failure analysis (tolerance analysis, statistical analysis, Monte Carlo, design-of-experiments) and FA techniques (CT, X-ray, FIB/SEM/EDX, etc.) to inform root cause and implement effective corrective actions.Proficiency in Large Data Processing and Coding: MATLAB, JMP, Python, or similar tool(s).Electrical engineering background with logical thought process and analytical skill set, and ability to break-down complex problems fundamental blocks that can be analyzed via understanding of electro-magnetic interactionsWorking knowledge of signal processing as applied to sensor systemsExcellent written and verbal communication skills and solid teamwork and leadership skillsMechatronics and/or MEMS experience is a a plusM.S. +3 years of relevant industry experience or PhD (preferred) in Mechanical Engineering, Electrical Engineering, Solid Mechanics, or Physics", "jobDescription": "The Sensing Product Design team is looking for a talented mechatronics engineer to build great experiences and bring Apple products to life. We are the team developing many of the sensors that changed the way people interact with their technology. Touch redefined the phone and tablet, TouchID seamlessly secured them, and the heart rate monitor let you keep tabs on yourself.\n\nIn this role, you will be responsible for specifying, developing, characterizing and validating touch sensing systems. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200265170": {"jobID": "200265170", "origin_search": null, "posted": "Jan 4, 2023", "jobTitle": "Touch ASIC Architect (Analog)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200265170/touch-asic-architect-analog?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in Electrical Engineering or industry experience equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Hands-on experience in design, development and launch of high volume IC designs in consumer products; \u2028direct experience with touch technology and / or flat panel display technology is beneficial.Strong electrical engineering background in signal processing, mixed-signal design, practical transceiver \u2028architecture design, filter design, and embedded system design.Hands-on experience in system-level design, requirements documentation, and IC micro-architecture definition of complex digital and mixed-signal ASICsProficiency in MATLAB, Verilog, or similar simulation, design and modeling tools.Excellent written and verbal communication skills and solid teamwork and leadership skills.Experience with Touch technology is a plus.Minimum of 5 years of relevant industry experience.  Analog ASIC design & architecture experience required.M.S. or Ph.D. in Electrical Engineering or industry experience equivalent.", "jobDescription": "Design, develop, and launch next-generation Touch Technologies in Apple products.\n\nThe Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the Touch Technology team is to enable the world’s best multi-touch user-experience. New challenges arise everyday that require the sharp problem- solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. \n\nAn analog ASIC architect is a key engineer responsible for analyzing the application and coming up with the best analog front end (AFE) architecture for touch and other sensing ASICs. These designs include multiple channels with complex filtering and DSP.\n\nCome, join us in crafting best-in-class solutions!"}, "200243874": {"jobID": "200243874", "origin_search": null, "posted": "Jan 4, 2023", "jobTitle": "Touch ASIC Architect -Analog", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200243874/touch-asic-architect-analog?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in Electrical Engineering or industry experience equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Hands-on experience in design, development and launch of high volume IC designs in consumer products; \u2028direct experience with touch technology and / or flat panel display technology is beneficial.Strong electrical engineering background in signal processing, mixed-signal design, practical transceiver \u2028architecture design, filter design, and embedded system design.Hands-on experience in system-level design, requirements documentation, and IC micro-architecture definition of complex digital and mixed-signal ASICsProficiency in MATLAB, Verilog, or similar simulation, design and modeling tools.Excellent written and verbal communication skills and solid teamwork and leadership skills.Experience with Touch technology is a plus.Minimum of 5 years of relevant industry experience.  Analog ASIC design & architecture experience required.M.S. or Ph.D. in Electrical Engineering or industry experience equivalent.", "jobDescription": "Design, develop, and launch next-generation Touch Technologies in Apple products.\n\nThe Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the Touch Technology team is to enable the world’s best multi-touch user-experience. New challenges arise everyday that require the sharp problem- solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. \n\nAn Analog ASIC Architect is a key engineer responsible for analyzing the application and coming up with the best analog front end (AFE) architecture for touch and other sensing ASICs. These designs include multiple channels with complex filtering and DSP.\n\nCome, join us in crafting best-in-class solutions!"}, "200452524": {"jobID": "200452524", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF Compliance Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452524/wireless-rf-compliance-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "You have experience and in-depth understanding of System Transceiver RF Parametric and RF component level characteristics and behaviors.You have working experience with lab equipment including network analyzers, signal generators, signal analyzers and call boxes (i.e., CMW/8960/UXM).Detailed understanding of at least one Wireless technology including 5G FR1, FR2, GSM, UMTS, CDMA, LTE, 802.11a/b/g/n/ac/ax and Bluetooth is a plus.Understanding of Antenna characteristics impact to radiated testing is preferred. Familiarity with radiated test setups, radiated chamber calibration and use are also a plus.Proficiency in MATLAB simulations, or STK, CST, HFSS simulation is a bonus.Knowledge on worldwide Regulatory standards in relation to carry a product to certification is a plus.Bachelor's Degree required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Apple Compliance Engineering team is looking for engineers to do wireless regulatory characterization and demonstrate regulatory compliance for different Apple products!"}, "200455005": {"jobID": "200455005", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Optical System Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455005/optical-system-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Graduate Degree in Optics, Physics, Electrical Engineering, Biophysics, Mechanical Engineering, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Thorough understanding and experiences in imaging optical system design, modeling and performance quantification.Proficiency in one or more optical modeling tools for imaging optics, e.g. Zemax, LightTools, etc.Fast learner with proven foundation in imaging optics, imaging sensor, illumination, and opto-mechanics.Strong analytical model building and problem solving capabilityStrong quantitative data analysis abilities, using JMP, Matlab, or equivalent tools.Ability to communicate clearly and efficiently across a range of technical subject areas with a broad slate of partners, including management, peers, and suppliers.Experiences in following fields is a plus: OCT, LIDAR, microscopy, AR/VR display, wavefront metrology, and optical grating.Graduate Degree in Optics, Physics, Electrical Engineering, Biophysics, Mechanical Engineering, or equivalent work experience", "jobDescription": "Apple’s display technology team features a collaborative environment with creative and elite products and pioneering technologies. Team provides opportunities for individuals to contribute across a wide spectrum of subject areas. Outstanding engineering excellence and thoroughness are expected and encouraged. Innovation, IP and patent creation are highly supported and valued. Opening up the boundaries to design and ship innovative products with outstanding technologies and user experiences are the main goals of our team. \n\nJoin us in crafting solutions the world doesn't know of yet. To be successful, you thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200451489": {"jobID": "200451489", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451489/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for an experienced Digital Circuit Design Engineer with:Strong understanding of CMOS device characteristics and design rules.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Experience in Circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits is a plus.Experience in RTL2GDSII flow and/or Static Timing Analysis (STA) is a plus.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Understanding of Timing characterization & modeling of Standard cell circuits is a plus.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200451491": {"jobID": "200451491", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451491/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for an experienced Digital Circuit Design Engineer with:Strong understanding of CMOS device characteristics and design rules.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Experience in Circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits is a plus.Experience in RTL2GDSII flow and/or Static Timing Analysis (STA) is a plus.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Understanding of Timing characterization & modeling of Standard cell circuits is a plus.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200431544": {"jobID": "200431544", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Product Design Engineer - Design Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431544/product-design-engineer-design-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum: BS in Mechanical Engineering or a similar technical discipline, with 2-5 years demonstrated ability. Advanced degrees are valued but 2-5 years of applicable hands-on experience is still required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in the use or design of test/measurement systems.Experience in applying engineering first principles to evaluate the performance of designs.Gathering and analyzing data with proficiency in Matlab, Python, Labview, Arduino, JMP or similar.Experience using CAD and basic lab tools to enable the design and fabrication of test fixtures and measurement systems.ALSO VALUABLE, BUT NOT REQUIRED:An understanding of how to apply statistics to ensure the proper interpretation of your data.Familiarity with a wide variety of sensor technologies, data acquisition systems, and fundamental analog/digital signal processing techniques.PERSONAL SKILL SET:Self motivated to investigate and solve difficult problemsAttention to detailAbility to clearly articulate issues quantitatively both verbally and with documentationExperience working in a multi-functional team / highly collaborative environmentAbility to manage multiple projects at once and prioritize to meet timelinesFlexibility and adaptability while working in a fast-paced and changing environmentMinimum: BS in Mechanical Engineering or a similar technical discipline, with 2-5 years demonstrated ability. Advanced degrees are valued but 2-5 years of applicable hands-on experience is still requiredThis position may require domestic and international travel (5%+)", "jobDescription": "Do you enjoy working in a dynamic lab environment and being part of a design team that will impact millions if not billions of people? If so, we want your help designing the next generation of products at Apple. The Product Design Validation (PDV) team’s mission is to inform Apple hardware design by quantifying product performance and experience with custom measurement tools, specialized analysis, and instrumented user studies.\n\nWe are looking for candidates that are passionate about engineering principles, curious about how things work, and are excited to grow and learn. You will be part of a collaborative team of multi functional partners focused on the design performance of our products and ultimately the customer experience. Excellent communication skills coupled with an enthusiastic, respectful and open minded approach to solving, debating and brainstorming are welcomed. Success in this role will require creativity, organization, and energy tempered by a sincere willingness to listen, learn, and understand what is needed from your designs."}, "200304147": {"jobID": "200304147", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AR/VR Graphics Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200304147/ar-vr-graphics-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science OR equivalent degree at at least 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Programming skills and knowledge of C / C++3D math for graphics/games (linear algebra)Communication and collaboration skillsBS/MS in Computer Science OR equivalent degree at at least 3 years of experienceApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for a Software Development Engineer to help us push the limits of the next generation of interactive experiences on our platform. This team is working with some of Apple’s most advanced technologies including augmented reality (AR) and virtual reality (VR) offered in ARKit and Metal 2. As a member of our creative organization, you will have the uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day."}, "200416323": {"jobID": "200416323", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "Triage Engineer, AR/VR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200416323/triage-engineer-ar-vr?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science, or equivalent degree—and 5+ years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Technical and Debug Expertise: Have great problem-solving skills, analytical, tools & development experience, and ability to evaluate and identify issues at a code level. Familiarity with Swift, Python, Javascript or other scripting/coding languages is key—preferably low-level experience with C/C++Customer focused: Passionate about the customer experience and how we can improve itPriority driven: Comfortable working in a continually changing, fast-paced environment and driving top issues to resolutionTechnically agile: Ready to deep dive into technical areas daily, but also discuss and represent these topics to a non-technical audienceGreat communicator: Excellent written/verbal skills, able to summarize key points and tie them back to product quality. Able to work with others to cut through ambiguity and to figure out how to bring issues to resolutionWorking with others: A history of working with cross-functional teams to ensure successful products. Able to work with other groups to improve quality and set priorities. Able to influence even without direct authorityInnovation: Able to bring creativity to engineering, leading development of new and better ways of testing, automation, and other improvementsBS/MS in Computer Science, or equivalent degree—and 5+ years of industry experience", "jobDescription": "Would you like to make an impact on the quality of Apple’s products? We’re looking for a passionate Triage Development Engineer to work on tool development and triage engineering on some of Apple's most advanced emerging technologies, including augmented reality (AR) and virtual reality (VR). As part of TDG, you’ll work cross-functionally to build tools, systems, and use engineering analysis to solve challenging debug problems and improve system debug-ability. You’ll be working in a dynamic environment, facing exciting new challenges daily. You have strong communication and interpersonal skills, problem-solving skills, curiosity, debugging and/or white box experience and attention to detail."}, "200447719": {"jobID": "200447719", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Wireless Systems Validation Engineer – WLAN, BT, UWB, Thread", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447719/wireless-systems-validation-engineer-wlan-bt-uwb-thread?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Practical knowledge of at least one Connectivity Wireless technology including WLAN, BT, UWB or ThreadPractical knowledge of at least one connectivity industry standards including 802.11, Bluetooth SIG, 802.15 requirements, compliance requirements and required testing methodologiesKnowledge of system level RF parametrics and its sources in RF component characteristics and behaviorHands-on experience with bench-level wireless testing, debug at the module, reference board or system-levelExperience with using RF lab test equipmentDebug-level experience on connectivity radio systems at the conducted level is a plusStrong written and verbal communication skillsBS with 3+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF System Engineering team is looking for a passionate, self-motivated individual to work on integration of WLAN, Bluetooth (BT), Ultra Wideband (UWB) and Thread technologies into Apple’s wireless products."}, "200447793": {"jobID": "200447793", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Performance Control Architect - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447793/performance-control-architect-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. and 20+ years of relevant industry experience. M.S. or Ph.D. in Electrical and Computer Engineering or Computer Science preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Research experience investigating execution efficiency in computing systems, particularly on real silicon.Comprehensive statistics and quantitative analysis skills.Understanding of the techniques used to manage power delivery and thermal limits in modern systemsHands-on experience with hardware instrumentation, including power measurement and performance countersKnowledge of computer architecture, including the relationships between CPUs, GPUs, other compute clusters and memory hierarchyUserland software (e.g., application, simulation, test harness, data analysis) development experience in environments such as C, C++, Objective-C, Swift, Python, Perl or MATLAB is essentialKernel software development experience in C or C++ is desirableB.S. and 20+ years of relevant industry experienceB.S. and 20+ years of relevant industry experience. M.S. or Ph.D. in Electrical and Computer Engineering or Computer Science preferred", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! The people who work here have reinvented entire industries with all Apple Hardware products.  The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our multifaceted group, you will have the unique and phenomenal opportunity to craft upcoming products that will delight and inspire millions of Apple's customers every single day.\n\nPlatform Architecture is looking for a Performance Control Architect to measure, analyze and control the relationship between power and performance in Apple’s most advanced systems on a chip. In this position, you will study the execution of iOS workloads on Apple silicon and leverage that understanding to influence the design of both hardware and software. You will design and conduct power/performance/thermal experiments, create instrumentation and data visualizations, contribute to Apple’s culture of debate, specify new SoC features, prototype innovative performance control algorithms, and develop the software that controls the performance of every application workload on hundreds of millions of iOS devices around the world."}, "200424471": {"jobID": "200424471", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "SRE/DevOps Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200424471/sre-devops-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Newport Beach", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s in Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "5+ years of experience in DevOps/SRE, systems engineering, build/release/deployment automation, etc.Experience designing and working with modern Continuous integration and deployment solutions.Experience with load balancing, scheduling jobs and working with backend infrastructure to support development servicesConsistent track record writing programs with high-level programming languages or scripting, Python, Swift, C/C++, Golang, etc.Experience with logging infrastructure and using tools such as Splunk, Logstash, or Elasticsearch.Experience with networking load balancers such as Ngnix, Netscaler, HAProxy.Experience with hosted services in a large scale enterprise environments.Implementing applications in cloud infrastructure and container technologies like Kubernetes and Docker.Bachelor’s in Computer Science or equivalent experience.-Knowledge of modern rendering techniques is desirable-Experience with Kafka, MongoDB and PostgreSQL is desirable.-Proven track record working in small, focused teams to complete critical achievements under pressure with tight deadlines.", "jobDescription": "The Technology Development Group (TDG) is looking for a DevOps/SRE Engineer to help us with advanced media pipelines supporting the next generation of interactive applications for our platform. Our team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), video, audio and graphics. As a member of our organization you will assist us in crafting future products that will delight, inspire and empower millions of people."}, "200360075": {"jobID": "200360075", "origin_search": null, "posted": "Apr 1, 2022", "jobTitle": "HomeKit Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200360075/homekit-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Engineering, Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "You are an accomplished coder in C and object-oriented languages, such as C++ or Objective-CYou have a well-founded grasp of computer science fundamentalsYou demonstrate a comprehensive knowledge of wireless technologies and protocols knowledge is a plusYou have experience shipping real products to customersYou thrive in a collaborative environmentYou have excellent communication skillsA real passion for product quality and attention to detailAbility to work in a rapid development cycle with tight schedulesYou are obsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersBachelor's degree in Computer Engineering, Computer Science or equivalent experience.", "jobDescription": "The HomeKit team provides the foundation that enables an entire ecosystem of secure and intelligent home connectivity.  We are developing technologies and crafting experiences that revolutionize the way people interact with the accessories around them.  The team is seeking a hardworking engineer to help build the Home automation platform and take it to the next level."}, "200393149": {"jobID": "200393149", "origin_search": null, "posted": "Jun 29, 2022", "jobTitle": "HomeKit Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200393149/homekit-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Engineering, Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "You are an accomplished coder in C and object-oriented languages, such as C++ or Objective-C or SwiftYou have a well-founded grasp of computer science fundamentalsYou demonstrate a comprehensive knowledge of wireless technologies and protocols knowledge is a plusYou have experience shipping real products to customersYou thrive in a collaborative environmentYou have excellent communication skillsA real passion for product quality and attention to detailAbility to work in a rapid development cycle with tight schedulesYou are obsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersBachelor's degree in Computer Engineering, Computer Science or equivalent experience.", "jobDescription": "The HomeKit team provides the foundation that enables an entire ecosystem of secure and intelligent home connectivity.  We are developing technologies and crafting experiences that revolutionize the way people interact with the accessories around them.  The team is seeking a hardworking engineer to help build the Home automation platform and take it to the next level."}, "200294888": {"jobID": "200294888", "origin_search": null, "posted": "Mar 8, 2022", "jobTitle": "Video Processing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200294888/video-processing-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science, Electrical Engineering or related majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience with Video Processing and GPU programmingExperience with HDR pipeline and Color Science a huge plusExcellent software design, problem solving and debugging skillsValidated programming skills and C/C++ coding abilitiesExperience in embedded real time multitasking software system3 years+ direct related experience in software developmentGood written and oral interpersonal skillsBS/MS in Computer Science, Electrical Engineering or related majorsApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped build almost daily. At Apple, you will have the opportunity to work on products that are always leaders in the industry and occasionally, change the world! The Video Engineering group at Apple is responsible for developing image/video core technologies used in almost all Apple products and services.  In this role, you will develop frameworks for image and video compression/processing, implementing features for HDR playback on iPhone/iPad/Mac /AppleTV for applications like AppleTV+, Netflix, Amazon Prime, YouTube, Hulu, Disney+ and HBOMax.  As an embedded software engineer, you will work on the video/image subsystem, including new video compression/processing feature development, performance, and power optimization. The ideal candidate would be an extraordinary teammate and have a proven track record of development for large volume product shipment."}, "200330413": {"jobID": "200330413", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "AR Apps Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200330413/ar-apps-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Computer Science or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.00", "max": "$75.48/hr,"}, "benefits": null, "requirements": "Experience developing UI automation, preferably in Apple frameworks such as XCTest.Strong objective oriented programming skills preferably in Python, Swift.Excellent knowledge and experience with test methodologies (unit testing, integration testing, performance testing, functional testing, etc).Strong passion for quality assurance in software, including experience in finding, investigating, and fixing bugs.Experience developing and understanding test frameworks and librariesAbility to investigate, debug and triage difficult problems both independently and cooperatively.Highly organized, creative, motivated, and passionate about achieving results.Creative thinker and strong problem solver with meticulous attention to detail.Bachelor’s degree in Computer Science or related field", "jobDescription": "At Apple, we strive to build the best products and experiences that enrich people’s lives. Apple’s Technology Development Group is working with some of Apple's most advanced technologies including the Augmented Reality (AR) support offered in ARKit. As a member of our dynamic organization, you will have the rare and rewarding opportunity to craft new products that will delight and inspire millions of people every single day!"}, "200374601": {"jobID": "200374601", "origin_search": null, "posted": "May 4, 2022", "jobTitle": "Sense Architecture Manager (SPG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200374601/sense-architecture-manager-spg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. / Ph.D. EE or related field with 15 / 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$183,500", "max": "$334,500,"}, "benefits": null, "requirements": "Track record managing high performance teamsExperience developing system architecture, sensor systems analysis, and modeling.Experience with use case analysis and requirement processes.Good understanding of optical and/or RF sensors physics and signal processing.Strong communication, documentation and presentation skills.M.S. / Ph.D. EE or related field with 15 / 10+ years of relevant industry experience", "jobDescription": "The Special Project Group (SPG) at Apple is currently looking for an exceptional candidate to lead the sense architecture team.  As a successful applicant you will provide strategic direction to a team of talented architects developing and evaluating sensing hardware solutions for autonomous systems.  You will work cross functionally with domain experts in sensor hardware, signal processing implementation, autonomy algorithms, systems engineering, and safety to perform system level trade-offs and provide robust assessments of architectural options. You must have a strong understanding of various sensing modalities’ strengths and limitations, associated algorithms, and general understating of perception systems. Prior experience in full product lifecycle is highly desired. You must feel passionate about guiding high permanence teams developing complex systems with multi-disciplinary teams and delivering within aggressive timelines."}, "200459843": {"jobID": "200459843", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Hardware Systems Design Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459843/hardware-systems-design-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE is required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong EE fundamentals including analog and high speed digital designBroad experience across different applications and technologiesExposure to solving unwanted coupling and interference between subsystemsDesign of sophisticated system architecturesAbility to analyze solutions and make system design trade-offsStrong desire to dive deep into system level issues and drive problems to closure in a team-based environment with a proactive attitudeExcellent verbal, written, and presentation skillsExperience in many of the following areas:-  Proven track record of leading dynamic multi-functional teams-  Familiarity with the challenges of taking a product from early architecture through to production-  Hands on experience with lab test equipment to debug difficult/intermittent hardware issues-  Schematic capture and rigid/flexible PCB layout-  Fundamentals of Signal and Power Integrity-  Low voltage power regulation and delivery-  Prototype design and validation with custom silicon-  Use of scripting languages to assist with hw developmentBS/MS EE is requiredPosition will require some international travel", "jobDescription": "The iPhone team is looking for expert Hardware Design Engineers who are motivated by the chance to create design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives! Our team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!"}, "200456977": {"jobID": "200456977", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "SoC Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456977/soc-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 0 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "-  Software development experience using C and assembly language with ARM CPUs.- Experience in  SW development and testing in FPGA environment-  Experience in developing low-level drivers and HW bring-up, using test tools and interacting with HW design teams.-  Exposure to multiple high-level programming languages, including C, C++.-  Experience with Configuration Management tools (git, Subversion, Perforce).-  Experience with scripting languages (i.e. Bash/shell, Perl, Python).-  Experience with MCUs, peripherals, features, and development environments is also valuable.-  Proven ability to design and integrate code into a shipping product against aggressive timelines.-  Strong software debugging skills are critical.-  Proficiency in Verilog/System Verilog-  Experience with FW development/debugging in pre-silicon environment (simulation/emulation).-  Proven excellence in firmware, device driver, or equivalent experience?Minimum of BS + 0 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200455227": {"jobID": "200455227", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "SoC Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455227/soc-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "-  Software development experience using C and assembly language with ARM CPUs.- Experience in  SW development and testing in FPGA environment-  Experience in developing low-level drivers and HW bring-up, using test tools and interacting with HW design teams.-  Exposure to multiple high-level programming languages, including C, C++.-  Experience with Configuration Management tools (git, Subversion, Perforce).-  Experience with scripting languages (i.e. Bash/shell, Perl, Python).-  Experience with MCUs, peripherals, features, and development environments is also valuable.-  Proven ability to design and integrate code into a shipping product against aggressive timelines.-  Strong software debugging skills are critical.-  Proficiency in Verilog/System Verilog-  Experience with FW development/debugging in pre-silicon environment (simulation/emulation).-  Proven excellence in firmware, device driver, or equivalent experience?Minimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200464293": {"jobID": "200464293", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Materials Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464293/materials-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our Engineers have Advanced Degree in Materials Science and Engineering, Mechanical Engineering, Chemistry, Polymers Science, or an equivalent field, but if you’ve followed a different path to expertise in Polymers and Composite materials, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "The ideal individual has an in-depth knowledge of polymer and composite materials, including sample preparation, familiarity with test equipment and data analysis methods. Hands on experience is highly desirable.Experience with leading materials engineering projects for polymeric/composite structural parts.Experience with various industry specifications for testing polymer and composite materials,preferably materials used in printed circuit boards or flexible printed circuit boardsExperience in material characterization, material selection and root-cause analysis of mechanical, thermal, and electro-mechanical performance of materials.Attention to detail and a strong passion for qualityAbility to effectively communicate and collaborate with multi-functional teams about various topics such as product requirements, technology specifications, project schedulesA proven dedication to continuous self-improvement.Ability to work in a fast-paced environment.Excellent written and oral communication skillsMost of our Engineers have Advanced Degree in Materials Science and Engineering, Mechanical Engineering, Chemistry, Polymers Science, or an equivalent field, but if you’ve followed a different path to expertise in Polymers and Composite materials, we still want to hear from you.", "jobDescription": "At Apple, our Products, Services, and Customer Experiences demand extraordinary innovation. Technology and environmental breakthroughs are crucial in the materials and processes we bring into production to lead the world in terms of Carbon and Material performance. Can you imagine your talent supporting Apple’s next leap ahead? \n\nWe are expanding our new team of Materials Specialists in the Advanced Technology Group with a key focus on bringing deep materials knowledge and characterization of printed circuit boards (PCBs) and flex printed circuits (FPCs) into the core product design process. We need you!\n\nAre you passionate about materials and being part of an extraordinary engineering team? Do you want to be part of a multi-functional initiative with outstanding suppliers and institutes delivering first of a kind material development? Do you adopt ownership and accountability? Do you want to work hand-in-hand with phenomenal people across Product Design, Electrical Engineering, Reliability Engineering, Design for Manufacturing in Apple’s key Product teams? If yes, we want you to join our diverse and impactful team.\n\nCome Join us!"}, "200459106": {"jobID": "200459106", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Sr. Power Technology Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459106/sr-power-technology-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE in power electronics with 10+ years experience in power electronics research or design engineering including 3+ years experience in technical lead role"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience of working on various high frequency power conversion technologies used in consumer electronics, computing, Telecom, Industrial/Medical applications such as, off-line switched mode power supplies and on-board DC/DC Converters. Any exposure to adjacent power electronics fields such as Automotive, Solar Inverters, Motor drives is helpful, although not vital.Must have worked in the capacity of technical lead in several projectsStrong expertise in various power conversion topologies and architectureAnalytical capabilities to understand and tackle architectural issuesHigh level of expertise in control loop design, Spice simulations and mathematical modelingHands on experience in digital control and embedded firmware development for power conversion products is a mustCan work independentlyGood understanding of safety, reliability and manufacturability aspectsFamiliar with working on novel concepts with passion for research & developmentAbility to communicate and collaborate with multi-functional teamsEvidence of innovations in enabling technical solutions will be an added benefitBSEE in power electronics with 10+ years experience in power electronics research or design engineering including 3+ years experience in technical lead role", "jobDescription": "An excellent opportunity to work on the forefront technology with the outstanding company consistently bringing innovations to the world. In this position, you will be part of the sophisticated power technology team developing innovative power architectures for Apple’s next generation products. Are you ready for a new challenge? Come join the team!"}, "200443235": {"jobID": "200443235", "origin_search": null, "posted": "Nov 11, 2022", "jobTitle": "Software Engineer – Video", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443235/software-engineer-video?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science, Electrical Engineering or related majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Experience with Video Processing and GPU programmingExperience with HDR pipeline and Color Science a huge plusExcellent software design, problem solving and debugging skillsValidated programming skills and C/C++ coding abilitiesExperience in embedded real time multitasking software systemMinimum of 3 years direct related experience in software developmentGood written and oral interpersonal skillsBS/MS in Computer Science, Electrical Engineering or related majorsApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped build almost daily. At Apple, you will have the opportunity to work on products that are always leaders in the industry and occasionally, change the world! The Video Engineering group at Apple is responsible for developing image/video core technologies used in almost all Apple products and services.  In this role, you will develop frameworks for image and video compression/processing, implementing features for HDR playback on iPhone/iPad/Mac /AppleTV for applications like AppleTV+, Netflix, Amazon Prime, YouTube, Hulu, Disney+ and HBOMax.  As an embedded software engineer, you will work on the video/image subsystem, including new video compression/processing feature development, performance, and power optimization. The ideal candidate would be an extraordinary teammate and have a proven track record of development for large volume product shipment."}, "200349341": {"jobID": "200349341", "origin_search": null, "posted": "Oct 5, 2022", "jobTitle": "System Architect - HW/SW Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200349341/system-architect-hw-sw-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in relevant field (EE, CS, Computer Eng)\n5+ years work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong system / SoC architecture background with deep understanding of low power processing.Experience in development of SoC Power and Performance simulation models for use case level analysis and optimization.Strong coding skills in Python, C/C++, SystemC.You have background on NN algorithms and Neural HW architecture.You have background on HW acceleration for image / display / audio signal processing workloads.Ability to drive HW / SW partition and co-optimization in a data driven way.Strong verbal communication skills across organizations and at the executive level.Excellent written skills for clear reporting of data analysis and conclusions.MS/PhD in relevant field (EE, CS, Computer Eng)\n5+ years work experience", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it!"}}