{"200451962": {"jobID": "200451962", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal IP Post Silicon Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451962/analog-mixed-signal-ip-post-silicon-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE is required\nMinimum 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in AMS test development that includes: review specification document; draft validation plan; build test bench; and perform data collection with automationStrong fundamental understanding of analog & mixed signal circuitry in one or more of the following domains: PLL, Data Converter, DDR Memory, Temp Sensor, etc.Proficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, etc.Experienced in scripting language, Python preferred, to automate test and analyze dataDiligent & Emphasis on quality of resultsInitiative in taking ownership & responsibility to drive deliverablesStrong verbal and written communication skillsHands-on lab experience including soldering/instrumenting systems is a plusBSEE is required\nMinimum 3 years of industry experience", "jobDescription": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200451389": {"jobID": "200451389", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless Systems Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451389/wireless-systems-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "This is a technical contributor role that requires validated experience in system design, integration, bringing up and productization of wireless communication systems.Experience bringing up a wireless chip including initial bringup/tuning of blocks, tuning of the tx or rx chain, and/or implementation and optimization of radio or phy communication or calibration algorithms.Understanding of communication theory and signal processing related algorithms (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, etc.)Deep experience, knowledge and skills on system design, integration, bring up, characterization and debug of real silicon in lab.Experience using and understanding of the theory of operation of lab equipment (spectrum analyzer, signal generator, power meter, etc.).Experience in modem architecture, microprocessor architecture, hardware and software control.Experience with silicon prototyping, emulation systems, and virtual platforms is a plus.Experience with multi-radio coexistence management is a plus.Knowledge in existing wireless communication protocols: LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE.Prefers some proven experience with Matlab, Python, Shell scripting and/or C/C++Excellent communications skills, both written and oral.BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Wireless System Engineer. As a member of our multifaceted group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nIn this technical role, you will be responsible for physical layer system design, integration, and characterization of state-of-the-art wireless SoC products at the center of a silicon design group from conception to production."}, "200272019": {"jobID": "200272019", "origin_search": null, "posted": "Jun 6, 2022", "jobTitle": "Apple Watch Display Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200272019/apple-watch-display-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in Physics/EE/Materials Science, preferably with experience in a multi-disciplinary environment. All experience levels will be considered."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Multi-disciplinary module integration and management; responsible for all customer facing display features.Overall display performance and definition, including: Front-of-screen behavior, cosmetics, power, reliability, assembly and process, system integration (both hardware and software), failure analysis, validation, characterization.Excellent project management, communications and multi-functional leadership skills required.Willingness and ability to travel.PhD or MS in Physics/EE/Materials Science, preferably with experience in a multi-disciplinary environment. All experience levels will be considered.", "jobDescription": "Imagine what you could do here. At Apple, extraordinary ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish."}, "200452571": {"jobID": "200452571", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF Compliance Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452571/wireless-rf-compliance-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Industry experience in development/ characterization of RF/Antenna system for wireless technologies. Experience on commercializing products for Cellular/ WLAN is required.In-depth understanding of at least one Wireless technology including 5G FR1, FR2, GSM, UMTS, CDMA, LTE, 802.11a/b/g/n/ac/ax and Bluetooth.Experience with regulatory/industry conformance specifications for consumer products.Experience in RF layout review radiated sub-system review and system grounding.Experience with one of the tools like MATLAB, HFSS, CST, ADS, etc.Understanding of regulatory features like DFS, Adaptivity, Power Table, etc. is a bonus.Experience with radiated test methodology, equipment, 3m Chamber, etc. is a plus.Bachelor's Degree required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Apple Compliance Engineering team is looking for a candidate to do system engineering towards ensuring wireless regulatory compliance for different cellular & connectivity technologies!"}, "200430397": {"jobID": "200430397", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Location Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200430397/location-quality-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in Computer Science or equivalent \nRequires a minimum of 3– 6 years of related experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$84,300", "max": "$162,800"}, "benefits": null, "requirements": "Requires physical activities such as Walking, Running and Swimming for data collection in the fieldBasic knowledge of programming strongly preferredExcellent Debugging skills & experience troubleshootingLaser-focused on the smallest details that are meaningful to our customersStrong communication skills and good interpersonal skills to work in team environmentThrive in a collaborative environment and can clearly communicate while expertly driving multiple projects across many teamsBachelors in Computer Science or equivalent \nRequires a minimum of 3– 6 years of related experience.", "jobDescription": "Join our Location team and drive innovation that matters. We create and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. If you're passionate about building technology that will make a difference, we may have the job for you. The Location team works on the next generation of location technologies on iOS, MacOS, tvOS and the revolutionary Watch. In this position, you will be a key player collaborating with the development team to help conduct experiments to collect test data and validate them for upcoming innovative location features. You'll be part of a highly high-energy team that has delivered amazing location technologies such as GPS, Indoor Location, iBeacon, Auto Unlock of Mac and many more. Our team is seeking a motivated, highly technical and comprehensive individual to help us build the best location experience for our customers."}, "200446475": {"jobID": "200446475", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "AR/VR Graphics Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446475/ar-vr-graphics-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Good programming skills and knowledge of C++, and Objective C or SwiftExtensive experience with at least one of the graphics APIs (Metal, OpenGL, Direct3D, Console, etc.)Experience with Shader Languages (HLSL/GLSL, Metal Shaders) and writing custom shaders3D math skills (linear algebra)Ability to collaborate with a content creation team to improve visual fidelity and runtime efficiency of 3D assetsProficiency with new and existing rendering techniques to create efficient and stunning industry defining visualsBS / MS / PhD in Computer Science or equivalent experienceYou have shipped a performant AR or VR applicationExtensive experience with application performance profiling and optimization", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer who wants to meaningly impact the lives of our users through first party applications. Apple’s Technology Development Group (TDG) is building AR applications using some of Apple's most advanced technologies including the augmented reality (AR) and virtual reality (VR) support offered in ARKit and Metal. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day!"}, "200448940": {"jobID": "200448940", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Cellular 4G/5G Firmware RF Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448940/cellular-4g-5g-firmware-rf-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceStrong RF background and familiarity with RF systems fundamentals as well as hands-on experience with RF test equipment (network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.)Validated understanding on RF, PLL, and general wireless systems measurements (i.e. ACLR, ACPR, EVM, phase noise, lock time, etc.)Experience in cellular RF system development / RF SW verificationAbility to work multi-functionally with different teams to define & implement RF verification test plan that will help achieve the outstanding modem targetsKnowledge of RF transceiver and RF front end components controlling for 4G/5G radio as well as understanding of RF calibrations for compensating RF impairmentsShown track-record of innovation and hands-on experience in RF measurement setup and test methodologyStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong proven understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms will be an added plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "As part of an outstanding modem team, you’ll craft powerful embedded firmware that deliver more performance in our products than ever before! You’ll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, we'll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world! Do you want to have an impact on every single Apple product? As a Cellular 5G/4G Firmware RF Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on requirements."}, "200461053": {"jobID": "200461053", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Senior Front End Web Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461053/senior-front-end-web-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years professional experience building and debugging consumer-facing single-page applications in JavaScript ES6+, HTML/CSSExperience with developing rich, interactive and well-performing user interfacesReact/Redux/WebPack for front end development requiredJest / Enzyme or equivalent unit-testing experience requiredWorking experience with NodeJS and Typescript are desired, but not requiredKnowledge of Java or Python a bonus, but not required", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\n\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.\n\nThanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here."}, "200381306": {"jobID": "200381306", "origin_search": null, "posted": "May 18, 2022", "jobTitle": "Manufacturing Design Engineer (MDE)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200381306/manufacturing-design-engineer-mde?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS or PhD in mechanical, manufacturing or industrial engineering preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$109,000", "max": "$164,500,"}, "benefits": null, "requirements": "3+ years of full time mechanical manufacturing experience requiredDemonstrate hands-on mechanical abilityDemonstrate excellent written and verbal interpersonal skills.35% domestic and international travel requiredExperience with highly cosmetic parts a plus as is experience in a manufacturing environment of consumer electronics or consumer plastic / sheet metal productsBe a self-starter by defining all engineering tasks to meet project objectives and have the ability to quickly learn about new processes with very little information providedBS, MS or PhD in mechanical, manufacturing or industrial engineering preferred.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nJob Summary: \n\nThe Apple Manufacturing Design Engineer (MDE) is accountable for driving the development of key mechanical manufacturing processes across Apple’s worldwide supply base. In this highly visible, hands-on role as the expert technical member of the Manufacturing Design Team you will have direct frequent communication and collaboration with Apple Industrial Design, Product Design, Manufacturing Design partners and worldwide suppliers."}, "200451354": {"jobID": "200451354", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Mixed Signal IP Post-Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451354/mixed-signal-ip-post-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in first silicon bring-up, debug, validation, characterization and reportExperience with data converter, PLL, filters, SerDes, DDRExperience developing automated testing script and instrument controls, Python preferred.Familiar with measurement equipment including signal generator, spectrum analyzer, scopeEmphasis on quality of work: should self-check scripts, test patterns, and reportsBachelors Degree\n10 years of experience", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a dedicated Mixed Signal IP Post-Silicon Validation Engineer! In this highly visible role, you will perform lab validation and characterization of coordinated circuits; and you will collaborate with many fields to launch the world's premiere mobile chips. As a member of our multifaceted group, we have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200461533": {"jobID": "200461533", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Safari/WebKit Configuration & Release Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461533/safari-webkit-configuration-release-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree or higher in Computer Science or a related field OR relevant work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Experience in the software industry, with passion for quality processes.Ability to define/design/develop/maintain test automation frameworks.Strong experience in using Python, Perl, shell scripting, version control systems, object-oriented methodology, and other related tools /scripting languages.Strong problem solving, critical thinking, organization and interpersonal skills.Experience in testing and automating APIs, UIs and Native Applications.Experience in software development lifecycle, test methodologies and tools.Working knowledge of C/C++ or Objective-C.Working knowledge of iOS and macOS is preferred.Bachelor's degree or higher in Computer Science or a related field OR relevant work experience.", "jobDescription": "The Safari and WebKit team is looking for a Configuration & Release Engineer to create, maintain and improve Safari and WebKit’s software release process and tools infrastructure. This position requires a self-motivated individual with strong programming and communication skills. We’re looking for critical problem solvers to drive our automated testing to help deliver a high-quality next generation Safari browser to customers on both iOS and macOS."}, "200443637": {"jobID": "200443637", "origin_search": null, "posted": "Nov 17, 2022", "jobTitle": "Apple Home Product Systems QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443637/apple-home-product-systems-qa-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS in CS/CE/EE or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum of 3 years in an end user quality-focused role.Experience with the development cycle of a customer-facing hardware product.Good understanding of QA methodologies, such as test planning, scheduling, and regression.Experience being accountable for the quality of a technical area and demonstrated understanding of how it works.Experience working with partners across different teams and organizations to clearly communicate status and raise critical issues.Ability to think analytically, reduce data sets, problem-solve, and innovate.Scripting experience in a high level, object-oriented programming language, such as Python.-  BS in CS/CE/EE or equivalent experience.", "jobDescription": "Would you like to work on a dynamic team that is all about delivering a quality experience on some of the world’s most creative products? \n\nWe are the Apple TV and HomePod Systems QA Team, and we are looking for a highly motivated, energetic, and experienced QA engineer with a passion for consumer electronics and technologies like Audio/Video, AirPlay, Wi-Fi, Precision Audio and Siri. You'll enjoy working on a team of diverse-minded Systems QA engineers as we take on new problems and help refine brand-new technologies for a simple and elegant user experience. \n\nYou'll partner closely with the hardware teams as we develop the next generation of devices that seem almost magical. You'll also work with software engineering on planning for the new set of features that will take Apple TV and HomePod to the next level. You will be proud of your work through every step of the development cycle and will help make the products more flexible, reliable and easy to use. \n\nCome be a part of a team using creativity and innovation to test features that our customers love!"}, "200460185": {"jobID": "200460185", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Power & Performance Telemetry Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460185/power-performance-telemetry-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S., M.S., or Ph.D. in Computer Science, Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$234,000,"}, "benefits": null, "requirements": "5+ years of experience in developing production software (C, C++ or Obj C)Proactive and self motivated with demonstrated creative and critical thinking capabilitiesStrong technical leadership and ability to inspire team membersExcellent spoken and written communication skillsDemonstrated ability to collaborate cross-functionally with engineers and managers across technical domainsStrong system level understandingStrong foundation in software design and architectureB.S., M.S., or Ph.D. in Computer Science, Electrical Engineering or equivalent", "jobDescription": "Power and Performance team is looking for a software engineering manager to lead its telemetry team.  This team is responsible for building systems to collect telemetry across all Apple products to drive power/performance triage and analytics. You would work with various teams across Apple to develop an understanding of new hardware and software features, and be responsible for the telemetry collection system spanning multiple layers of software stack. You will have the opportunity to work on the latest Apple products and drive the team to build efficient software that would ship to billions of Apple customers. We're looking for a strong leader to join and lead this amazing team."}, "200417157": {"jobID": "200417157", "origin_search": null, "posted": "Dec 2, 2022", "jobTitle": "Xcode Cloud- Web Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200417157/xcode-cloud-web-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelorʼs Degree in Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "Professional experience building highly-scaled web applicationsAbility to learn quickly and adapt to new challengesExperience designing and using web service APIsExperience communicating with customers, collaborating with technical/design teams, leading high-impact feature development, and mentoring engineersBachelorʼs Degree in Computer Science or equivalent experience.", "jobDescription": "Xcode Cloud is a continuous integration and delivery service created by Apple, for developers.\n\nAs a Web Engineer, you will have the unique and rewarding opportunity to shape the future of Apple platform development. You will build tools used by thousands of developers around the world to build, test, and ship software for Apple's iOS, watchOS, tvOS, and macOS platforms."}, "200448548": {"jobID": "200448548", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Wireless Systems Design and Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448548/wireless-systems-design-and-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "This is a comprehensive technical contributor role that requires validated experience in system design, integration, bringing up and productization of wireless communication systems.Prefers experience bringing up a wireless chip including initial bringup/tuning of blocks, tuning of the tx or rx chain, and/or implementation and optimization of radio or phy communication or calibration algorithms.Deep understanding of communication theory and signal processing related algorithms (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, etc.)Deep experience, knowledge and skills on system design, integration, bring up, characterization and debug of real silicon in lab.Experience using and understanding of the theory of operation of lab equipment (spectrum analyzer, signal generator, power meter, etc.).Experience in modem architecture, microprocessor architecture, hardware and software control.Experience with silicon prototyping, emulation systems, and virtual platforms is a plus.Experience with multi-radio coexistence management is a plus.Knowledge in existing wireless communication protocols: LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLE.Some proven experience with Matlab, Python, Shell scripting and/or C/C++Excellent communications skills, both written and oral.BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Wireless System Engineer, working on both design and integration as part of your growth. As a member of our multifaceted group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nIn this technical role, you will be responsible for physical layer system design, integration, and characterization of state-of-the-art wireless SoC products at the center of a silicon design group from conception to production."}, "200452878": {"jobID": "200452878", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452878/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelors degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Software skills in C/C++.Familiarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is a plusExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is ideal Experience with scripting (Python, Tcl, Perl) is a plusMinimum requirement of a bachelors degree", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200452041": {"jobID": "200452041", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Software Engineer: Linux Driver developer (Thunderbolt/USB/PCIe/Displays)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452041/software-engineer-linux-driver-developer-thunderbolt-usb-pcie-displays?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experienced in embedded Linux kernel developmentExperienced in one or more of USB, PCIe, Thunderbolt, Display and Networking Linux frameworksStrong Computer architecture and Operating system fundamentalsStrong debugging skills in Kernel and user spaceYou are a skilled C programmer and good at scripting using bash/pythonFamiliarity with ARM architectureBS and a minimum of 10 years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. \n\nAre you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly."}, "200460429": {"jobID": "200460429", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "SoC Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460429/soc-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Strong Programming skills for writing and debugging test programs and test related hardware development (i.e. Teradyne UFlex/J750/ip750, Advantest 93k platforms.)Proficiency in programming with Scripting languages (i.e., PERL) and high level languages (i.e., C/C++ or Visual Basic.)Experience working on digital VLSI SoC.Expertise in Semiconductor Test Methodology.Deep understanding of Electronic Engineering Fundamentals, Design for Test and Manufacturing Concepts.In depth knowledge of Semiconductor Manufacturing Process.Understanding of semiconductor product life cycle.Able to work with test equipment (i.e., oscilloscope, logic analyzer, etc.)Travel is required.BS and a minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices! \n\nAs our SoC Test Engineer you will be crafting and debugging ATE programs and hardware for characterization, qualification, and production of SoC devices."}, "200460433": {"jobID": "200460433", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "SoC Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460433/soc-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong Programming skills for writing and debugging test programs and test related hardware development (i.e. Teradyne UFlex/J750/ip750, Advantest 93k platforms.)Proficiency in programming with Scripting languages (i.e., PERL) and high level languages (i.e., C/C++ or Visual Basic.)Experience working on digital VLSI SoC.Expertise in Semiconductor Test Methodology.Deep understanding of Electronic Engineering Fundamentals, Design for Test and Manufacturing Concepts.In depth knowledge of Semiconductor Manufacturing Process.Understanding of semiconductor product life cycle.Able to work with test equipment (i.e., oscilloscope, logic analyzer, etc.)Travel is required.BS and a minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!   \n\nAs our SoC Test Engineer you will be crafting and debugging ATE programs and hardware for characterization, qualification, and production of SoC devices."}, "200452860": {"jobID": "200452860", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452860/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelors degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Software skills in C/C++.Familiarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is a plusExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is ideal Experience with scripting (Python, Tcl, Perl) is a plusMinimum requirement of a bachelors degree", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200451019": {"jobID": "200451019", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "ASIC/FPGA Prototyping Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451019/asic-fpga-prototyping-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS+ 3 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Typically requires proven experience with bring up, debugging and verification on FPGAExperience in FPGA development for wireless applications strongly preferredProven understanding of wireless standards, such as IEEE 802.11, Bluetooth is a plusExperience with FPGA platforms: Dini, HAPS - including compilation, debug, performance and throughput tuningExperience writing 'make' based build systemExperience with C++ and python highly desirableMaintain common design platform for ASIC as well as FPGA, with considerations for memories, I/O Pads, gated clocks and complex generated clocks.Design and verification using Verilog/System VerilogPerform FPGA Synthesis, Place & Route, timing optimizationsPerform bring-up, debug, and validation of designs to achieve functional and performance goalsCreate and execute plans to bring-up, debug, and validate designsThoroughly document and support each of above stepsCollaborate with cross-functional teams in order to define prototype hardware to evaluate new technologies and featuresBS+ 3 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborating with people across different functional areas, and thriving during crisis times, we encourage you to apply."}, "200449703": {"jobID": "200449703", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "RF Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449703/rf-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS with 3 + years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS with 3 + years of relevant industry experienceKnowledge of mobile communications in 4G/5G 3GPP protocols and radio architecture and Interfaces.Knowledge of RF transceiver and RF front end components control for 4G/5G radio.Understanding of RF calibrations for compensating RF impairments.Understanding of design principles to meet tight real time deadlines a plus.Deep understanding of software engineering principles, and core computer science fundamentals.Excellent in embedded C/C++ programming, and working experience with compilers, build and source code control tools.Experience with using RF Test equipment for RF validation and debugging.Proficiency with debugging in embedded software systems. Familiarity with JTAG.Minimum BS with 3 + years of relevant industry experience-  Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.-  We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible. As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. You’ll work across fields to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. Do you want to have an impact on every single Apple product?\n\nAs a RF Software Engineer on the Cellular FW team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing innovative cellular SoCs! This position requires someone comfortable with all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200443028": {"jobID": "200443028", "origin_search": null, "posted": "Nov 10, 2022", "jobTitle": "AR/VR System UI Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443028/ar-vr-system-ui-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or Equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "0-2 years experience in software developmentTrack record for building complex applications that are functional and delightfulProficient in Swift, C++ or ObjCAttention to detail, creativity and passion.BS in Computer Science or Equivalent- Proficient in 3D math- Familiarity with SwiftUI and/or UIKitApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "The Technology Development Group (TDG) is looking for an AR/VR System UI Engineer to help define and build the next generation user experiences on our platforms using Apple's latest technologies including RealityKit and ARKit."}, "200455241": {"jobID": "200455241", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "AMCC DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455241/amcc-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of System Verilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  Good SW programming skills with knowledge of data structures and algorithms-  Experience with python, perl, or similar scripting language-  Knowledge of memory architecture, caches, and cache-coherency protocols-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal and communication skills and the dream to take on diverse challengesMinimum of BS + 10 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200463907": {"jobID": "200463907", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Cloud FinOps Product Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463907/cloud-finops-product-manager?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in finance, economics, mathematics, or other relevant field that demonstrates quantitative competence. MBA desirable."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$177,000", "max": "$269,000,"}, "benefits": null, "requirements": "5+ years of demonstrated ability in program/project management role in a customer-centric environmentOutstanding driver who is excellent at connecting the dots and able to lead and influence global, cross functional teamsAbility to consistently and positively in a fast-paced, constantly evolving environment. Remain flexible and calm in the face of uncertainty and ambiguityCollaboration skills—leading execution across teams, influencing across organizations, and experience working across all levelsCreative and inventive, always finds a way forward; eternal optimist with a committed drive for impact.Strong intuition for business and ability to comfortably dive into any area of the business, develop a deep understanding, and craft execution plansAn understanding of data in a sophisticated and complex enterprise system landscape, including data governance, quality, and standardizationExperienced with the common frameworks of cloud services and distributed systems including AWS, GCP, Kubernetes, etc.Experience with Agile software developmentHands-on experience with Python, R, Tableau or similar tools to mine, transform and visualize dataBachelor's degree in finance, economics, mathematics, or other relevant field that demonstrates quantitative competence. MBA desirable.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. You bring passion and dedication to your job and there's no telling what you could accomplish! \n\nApple’s FinOps Engineering team is looking for a hard-working and highly motivated leader to be a Cloud FinOps Product Manager. You will provide a key function in shaping the success of Apple’s current and future products.\n\nAs a critical team member, you will work with various business and engineering teams to understand business initiatives. Our goal is to be persistent and flexible in extracting data from various sources, cleaning and curating this data, and then clearly and concisely summarizing any insights. You will have the opportunity to partner with internal and external teams to drive the planning and execution of products."}, "200458691": {"jobID": "200458691", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Display Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458691/display-quality-engineer?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in Electrical Engineering, Optical Science, Physics."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$138,500", "max": "$208,500,"}, "benefits": null, "requirements": "Industry or academic experience in display technologies such as LCD and OLED.In-depth understanding of Display Modules and Display components, in the area of Optical, Electrical or Physics perspective.Proven ability to drive vendors in Display Quality improvement. Capability to plan DOEs, execute failure analysis, data analysis, and come up with yield/quality improvement path.Excellent written and verbal communication skills.BS/MS/PhD in Electrical Engineering, Optical Science, Physics.-Knowledge of Display panels, Display Modules or Components (Optical, Electrical and Material science, Mechanical and Process engineering)-Periodic international travel required (up to 25%)", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries! It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!\n\nApple is looking for a world-class Display Quality Engineer to lead the engineering and manufacturing activities to launch the next-generation display technologies for the displays in award-winning Apple products. The Display Quality Team is responsible for delivering the technologies with high quality products to enable the world’s best Apple display products. Each individual will serve as a focal point in process & quality improvement of new display panels from the engineering build to the product ramp."}, "200181407": {"jobID": "200181407", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200181407/ar-vr-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Newport Beach", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSCS or comparable degree and/or relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of experience with coding skills in C++/Objective-C/Swift2+ years of experience with Video and Audio playback2+ 3D graphics and realtime rendering, e.g. Metal, experienceBSCS or comparable degree and/or relevant experience-  Understanding decoder architecture: HEVC, AVC, AAC-  Media synchronization knowledge-  Streaming media protocols and formats, e.g. HLS and DASH-  Realtime debugging and profiling-  Ability to work in multi-functional teams", "jobDescription": "Apple's Technology Development Group is currently seeking AR/VR Software Engineer to join our team. \n\nApple revolutionizes how people interact with technology. We take great ideas, apply hard work and total dedication to the customer experience, and produce great products and services that our customers can't live without. Our commitment to excellence and our creativity enable our customers to do amazing things. We build technology that inspires people. What inspires you? Creating something new and finding solutions for complex problems? Delighting millions of people across the planet and working with world-class innovators? All of the above? Then we want to talk to you about this job opportunity. Apple's Technology Development Group works with advanced technologies, including the augmented reality (AR) platform ARKit and Metal 2, to create ground-breaking new products. We are looking for a Software Engineer with expertise in media playback and graphics to work with our team of high-performing and risk-taking innovators to create services that are out of this world."}, "200459859": {"jobID": "200459859", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Silicon Validation Triage Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459859/silicon-validation-triage-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "System-level understanding of CPU/SoC architecture, DRAM/memory, and boards.Experience with Silicon chip bringup, validation and debug.Enjoy hands-on debug and problem-solving.Patient and disciplined problem-solving skills in the face of partial data.Good understanding of typical Silicon debug features and techniques.Clear and concise interpersonal skills.Effective collaboration across teams.Understanding of system software and kernel concepts.Moderate UNIX command line and scripting skills.ADDITIONAL DESIRABLE QUALIFICATIONSKnowledge of SoC and IP design flows.Knowledge and use of lab measurement and analytical equipment.IP block-level knowledge.Knowledge of manufacturing test flows and steps.Knowledge of SOC validation concepts.C, Assembly, UNIX system programming.Kernel and device driver programming and concepts.BS and a minimum of 3 years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work at Apple have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology?   As a member of the Apple SOC Silicon Validation Team, you will use your knowledge of SOC/IP design, debug features and related tools, validation, and problem-solving in order to drive failures to resolution. You will be debugging failures that come from validation, software checkout, or factory screening that appear to be Silicon issues or that require Silicon expertise in order to root cause. You will work at the cross-section of hardware and software and partner with engineers to quickly root cause failures. You will also drive systematic improvements in debug methods, tools and features based on your findings and expertise."}, "200452581": {"jobID": "200452581", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF Compliance Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452581/wireless-rf-compliance-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree with 3 or more years of relevant work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Industry experience in development/characterization of RF/Antenna system for wireless technologies. Experience on commercializing products for Cellular/ WLAN is required.In-depth understanding of at least one Wireless technology including 5G FR1, FR2, GSM, UMTS, CDMA, LTE, 802.11a/b/g/n/ac/ax and Bluetooth.Experience with regulatory/industry conformance specifications for consumer products.Experience in RF layout review radiated sub-system review and system grounding.Experience with one of the tools like MATLAB, HFSS, CST, ADS, etc.Understanding of regulatory features like DFS, Adaptivity, Power Table, etc. is a bonus.Experience with radiated test methodology, equipment, 3m Chamber, etc. would be a plus.Bachelor's Degree with 3 or more years of relevant work experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Apple Compliance Engineering team is looking for a candidate to do system engineering towards ensuring wireless regulatory compliance for different cellular & connectivity technologies!"}, "200448090": {"jobID": "200448090", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Materials Engineer - Textiles", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448090/materials-engineer-textiles?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Master’s degree or PhD in Chemical, Materials, Mechanical, Textile Engineering or related fields."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "In-depth understanding of material structure and property/performance relationshipStrong background in characterizing and specifying materials and performance using design of experimentsExpertise driving material scoping and developmentComfortable working both independently and collaboratively in a fast-paced environmentStrong attention to detail and resolution to solve complex problems3+ years proven experience in yarn and textile constructions preferred.Master’s degree or PhD in Chemical, Materials, Mechanical, Textile Engineering or related fields.", "jobDescription": "Why Apple? \n\nAt Apple we believe our products begin with our people. By hiring a diverse team we drive creative thinking. By giving that team everything they need we drive innovation. By hiring incredible engineers we drive precision. And through our collaborative process we create memorable experiences for our customers. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. \n\nWhy Softgoods? \n\nThe Apple Softgoods Engineering team works with textiles, non-wovens, leather, polyurethanes, silicone and other soft polymers. Our mission is to use these incredible materials to enable new product categories, and to enhance Apple’s existing product lines. Bringing Apple engineering and precision to products made of soft materials is an exciting challenge and requires a creative and open minded approach. We have a talented team of people from a wide variety of backgrounds. We all work together in a customized lab where we design, engineer and develop the best Softgoods products in the world. \n\nWhat is the role? \n\nWe are seeking a motivated engineer to drive material development in the areas of woven and knit textiles. The position requires you to drive strategic next generation materials, engage in hands-on project-based work, and establish key material supplier relationships. We encourage anyone who is passionate about sustainability and the environment, building relationships, developing top technical talent, and approaching problem solving with curiosity and imagination to apply. We value people with a desire to learn new skills and have an approach to challenging questions as opportunities for insight. To that end, we are committed to professional development across all aspects of materials and communication, with mentorship and training opportunities both within and outside Apple."}, "200448371": {"jobID": "200448371", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "GPU Design Engineer – Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448371/gpu-design-engineer-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Experience and knowledge of CPU or GPU architectureKnowledge of logic design fundamentalsKnowledge in one or more areas of cache design, on-chip interconnect network, data compression or shader processorProficiency in Verilog/System Verilog, HDLUnderstanding of high performance, low power designsExperience with scripting languages such as Perl, Python and Ruby is a plusAbility to work well in a team with strong communication skillsMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Do you love working on challenges that no one has solved yet? Join us to help deliver the next groundbreaking product containing an Apple designed GPU. As part of the GPU Memory Hierarchy Design team, you’ll be responsible for crafting and building a GPU that enriches the lives of millions of people every day."}, "200463849": {"jobID": "200463849", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch EE Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463849/iphone-touch-ee-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "•Ph.D. in Electrical Engineering, Material science or equivalent experience.\n•Master’s degree in Electrical Engineering + 3 years of industry experience.\n•Bachelor’s degree in Electrical Engineering + 5 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong electrical engineering background in board-level analog and mixed-signal design.Schematic design and layout experience (SPICE or Cadence experience a plus).Circuit and FEA simulation experience (LCR extraction, signal integrity, electromagnetic coupling, etc.).Hands-on experience with module/system level integration, including architecture scoping, characterization, design down-selection, and validation.Experience with creating engineering design, requirement, and specification documents.Experience with high volume manufacturing of Flexible Printed Circuit Boards or micro fabrication process development is a plus.Experience with statistical analysis of production data (familiarity with JMP is a plus).Proficiency in MATLAB and Python scripting tools.Demonstrated ownership and ability to work with cross-functional teams in a dynamic work environment.Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams.Excellent written and verbal communication skills and solid teamwork.•Ph.D. in Electrical Engineering, Material science or equivalent experience.\n•Master’s degree in Electrical Engineering + 3 years of industry experience.\n•Bachelor’s degree in Electrical Engineering + 5 years of industry experience.", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including Electrical Engineering, Manufacturing process, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200461292": {"jobID": "200461292", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Senior AR/VR Graphics Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461292/senior-ar-vr-graphics-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "You have 5+ years delivering commercial quality, broadly released consumer or enterprise softwareExcellent programming skills and deep knowledge of C++, and Objective C or SwiftExtensive experience with at least one of the graphics APIs (Metal, OpenGL, Direct3D, Console, etc.)Experience with Shader Languages (HLSL/GLSL, Metal Shaders) and writing performant, power-efficient shaders3D math skills (linear algebra, vector calculus)Deep Understanding of entire graphics pipeline, from CPU instructions to emitted photonsAbility to collaborate with a content creation team to develop efficient, scalable 3D assets and effectsProficiency with new and existing rendering techniques to create efficient and stunning industry defining visualsBS / MS / PhD in Computer Science or equivalent experienceExtensive experience with application performance profiling, optimization and automated testingShipped performant AR or VR applicationsCommunicates and collaborates well across team boundariesEffectively mentors junior developers and spreads knowledge", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer who wants to meaningly impact the lives of our users through first party applications. Apple’s Technology Development Group (TDG) is building AR applications using some of Apple's most advanced technologies including the augmented reality (AR) and virtual reality (VR) support offered in ARKit and Metal. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day!"}, "200446199": {"jobID": "200446199", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "Cloud Security Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446199/cloud-security-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science or equivalent with emphasis in security related fields"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of work experience in infrastructure engineering or security engineering experience.3+ years of work experience in distributed cloud computing. Kubernetes developing experience is a huge plus.Advanced programming language proficiency in Go (or comparable object-oriented language) with experience designing and developing efficient, secured, scalable, and reliable production systems.Keeps up with industry trends in security technologyExperience working on high volume servicesA critical eye for correct codeProficiency in testing your softwareFluency navigating Linux production environmentsKnowledge of development and integration (e.g. CI/CD) (optional)Understanding of OIDC/OAuth2, JWT (optional)Ability to parse user requirements and develop production-quality solutions.Love open source and collaboration, including direct participation in the Kubernetes and other cloud native communities!BS or MS in Computer Science or equivalent with emphasis in security related fields", "jobDescription": "The Apple Cloud Services (ACS) Compute team is building the next generation cloud compute services empowering Apple’s software developers to build the products our customers love. We're a fast-moving, highly-skilled team designing, developing and supporting the orchestrated, container-based compute platform that Apple’s server-side developers use to build, test and deploy their products. Our web-scale implementation hosts Apple’s core cloud services and has to stay highly available, secure, and \"just work”. That's a tall order, and we're looking to add more talented, passionate engineers who enjoy solving distributed systems challenges and build solutions to a variety of outstanding security challenges, and build the identity and authorization infrastructure. If you're curious, collaborative, and want to join us, we'd love to hear from you."}, "200467262": {"jobID": "200467262", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Haptics Hardware Engineer - EE", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467262/haptics-hardware-engineer-ee?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.Sc or PhD degree in Electrical Engineering, Mechatronics, Applied Physics or equivalent\nRelevant industry experience is a plus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong EE, circuit, signal processing and electromagnetism backgroundGood understanding of sensors and associated signal chainFundamental knowledge and experience in physics, mechanical engineeringKnowledge of statistics fundamentalsProficiency in MATLAB, SPICE, Simulink, or similar simulation and modeling toolsFamiliarity with modeling electro-mechanical systemsYou should be team oriented and be able to thrive in collaborative multi-functional environment as well \u2028as have excellent written and verbal communication skillsM.Sc or PhD degree in Electrical Engineering, Mechatronics, Applied Physics or equivalent\nRelevant industry experience is a plus", "jobDescription": "The Haptic Engineering team develops state of the art Haptic solutions and technologies that are central to Apple’s products, including the iPhone and Apple Watch. The key goal is to enable the world’s best user-experience. New challenges arise every single day that require the sharp analytical skills of talented and smart individuals. The team features a highly multi-functional and hands-on environment that cultivates engineering perfection, creativity, and innovation. \n\nWe are looking for a Hardware Design Engineer to own the design, development, and validation of next-generation Haptic Technologies. You will be working with different actuation and sensing technology from the concept phase to mass production. Also, you will be responsible to integrate these technologies in complex consumer electronics system."}, "200455330": {"jobID": "200455330", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455330/soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to tackle diverse challengesMinimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200456571": {"jobID": "200456571", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "System Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456571/system-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS, CS, EE, CE, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "3+ years experience with HDMI protocol compliance testingFamiliarity with quantum data or equivalent video analyzersExperience multitasking in a fast-paced cross-functional environmentAbility to think creatively, problem-solve, and innovate- BS, CS, EE, CE, or equivalent experienceNice to have:-  Automation script development using Python-  DisplayPort and USB Protocol Compliance validation experience-  Able to communicate technical concepts to a non-technical audience", "jobDescription": "Are you passionate about being at the forefront of new, key technologies in consumer products? \n\nWe are the Product Systems Quality team, and we perform compliance testing to ensure wide compatibility of our products and peripherals. We are seeking an inquisitive and motivated Systems Test Engineer with excellent data analysis and problem-solving capabilities. You will contribute to the high-quality of Apple's world-changing products from early prototypes to final designs. Our team works across product lines and you'll work on Mac, Apple TV and accessories! \n\nCome join our team!"}, "200356998": {"jobID": "200356998", "origin_search": null, "posted": "Nov 29, 2022", "jobTitle": "Media Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200356998/media-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE (MS preferred)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Programming skills preferably with C and Objective-CProficiency with Cocoa technologiesAn ability to work well with tight schedules and rapid development cyclesExperience shipping high-quality, GUI-based applications or frameworksBS or MS in CS/CE (MS preferred)NICE TO HAVE BUT NOT REQUIRED:Experience with using and developing media librariesFamiliarity with inner workings of media systems and audio/video codecsExperience debugging problems in a highly concurrent environment", "jobDescription": "The Interactive Media Group (IMG) provides the media and graphics foundation across all of Apple's innovative products, including iPhone, HomePod, Apple TV, Apple Watch, iPad, Macs as well as professional and consumer applications from Final Cut to Music, TV and iWork. IMG takes the media experience to the next level on the iOS, tvOS, watchOS and macOS platforms with technologies such as AVFoundation, CoreMedia, CoreAudio, CoreAnimation and Metal. \n\nWe are looking for an experienced software engineer to join our team! The applications developed by our team are used by millions of customers across all Apple platforms! We are passionate about delivering the best possible media playback experiences for the benefit of applications throughout the Apple ecosystem."}, "200451197": {"jobID": "200451197", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "SoC Power Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451197/soc-power-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "We are looking for applicants with phenomenal programming skills and understanding of low-power digital design and power fundamentals, including:Expertise on C/Assembly programming and associated tool chains.Use of basic lab equipment such as multi-meter units, oscilloscopes, etc.Calculations for dynamic and static power in CMOS.Strong communication skills and ability to work as a team.BS and a minimum of 3 years relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "As part of our Silicon Engineering group, you will take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you will help design products that bring to our customers experiences they’ve never before envisioned!\n\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Validation Engineers. \n\nThe SoC hardware development team is looking for a motivated engineer to fill a full-time position. The primary role is to engage in power hardware validation and analysis of typical SoC workloads. The analysis of the workloads and their power dissipation will help drive the power optimization efforts to achieve best-in-class power/performance."}, "200446693": {"jobID": "200446693", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Layout Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446693/layout-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "• B.S. EE and 3+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in analog/mixed-signal layout design of deep submicron CMOS circuits and recent experience on advance nodes including FinFET technologiesHigh level of proficiency in interpretation of CALIBRE DRC, ERC, LVS, reportsExperience with CADENCE or MENTOR GRAPHICS layout toolsProgramming knowledge in SKILL, Perl, and/or Python is a bonus• B.S. EE and 3+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Silicon Engineering is seeking creative Layout Design Engineers to design the next generation of Apple’s world-leading systems-on-chip (SOCs). Apple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad. Our Analog/Mixed-Signal (AMS) circuits connect them to the physical world! Examples of our AMS IPs include SERDES for data communication, PLLs for clock generation, and sensors for measuring all sorts of physical quantities.\n\nAnalog Layout is a crucial component of the hardware design process. Analog Layout Engineers work alongside circuit designers to transform design ideas into silicon. Apple’s world-leading SOCs are crafted using robust tool-suites, the most advanced nodes, and modern layout methodologies.\n\nThis job may be right for you if:\n\nYou want to accelerate your career. Thrive in a fast-paced, multifaceted, and results oriented environment. Are passionate about working with the world’s most advanced technology. Enjoy collaborating with a very talented and experienced team. Have a good understanding of engineering fundamentals. Actively seek out opportunities to work with cross-functional teams (SOC, Tech, CAD). Drive critical floor-planning decisions. Lead a team of people to produce complex AMS blocks with high-quality layout. Are always looking for ways to introduce new ideas and workflows that improve efficiency across a global team of layout engineers. Want opportunities to challenge yourself and broaden your skillset. Want to work every single day to craft products that enrich people’s lives."}, "200456933": {"jobID": "200456933", "origin_search": null, "posted": "Feb 18, 2023", "jobTitle": "Embedded Tools Engineer- Airpods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456933/embedded-tools-engineer-airpods?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Engineering, Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "3+ years of relevant industry experienceAble to coordinate the efforts of multiple teamsExcellent written and verbal communication skillsProficient with at least one general purpose programming/scripting language including but not limited to Python, Ruby or BashFamiliar with one or more CI/CD tools — TeamCity/Jenkins/CircleCI/GitLabExperience with languages, tools, and frameworks for embedded systems and embedded systems (Make, git, gcc or clang tool chain, cunit, google test, clang static analysis, cppcheck, gcov, etc.)Familiarity with Splunk is a plusBS/MS in Computer Engineering, Electrical Engineering", "jobDescription": "The Audio Products Firmware team is looking for an energetic engineer to join our team. This is an individual contributor role to develop the testing pipelines and tooling required to build Apple products. You will have the opportunity to have a major impact on the development for Apple's consumer audio products.  In this role, you will work with a wide cross-functional team to continually improve the efficiency of the firmware and software in Apple products."}, "200405739": {"jobID": "200405739", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Engineering Program Manager - SWE Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200405739/engineering-program-manager-swe-systems?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE/CS/CE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Self-motivated and hardworking with proven creative and critical thinking capabilitiesYou are able to understand priorities and clarify directionYou exhibit a deeply curious mindset about new ideasAbility to filter and distill meaningful information for the right audienceExperience project managing complex, multi-functional projectsExcellent attention to detailExcellent spoken and written communicationExperience developing and releasing a consumer productAbility to build and execute plans in ambiguous settings ; remains flexible and calm when facing uncertaintyExperience demonstrating strong presentation skillsStrong engineering / technical backgroundBS/MS EE/CS/CE or equivalent", "jobDescription": "Why Apple? At Apple, we create amazing, innovative devices by working across Software, Hardware, and Design to build the best experiences possible. At the heart of that intersection between Technology and Liberal Arts, are the Systems Engineering Project Managers who help plan, prioritize, refine, and bring these experiences to life on new products. From exciting new technologies, to the software that powers them, System EPMs are responsible for shepherding a project from start to finish. If this sounds exciting, then let’s talk!\n\nThe Software Engineering Program Office is looking for an extraordinary Systems Engineering Project Manager with a genuine passion for running programs. SWE System EPMs work alongside engineering and program partners in Hardware, organize and lead Software teams through developing new products from concept to launch. We ensure teams and management are kept well-informed and guide cross-functional engineering teams to meet design and schedule goals. As a Systems EPM you will get a front row seat to what it takes to ship the best consumer products in the world. You will get to work with passionate, smart, and innovative people on get an opportunity to be highly impactful in this unique role."}, "200464393": {"jobID": "200464393", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Human Factors Design Engineer/ Data Science", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464393/human-factors-design-engineer-data-science?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Masters degree in an analytical field such as (but not limited to) Computer Science,  Engineering, Statistics, Applied Math, Physics, Biological Sciences, Robotics, Climate or Environmental Science,  along with 2+ years relevant work experience. Ph.D. degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Candidates must be able to work independently and excel in a dynamic, hands-on, cross-functional and creative corporate environment. Ideal candidates will possess an energetic personality with excellent communication and interpersonal skills, attention to detail, patience, and aesthetic sensibility.This position requires strong programming skills in Python with experience working with multivariate datasets to import, clean, analyze and visualize data to enable data-driven decisions. Knowledge of population studies, dimensionality reduction, and and big data analysis is desired. Datasets include human anthropometric and biometric data as well as user study research data.Ideal candidates have experience analyzing and visualizing data sets in prediction and probabilistic models (e.g., Bayesian network models, Markov random field models). Candidates are enthusiastic about delving deeper into 3D data analysis and visualization. Most importantly, a great passion for creating informative visualizations and presentations to communicate results to all levels of the company.Masters degree in an analytical field such as (but not limited to) Computer Science,  Engineering, Statistics, Applied Math, Physics, Biological Sciences, Robotics, Climate or Environmental Science,  along with 2+ years relevant work experience. Ph.D. degree preferred.", "jobDescription": "Apple is currently seeking an enthusiastic team player to join a dynamic and collaborative group as a data scientist on a human factors design team. You’ll have the unique opportunity to contribute to the development and continuing improvement of Apple hardware products by distilling data into actionable and intuitive visualizations from human interaction perspective. As an Austin-based team member, you will collaborate closely with Cupertino-based cross-functional team members."}, "200450182": {"jobID": "200450182", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "3rd Party App Compatibility, Tester", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450182/3rd-party-app-compatibility-tester?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science, Computer Engineering, Software Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$190,000,"}, "benefits": null, "requirements": "4+ years of validated experience working in Software Quality Assurance on Apple OS platformsAbility to identify and investigate difficult problems and independently work towards resultsCreative thinker and strong problem solver with meticulous attention to detailAbility to work in a fast-paced and dynamic environmentUnderstanding of and experience with the SDLC and QA’s role in itExperience with macOS or Linux command lineHighly organized, creative, motivated, and passionate about achieving resultsExcellent written and verbal communication skills are needed to facilitate close interaction with development teams, management, and other organizations within AppleBS in Computer Science, Computer Engineering, Software Engineering or equivalent experienceKnowledge of one or more Scripting or Programming Languages including Swift, Objective C, Python, etc. is a plus", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nApple’s 3rd Party App Compatibility team is looking for a curious, tenacious individual with strong communication skills and attention to detail. The primary responsibility of this role is identifying bugs within third-party apps on future iOS, macOS, tvOS, iPadOS, and watchOS releases, ensuring a high-quality customer experience when Apple ships software updates and new devices."}, "200421452": {"jobID": "200421452", "origin_search": null, "posted": "Sep 6, 2022", "jobTitle": "Frontend/ UI Engineer - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200421452/frontend-ui-engineer-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA in Computer Science/Engineering or equivalent is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of experience in a professional software development positionProficient in JavaScript, Typescript, HTML, CSSExperience crafting complex applications using React or a comparable JS framework (e.g.: Angular, Vue, Backbone, Ember)Experience creating phenomenal web UIExperience with *nix and macOSFamiliarity with version control systems such as GitBS/BA in Computer Science/Engineering or equivalent is preferred.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple's long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a substantial scale, meeting Apple's high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple's outstanding integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep dedication to strengthening Apple's privacy policy, one of Apple's core values. Although services are a bigger part of Apple's business than ever before, these teams remain small, flexible, and cross-functional, offering greater exposure to the array of opportunities here. The We are looking for an outstanding software engineer to join the Apple Universal Media team and help us build the next generation products that change the way millions of users consume video. As a Software Engineer at Apple, you will be owning key modules of the product and be responsible for delivering industry grade quality solutions. Ready to make a difference?"}, "200433040": {"jobID": "200433040", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Product Design Engineering Manager - Retail and Events Product Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200433040/product-design-engineering-manager-retail-and-events-product-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. degree in mechanical engineering is required, M.S. beneficial\n5+ years proven experience in mechanical design\n2+ years leading programs and mentoring others"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$260,000,"}, "benefits": null, "requirements": "Experience working in a collaborative environment and self-motivation to identify and drive resolution on design issues across multiple projectsExperience leading complex electromechanical programs with multiple supporting modulesHighly effective communication skills: ability to clearly explain complex issues to a variety of audiences, think about the big picture when communicating, and report technical details succinctlyStrong analytical skills with regard to engineering theoryAbility to articulate design issues in quantitative terms both verbally and with documentationPassion for functional design and an appreciation for detailInternational travel requiredComputer industry experience not required. Serious consideration will be given to qualified candidates from other analytical fields with robust engineering fundamentals.B.S. degree in mechanical engineering is required, M.S. beneficial\n5+ years proven experience in mechanical design\n2+ years leading programs and mentoring others", "jobDescription": "Apple is seeking an enthusiastic leader to direct and grow the the capabilities of the Retail and Events Product Design (REPD) team. We are a diverse group of engineers who design integrated hardware solutions for retail spaces and special Apple events like new product announcements, developer conferences, and store openings. These solutions are engineered to elevate and showcase Apple products in magical and transformative ways.\n\nIdeally, you are someone who approaches problem solving with creativity and curiosity! Your team’s scope of ownership will span technology development and concept generation to detailed design, analysis, and testing through mass production of complex assemblies. We operate under much ambiguity, so you should be skilled in and excited by the challenge of bringing clarity to your team and peers.  We value leaders who can provide both deep technical insight along with a passion and commitment to developing the skills and capabilities of the team.  We are seeking excellent communicators who are able to fluently debate and strategize with cross functional partners, present to executive leadership, and motivate growth within your team.  \n\nYou and your team will have a uniquely rewarding opportunity to drive product definition of new generations of retail displays and merchandisers while collaborating with teams from Industrial Design and Visual Merchandising, to Manufacturing and Operations.  Through it all, you will be given ownership of designs that will surprise and delight customers during what is often their first interactions with a new Apple product."}, "200322787": {"jobID": "200322787", "origin_search": null, "posted": "Nov 2, 2022", "jobTitle": "Display Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200322787/display-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BACHELORS OR MASTERS DEGREE IN ELECTRICAL ENGINEERING OR EQUIVALENT"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years significant proven experience crafting consumer electronics and/or embedded systemsMust have strong EE fundamentals (analog/digital design, signal/power integrity, etc.)Should demonstrate strong verbal and written communicationsExperience in a lab environment prototyping circuits, design bring-up,plus hands-on with oscilloscopes, spectrum analyzers, DAQ, etShould have experience leading high volume products from concept to mass productionExperience with leading PCB technology and electrical design and characterization of the following areas: Differential serial links (e.g.LPDP, MIPI) and I2C/SPI/UART buses.Experience in one or more of: MCU/CPLD, power (DC-DC converters, power management, low power design), analog circuits,display technology, and system integration.Expertise in board CAD tools including Cadence Concept & AllegroExperience in modeling power consumption for various usageExperience in predicting hardware performance by simulationExperience in capacitive multi-touch preferredExperience in micro-LED or OLED display is a plusBACHELORS OR MASTERS DEGREE IN ELECTRICAL ENGINEERING OR EQUIVALENTApple is an Equal Opportunity Employer that is committed to inclusion & diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Are you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly and we are hiring all levels from junior to senior engineers to join our display engineer team."}, "200457248": {"jobID": "200457248", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Camera & Depth Sensing Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457248/camera-depth-sensing-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Relevant industry experience designing Camera hardware or related optical systems OR Project Management relevant experience in a similar field.Camera/depth sensing module design and development experience.In-depth technical engineering knowledge to effectively establish and manage project and operational KPIs, assess and drive technical risks, and critically challenge engineering decisions.Proven ability to effectively manage multiple global contract manufacturers and vendorsAbility to bring focus and transparency to complex situations while monitoring the bigger picture and the needs of a rapid development cycle.Skilled at handling accountability without control, knowing how to identify and drive priorities from among the multiple issues competing for your attention.Excellent communication and conflict resolution skillsKnowledge of camera module design and/or camera key parts design and subcomponentsFamiliarity with a consumer product life cycle.BS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products! \n\n The Camera & Depth Sensing Team is looking for a Hardware Engineering Program Manager (EPM) to drive the design, development, and integration of camera and depth sensing modules. In this highly cross-functional role, the candidate has the opportunity to craft the next generation of cameras and depth sensing modules for Apple's entire product line. The candidate is required to navigate through uncertainties, be adapt to rapid changing scenarios, and lead complex decisions with the final goal to deliver the best technology into the hands of millions of people!"}, "200450519": {"jobID": "200450519", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CPU Implementation Analysis Infrastructure Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450519/cpu-implementation-analysis-infrastructure-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceFamiliarity with physical design flow (synthesis and PnR) with good understanding on high performance and low power design conceptsProficiency in industry-standard APR, STA, and Power analysis toolsFamiliarity with any of the following: HTML, Javascript, PHP, SQL, past experience in building web-based softwareCompetency in logic design (RTL) and electrical fundamentalsExcellent communication and interpersonal skillsMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role as a part of the industry-recognized and innovative CPU design team, you will work closely with design team on developing infrastructure to enable and standardize analysis of state of the art CPU physical design and implementation. In this role, you will have the opportunity to interface and interact across most disciplines in CPU design and also influence other teams in the Silicon Engineering Group (SEG) at Apple."}, "200461197": {"jobID": "200461197", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Senior Software Engineer (Media Processing), Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461197/senior-software-engineer-media-processing-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "- BS or MS in Computer Science or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Mastery of software design principles in conjunction using Java and/or JVM based languages.Experience with video / audio codecs and media containers a plus.Experience with live video processing and video streaming broadcast protocols like SRT, RIST, and RTMP would be beneficial.Working knowledge of the HLS protocol.Strong understanding of highly available fault tolerant distributed systems.Prior experience building and working with Docker and other containerization technologies.Experience deploying software on elastic platforms such as Kubernetes, EC2, etc.Deep understanding of both SQL and NoSQL databases like Cassandra and MongoDB.Ability to work in a fast-paced dynamic environment.Enjoys fixing/improving things and finding solutions to difficult problems.Strong belief in automation and tooling as a critical part of the software lifecycle.Strong written and oral communication skills.Possess strong and clear communication abilities- BS or MS in Computer Science or equivalent work experience.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with dedication to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. \n\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, forward-thinking, and multi-functional, offering greater exposure to the array of opportunities here."}, "200455273": {"jobID": "200455273", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455273/soc-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  Good SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal and communication skills and the dream to take on diverse challengesMinimum of BS + 10 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200445708": {"jobID": "200445708", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Quality Engineer - Home", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445708/quality-engineer-home?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer or Electrical Engineering, Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expertise in driving 99.9% end-to-end product reliability based on insights driven by field data analysisInnate ability to translate above insights into Real-world lab test scenariosIn-depth knowledge of tools and techniques for analyzing and benchmarking of operating systems, application/algorithm performanceDesign and develop innovative ideas that tackle automation and execution problemsDeep understanding of Operating System and Wireless conceptsExpertise in data analysis/visualization tools like Splunk and TableauThrive in a product-focused environment and comfortable working with multi-functional teamsReal passion for product quality and attention to detailProficient in writing tools and automations in PythonProven track record to provide technical advice, leadership, and direction to project teamExcellent written and verbal interpersonal skills, including collaborating with external partnersBachelor's degree in Computer or Electrical Engineering, Computer Science or equivalent experience.", "jobDescription": "The Home Team provides the foundation that enables an entire ecosystem of secure and intelligent home connectivity. We are developing technologies and building experiences that revolutionize the way people harmonize with their Homes. The team is seeking a high motivated Quality Engineer who is passionate about analyzing and optimizing iOS apps and frameworks. You will be leading reliability and performance investigations based on field and internal testing to pinpoint areas of improvement, working cross functionally to implement changes, and crafting benchmarks and tools to help streamline the process."}, "200463583": {"jobID": "200463583", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Software Engineer: Validation of Crypto and Security IPs", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463583/software-engineer-validation-of-crypto-and-security-ips?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 3 years relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong Interest in low level and embedded software developmentStrong Interest in test automation, experience with Python.Knowledge and skill in C/C++ programmingStrong debugging skills for SoC and system level issues.Good understanding of RISC based computer architecture, memory management unit, coherent cacheKnowledge and skill in C/C++ programming, Experience with ARM assembly is a plus.At least 3 years experience with secure boot, trusted execution environment, data encryption.Bachelor's degree and a minimum of 3 years relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nWe have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles! You will develop software to validate and debug crypto and security blocks in Apple SoCs."}, "200458929": {"jobID": "200458929", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Apple Silicon GPU Driver Engineer - Performance", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458929/apple-silicon-gpu-driver-engineer-performance?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSc, MSc, or equivalent experience in Computer Science, Computer Engineering, or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent programming skills and knowledge of C/C++Experience or interest in working on all levels of the software stack, including the application layer, system frameworks, and operating systemExperience or curiosity about deep diving into system level performance issues, and developing tools and techniques to help guide optimizationsBSc, MSc, or equivalent experience in Computer Science, Computer Engineering, or related fieldExperience or curiosity about developing device drivers for high performance hardware a plusExperience or interest with graphics or compute APIs a plus", "jobDescription": "We are looking for an engineer to join the Apple Silicon GPU Driver Performance Team, which is responsible for developing technology which helps make Apple Silicon GPUs blazingly fast. \nThe ideal candidate will have a passion for squeezing the best possible performance out of the GPU, developing our driver software stack responsible for deep GPU performance introspection, and enjoys interacting with the low level details of the GPU architecture."}, "200394333": {"jobID": "200394333", "origin_search": null, "posted": "Jul 19, 2022", "jobTitle": "Wireless Software QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200394333/wireless-software-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "2+ years of experience in 802.11 protocols2+ years of experience in SQA methodologies and practicesExperience in developing test strategies and executing it with automation or manual testingExperience with scripting and automation - python preferredExperience with developing automation tools and framework is an advantageOpen to entry level engineers with wireless background and scripting experience or with internship experience in WiFi QABachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experienceProven ability to own complete functional area of an application or productFamiliarity with SQA methodologies", "jobDescription": "Join the Sensing and Connectivity team in driving the innovation and delivering seamless wireless connectivity and the best user experience to our customers. Our team works on an Apple eco-system of devices that delivers the best wireless connectivity experience.\nIf you are motivated, highly technical and passionate about WiFi and Networking technologies, possess excellent problem solving and coding skills, this team can be your destination."}, "200449020": {"jobID": "200449020", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Graphics Verification Engineer - Shader Core", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449020/graphics-verification-engineer-shader-core?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong background or coursework in computer architecture and memory systemsStrong background or coursework in one or more object-oriented languages such as C++Experience with HDL simulators and waveform viewersExperience working under strict schedule deadlines with the ability to prioritizeExcellent communication skills and ability to collaborateExperience with Python, Ruby, Perl or similar scripting languages is a plusMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices. \n\nThe Graphics Verification Team is looking for talented engineers to help build complex, large-scale GPU products. In this role you will partner with our graphics architecture, µ-architecture, design, software and hardware performance teams to help define and deliver cutting-edge features for our Unified Shader Core (USC)."}, "200455268": {"jobID": "200455268", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455268/soc-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to tackle diverse challengesMinimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200455325": {"jobID": "200455325", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455325/soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to tackle diverse challengesMinimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200456748": {"jobID": "200456748", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "AR/VR Camera Driver Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456748/ar-vr-camera-driver-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science or Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "4+ years related low level software development experience on Mac OS X, Windows, Linux or Embedded systemExcellent programming skills and knowledge of C/C++Excellent debugging and problem solving skillsAR/VR industrial/academic experiences is a bonusExperience in hardware/software co-simulation, and pre-silicon validation is a plusKnowledge of modern digital camera technologies, image sensors, and ISP pipelines is a plusStrong written and oral interpersonal skillsBS or MS in Computer Science or Electrical Engineering", "jobDescription": "Apple’s camera system receives rave reviews and is consistently considered the best smartphone camera out there. Imagine the impact you can make! A billion users will use the technologies you helped craft almost daily. Apple's Camera Drivers team is looking for an outstanding engineer to drive brand new next generation technologies for revolutionary Apple products. Are you passionate about working in a close knit team that collaborates multi-functionally with a liberating amount of autonomy? Apart from being an opportunity to do your life’s best work at Apple, this role will also enrich your work life experience by providing opportunities to develop strong communication and collaboration skills."}, "200311866": {"jobID": "200311866", "origin_search": null, "posted": "Feb 1, 2022", "jobTitle": "Senior Engineering Manager - Experimentation, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200311866/senior-engineering-manager-experimentation-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced Degree in Computer Science, Statistics, Applied Math or related field.\n\n10+ years of industry experience building scalable micro services and data driven platforms.\n\n5+ years of experience in engineering management.\n\n2+ years of experience with Experimentation & Multivariate Testing."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$299,000,"}, "benefits": null, "requirements": "Expertise in building Multivariate Experimentation platforms.Proven success in leading and building high-caliber, data focused teams with diverse technical strengths.Skilled at operating in a multi-functional organization.Ability to condense complex concepts and analysis into clear and concise takeaways that drive action.Curious business attitude with a proven ability to seek projects with a sense of ownership.Excellent communication, social and presentation skills.Extensive background in statistical methods and data mining.Experience working with structured and unstructured data stored in distributed files systems such as HDFS and S3.Knowledge in distributed processing frameworks such as Spark.Desire to work in a fast-paced and challenging work environment.Prior experience in advertising industry is a plus.Advanced Degree in Computer Science, Statistics, Applied Math or related field.\n\n10+ years of industry experience building scalable micro services and data driven platforms.\n\n5+ years of experience in engineering management.\n\n2+ years of experience with Experimentation & Multivariate Testing.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. \n\nAds ML Experimentation team is seeking an experienced Engineering Manager who will help drive innovation and improve our product decision making process through the intersection of data and experimentation. You are a driven and versatile leader who can excel in an Agile environment. You will work closely with data scientists, leading a team of engineers to design, develop, and implement solutions. You shall partner with stakeholders to develop new experimentation methodologies & statistical techniques to optimize customer experiences across Apple Ad Platform’s use-cases. While understanding our product features, you will perform meticulous analysis, measure performance and make data-driven decisions."}, "200439742": {"jobID": "200439742", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Data Platform Architect - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439742/data-platform-architect-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "8+ years of experience designing, implementing, and delivering complex, scalable and resilient platforms and servicesExperience with large scale data processing using distributed systems including hands on experience with Spark/Kafka/KubernetesPossesses a deep understanding modern data architectures, stays on top of new developments, and are aware of what other leading players are doingSignificant experience designing for cloud based environments including Amazon Web Services, Microsoft Azure, Google Cloud Platform, or similarDeep expertise with a variety of data formats including Parquet, Avro, Iceberg, ORC and a keen understanding of schema management and evolution techniquesExperience using NoSQL data-stores (e.g Cassandra, Elastic Search/Solr), OLTP, OLAP (Snowflakes, Vertica or similar)Background in computer science, mathematics, or similar quantitative field with a minimum of 8 years professional experienceMost importantly, a sense of humor and an eagerness to learn", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives! Our Ad Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in the App Store and Apple News! Our advertising platforms are highly performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy.\n\nThe Ad Platforms Engineering team is seeking an architect to help design and build highly scalable data platforms and services. This architect will definine and deliver technical solutions for the Ad Platforms Data Platform. You will serve as an ambassador to various internal groups to evaluate use cases, standardize integration patterns, and ensure that platform components are correctly used. You will be customer driven but platform conscious. In this role you will create solution that deliver on Apple's privacy commitments to our customers while enabling our teams to change the way advertising works with data. \n\nA successful candidate will have previous experience designing and architecting cloud based data processing and transformation systems. They will have experience with AWS, Azure, GCP, or similar and possess a deep understanding of data storage and processing technologies such as Spark, Kafka, EMR, Hadoop, Snowflake, Redshift, and similar."}, "200372317": {"jobID": "200372317", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AR/VR Video Processing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200372317/ar-vr-video-processing-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS CS/EE or equivalent, higher degree is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years experience with software developmentSuccess shipping media products involving image and video processing, video capture/playback, or media processing pipelineExperience with developing media SDKs, frameworks and customer facing APIsExcellent programming skills and proficient with one of C/C++, Objective-C, Swift, Objective-C experience is helpfulExcellent communication and collaboration skillsStrong problem solving and analytical thinking skillsA strong focus on end user experienceBS CS/EE or equivalent, higher degree is preferredExperience with hardware assisted acceleration, performance analysis and optimization is helpfulExperience with file formats (mov, mp4) and codecs (H.264/AVC, HEVC) is a plusVideo streaming (MPEG Dash/HLS) is a plusExperience with 3D rendering, 3D Graphics APIs or GPU compute is a plus", "jobDescription": "We are a team of media processing experts and specialists who are looking for a motivated individual to join our team and develop next generation media processing pipeline and framework for new products! You will be using your expertise in the video processing domain to solve complex problems in a new and exciting domain. You will work closely with software, hardware, algorithms and UX teams to create ground breaking technologies and systems. You will architect and develop high quality software to power extremely low latency applications and experiences - performance optimization and efficient utilization of hardware resources are critically important. Do you have hands-on experience creating high performance audio, video, image processing and graphics software? You have a great opportunity to learn and grow, while working with some of the most creative people in the industry. Grit, ability to persevere and adapt quickly are key attributes."}, "200419741": {"jobID": "200419741", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Core Darwin Debug Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200419741/core-darwin-debug-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "GDB and other debug toolsExcellent knowledge of python. Prior experience in developing large automation tools using python is preferred.Previous experience of Kernel and/or firmware engineeringHighly professional, with ability to multitask and deliver solid work on tight schedulesKnowledge of debugging UNIX kernelsDeep and current understanding of the C programming languageGood understanding of operating system fundamentals like threading, synchronization primitives, inter-process communication, and process lifecycleBS in Computer Science or equivalent experience/skills", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Embedded Kernel & Triage team is looking for an experienced triage and development engineer to support the larger engineering organization. The position will include debugging critical software and hardware issues across the entire software stack. You will have the opportunity to have a major impact on the quality of software for Apple's consumer operating systems products."}, "200452888": {"jobID": "200452888", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452888/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong software skills in C/C++.Minimum requirement of 3 years relevant experienceFamiliarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is requiredExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is requiredExperience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 3 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200452886": {"jobID": "200452886", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452886/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong software skills in C/C++.Minimum requirement of 3 years relevant experienceFamiliarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is requiredExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is requiredExperience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 3 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200448938": {"jobID": "200448938", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware RF Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448938/cellular-4g-5g-firmware-rf-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceStrong RF background and familiarity with RF systems fundamentals as well as hands-on experience with RF test equipment (network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.)Validated understanding on RF, PLL, and general wireless systems measurements (i.e. ACLR, ACPR, EVM, phase noise, lock time, etc.)Experience in cellular RF system development / RF SW verificationAbility to work multi-functionally with different teams to define & implement RF verification test plan that will help achieve the outstanding modem targetsKnowledge of RF transceiver and RF front end components controlling for 4G/5G radio as well as understanding of RF calibrations for compensating RF impairmentsShown track-record of innovation and hands-on experience in RF measurement setup and test methodologyStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong proven understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms will be an added plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "As part of an outstanding modem team, you’ll craft powerful embedded firmware that deliver more performance in our products than ever before! You’ll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, we'll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world! Do you want to have an impact on every single Apple product? As a Cellular 5G/4G Firmware RF Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on requirements."}, "200460791": {"jobID": "200460791", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "AIML - Sr Engineering Program Manager, Siri in the Car and Hearables", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460791/aiml-sr-engineering-program-manager-siri-in-the-car-and-hearables?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors or Master’s degree in Computer Science or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "8+ years of experience in project or program management shipping experiences and featuresExcellent project management skills including project structuring and managing multiple work streams interdependentlyThorough understanding of testing, build and release processes for sophisticated softwareAbility to define and prioritize long-term feature roadmap, create feature specificationsDemonstrated skill of negotiating and distilling sophisticated technical requirements from multiple partners into a coherent long term platform roadmapSolid knowledge of technical system architecture and systems design tradeoffsDemonstrated data-driven decision-making skills, including experience leading data driven projects or programs.Outstanding group facilitation, interviewing and influence skillsAbility to communicate abstract ideas clearly and independently manage complex project objectivesStrong verbal and written communication skills, including negotiation, presentation and influenceAbility to independently draft and present deliverables, recommendations and communication strategiesBachelors or Master’s degree in Computer Science or related field", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? Are you passionate about empowering many ground-breaking intelligent experiences to be made? The Siri Assistant team is building groundbreaking technology... and we are looking for people like you!   We’re looking for a strong Engineering Program Manager who will lead how Siri works in the Car and on AirPods. The individual has demonstrated a consistent record of building and maintaining sophisticated software platforms, tools and processes that deliver new end-to-end experiences that delight customers."}, "200442550": {"jobID": "200442550", "origin_search": null, "posted": "Nov 8, 2022", "jobTitle": "HID-Haptics Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442550/hid-haptics-firmware-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "• B.S. in CS/CE/ECE or equivalent experience. M.S. with advanced courses in Embedded Systems, Controls, and/or Signal Processing preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expertise in C or C++ for embedded systemsExperience interfacing microcontrollers with sensors and actuators (e.g. LRA, VCA, Piezo)Knowledge of embedded peripherals / protocols (e.g. DMA, USB, UART, SPI, I2C)Ability to apply software best-practices to firmware design in bare-metal or RTOS environmentsBoard bring-up and debug skills with JTAG, mixed-signal oscilloscopes, and/or logic analyzersWorking knowledge of closed-loop control systems and experience implementing low-levelControl algorithms in embedded environments preferredDevelopment of production DSP or FPGA firmware for haptic or audio applications preferredIndependent work ethic with strong attention to detailExcellent communication and teamwork skills• B.S. in CS/CE/ECE or equivalent experience. M.S. with advanced courses in Embedded Systems, Controls, and/or Signal Processing preferred", "jobDescription": "We are looking for a creative, motivated, and passionate embedded software engineer to develop Taptic Engine firmware for next-generation Apple products, including iPhone,  Watch, and Mac. Come join a tightly-integrated team of hardworking engineers to deliver world-class haptic experiences that will be enjoyed by millions of customers. In this role you will collaborate with teams across the company, including Hardware, Software, QA and Design."}, "200351061": {"jobID": "200351061", "origin_search": null, "posted": "Apr 13, 2022", "jobTitle": "Display Device Characterization Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200351061/display-device-characterization-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Electrical Engineering, Materials Science, Physics, Optics or related disciplines. Industry experience, including new product introduction, preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Deep understanding of compound semiconductor, optical device physics, and materials.Excellent written and verbal communication skills and people skills are required.3+ years of hands-on experience with compound semiconductor device and materials characterization in a manufacturing or research environment.Knowledge of geometrical optics, illumination and imaging systems, and color science; some background in diffractive optics a plus.Strong background in design and fabrication of electro-optical devices.Experience with device level reliability and failure analysis.Experience with current-voltage measurements and parameter extraction.Ability to think creatively to solve complex problems.Ability to communicate concepts and information across teams to drive important decision making.Experience with Photoluminescence/Electroluminescence characterization.Experience understanding characterization such as: TEM/FIB/SEM/EDX/EELS/Ramen/Auger/XPS/HALL/SIMS/XRD/ECV/Reflection/Absorption Spectroscopy/ Cathodoluminescence/EBIC etc.Programming, simulation, data handling and modeling skills (Python/Matlab/JMP/Labview/VBA etc).Experience with epi growth and characterization (MOCVD/HVPE/MBE etc).MS or PhD in Electrical Engineering, Materials Science, Physics, Optics or related disciplines. Industry experience, including new product introduction, preferred.", "jobDescription": "Apple is searching for a highly motivated engineer with clear and concise communication skills to design, investigate and improve performance of light-emitting devices for a next-generation display application."}, "200403827": {"jobID": "200403827", "origin_search": null, "posted": "Oct 29, 2022", "jobTitle": "Apple Cloud Platform - Internal CI/CD Service & Tools", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200403827/apple-cloud-platform-internal-ci-cd-service-tools?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to write clear, readable production code for services used in production (ideally Java or Go distributed systems)Experience with Git or similar distributed version control system, and some understanding of its internals (you will be integrating with SCM systems, not just using them during development)Experience with running software on Linux or other Unix based systems. You should be comfortable on a command line and with basic troubleshootingClear communicator (both written and verbal)Growth mindset and willingness to teach and learn from others.Committed to fostering an open and inclusive work environment.Our team comes with a diverse set of experience with many of the technologies below to represent the perspective and variety of our internal customer base. Candidates are not required to have experience with every technology or product.-  Java and Go experience-  Ability to write and understand in a scripting language or two (Python, bash, Ruby)-  Preference for test driven development and writing testable code, and testing frameworks-  Experience with AWS or GCP-  Experience with NoSQL databases, particularly Cassandra-  MacOS experience.-  Some familiarity with Docker (or other VM/Container solutions), and ideally deployment technologies such as Kubernetes and Tekton-  Exposure with at some equivalent build/deploy services such as Jenkins, TeamCity, CircleCI, Concourse, TravisCI, etc.-  Experience with a secure software development lifecycle, and integration of security into all phases of product development-  At least some exposure to a variety of build tools: Gradle, Maven, Ant, Make, Rake, Grunt, Gulp, Ninja, Blaze/Bazel, Pants or others. We don’t use all of these, but our customers do so having some understanding helps build the right product.", "jobDescription": "Are you a service developer looking to grow your skill set, invent new technology, and make a difference in developer productivity for thousands of developers inside all parts of Apple?\n\nThe Software Development Productivity team builds services and tools to help developers get ideas from commit to production quickly and with confidence. We’re constantly improving our existing CI/CD service to give developers the building blocks they need to produce scalable, high performance build and deploy pipelines with minimal friction. Our services power an enormous number of builds per day across all of Apple, including some of the most well known customer facing properties, and we want to do even more.\n\nOur engineering team is committed to innovating and pushing the bounds of continuous delivery. We ship to customers frequently and constantly strive to improve our delivery. Improving means constantly learning and making mistakes, something our team embraces. \n\nWe believe that the role of a developer is not to produce code, but solve problems. This means asking a lot of questions, understanding and empathizing with customers, and helping make the hard choices about what to build.\n\n\nYOU’LL DO WELL IN THIS ROLE IF YOU:\n-  Are driven to create outstanding customer experiences, and are passionate about helping developers write better code faster.\n-  Are good at understanding an entire customer problem and applying technology to it\n-  Love teaching people and learning new things\n-  Are not afraid to ask the hard questions or express your opinions, even when they are controversial.\n-  Enjoy evolving a large, critical system to provide next generation features"}, "200455331": {"jobID": "200455331", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455331/soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  Good SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal and communication skills and the dream to take on diverse challengesMinimum of BS + 10 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200196517": {"jobID": "200196517", "origin_search": null, "posted": "Aug 24, 2021", "jobTitle": "Security Infrastructure DevOps Engineer, SEAR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200196517/security-infrastructure-devops-engineer-sear?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent skills in Python, Java, or GoExperienced in SQL and familiarity with Python ORM librariesFamiliarity with JavaScript, React and web servicesExperienced with high-availability operations management, including deployment automation and rollback strategiesExperienced with building cloud services and distributed systemsDemonstrated creative, critical and independent thinking capabilities and troubleshooting skillsEffective communication of complex technical conceptsTrack record of shipping customer-facing services or productsPassionate about engineering perfection, performance, and qualityEnthusiasm for new technologies and growthRequirement for on-call rotation, which includes weekendsB.S. in Computer Science or equivalent experience", "jobDescription": "Come change the world with us!\n\nWe're on a mission to protect our customers, eradicate malware, and uncover security & privacy issues. The security engineering team at Apple creates services that protect over 1 billion users by \"sequencing the DNA\" of millions of iOS & macOS binaries. We're seeking full stack engineers to build high-availability & low latency systems, using Python, cloud services, and distributed databases."}, "200371081": {"jobID": "200371081", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Secure Runtime Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200371081/secure-runtime-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's or Masters degree in computer science or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "An authentic passion for securityHighly proficient in C/C++Experience in embedded operating system environmentsHighly professional, with the ability to deliver proven work on tight schedulesDirect experience in the overlap between software and hardware security, microkernel development, and firmware/software technologies.Experience with cryptography for platform security and implementation of secure software stacks and runtimes.Understanding of SoC-level design.Evidence of driving technical innovation.Strong communication skills.Bachelor's or Masters degree in computer science or related fieldExperience with ARM based SoC's", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices.  We are looking for an exceptional software engineer to work on the Secure Enclave coprocessor’s operating system, drivers, and core services. We work on a core technology and you have the opportunity to make a major impact in the way that Apple secures its iOS, watchOS, tvOS, and macOS products. Our environment champions product innovation, rapid product iteration, and a liberating amount of autonomy. In this rare and highly visible role, you are at the center of Apple's security efforts, influencing and assisting teams multi-functionally to secure user experiences across Apple's product line."}, "200326451": {"jobID": "200326451", "origin_search": null, "posted": "Jan 5, 2022", "jobTitle": "QA Manager - macOS System Experience", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200326451/qa-manager-macos-system-experience?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor of Computer Science, or related field, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$142,000", "max": "$214,500,"}, "benefits": null, "requirements": "3+ years leading a SQA or Software Development teamDeep understanding of SQA methodologies and practicesDetail oriented, analytical, and creative problem solver with passion for quality processesAdvanced proficiency with iOS macOS or other operating systems such as Unix/LinuxPassionate about phenomenal customer experience, specially great UI experienceComfortable working in a constantly evolving and dynamic environment and driving top issues to resolutionExcellent written and verbal communication skillsSolid contributions as an Individual contributor while also managingExposure to automation/scriptingBachelor of Computer Science, or related field, or equivalent work experience", "jobDescription": "Apple’s System Experience QA team is looking for a results-oriented leader with strong technical and interpersonal skills to lead a small team of QA Engineers. The person in this role will work closely with Engineering, other QA and Automation Managers on delivering the highest quality experience to our many macOS customers.\n\nAs a member of our dynamic group, you will have the unique opportunity to be part of testing one of our most iconic operating systems - macOS. From Notification Center interactions, Control Center, Dock and Mission Control to Sidecar and Universal Control, the team is responsible for many features that provide great system experience on the Mac!"}, "200455806": {"jobID": "200455806", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "PMU Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455806/pmu-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Typically requires a minimum of 10 years of experience in the areas of silicon validation, board-level hardware design, or IC design.Strong bring-up & debugging skills and hands-on lab work. Experience with sophisticated test equipment setups for analog measurement.Proven experience with debug, and performance analysis of analog circuits, voltage regulators, and power distribution for high-speed digital ICs.Basic software automation skills in (ex. Python, LabVIEW, TestStand).Mentoring and training for junior validation engineers.Effective communication skills working across large multi-functional HW, SW, architecture teams.Provide feedback on board-level HW design requirements, and support ATE test and reliability test planning.BS and a minimum of 10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \nThe PMU team is looking for qualified, motivated silicon validation engineers from a variety of skill levels. We are a fast-growing and highly diverse group, and you will work as part of a team doing post-silicon bring- up, debug, and validation of analog and power ICs that will drive the next generation of technology for Apple products. This team not only provides an environment optimal for the refinement of engineering abilities, but also promotes passion, creativity, and teamwork. As you work alongside world-class IC designers and product teams building the most technologically advanced products in the world, you will find the PMU validation team to be a highly dynamic work environment with endless learning opportunities."}, "200451496": {"jobID": "200451496", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "PMU Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451496/pmu-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of a BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Some experience in the areas of silicon validation, board-level hardware design, or IC design is preferred, but not required.Strong bring-up & debugging skills and hands-on lab work. Experience with sophisticated test equipment setups for analog measurement.Proven experience with debug, and performance analysis of analog circuits, voltage regulators, and power distribution for high-speed digital ICs.Basic software automation skills in (ex. Python, LabVIEW, TestStand).Mentoring and training for junior validation engineers.Effective communication skills working across large multi-functional HW, SW, architecture teams.Provide feedback on board-level HW design requirements, and support ATE test and reliability test planning.Minimum requirement of a BS degree", "jobDescription": "Do you love building elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \nThe PMU team is looking for qualified, motivated silicon validation engineers from a variety of skill levels. We are a fast-growing and highly diverse group, and you will work as part of a team doing post-silicon bring- up, debug, and validation of analog and power ICs that will drive the next generation of technology for Apple products. This team not only provides an environment optimal for the refinement of engineering abilities, but also promotes passion, creativity, and teamwork. As you work alongside world-class IC designers and product teams building the most technologically advanced products in the world, you will find the PMU validation team to be a highly dynamic work environment with endless learning opportunities."}, "200451730": {"jobID": "200451730", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Module Reliability Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451730/module-reliability-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "A graduate degree in Materials Science, Physics, Mechanical Engineering or an equivalent field is desired, PhD preferred. 3-5 years of experience in an engineering role which involves hands on work."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Possess extraordinary problem solving abilitiesUnderstand the physics behind the mechanical & electrical properties of materialsHave experience with the design and manufacture of assemblies that convert digital signals into physical signals (voltage, light, vibration) and vice versaHave exposure to failure analysis techniques as well as Materials characterization tools (e.g. scanning electron microscopy, CT scanning, FTIR)Are adept in statistical data analysis and are capable of clear reportingADDITIONAL REQUIREMENTS:Ability to travel internationally without restrictionsExcellent written and verbal communication skills with a strong attention to detailAbility to balance multiple projects at once including running activities remotely at third party vendor sites overseasAbility to complete tests and resolve problems in an unattended mannerFlexibility to accept new tasks and go beyond one's comfort zone to pursue the solution to new and unexpected problemsDynamic person with a can do attitude and a dream to work with a great team and productA graduate degree in Materials Science, Physics, Mechanical Engineering or an equivalent field is desired, PhD preferred. 3-5 years of experience in an engineering role which involves hands on work.", "jobDescription": "Are you a technologist looking for a career choice that provides ever evolving challenges? This position is offered in Apple’s Hardware Module Reliability Group. We guide development teams toward generating reliable designs for Apple's new technology components. We achieve this objective by identifying high risk failure modes early in the design life cycle and by using our engineering knowledge to help find the best path towards mitigation. Here are some examples of the technologies that we've supported (to name a few): FaceID, TouchID, iPhone Rear Camera, iPhone Proximity Sensor, AppleWatch Taptic Engine and AppleWatch ForceTouch. Overall, we feel that we offer an exciting chance to build your skills as you learn about a wide variety of technologies."}, "200439233": {"jobID": "200439233", "origin_search": null, "posted": "Oct 26, 2022", "jobTitle": "Video Codec Algorithm Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439233/video-codec-algorithm-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/Ph.D. in Computer Science, Computer Engineering, Electrical Engineering, or closely related fields\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \n\nApple benefits programs vary by country and are subject to eligibility requirements.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expert knowledge in video and image coding principles, algorithms, and techniquesExpert knowledge and experience in video compression standards, such as  H.264, HEVC, VVC, VP9, AV1Experienced in assessing visual quality using both objective metrics and subjective techniquesExcellent software design and debugging skills and solid programming skills in C/C++Good written and oral communication skillsFamiliarity with video processing algorithms such as scaling, noise reduction, tone mapping, etc would be a plusFamiliarity with the latest computer vision and deep learning technologies would be a plusMS/Ph.D. in Computer Science, Computer Engineering, Electrical Engineering, or closely related fields\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \n\nApple benefits programs vary by country and are subject to eligibility requirements.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "We are looking for a highly ambitious and enthusiastic individual, who is able to excel in a technically meaningful environment, to fill in the position of video codec algorithm engineer. In this role you will work as an individual contributor in a small and dynamic team, developing video compression and processing algorithms for current and future Apple products."}, "200459170": {"jobID": "200459170", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Sr. iPhone Hardware Systems Design Engineer - SOC", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459170/sr-iphone-hardware-systems-design-engineer-soc?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSEE/MSEE/PhD"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "3+ years proven experiencesStrong EE fundamentals and problem solving skillsDeep understanding of mobile SoC architecture and functionalityStrong experience and knowledge in SOC functionality and performance testing and validationHands-on experience in SoC/board/system-level bring up, issue debug, and testing, lab equipments to measure power/thermal/performanceHigh level of knowledge in mobile system power delivery and PMICConfirmed engineering passion, initiative, innovation, and creativityScripting languages (Python, Perl, Shell, etc.)BSEE/MSEE/PhD", "jobDescription": "The iPhone HW Engineering team is seeking a hardworking electrical hardware engineer to work on the iPhone system technologies areas. The ideal candidate will work with multi-functional teams to perform in-depth analysis, testing, and validation of iPhone SoC power and performance, and improvement of systems design."}, "200459413": {"jobID": "200459413", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "PCB Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459413/pcb-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "6+ years of PCB Design ExperienceExperience with Allegro Software tools", "jobDescription": "The people here at Apple don’t just create products and they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. Are you up for the challenge?\n\nOur Engineering PCB Services Org takes pride in supporting board designs for Electrical Engineering teams at Apple. We are seeking a dynamic, motivated individual with deep understanding of printed circuit board design (PCB), high speed design environments, and the ability to receive guidance from our design engineers to build complex boards. We believe in technology enablement by collaboration and building extraordinary products at Apple.\n\nCollaborating with Design teams in the design and development of complex, detailed layouts of rigid and flexible printed circuit boards using CAE and CAD applications and tools is a key aspect of this position. You would work with multiple Design teams to plan schedules, resolve costs, packaging, manufacturing, and electrical design issues. \n\nCome join us!"}, "200459419": {"jobID": "200459419", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "PCB Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459419/pcb-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "6+ years of PCB Design ExperienceExperience with Allegro Software tools", "jobDescription": "The people here at Apple don’t just create products and they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. Are you up for the challenge?\nOur Engineering PCB Services Org takes pride in supporting board designs for Electrical Engineering teams at Apple. We are seeking a dynamic, motivated individual with deep understanding of printed circuit board design (PCB), high speed design environments, and the ability to receive guidance from our design engineers to build complex boards. We believe in technology enablement by collaboration and building extraordinary products at Apple.\n\nCollaborating with Design teams in the design and development of complex, detailed layouts of rigid and flexible printed circuit boards using CAE and CAD applications and tools is a key aspect of this position. You would work with multiple Design teams to plan schedules, resolve costs, packaging, manufacturing, and electrical design issues. \n\nCome join us!"}, "200446197": {"jobID": "200446197", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "CoreDarwin Software Integrity Engineer - DevOps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446197/coredarwin-software-integrity-engineer-devops?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent knowledge and experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Developing test suites for both at-desk testing and our Continuous Integration infrastructureDesign and own a pre-submission validation processTriaging failures and following up with the responsible team(s) for fixesExperience with continuous integration frameworks (such as Jenkins) and a git-based development flowExperience system & kernel-level test developmentProgramming skillsLeading a fleet of lab test machines and associated CI automationHands-on approach and willingness to tackle new challengesExcellent communication and interpersonal skillsBS/MS in Computer Science or equivalent knowledge and experience", "jobDescription": "As a CoreDarwin Software Quality Integrity Engineer working on Continuous Integration, you will be deeply involved with our development engineers and your peers in QA to design, create, implement, and maintain manual and automated test suites. You will also be responsible for reporting on testing progress and the overall health of your assigned areas throughout the development cycle. You will create problem reports and then track their resolution through completion. You will partner with automation SW engineers for the first-level pre-submission triaging and analysis of issues. You will also help create tailored tools to facilitate testing for yourself and others. A successful candidate must be passionate and have strong multitasking skills."}, "200440257": {"jobID": "200440257", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Software Engineer, Safari UI", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440257/software-engineer-safari-ui?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Passion for developing highly visible, product-defining featuresStrong object-oriented programming and design skillsDetailed knowledge of Objective-C, Swift, C++, or CExcellent debugging and problem solving skillsWillingness to work at all layers of the software stackBS in Computer Science or related field, or equivalent experience", "jobDescription": "We’re looking for an engineer to help define the future of web browsing. Come help transform Apple’s flagship application and directly affect how people live, communicate, and connect. Together, we’ll build on the industry-leading WebKit engine and Apple’s frameworks to deliver a fluid browsing experience and powerful, easy-to-use features. Your vision and impact will extend beyond Safari, as we prototype and build features involving everything from new hardware to Foundation and Core Animation, to Siri and CloudKit, and everything in between."}, "200449637": {"jobID": "200449637", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Cell Process Engineering Technician", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449637/cell-process-engineering-technician?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Associate’s Degree in Engineering Technology or related field; or equivalent combination of education and experience in developing advanced lithium ion processes."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$38.94", "max": "$69.23/hr,"}, "benefits": null, "requirements": "Three to five years of process development with emphasis on lithium ion.Experience with calendering and slitting or cell assemblyAbility to diagnose and correct process upsetsFamiliarity with proper laboratory safety and housekeeping practices such a 5SExperience using Mac OS and / or Windows OSAbility to adhere to any established quality standards, SOP’s and defined process control plans while suggesting improvements as neededUnderstanding and ability to read product and machine design prints and schematicsDetailed oriented with strong communication and analytical skillsWorking knowledge of coating and formation / test equipment a plusMust be able to lift up to 50 lbsAssociate’s Degree in Engineering Technology or related field; or equivalent combination of education and experience in developing advanced lithium ion processes.", "jobDescription": "Do you have a passion for invention and self-challenge? As part of our Battery Engineering group, you’ll help craft creative battery solutions that deliver more energy in smaller spaces than ever before. You’ll work across subject areas to transform improved hardware elements into a single, integrated design. Join us, and help us innovate new battery technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what batteries can do and improve the product experience for our customers across the world.\n\nThis Engineering Technician role is to support Apple’s Cell Pilot Line (CPL) process engineering group in all phases of Process Development activities. Primary focus in either the electrode fabrication or cell assembly areas."}, "200464371": {"jobID": "200464371", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464371/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A minimum requirement of a bachelor's degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Understanding of micro-processor architectureKnowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerSome experience with scripting languages such as Python, Perl, or TclSome knowledge of software tool chains including including compilers, assemblers, and source control tools is a plusAbility to work well in a team, but to be responsible and self-driven.A minimum requirement of a bachelor's degree.", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join our team of SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200463780": {"jobID": "200463780", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463780/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A minimum requirement of a bachelor's degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Understanding of micro-processor architectureKnowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerSome experience with scripting languages such as Python, Perl, or TclSome knowledge of software tool chains including including compilers, assemblers, and source control tools is a plusAbility to work well in a team, but to be responsible and self-driven.A minimum requirement of a bachelor's degree.", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join our team of SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200451469": {"jobID": "200451469", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Register File Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451469/register-file-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "We are looking for applicants with circuit design experience in the CPU environment, including:Knowledge of high-performance low power circuit design.Experience developing Register File designs for low voltage and low power operating conditions.Knowledge of Verilog and/or VHDL, and experience with simulators and waveform debugging tools.Knowledge of industry standard circuit and design tools.Ability to conduct experiments during silicon debug, capturing and analyzing data; and utilize scripting to support efficient handling of ATE data.Efficient programming skills in languages like: SKILL, Perl, Python, TCL, Shell.Ability to provide automations for rapid and dynamic design needs.Ability to work collaboratively with CAD to define and maintain design methodology flows and tools.BS and a minimum of 3 years of relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you want to utilize your engineering background to make big things happen? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. You’ll help design the tools that allow us to bring customers experiences they’ve never before imagined!\nYou will join an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Register File Design Engineers to work on custom digital circuits to implement sophisticated circuit techniques to improve circuit performance, optimize dynamic/static power and support full bring up through productization."}, "200336054": {"jobID": "200336054", "origin_search": null, "posted": "Dec 22, 2022", "jobTitle": "Wireless Bluetooth Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200336054/wireless-bluetooth-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Bluetooth experience preferred, not requiredVery strong C++, C, Objective-C, or SwiftSelf-motivated and dedicated with validated creative and critical thinking capabilitiesThrive in a collaborative environment and can clearly communicate while authoritatively driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to pursue everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "jobDescription": "Join our Wireless Software Engineering team and drive innovation that matters! We craft and seamlessly integrate technologies that enrich people’s lives such as exposure notifications for covid-19, audio, gaming, fitness, and more; all while delivering the best user-experience. If you're a strong software engineer and are passionate about building awesome Bluetooth solutions, we may have the job for you. The Core Bluetooth team is looking for a motivated software engineer to design, implement, and maintain next generation personal connectivity solutions. You are responsible for crafting and developing world changing wireless protocols such as exposure notifications on the very latest Apple products."}, "200359594": {"jobID": "200359594", "origin_search": null, "posted": "Mar 25, 2022", "jobTitle": "Wireless Bluetooth Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200359594/wireless-bluetooth-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Bluetooth experience preferred, not requiredVery strong C++, C, Objective-C, or SwiftSelf-motivated and dedicated with validated creative and critical thinking capabilitiesThrive in a collaborative environment and can clearly communicate while authoritatively driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to pursue everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "jobDescription": "Join our Wireless Software Engineering team and drive innovation that matters! We craft and seamlessly integrate technologies that enrich people’s lives such as exposure notifications for covid-19, audio, gaming, fitness, and more; all while delivering the best user-experience. If you're a strong software engineer and are passionate about building awesome Bluetooth solutions, we may have the job for you. The Core Bluetooth team is looking for a motivated software engineer to design, implement, and maintain next generation personal connectivity solutions. You are responsible for crafting and developing world changing wireless protocols such as exposure notifications on the very latest Apple products."}, "200450235": {"jobID": "200450235", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Analog Custom Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450235/analog-custom-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "5+ years of experience in test development, debug, and reporting for mixed-signal ICs and IPs.Hands-on experience with lab equipment including digital multimeter, source meter, spectrum analyzer, signal generator, oscilloscope, power supply, logic analyzer, BERT, etc.Hands-on experience in designing PCB schematics (Orcad) and layout (Allegro) for analog and mixed-signal applications including FPGA.Hands-on experience with test automation and data analysis platforms.Excellent coding / scripting skills (Python, Perl, Tcl, etc.).Experience in test lab setup and maintenance, as well as rework.Experience in testing of PLL, DLL, SERDES, memory interface, LDO, and voltage reference.ADC / DAC testing experience is a plus.Experience in SI / PI measurements is a plus.Strong communication and interpersonal skills.Leadership skills for driving cross-functional test plans and debug activities.Analog circuit design experience is a plus.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "Imagine what you could do here at Apple?\nTogether we could help craft the next generation of the world’s finest devices. New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish.\nThe AMS team is searching for a self-motivating, engineer for the role of Hardware Characterization Engineer. As a member of the AMS team, we will be working on the leading-edge technology nodes to build best-in-class custom analog designs used to connect our world-class products to the world as well as optimizing their performance.\nYou will become part of a development team that cultivates engineering excellence, creativity and innovation. Collaboration across teams is a key component of success at Apple. The right candidate will thrive in that type of environment. It's one of the most exciting aspects of the job. Dynamic, smart people and inspiring, innovative technologies are the norm here\nWill you help us design the next generation of revolutionary Apple products?"}, "200451072": {"jobID": "200451072", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Sr. Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451072/sr-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Validated experience in firmware, device driver.Software development experience using C and assembly language, with ARM SoCs.FPGA development and test.Experience in developing low-level drivers and HW bring-up, using test tools and interacting with HW design teams.Exposure to multiple high-level programming languages, including C, C#, C++Experience using MS Visual Studio IDE, as well as (command line) gnu toolchain.Experience with Configuration Management tools (git, Subversion).Experience with scripting languages (i.e. Bash/shell, Perl, Python, VBA)Bluetooth and WIFI experience preferred.Experience with MCUs, peripherals, features, and development environments is also valuable.Proven track record to design and integrate code into a shipping product against ambitious timelines.Strong electrical system and software debugging skills are essential. ICE/JTAG experience is preferred.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nAs a Firmware Engineer, you will be developing embedded software solutions for our current and future products."}}