{"200446225": {"jobID": "200446225", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "Cloud Security Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446225/cloud-security-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science or equivalent with emphasis in security related fields"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of work experience in infrastructure engineering or security engineering experience.3+ years of work experience in distributed cloud computing. Kubernetes developing experience is a huge plus.Advanced programming language proficiency in Go (or comparable object-oriented language) with experience designing and developing efficient, secured, scalable, and reliable production systems.Keeps up with industry trends in security technologyExperience working on high volume servicesA critical eye for correct codeProficiency in testing your softwareFluency navigating Linux production environmentsKnowledge of development and integration (e.g. CI/CD) (optional)Understanding of OIDC/OAuth2, JWT (optional)Ability to parse user requirements and develop production-quality solutions.Love open source and collaboration, including direct participation in the Kubernetes and other cloud native communities!BS or MS in Computer Science or equivalent with emphasis in security related fields", "jobDescription": "The Apple Cloud Services (ACS) Compute team is building the next generation cloud compute services empowering Apple’s software developers to build the products our customers love. We're a fast-moving, highly-skilled team designing, developing and supporting the orchestrated, container-based compute platform that Apple’s server-side developers use to build, test and deploy their products. Our web-scale implementation hosts Apple’s core cloud services and has to stay highly available, secure, and \"just work”. That's a tall order, and we're looking to add more talented, passionate engineers who enjoy solving distributed systems challenges and build solutions to a variety of outstanding security challenges, and build the identity and authorization infrastructure. If you're curious, collaborative, and want to join us, we'd love to hear from you."}, "200448786": {"jobID": "200448786", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Software Engineer- Photo Apps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448786/software-engineer-photo-apps?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science\n2+ years industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Object-Oriented analysis and design experienceSwift / Objective-C / C++ experienceExposure to performance analysis and optimization techniquesExperience with Core Image or similar GPU image processing technologiesDesire to grow and develop in a fast-paced development teamBS in Computer Science\n2+ years industry experiencePrior exposure to image and video processing applicationsExposure to Metal, OpenCL, OpenGL or other GPU programming languageExperience writing Swift applications for iOS or macOSExperience working in an Agile environmentInterest in Visual Media, Graphics or Photography", "jobDescription": "Come join the Photos Imaging team to do your best work on exciting and groundbreaking projects that will surprise and delight our users. \n\nApple’s Photos Imaging team is looking for a dedicated, enthusiastic and growth centred software engineer to a join an expanding team focused on the next generation of visual media processing features in the Photos ecosystem."}, "200463244": {"jobID": "200463244", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463244/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A minimum requirement of a bachelor's degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Understanding of micro-processor architectureKnowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerSome experience with scripting languages such as Python, Perl, or TclSome knowledge of software tool chains including including compilers, assemblers, and source control tools is a plusAbility to work well in a team, but to be responsible and self-driven.A minimum requirement of a bachelor's degree.", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join our team of SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200464479": {"jobID": "200464479", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Sr. Software Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464479/sr-software-integration-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or Master degree in Computer Engineering or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of SW development and system integration experienceExperience with Apple Clang or LLVM and GCC compilers, GNU Make or CMake, and build system optimization are a strong plusExperience with continuous integration and release, and familiar with Jenkins or similar toolsHave a deep understanding of branching and software configuration management. Hands-on experience with GITRich experience with Scripting languages (Python, Perl, or equivalent).Experience with embedded systems is a plus. Experience in building C/C++-based projects.Excellent written and verbal communication skills are needed to collaborate closely with cross functional development teams Obsessively passionate and inquisitive, and seek to pursue everyday problems in innovative waysLaser-focused on the smallest details that are important to our customersBachelor or Master degree in Computer Engineering or equivalent degree", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin our Wireless Technologies and Ecosystems (WTE) Engineering team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. We're a passionate and key team that helps drive design, develop and integrate cellular chipsets in Apple products. You will join a hands-on development team that nurtures creativity and generates novel solutions to deliver engineering perfection."}, "200387334": {"jobID": "200387334", "origin_search": null, "posted": "Jun 2, 2022", "jobTitle": "Display Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200387334/display-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS / PHD Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Confirmed excellence in at least one electrical engineering disciplinePower electronics, RF/wireless, or IC design, semiconductors,FPGAs, TFTsHands-on lab experience including data acquisition and automationusing test equipment.Strong python and Matlab script skill preferredExperience with circuit simulation tools such as HSPICE or Spectre.Experience with PCB design and IC packaging and layout, includinganalysis for SI/PI/crosstalk is a plus.Experience in display technology, such as LCD, OLED, plasma, DLP,LCOS, e-paper, etc is a plus.Up to 20% international travel required per year.MS / PHD Electrical Engineering", "jobDescription": "We are looking for an electrical engineer to bring fresh perspective and integrate state of the art technologies into Apple displays. In this rare position, you will have a high-visibility role to deliver the world's best front- of-screen experience on small form factor Apple products. You will design, prototype, and validate display hardware, integrate systems, and support new products ramping to mass production."}, "200450453": {"jobID": "200450453", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Software Engineer - Distributed Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450453/software-engineer-distributed-systems-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in CS&E or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience developing distributed/microservices based systemsExperience with app containerization and build/release/deployment strategiesExperience with event-based messaging systems (Kafka)Experience in DBA (MongoDB, Redis, S3, PostgreSQL)Experience in creating scripts to automate distributed client-server infrastructureExperience with logging infrastructure and using tools such as SplunkExperience developing unit tests and contributing to integration testsExperience with Git, Jenkins (or other CI/CD tooling)Contribute to highly scalable backend services (NodeJS, TypeScript, Java)Highly professional, with the ability to deliver high quality work on tight schedulesHighly collaborative and used to code reviews, PRs, and working in a larger teamAbility to identify gaps or inefficiencies in processes or workflow and suggest improvementsAbility to work on multiple projects at the same timeAbility to convert a complex technical problem into smaller modular tasksBS in CS&E or equivalent experience", "jobDescription": "Join a great team responsible for delivering instructional content for iOS, macOS, watchOS, tvOS, Apple apps, and on the web. Our team has created and develops cutting edge web apps for delivering user assistance to Apple customers. The team supports the department that produces onscreen and printed product documentation for all Apple software and hardware."}, "200451965": {"jobID": "200451965", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal IP Post Silicon Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451965/analog-mixed-signal-ip-post-silicon-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE is required\nMinimum 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in AMS test development that includes: review specification document; draft validation plan; build test bench; and perform data collection with automationStrong fundamental understanding of analog & mixed signal circuitry in one or more of the following domains: PLL, Data Converter, DDR Memory, Temp Sensor, etc.Proficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, etc.Experienced in scripting language, Python preferred, to automate test and analyze dataDiligent & Emphasis on quality of resultsInitiative in taking ownership & responsibility to drive deliverablesStrong verbal and written communication skillsHands-on lab experience including soldering/instrumenting systems is a plusBSEE is required\nMinimum 10 years of industry experience", "jobDescription": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200415545": {"jobID": "200415545", "origin_search": null, "posted": "Nov 12, 2022", "jobTitle": "Autonomy Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200415545/autonomy-systems-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Computer Science, Engineering, Robotics or a related field are likely matches\nMinimum of 5 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with analysis, verification, or validation of complex robotics systems, preferably in autonomous applications.Experience using rigorous scientific methods for trade studies, testing, and problem solving. Familiarity with formal verification is a plus.Experience with statistics, data analysis, or modeling.Excellent Python skills. Experience with C++ and/or SQL experience is a plus.Experience in system or algorithm design, tackling deep unsolved problems, and a history of detailed execution.MS or PhD in Computer Science, Engineering, Robotics or a related field are likely matches\nMinimum of 5 years of relevant industry experience", "jobDescription": "How do you verify an AI? Join a team of talented engineers who are defining verification & validation for safe autonomous technology.\nThe Special Projects Group at Apple is seeking an accomplished robotics engineer or systems engineer to serve as a Autonomy Systems Engineer focused on Verification and Validation. With a mix of systems engineering, data science, and algorithm development, you will conduct technical analyses of system requirements and use cases to develop insightful metrics and tests that verify the performance and safety of our system. Your work deliverables will be a key part of the development cycle, delivering objective criteria against which we can measure the readiness of our system. We expect successful candidates to demonstrate an ability to solve complex problems efficiently, and to communicate about them effectively with a variety of audiences."}, "200438897": {"jobID": "200438897", "origin_search": null, "posted": "Oct 26, 2022", "jobTitle": "AR/VR Media Infrastructure Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438897/ar-vr-media-infrastructure-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Newport Beach", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BS/MS degree in Computer Science or equivalent experience\n\n-  10+ years of experience in film, games, or entertainment"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$250,000,"}, "benefits": null, "requirements": "10+ years of experience in film, games, or entertainmentExperience leading a team of engineersExperience with storage systems such as Qumulo, NetApp, QuantumExperience in hybrid on-premise and cloud compute capacity planning, build out, and compute benchmarking (ex. Deadline, OpenCue)Experience in setup and management of production tracking databases and version control systems (ex. Shotgrid, Ftrack, Perforce)Experience in setup and management of DevOps and containerization systemsExperience configuring, managing, and hardening high-availabilty server solutionsExperience with Cisco (and, ideally, Arista) network architectureEffectively coordinates work and communication across disparate groups of individualsPassion for staying on top of industry trendsExcellent client services skills and email etiquette-  BS/MS degree in Computer Science or equivalent experience\n\n-  10+ years of experience in film, games, or entertainment", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nAre you passionate about solving complex business challenges with process engineering and technology? Do you thrive in environments that require cross-functional thinking, collaboration, and innovation? Do you have experience in the entertainment industry working directly with production crew and internal studio departments? Are you looking to change the industry through innovation, technology, collaboration and creativity? If so, this may be the job for you.\n\nThe TDG Media Infrastructure team is responsible for the technology strategy, delivery, and sustainment of infrastructure systems used to enable 2D/3D content creation. You will set the vision and manage a team of engineers responsible for system bringup, deployment, reliability, security, and service scalability. You will work closely with leadership, production, engineers, vendors, information security, and others to deliver a technology ecosystem that meets the demands of a fast-paced content production environment."}, "200465722": {"jobID": "200465722", "origin_search": null, "posted": "Feb 25, 2023", "jobTitle": "Battery Cell Technology Development Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465722/battery-cell-technology-development-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "3+ years relevant industry experience (preferably Battery or Consumer Electronics) of taking technologies from concept definition to mass production. Experience with emphasis on lithium ion or lithium polymer battery cells a plusTechnical project management / leadership experience in material development, mechanical design, simulation, and manufacturing process developmentTechnical Degree in Chemical Engineering, Material Science or Mechanical Engineering required, experience in lithium-based battery is an advantage.Knowledge of current innovative production process applicable to lithium rechargeable cells highly desired.Experience in working with suppliers to develop and qualify batteryDemonstrated savvy in working in a fast-paced, multi-functional environment; engaged and eager to learn.Experience with modeling and simulation work a plus.Excellent communication, organizational and leadership skills as well as the ability to filter and distill relevant information for the right audience.Experienced in setting up project plans, anticipate potential roadblocks and react proactively to mitigate against risks or impacts.Ability to comprehend, communicate and manage complex design tradeoffs.Understands and deals well with rapid development cycles; remains flexible and calm in the face of ambiguity. Highly adept in multi-tasking of both short-term and long-term activities.BS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, dedicated people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product!\n\nAs an Engineering Project Manager (EPM) within Apple's HW Technology organization, you will be responsible for development of battery solutions for a wide range of Apple products. We are looking for an upbeat EPM to support technically challenging projects where you are encouraged to use your engineering background to enable multi-functional teams delivering sophisticated solutions. The ideal candidate will understand lithium based rechargeable cells, and have a passion for upending conventional wisdom of material, packaging, and analytics development to push industry boundaries and deliver better Batteries. The candidate will have a working understanding of battery cell design and manufacturing to drive and complete a plan from concept development to build management to product integration. Successful candidates will have proven ability to enable larger multi-functional teams to deliver complex systems efficiently and with high quality, with ability to bridge gaps between different engineering teams, while driving and qualifying suppliers to Apple Battery specifications."}, "200408454": {"jobID": "200408454", "origin_search": null, "posted": "Aug 2, 2022", "jobTitle": "Engineering Program Manager, CoreOS", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200408454/engineering-program-manager-coreos?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "At least 5 years of program or product management in software developmentDriving multi-functional efforts across major technical fields: SW, HW, Silicon, and QAOutstanding communication and presentation skills to engineers, managers, and execsIdentifying risks, developing mitigation strategies, and facilitating resolutionsSound technical foundation and a highly motivated self-starterKnowledge of software engineering standard methodologies and related dependenciesStrong leadership skills and ability to inspire team membersBS in Computer Science or related field, preferred.", "jobDescription": "Why Apple? Imagine what you could do here. At Apple, new insights have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Core OS organization is looking for an experienced program manager to lead highly multi-functional technology efforts across Mac OS X and iOS. This is an opportunity to drive key software initiatives across subject areas as well as integrating them with hardware roadmaps. This role requires an energetic and motivated individual with strong communication, organization, and technical skills who work well in a fast-paced dynamic environment."}, "200452482": {"jobID": "200452482", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Cellular RF Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452482/cellular-rf-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "M.S.E.E. preferred, not requiredExperience with radio hardware design and/or RF component designFamiliarity with the challenges of development for high-volume manufacturing.Hands on experience with RF circuits and hardware on the lab bench.Understanding of core technologies and physics that drive innovative RF performance.Proficient in wireless communications standards, wireless technology and communications market trends.Excellent written and verbal communicator, proven track record of working in a dynamic multi-functional team.Well organized and have the ability to be flexible in a changing work environment.Cellular Handset experience (preferred, not required)Experience with RF simulation tools (ADS, HFSS, Matlab) (preferred, not required)Experience with Python for test setup automation and data analysis (preferred, not required)B.S. and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Are you ready to join our RF Hardware Design team?\n\nThe RF Hardware Design Engineer will design, develop, and optimize radio frequency (RF) hardware circuits and systems for wireless communications devices. The engineer will be responsible for development and integration of cellular radio platforms, and will be involved from initial concept study to the mass production phase. Some international and domestic travel may be required."}, "200435777": {"jobID": "200435777", "origin_search": null, "posted": "Oct 18, 2022", "jobTitle": "Computational Display/Optics Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435777/computational-display-optics-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "M.S. or Ph.D in Optical science, EE, Computer science or equivalent, industrial experience is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Understanding of computational display hardware and technologies and basics of optical designSolid background in at least one of the following areas: Geometrical optics, Physical optics, Fourier optics; Imaging and image processing; Computational imaging/displays; Camera/3D displays calibration and/or 3D geometry; Displays optics and human perceptionProficient in at-least one of the Matlab/Python/LuaExperience in calibration and metrology methodologies used in optics, computational displays and cameras.Experience in mathematical modeling and statistical analysisExperience in working with optical modeling software (Zemax is preferred)M.S. or Ph.D in Optical science, EE, Computer science or equivalent, industrial experience is preferred.Experience in these areas is a plus:-  C++ programming-  Eye tracking, computer vision-  Algorithm development-  Monocular/Binocular vision-  Prior experiences in prototyping new technologies-  Knowledge of linear systems theory, Linear Algebra, Fourier analysis, and digital filtering is a plus", "jobDescription": "Do something different! Apple is looking for a creative and world class engineer to join a multi-disciplinary team exploring and delivering new display technologies for Apple’s next generation products. We are looking to add experts in optics and computational display and/or imaging. A successful candidate will work with cross-functional team on investigating advanced display technologies, the display architecture, prototyping, and system integration.\n\nThe team features a diverse engineering roster including optical engineers, display engineers, software developers, human perception experts, and product design engineers. A successful candidate needs to be a flexible thinker and be able to problem solve outside of their respective technical area. Join a unique display exploration team within Apple. Think you know what the displays of the future will be? Help Apple create them!"}, "200236253": {"jobID": "200236253", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AR/VR Graphics Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200236253/ar-vr-graphics-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science OR equivalent degree OR equivalent experience and at least 3 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Programming skills and knowledge of C / C++3D math for graphics/games (linear algebra)Communication and collaboration skillsBS/MS in Computer Science OR equivalent degree OR equivalent experience and at least 3 years of experience.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for a Software Development Engineer to help us push the limits of the next generation of interactive experiences on our platform. This team is working with some of Apple’s most advanced technologies including augmented reality (AR) and virtual reality (VR) offered in ARKit and Metal 2. As a member of our creative organization, you will have the uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day."}, "200236299": {"jobID": "200236299", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AR/VR Graphics Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200236299/ar-vr-graphics-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science OR equivalent degree and at least 3 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Programming skills and knowledge of C / C++3D math for graphics/games (linear algebra)Communication and collaboration skillsBS/MS in Computer Science OR equivalent degree and at least 3 years of experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for a Software Development Engineer to help us push the limits of the next generation of interactive experiences on our platform. This team is working with some of Apple’s most advanced technologies including augmented reality (AR) and virtual reality (VR) offered in ARKit and Metal 2. As a member of our creative organization, you will have the uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day."}, "200404026": {"jobID": "200404026", "origin_search": null, "posted": "Aug 22, 2022", "jobTitle": "iOS Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200404026/ios-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Computer Science (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong experience writing C++ code in a POSIX environmentProven understanding of multi-threaded programming and synchronizationBroad experience in overall system design and implementationExcellent debugging skillsThe ability to thrive in a collaborative environment and can clearly communicate while expertly driving multiple projectsBachelors or Masters in Computer Science (or equivalent)Confirmed experience mentoring other team members while leading projects.Validated experience with Test Driven Development.Experience developing in embedded system environments.Experience with git revision control.Familiarity with the overall architecture of consumer electronics.Experience with Boost C++ libraries a plus.", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin our Wireless Technologies and Ecosystems (WTE) team and drive innovation that matters!\nWe build and seamlessly integrate technologies that enrich peoples' lives and deliver the absolute best user-experience.\nIf you're passionate about technology, we may have the job for you."}, "200431180": {"jobID": "200431180", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "iOS Software Engineer, Video Applications", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431180/ios-software-engineer-video-applications?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "3+ years software development experienceStrong skills in Objective-C, C/C++, and/or SwiftSignificant skills in UIKit, Metal, 3D/2D Graphics, AR/VR, image analysis, and/or AudioExperience with multi-threading, concurrent programming, memory management, and/or performance optimizationProven ability to develop and ship high quality software productsStrong communication skills and the ability to work closely with othersFamiliarity with content creation tools is an added plusBS or MS in Computer Science preferred.", "jobDescription": "The Video Applications group develops high-profile media creation applications used by millions of people. iMovie, Final Cut Pro X, Motion, and Compressor are state-of-the-art media authoring tools which consumers and creative professionals rely on for everything from broadcast news and feature films to documentaries and home movies. Our user base is passionate and loyal, and our products sit at the center of a rich partner ecosystem in a vibrant industry. \n\nThe Video Applications team is seeking experienced iOS software engineers to help drive the design and implementation of applications for video content creation. You should have experience in user interface implementation, 2D or 3D graphics and rendering, image processing, audio processing, data management, and/or application architecture."}, "200458879": {"jobID": "200458879", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "CAD Engineer - PDV", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458879/cad-engineer-pdv?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Requires experience in Silicon chip design flows.Expertise in Calibre/ICV runset coding for DRC/LVS/ERC/MFILL is required. Rule coding in PERC is a plus.Tapeout support and SOC chip level PDV debug experience in various technology nodes is desirable.Knowledge/scripting in programming languages such as Perl, Python, Tcl, Shell, Makefile and C.Deep understanding in Silicon technology and experience with flow development in advanced nodes.Knowledge of parasitic extraction, SKILL coding, and PnR tools is a plus.Minimum requirements of BS + 10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAs a member of our CAD team, you will architect, develop, maintain and improve physical design verification (PDV) flows. The role requires you to work on flow and runset development for various technology nodes and tool sets. Working alongside the CAD team, you will be collaborating with the custom digital/analog/mixed-signal design, physical design (PD) and chip integration teams. You will need to have a deep understanding of design rule checks (DRC) and layout versus schematic (LVS) runsets, writing from scratch and/or modify existing ones. Also you should have worked with Dummy Metal Fill generation and Design for Manufacturability (DFM) rules at different technologies."}, "200439147": {"jobID": "200439147", "origin_search": null, "posted": "Oct 26, 2022", "jobTitle": "Display Technologist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439147/display-technologist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD degree in Physics, Optics, Material Science, Computer Science or Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands-on experience building imaging systems and programming custom interfaces with lab equipmentsStrong Python/Matlab skillsBasic shell scripting ability and automated data analysis are preferredUnderstanding in the basic principles of inorganic and organic light-emitting diode (LED/OLED) is a plusBasic understanding of colorimetryProven record of problem-solving skills together with self-driven growth mindsetsMS or PhD degree in Physics, Optics, Material Science, Computer Science or Electrical Engineering", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Display Technologies group, you’ll help ensure our products’ displays work beautifully through the successful design, fabrication, and implementation of components in Apple devices. From initial concept to mass production, you’ll develop highly innovative displays for the full line of Apple products, including Apple Watch, iPhone, iPad, and Mac. Through touch and sight, these displays are how millions of Apple customers connect with our products every single day. Together, you’ll collaborate with multifunctional teams across Apple to make each interaction a magical experience to see and touch. \n\nOur Display Investigations team is looking for a dedicated Display Technologist candidate who will bring innovations to Apple's unique display technology features that are achieved by the interplay between hardware and software. As a member of our team, the candidate will be participating in building imaging equipment for development of Apple products with phenomenal display qualities. Candidates with strong problem-solving skills combined with deep curiosity about displays will be preferred."}, "200456326": {"jobID": "200456326", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Product Design Engineer - Mac", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456326/product-design-engineer-mac?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. Mechanical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Genuine curiosityA sense of ownershipCollaborative & receptive to feedbackEngineering fundamentals: solid mechanics, material science, heat transfer, mechanism design, manufacturingExcellent communication skills: both written and verbal, ability to clearly communicate design ideas and contribute to brainstormsMechanical Design experience in course work, internship or hobbyB.S. Mechanical Engineering or equivalent", "jobDescription": "Do you love utilizing your creativity, spatial reasoning & attention to detail to collaboratively solve design challenges? The Mac Product Design team works with other engineers and designers to seamlessly integrate technology into the next generation of portable and desktop computers. We apply a genuine sense of curiosity and dedication to delivering truly innovative and relevant products that enrich our customers’ lives. We want you to join our cohesive and diverse family of Product Design Engineers to do the most impactful work of your life. In this role, you will ideate concepts, design down to the details, prototype & test, and travel to assembly sites to optimize the design."}, "200452083": {"jobID": "200452083", "origin_search": null, "posted": "Dec 22, 2022", "jobTitle": "Wireless Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452083/wireless-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BSEE or equivalent with + 10 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "4-10 years of wireless/RF industry experience with preferred 2 or more years of wireless module development experience from early concept to MP for consumer electronic devices.Strong RF design background. Additional experience in packaging, product engineering, ATE, and reliability engineering is highly desirable.Strong data analysis skills including yield analysis (Cpk), and retest rate analysis, required for data sheet closuresAbility to define best engineering methods for custom Wireless module and component development during prototyping phase.Excellent problem-resolution skills are expected to address technical issues during development and rampVery good communication skills, verbal and written, including the capability to drive meetings to make key decisions on wireless technologies.Experience in setting up project schedules and work breakdown structures while communicating risks with prioritization is a plus.Ability to travel internationally.Minimum BSEE or equivalent with + 10 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! \n\nThe Wireless Module Engineer (WME) is well-versed in multiple fields for wireless module development: RF design, packaging, product engineering (including yield analysis), ATE, and reliability engineering. The WME will use their expertise to develop wireless modules from early concept to ramp, communicate risks/priorities (Design/Reliability/Yield) to executives, and lead cross-functional problem-solving. They will also drive all RF module and component vendor meetings and ensure that the vendors are adhering to the internal processes. WME will be responsible for formulating component and module development guidelines. The position will support multiple product lines from the Hardware Technology organization from early concept through ramp."}, "200452073": {"jobID": "200452073", "origin_search": null, "posted": "Dec 22, 2022", "jobTitle": "Wireless Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452073/wireless-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BSEE or equivalent with + 3 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "4-10 years of wireless/RF industry experience with preferred 2 or more years of wireless module development experience from early concept to MP for consumer electronic devices.Strong RF design background. Additional experience in packaging, product engineering, ATE, and reliability engineering is highly desirable.Strong data analysis skills including yield analysis (Cpk), and retest rate analysis, required for data sheet closuresAbility to define best engineering methods for custom Wireless module and component development during prototyping phase.Excellent problem-resolution skills are expected to address technical issues during development and rampVery good communication skills, verbal and written, including the capability to drive meetings to make key decisions on wireless technologies.Experience in setting up project schedules and work breakdown structures while communicating risks with prioritization is a plus.Ability to travel internationally.Minimum BSEE or equivalent with + 3 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! \nThe Wireless Module Engineer (WME) is well-versed in multiple fields for wireless module development: RF design, packaging, product engineering (including yield analysis), ATE, and reliability engineering. The WME will use their expertise to develop wireless modules from early concept to ramp, communicate risks/priorities (Design/Reliability/Yield) to executives, and lead cross-functional problem-solving. They will also drive all RF module and component vendor meetings and ensure that the vendors are adhering to the internal processes. WME will be responsible for formulating component and module development guidelines. The position will support multiple product lines from the Hardware Technology organization from early concept through ramp."}, "200100523": {"jobID": "200100523", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Digital Sculptor (All levels)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200100523/digital-sculptor-all-levels?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Our team includes people with various backgrounds including: Industrial Design, Transportation Design, Computer Graphics, 3D Animation/Modeling, Architecture, Fine Arts and Engineering from all over the world."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "A strong passion and enthusiasm for pursuing a lasting career in the craft of 3D modeling.Proficiency in NURBS modeling is preferred (i.e. Alias, Rhino, etc.), as is the ability to go beyond the limitations of software tools and manually manipulate or refine surfaces.An understanding of solid modeling CAD programs is a plus.Candidates must enjoy working at a fast pace and possess perseverance, excellent problem solving, organization, and interpersonal skills.Experience in industrial design, digital design, model making, product design, or related field is desired; however, recent graduates with advanced surface modeling skills will also be considered.Any level modeler is encouraged to apply.Our team includes people with various backgrounds including: Industrial Design, Transportation Design, Computer Graphics, 3D Animation/Modeling, Architecture, Fine Arts and Engineering from all over the world.Please submit resume and portfolio in PDF format, emphasizing 3D modeling ability to  digitalsculptor@apple.com", "jobDescription": "Digital sculptors on the Apple Industrial Design Team take projects from concept models to final production surfaces and are responsible for the production data sets.   \n\nWe are a group of imaginative, problem solving, creative people always looking to hone the craft of sculpting. We work hand in hand with Industrial Designers and partner closely with engineers, artists, model makers and vendors. A culture of technical excellence, learning and growth is fostered by a diverse and close knit team that has fun working side by side with the designers in the Apple Design Team. The sculpting team is crucial to the design and development of all current and future Apple products."}, "200290595": {"jobID": "200290595", "origin_search": null, "posted": "Sep 21, 2021", "jobTitle": "HID - CI/DevOps Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200290595/hid-ci-devops-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or related field, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Excellent verbal, written communication and teamwork skillsExcellent analytical and problem‐solving skillsExperience in setting up, configuring and managing Jenkins servers and nodesProficient in Java and Groovy, as well as a good experience with jenkinsfilesProficient in scripting languages such as Python or BashProficient in Mac and Linux environmentsSelf-motivated, pro-active and solution-oriented individualBS degree in Computer Science or related field, or equivalent work experience-  Experience with firmware-  Fluency in C, C++, Objective-C-  Knowledge in web UI design-  Knowledge in web services implementation-  Knowledge in database implementation and design-  Knowledge of iOS development environment and tool stack-  Knowledge in configuration management tool such as Puppet or Chef-  Knowledge in containerization technologies such as Docker or Kubernetes-  Knowledge in logging and visualization technologies such as Splunk-  Knowledge in artifact management technologies such as Artifactory or AWS S3", "jobDescription": "Come join a team of creative and enthusiastic engineers responsible for next-generation Human Input Devices for iPhone, iPad, Mac, Accessories and more! We are looking for hardworking, energetic and self-driven CI / DevOps engineers with an innate passion for making things faster and a commitment to automate everything, someone who will always find the best ways to make the team more efficient by reducing tedious work as much as possible, to focus on what is truly important.\n\nYou need to have a strong automation background and a willingness to bring your experience and good practices to a firmware and algorithms development environment. Our team is responsible for partnering with developers and making the services we create faster and more resilient to failure. You will be part of the automation effort on big projects in Apple HID, creating automation infrastructure and helping make decisions from the ground up.\n\nAs a member of our HID organization, you will also have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple's customers every day. In this role, you will be at the focal point of many multi-functional interactions with the firmware, algorithms, software, and QE teams."}, "200458806": {"jobID": "200458806", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Cellular RF Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458806/cellular-rf-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BSEE with 10+ years of directly relevant experienceStrong experience with radio hardware design and/or RF component designFamiliarity with the challenges of development for high-volume manufacturingHands on experience with RF circuits and hardware on the lab benchUnderstanding of core technologies and physics that drive innovative RF performanceProficient in wireless communications standards, wireless technology and communications market trends.Excellent written and verbal communicator, proven track record of working in a dynamic multi-functional teamWell organized and have the ability to be flexible in a changing work environment.Cellular Handset experience (preferred, not required)Experience with RF simulation tools (ADS, HFSS, Matlab) (preferred, not required)Experience with Python for test setup automation and data analysis (preferred, not required)BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Are you ready to join our RF Hardware Design team?\n\nThe RF Hardware Design Engineer will design, develop, and optimize radio frequency (RF) hardware circuits and systems for wireless communications devices. The engineer will be responsible for development and integration of cellular radio platforms, and will be involved from initial concept study to the mass production phase. Some international and domestic travel may be required."}, "200310819": {"jobID": "200310819", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Sr Software Engineer (Java), IS&T Admin", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200310819/sr-software-engineer-java-is-t-admin?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS degree in computer science or information management plus 8-10 years of experience, or MS degree plus 6-7 years, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum 8+ years experience in designing and developing scalable enterprise level solutionsKnowledge and experience with Digital Asset Management systemsSolid understanding of web applications development using Java/J2EE, Java frameworks and Linux and applications of frameworks and patternsProven skills and Hands-on programming experience in Java/J2EE, Java frameworks and patternsExperience in building, orchestrating, and deploying highly scalable REST based stateless APIs/web services for web applications / mobile clientsAbility to match technical approaches and investments to business goals and size technical efforts accurately with partnersExcellent written and verbal communication skillsExperience in Kafka, Elasticsearch and AWS is an added advantageExperience in handling implementation challenges in the area of architecture, design, integration, infrastructure and scaleAbility to review the technical design and perform code review with the developersExperience with CI & CD tools like Jenkins, Maven, Hudson etcSolid knowledge of software development life cycle including agile methods and ability to adjust for what works bestBS degree in computer science or information management plus 8-10 years of experience, or MS degree plus 6-7 years, or equivalent.", "jobDescription": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job. \n\nThe Partner Solutions team is looking for an experienced Java Software Engineer to architect and develop highly scalable, reliable and multi-tenant Digital Asset Management solution for Apple Business teams. In this role you will be partnering with cross functional teams across Apple. You will collaborate with our business leaders and other partners to implement these new solutions. The candidate must be able to work independently, understand the needs and build the solutions for sophisticated architecture and comfortable working under pressure at times."}, "200462214": {"jobID": "200462214", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Mac System Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462214/mac-system-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 10+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Subject matter expert and strong understanding of personal computing systems and product designPossesses strong technical breadth across several computer subsystem technologies, e.g., CPU, GPU, storage, memory, audio, display, input devices, power delivery, power management, networking, wireless, I/O, thermal management, cameras and sensorsAble to create, review and approve engineering requirement specification documentsUnderstands schematics, PCB layout & designs; has experience in bring-up, system debug and hands-on lab environmentsComprehends the roles of HW/FW/SW layers and how they interact in system designHas strong analytic, verbal, written and communication skills. Able to summarize and effectively communicate technical issues and actions to key stakeholders and leadership teamsMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 10+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you.", "jobDescription": "The Mac System Architecture team seeks an outstanding computer systems or technology architect to influence and drive new product designs. This position is a multi-disciplinary and cross-functional lead engineering role encompassing all aspects of computer system design. The candidate will have the skills and experience to create system architectures, surprise and delight our customers, and advance our products’ performance, size, power, thermal and cost goals.\nIf this role sounds like a fit, please consider applying!"}, "200462199": {"jobID": "200462199", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Mac System Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462199/mac-system-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 10+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Subject matter expert and strong understanding of personal computing systems and product designPossesses strong technical breadth across several computer subsystem technologies, e.g., CPU, GPU, storage, memory, audio, display, input devices, power delivery, power management, networking, wireless, I/O, thermal management, cameras and sensorsAble to create, review and approve engineering requirement specification documentsUnderstands schematics, PCB layout & designs; has experience in bring-up, system debug and hands-on lab environmentsComprehends the roles of HW/FW/SW layers and how they interact in system designHas strong analytic, verbal, written and communication skills. Able to summarize and effectively communicate technical issues and actions to key stakeholders and leadership teamsMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 10+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you.", "jobDescription": "The Mac System Architecture team seeks an outstanding computer systems or technology architect to influence and drive new product designs. This position is a multi-disciplinary and cross-functional lead engineering role encompassing all aspects of computer system design. The candidate will have the skills and experience to create system architectures, surprise and delight our customers, and advance our products’ performance, size, power, thermal and cost goals. \n\nIf this role sounds like a fit, please consider applying!"}, "200462210": {"jobID": "200462210", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Mac System Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462210/mac-system-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 5+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Subject matter expert and strong understanding of personal computing systems and product designPossesses strong technical breadth across several computer subsystem technologies, e.g., CPU, GPU, storage, memory, audio, display, input devices, power delivery, power management, networking, wireless, I/O, thermal management, cameras and sensorsAble to create, review and approve engineering requirement specification documentsUnderstands schematics, PCB layout & designs; has experience in bring-up, system debug and hands-on lab environmentsComprehends the roles of HW/FW/SW layers and how they interact in system designHas strong analytic, verbal, written and communication skills. Able to summarize and effectively communicate technical issues and actions to key stakeholders and leadership teamsMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 5+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you.", "jobDescription": "The Mac System Architecture team seeks an outstanding computer systems or technology architect to influence and drive new product designs. This position is a multi-disciplinary and cross-functional lead engineering role encompassing all aspects of computer system design. The candidate will have the skills and experience to create system architectures, surprise and delight our customers, and advance our products’ performance, size, power, thermal and cost goals. \n\nIf this role sounds like a fit, please consider applying!"}, "200448163": {"jobID": "200448163", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "GNSS Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448163/gnss-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 3 years of relevant industry experience is required\nBS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in wireless SoC or system validation.Knowledge of wireless SoC, microprocessor, memory, peripherals, I/O characterization.Experience with digital interfaces such as USB/SPMI/SPI/UART/I2C/JTAG.Familiarity with lab equipment such as logic analyzer, spectrum analyzer, signal generators, etc.Experience with version control (Git) and issue tracking tools (JIRA).Validation knowledge of wireless system, digital signal processing and statistics is preferable.Strong Python programming required, C/C++ and other scripting preferred.Experience of hardware design, verification, board design, FPGA, schematics/layout is a plus.GNSS/Cellular validation experience preferred.Strong written and verbal communication skills.BS + 3 years of relevant industry experienceBS + 3 years of relevant industry experience is required\nBS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Do you like to solve problems? \n\nGlobal Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13,000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. \n\nOur GNSS team is part of Apple's cellular SoC team. We are a vertically coordinated engineering team spanning RF, mixed-signal analog design, systems engineering, RTL design, DV, firmware and software engineering, test, and validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Validation Engineer, you will be a key member of our highly innovative GNSS design team, developing GNSS technology and SoC for novel ultra-low-power location-based applications."}, "200451271": {"jobID": "200451271", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "PHY Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451271/phy-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS \n10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "We are looking for an extensive technical background in one or more of the following:Strong embedded SW fundamentals, including knowledge of design and development-flows, real-time constraints, concurrency, multi-processor systems, caching and virtual memory.Deep understanding of data structures, object-oriented design, and system architecture in an embedded environmentStrong software engineering skills including design, development (using C, C++), scripting (Python), and debuggingFamiliarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management.Experience with configuration (GIT, Perforce) and release management, continuous integration, unit and regression testing.Strong understanding of design strategies for maintainability, scalability, and code reuse.Excellent communication skills – both written and oral.Highly organized, motivated and passionate about driving resultsBS \n10 years of experience", "jobDescription": "At Apple, new way of thinking and insights can turn in to extraordinary products very quickly. The success we are striving will be result of highly skilled team working in an environment that nurtures creativity, partnership and novelty in solving tough problems. As a firmware engineer in the Wireless Connectivity Silicon Team, you will be responsible for the design, development, and bringup of innovative wireless silicon for various Apple’s products. Bringing your passion and dedication will lead to innovative silicon solutions for Apple products.\n\nJoin us! We are looking for a forward-thinking, dedicated, highly competent, experienced firmware engineers to design, develop and bringup fresh silicon for Apple's products - the iPhone, Mac and more! New challenges arise every day that require sharp problem-solving skills of individuals. Are you ready to take on this challenge?"}, "200451122": {"jobID": "200451122", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "PHY Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451122/phy-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for an extensive technical background in one or more of the following:Strong embedded SW fundamentals, including knowledge of design and development-flows, real-time constraints, concurrency, multi-processor systems, caching and virtual memory.Deep understanding of data structures, object-oriented design, and system architecture in an embedded environmentStrong software engineering skills including design, development (using C, C++), scripting (Python), and debuggingFamiliarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management.Experience with configuration (GIT, Perforce) and release management, continuous integration, unit and regression testing.Strong understanding of design strategies for maintainability, scalability, and code reuse.Excellent communication skills – both written and oral.Highly organized, motivated and passionate about driving resultsBachelors Degree\n10 years of industry experience", "jobDescription": "At Apple, new way of thinking and insights can turn in to extraordinary products very quickly. The success we are striving will be result of highly skilled team working in an environment that nurtures creativity, partnership and novelty in solving tough problems. As a firmware engineer in the Wireless Connectivity Silicon Team, you will be responsible for the design, development, and bringup of innovative wireless silicon for various Apple’s products. Bringing your passion and dedication will lead to innovative silicon solutions for Apple products.\n\nJoin us! We are looking for a forward-thinking, dedicated, highly competent, experienced firmware engineers to design, develop and bringup fresh silicon for Apple's products - the iPhone, Mac and more!. New challenges arise every day that require sharp problem-solving skills of individuals. Are you ready to take on this challenge?"}, "200465189": {"jobID": "200465189", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Camera Module Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465189/camera-module-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors, Masters, or PhD in a relevant field (Mechanical Engineering, Mechatronics Engineering, \nElectrical Engineering, Optics, or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "This role requires the ability to learn quickly and become familiar with several different technology areas. At least 2+ years relevant experience in camera technology or related electronics industry. Ability to lead a cross-functional team of Apple and vendor engineers to address complex, time-critical problems is a key requirement. Able to communicate and convey ideas clearly and concisely.The applicant will be familiar with at least 3 of the skills listed below:Design and tolerance analysis of highly constrained, high-volume actuators or translational mechanisms.Electronic circuit and system design including power and signal integrity.Understanding of geometric optics and image quality evaluation including test charts, algorithms, and lighting.Image sensor design or characterization.Compact module manufacturing processes such as sensor attachment, flex attachment, active alignment, etc.Failure analysis techniques such as optical microscopy, X-ray, CT scans or SEM. Demonstrated ability in root-cause and corrective-action analysis.Proficiency in statistical analysis, data reporting, and visualization.Proven track record of successfully delivering new products into mass production on time, meeting yield and efficiency targets.Bachelors, Masters, or PhD in a relevant field (Mechanical Engineering, Mechatronics Engineering, \nElectrical Engineering, Optics, or equivalent)", "jobDescription": "Do you love taking on big challenges that require exceptionally creative solutions? Imagine what you \ncould do here. At Apple, new ideas have a way of becoming outstanding products, services, and \ncustomer experiences very quickly. \n\nBring passion and dedication to your job and there's no telling what you could accomplish. The \nCamera Hardware Engineering group is responsible for all research, design, development, test, and \nqualification of camera hardware for Apple products. We are searching for extraordinary Hardware \nEngineers to take ownership in the development of very high-performance compact camera modules. We are seeking an engineer to take leadership of camera hardware projects in engagements with \nproduct and technology teams for Multiple-Camera Design and Integration."}, "200451292": {"jobID": "200451292", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "PHY Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451292/phy-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine, CA", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS\n10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "We are looking for an extensive technical background in one or more of the following:Strong embedded SW fundamentals, including knowledge of design and development-flows, real-time constraints, concurrency, multi-processor systems, caching and virtual memory.Deep understanding of data structures, object-oriented design, and system architecture in an embedded environmentStrong software engineering skills including design, development (using C, C++), scripting (Python), and debuggingFamiliarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power management.Experience with configuration (GIT, Perforce) and release management, continuous integration, unit and regression testing.Strong understanding of design strategies for maintainability, scalability, and code reuse.Excellent communication skills – both written and oral.Highly organized, motivated and passionate about driving resultsBS\n10 years of experience", "jobDescription": "At Apple, new way of thinking and insights can turn in to extraordinary products very quickly. The success we are striving will be result of highly skilled team working in an environment that nurtures creativity, partnership and novelty in solving tough problems. As a firmware engineer in the Wireless Connectivity Silicon Team, you will be responsible for the design, development, and bringup of innovative wireless silicon for various Apple’s products. Bringing your passion and dedication will lead to innovative silicon solutions for Apple products.\n\nJoin us! We are looking for a forward-thinking, dedicated, highly competent, experienced firmware engineers to design, develop and bringup fresh silicon for Apple's products - the iPhone, Mac and more!. New challenges arise every day that require sharp problem-solving skills of individuals. Are you ready to take on this challenge?"}, "200460516": {"jobID": "200460516", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Engineering Development Test Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460516/engineering-development-test-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Degree in STEM, engineering or technical field desired"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Outstanding verbal and written communication skillsComfortable in a dynamic development environmentAbility to effectively communicate and engage with engineering teamsOutstanding team leadership and driven to innovateStrong ability to task manage and prioritize multiple test requestsExperience with tools such as Jira, confluence, and data visualization tools.Engineering background working with complex hardware & software systemsExpert in operational security/securing sensitive hardwareStrong ability to adapt to change and perform under pressureHistory of operational and developmental test planning in dynamic environments (desired)Operational safety experience (desired)Operational/developmental test experience (desired)Degree in STEM, engineering or technical field desired", "jobDescription": "The Engineering Developmental Test Lead is responsible for supporting asset monitoring, inventory, changing management, processes’ and systems integration. A successful Engineering Developmental Test Lead is a natural leader and facilitator; is driven, organized and detail oriented; excels in program/ project management; communicates with ease at all levels; thrives in an ambiguous, ever fluid environment; is adept at taking action and resolving conflict; manages through relationships and influence; possesses a ‘Safety First - Mission Always’ mindset; and is at ease in high stress environments."}, "200436287": {"jobID": "200436287", "origin_search": null, "posted": "Oct 17, 2022", "jobTitle": "Haptics Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436287/haptics-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or Computer Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong C/C++ and object-orientated programming and debugging skillsExpertise in developing system software such as drivers or frameworksExperience with profiling code in both kernel and user-spaceAbility to quickly familiarize yourself with code you’ve never seen before, and understand thepertinent functionalityAbility to apply software best-practices at both higher and lower levels of softwareExperience working with microcontrollers or sensors preferredExperience crafting SW interfaces or APIs with customer-facing features preferredIndependent work ethic with strong attention to detailExcellent communication and teamwork skillsBS/MS in Computer Science or Computer Engineering", "jobDescription": "We are looking for a creative, motivated, and hard-working software engineer to develop drivers, frameworks, and tools for haptics-enabled next-generation Apple products, including iPhone, Watch, and Mac. Come join a tightly-integrated team of hardworking engineers to deliver world- class haptic experiences that will be enjoyed by millions of customers! In this role you’ll collaborate with teams across the company, including firmware, algorithms, UI, and design teams to deliver a coordinated customer experience."}, "200455299": {"jobID": "200455299", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455299/soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to tackle diverse challengesMinimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200452077": {"jobID": "200452077", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Wireless Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452077/wireless-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BSEE or equivalent with + 10 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "4-10 years of wireless/RF industry experience with preferred 2 or more years of wireless module development experience from early concept to MP for consumer electronic devices.Strong RF design background. Additional experience in packaging, product engineering, ATE, and reliability engineering is highly desirable.Strong data analysis skills including yield analysis (Cpk), and retest rate analysis, required for data sheet closuresAbility to define best engineering methods for custom Wireless module and component development during prototyping phase.Excellent problem-resolution skills are expected to address technical issues during development and rampVery good communication skills, verbal and written, including the capability to drive meetings to make key decisions on wireless technologies.Experience in setting up project schedules and work breakdown structures while communicating risks with prioritization is a plus.Ability to travel internationally.Minimum BSEE or equivalent with + 10 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! \n\nThe Wireless Module Engineer (WME) is well-versed in multiple fields for wireless module development: RF design, packaging, product engineering (including yield analysis), ATE, and reliability engineering. The WME will use their expertise to develop wireless modules from early concept to ramp, communicate risks/priorities (Design/Reliability/Yield) to executives, and lead cross-functional problem-solving. They will also drive all RF module and component vendor meetings and ensure that the vendors are adhering to the internal processes. WME will be responsible for formulating component and module development guidelines. The position will support multiple product lines from the Hardware Technology organization from early concept through ramp."}, "200461513": {"jobID": "200461513", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "GPU Performance Modeling Engineer - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461513/gpu-performance-modeling-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Cambridge", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience. Degree in Computer Science, Electrical Engineering or Computer Engineering is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong knowledge and experience in GPU architecture, micro-architecture design, or performance analysis with an emphasis on hardware/software co-designStrong software skills and proficiency in C/C++ and a scripting language such as Python or RubyExperience working on performance model development and experimentation (GPU or CPU)Knowledge and experience with GPU performance benchmarks and workloadsStrong interpersonal skills and creativity to help the team solve design challengesKnowledge of 3D graphics APIs, operating system internals, and compiler technology a plusBS and 10+ years of relevant industry experienceBS and 10+ years of relevant industry experience. Degree in Computer Science, Electrical Engineering or Computer Engineering is preferred.", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. Join us to help deliver the next groundbreaking Apple product!\n\nWe are seeking a highly motivated, innovative, and dedicated engineer to join the Platform Architecture GPU Performance Modeling Team; we are a group that is driving advanced exploration for next generation GPU architectures and micro-architectures in iPhone, iPad and Mac products. We rely on strong analytical skills and close collaboration to deliver the best overall solution to our customers. In this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting highly performant products to millions of customers quickly."}, "200452590": {"jobID": "200452590", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Cellular Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452590/cellular-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be essential for this role to design algorithms related to channel state feedback, digital precoding and analog beamforming, channel estimation, interference mitigation, MIMO detection, multi-user MIMO, timing and frequency recovery, automatic gain control, RF impairments estimation and correction, forward-error correction, OFDM, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in algorithm design and optimization for embedded applications, complexity analysis and mapping to vector signal processors, memory requirements, real-time vs non-real time requirements, etc.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc.Knowledge of cellular communication standards and call flows: 5G NR (FR1 and FR2), 4G LTE, link adaptation, Channel state information feedback.Strong analytical skills (linear algebra, random processes, detection and estimation, filter design, machine learning, etc.)BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200452594": {"jobID": "200452594", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Cellular Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452594/cellular-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be essential for this role to design algorithms related to channel state feedback, digital precoding and analog beamforming, channel estimation, interference mitigation, MIMO detection, multi-user MIMO, timing and frequency recovery, automatic gain control, RF impairments estimation and correction, forward-error correction, OFDM, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in algorithm design and optimization for embedded applications, complexity analysis and mapping to vector signal processors, memory requirements, real-time vs non-real time requirements, etc.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc.Knowledge of cellular communication standards and call flows: 5G NR (FR1 and FR2), 4G LTE, link adaptation, Channel state information feedback.Strong analytical skills (linear algebra, random processes, detection and estimation, filter design, machine learning, etc.)BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200462276": {"jobID": "200462276", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Camera Module Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462276/camera-module-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors, Masters, or PhD in a relevant field (Mechanical Engineering, Mechatronics Engineering, Electrical Engineering, Optics, or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "This role requires the ability to learn quickly and become familiar with several different technology areas. At least 2+ years relevant experience in camera technology or related electronics industry. Ability to lead a cross-functional team of Apple and vendor engineers to address complex, time-critical problems is a key requirement.The applicant will be familiar with at least 3 of the skills listed below:Design and tolerance analysis of highly constrained, high-volume actuators or translational mechanisms.Electronic circuit and system design including power and signal integrity.Understanding of geometric optics and image quality evaluation including test charts, algorithms, and lighting.Image sensor design or characterization.Compact module manufacturing processes such as sensor attachment, flex attachment, active alignment, etc.Failure analysis techniques such as optical microscopy, X-ray, CT scans or SEM. Demonstrated ability in root-cause and corrective-action analysis.Proficiency in statistical analysis, data reporting, and visualization.Proven track record of successfully delivering new products into mass production on time, meeting yield and efficiency targets.Bachelors, Masters, or PhD in a relevant field (Mechanical Engineering, Mechatronics Engineering, Electrical Engineering, Optics, or equivalent)", "jobDescription": "Do you love taking on big challenges that require exceptionally creative solutions? Imagine what you could do here. At Apple, new ideas have a way of becoming outstanding products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Camera Hardware Engineering group is responsible for all research, design, development, test, and qualification of camera hardware for Apple products. We are searching for extraordinary Hardware Engineers to take ownership in the development of very high performance compact camera modules. We are seeking an engineer to take leadership of camera hardware projects in engagements with product and technology teams for Multiple-Camera Design and Intregration."}, "200287293": {"jobID": "200287293", "origin_search": null, "posted": "Oct 24, 2022", "jobTitle": "Cellular Protocol Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200287293/cellular-protocol-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum of  2 years experience with cellular protocol stacksStrong Software Engineering skills including design, programming (C, C++, script) and debuggingExperience in 3G, 4G or 5G NR technology is a strong plus.Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP/ETSI standardsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200454945": {"jobID": "200454945", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200454945/cpu-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceYou should have experience in CPU performance architecture, micro-architecture design, or performance analysisStrong CPU architecture knowledge, micro-architecture knowledge, and an understanding of competing architecturesExperience working in a performance modeling environmentProficient in C and C++Proficient in scripting languages such as Perl, Python, and RubyAbility to problem solve and prove your own ideasKnowledge and experience with common performance benchmarks and workloadsKnowledge of OS internals and compiler technology a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200451794": {"jobID": "200451794", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CPU Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451794/cpu-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceYou should have experience in CPU performance architecture, micro-architecture design, or performance analysisStrong CPU architecture knowledge, micro-architecture knowledge, and an understanding of competing architecturesExperience working in a performance modeling environmentProficient in C and C++Proficient in scripting languages such as Perl, Python, and RubyAbility to problem solve and prove your own ideasKnowledge and experience with common performance benchmarks and workloadsKnowledge of OS internals and compiler technology a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200452847": {"jobID": "200452847", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452847/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong understanding of micro-processor architectureGood knowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerExperience with scripting languages such as Python, Perl, or TclKnowledge of software tool chains including including compilers, assemblers, and source control toolsBackground in silicon bring-up and debug experience a plusAbility to work well in a team, but to be responsible and self-driven.BS and a minimum of 10 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world?   Join our team of experienced SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200452823": {"jobID": "200452823", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452823/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Understanding of micro-processor architectureMinimum of 3 years industry experienceGood knowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerExperience with scripting languages such as Python, Perl, or TclKnowledge of software tool chains including including compilers, assemblers, and source control toolsBackground in silicon bring-up and debug experience a plusAbility to work well in a team, but to be responsible and self-driven.BS and a minimum of 3 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world?   Join our team of experienced SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200400482": {"jobID": "200400482", "origin_search": null, "posted": "Aug 5, 2022", "jobTitle": "Hardware Architecture Team Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200400482/hardware-architecture-team-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S./M.S. EE with 15+ years or Ph.D. EE with 10+ of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$183,500", "max": "$334,500,"}, "benefits": null, "requirements": "Extensive experience with system architecture and associated tradeoffs for complex electronic systems that span hardware, software and mechanical aspectsExcellent communication skills  and demonstrated ability to work cross-functionally with a wide range of stakeholders including EE design, software, mechanical engineering, thermal, etc.Ability to develop system architecture options that meet requirements, analyze system performance, and make recommendations based on various optimization criteria.Strong system modeling experience at functional and physical levels, preferably in SysML and/or Matlab Simulink.Familiarity with autonomous systems and associated technologies including high performance compute, sensing and actuation sub-systems.Working knowledge of CAN, LIN, Ethernet, and high-speed serial links5+ years of technical managerial experienceB.S./M.S. EE with 15+ years or Ph.D. EE with 10+ of relevant industry experience", "jobDescription": "The Special Project Group (SPG) at Apple is currently looking for an exceptional candidate to lead the Hardware Architecture Team.  The Hardware Architecture Team is responsible for defining and specifying hardware architecture for Apple’s autonomous system development. \n\nDoes working on autonomous technology excite you? If you're passionate about the user experience and want to be part of a group that works on shaping very early-stage technology, we may be the team for you!"}, "200465924": {"jobID": "200465924", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Media IP Subsystem Platform Validation Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465924/media-ip-subsystem-platform-validation-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience with SoC pre-/post-silicon or platform level validation, technical program management/engineering management experience. Exposure to different media technologies.Exposure to AR/VR technologies and use cases is a plus.SOC Media IP architecture experience is a plus.Self-motivated and dedicated with validated creative and critical thinking capabilities.Extraordinary leadership with a collaborative mentality.Excellent communication and organizational skills.Experience working in a dynamic multi-disciplined engineering environment, strong at multi-tasking.Ability to filter and distill relevant information for the right audience.Dedication to own/drive project planning and development using well-defined metrics.Experience with Digital Video Signal Processing is a plus.BS + 10 years of relevant experience", "jobDescription": "Do you want to apply your engineering background to make big things happen? Can you influence, connect, get results, and communicate optimally? Come to Apple and work with a diverse team to deliver innovative technologies to our customers. This is an excellent opportunity to engage in groundbreaking media (Display, Camera and Codecs) technologies and contribute to new Apple products year after year.\n\nWe are looking for a dedicated Engineering Program Manager or a technical leader who is passionate about getting into program management and encouraging the team to collaborate and deliver innovative designs within schedule constraints. The ideal candidate needs to be able to dig into sophisticated technical topics while balancing the strategic needs of the project and the tradeoffs involved in technology development.\n\nAs a SoC media Validation EPM within the Hardware Technology Team, you will be leading the E2E validation for driving display, camera and codec sub-systems starting from the early architecture, pre-silicon and post-silicon to mass production. You will be working closely with the Technology Development Group, hardware, silicon, software and validation teams to build products that surprise and delight our customers."}, "200450621": {"jobID": "200450621", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "Pixel Development Engineer - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450621/pixel-development-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Pasadena", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. in Electrical or computer engineering or a similar discipline is required, M.S. or Ph.D. is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "You will have 5+ years of relevant experience in image sensor pixel and sensor development, sensor characterization, sensor bring up and debug, or wafer level testingFamiliar with image sensor technology, image sensor performance metrics, image sensor usage, and integration into camera systems.You will also be aware of general industry trends and technical challenges.Knowledgeable enough in all aspects of sensor usage that you can productively work with and support the camera team.Hands-on experience with silicon bringup, sensor characterization and issue debug. Ability to innovate and build new and unique solutions.Proficiency with data analysis tools (JMP, MATLAB, Excel, etc)Excellent written and verbal communication skills and solid teamwork and leadership skillsB.S. in Electrical or computer engineering or a similar discipline is required, M.S. or Ph.D. is preferred", "jobDescription": "Why Apple?\n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.\n\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\nThe Camera Hardware Engineering group is responsible for all research, design, development, test, and qualification of camera hardware for Apple products. As a key member of the Core Sensing Devices team, you will be responsible for image sensor evaluation from global suppliers, development of new image sensors for different applications, general problem solving, and implementation of new features. In this role, you will be at the center of image sensor development effort, and you will work with cross functional teams in many aspects of your daily activities."}, "200452155": {"jobID": "200452155", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "IC Packaging Simulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452155/ic-packaging-simulation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Proven capability in mechanics and mathematics.Hands-on experience of major FEM tools (e.g., ANSYS, ABAQUS, Hypermesh, etc.).Proficiency with numerical simulation software tools and expert in Matlab and/or Scientific Python.Deep understanding of packaging materials and their mechanical behaviors.Knowledge of electronic packaging structures and processes, as well as its reliability, and package qualification requirements is a huge plus.Able to perform independent research and development work.Excellent written and verbal communication skills with ability to present ideas, design concepts, data and plan with high confidence at team meetings.- BS and 3+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? \n\nWe are looking for a self-motivated Packaging Simulation Engineer who is proficient in FEM simulation with multi-year FEM software ANSYS or ABAQUS.\n\nThis position requires someone familiar with development process of simulation and characterization projects, that thrives in a multifaceted collaborative organization."}, "200451825": {"jobID": "200451825", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CPU Post-Silicon Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451825/cpu-post-silicon-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceExperience with CPU architecture and micro-architecture conceptsExperience working in a performance modeling environmentExperience with tracing on silicon for performance evaluationProficient in scripting languages such as Python or PerlComfortable with C and C++Knowledge and experience with common performance benchmarks and workloadsKnowledge of OS internals and compiler technology is a plusExperience in analyzing application performanceMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200451495": {"jobID": "200451495", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "PMU Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451495/pmu-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Typically requires a minimum of 3 years of experience in the areas of silicon validation, board-level hardware design, or IC design.Strong bring-up & debugging skills and hands-on lab work. Experience with sophisticated test equipment setups for analog measurement.Proven experience with debug, and performance analysis of analog circuits, voltage regulators, and power distribution for high-speed digital ICs.Basic software automation skills in (ex. Python, LabVIEW, TestStand).Mentoring and training for junior validation engineers.Effective communication skills working across large multi-functional HW, SW, architecture teams.Provide feedback on board-level HW design requirements, and support ATE test and reliability test planning.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \nThe PMU team is looking for qualified, motivated silicon validation engineers from a variety of skill levels. We are a fast-growing and highly diverse group, and you will work as part of a team doing post-silicon bring- up, debug, and validation of analog and power ICs that will drive the next generation of technology for Apple products. This team not only provides an environment optimal for the refinement of engineering abilities, but also promotes passion, creativity, and teamwork. As you work alongside world-class IC designers and product teams building the most technologically advanced products in the world, you will find the PMU validation team to be a highly dynamic work environment with endless learning opportunities."}, "200458489": {"jobID": "200458489", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Formal Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458489/formal-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Interest in learning and becoming an expert in SoC/CPU/GPU/Cellular designs, VLSI, and digital logic design and verification techniquesDetail oriented mindset and desire to overcome challenges is requiredBS and a minimum of 3 years relevant industry experience.-  Formal Method or Formal Verification technologies experience and abstraction techniques-  Knowledge and experience in interpreting hardware specifications and using-  Temporal logic assertion-based languages such as SVA or PSL-  Experience in using EDA formal tools and tool development experience is a plus-  Proficiency in any scripting language with excellent debugging skills-  Extraordinary teammate with excellent interpersonal skills-  Passionate about developing world-class/innovative formal verification solutions", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nLearn from the best Formal Verification team in the world and acquire experience being at the center of a System-on-a-chip (SoC) design verification effort collaborating with design. Are you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly."}, "200448954": {"jobID": "200448954", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "Wireless Systems Engineer – RF Systems Cellular", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448954/wireless-systems-engineer-rf-systems-cellular?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 10+ years relevant experience required. MS/PHD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficiency in RF, Demodulation and RRM aspects of 3GPP, GCF, PTCRB / GCF and carrier conformance requirements and implications to device and test equipment architectures, and performance tradeoffsDirect hands-on experience with and proficient knowledge of underlying theory and techniques used in 2G, 3G, 4G LTE cellular technologies. Proficiency in 5G-FR1 or 5G-mmWave cellular technology is a plusProficiency in cellular transceiver and RF front end architectures and performance tradeoffsExperience and a deep understanding of system level RF Parametric its sources in RF component characteristics and behaviorProficiency in hands-on system level debug and optimization at RF conducted system level or radiated levelDeep knowledge of test set-ups of complex RF test equipment for hardware validationExperience with characterizing and validating devices towards 3GPP and world-wide regulatory RF standards using RF lab test equipment (Call box, Power meter, Network analyzer, Spectrum analyzer, signal generator)Proficiency in device certification processes on at least one (GCF, PTCRB) industry certifications or (FCC, EU, China) Regulatory complianceExperience with product development cycle of cellular handsetsStrong written and verbal communication skillsBS with 10+ years relevant experience required. MS/PHD preferred.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work towards ensuring Apple products conform and go beyond all applicable cellular industry standards and regulatory requirements."}, "200448162": {"jobID": "200448162", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "GNSS Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448162/gnss-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant industry experience is required\nBS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in wireless SoC or system validation.Knowledge of wireless SoC, microprocessor, memory, peripherals, I/O characterization.Experience with digital interfaces such as USB/SPMI/SPI/UART/I2C/JTAG.Familiarity with lab equipment such as logic analyzer, spectrum analyzer, signal generators, etc.Experience with version control (Git) and issue tracking tools (JIRA).Validation knowledge of wireless system, digital signal processing and statistics is preferable.Strong Python programming required, C/C++ and other scripting preferred.Experience of hardware design, verification, board design, FPGA, schematics/layout is a plus.GNSS/Cellular validation experience preferred.Strong written and verbal communication skills.BS + 10 years of relevant industry experienceBS + 10 years of relevant industry experience is required\nBS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Do you like to solve problems? \n\nGlobal Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13,000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. \n\nOur GNSS team is part of Apple's cellular SoC team. We are a vertically coordinated engineering team spanning RF, mixed-signal analog design, systems engineering, RTL design, DV, firmware and software engineering, test, and validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Validation Engineer, you will be a key member of our highly innovative GNSS design team, developing GNSS technology and SoC for novel ultra-low-power location-based applications."}, "200448157": {"jobID": "200448157", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "GNSS Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448157/gnss-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 3 years of relevant industry experience is required\nBS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience in wireless SoC or system validation.Knowledge of wireless SoC, microprocessor, memory, peripherals, I/O characterization.Experience with digital interfaces such as USB/SPMI/SPI/UART/I2C/JTAG.Familiarity with lab equipment such as logic analyzer, spectrum analyzer, signal generators, etc.Experience with version control (Git) and issue tracking tools (JIRA).Validation knowledge of wireless system, digital signal processing and statistics is preferable.Strong Python programming required, C/C++ and other scripting preferred.Experience of hardware design, verification, board design, FPGA, schematics/layout is a plus.GNSS/Cellular validation experience preferred.Strong written and verbal communication skills.BS + 3 years of relevant industry experienceBS + 3 years of relevant industry experience is required\nBS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Do you like to solve problems? \n\nGlobal Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13,000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. \n\nOur GNSS team is part of Apple's cellular SoC team. We are a vertically coordinated engineering team spanning RF, mixed-signal analog design, systems engineering, RTL design, DV, firmware and software engineering, test, and validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Validation Engineer, you will be a key member of our highly innovative GNSS design team, developing GNSS technology and SoC for novel ultra-low-power location-based applications."}, "200462030": {"jobID": "200462030", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Optical Sensing HW - Optical Sensing HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462030/optical-sensing-hw-optical-sensing-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.S/Ph.D. in Electrical Engineering, Optics or Physics. Ph.D. preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Multi-disciplinary understanding of optics, general Physics principles and basic EE concepts.Proven experience in modelling complex cross-disciplinary systemsAbility to effectively combine modelling and experimentation to drive key system design decisionsProficiency with numerical simulation software: Matlab, Python, Zemax, LightTools, etc.Excellent written and verbal communication skills, and proven collaboration and leadership skillsIndustry experience in miniaturized optical systems is preferred, but not a hard requirement.M.S/Ph.D. in Electrical Engineering, Optics or Physics. Ph.D. preferred.", "jobDescription": "Design, develop, and launch next-generation optical-sensing technologies. \nBring devices to life and enable them interact with users and the environment in ways never imagined before. The optical sensing team integrates optical sensors across a variety of Apple products such as iPhones, iPads and Macs. The optical sensing team is looking for someone who is a self-driven go-getter. Strong experience with optics, optical system design, and detectors is required. Join us in crafting solutions the world doesn't know of yet."}, "200458293": {"jobID": "200458293", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Cellular Protocol Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458293/cellular-protocol-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering, Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience in embedded system software development.Strong Software Engineering skills including design, programming (using C, C++), scripting and debuggingDemonstrated ability to write thoughtful, maintainable codeExcellent problem solving, critical thinking, and communication skillsExperience in cellular protocols or wireless software development is a plusExperience in Access Stratum is a strong plusBachelors or Masters in Electrical Engineering, Computer Science or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! We are looking for an individual who can excel in a fast-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200167620": {"jobID": "200167620", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AR/VR Accessibility Frameworks Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200167620/ar-vr-accessibility-frameworks-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience writing AR/VR or iOS applicationsAptitude for independently learning new technologiesExcellent cross-functional and communication skillsExcitement to build software that makes a tangible difference in peoplesʼ lives!BS / MS in Computer Science OR equivalent degree OR equivalent experience• Knowledge of either UIKit or AppKit APIs.• Experience with at least one of the following languages and related development tools: ObjectiveC, Swift, C++, or C• Experience with assistive technologies is nice to have, but not required.• Experience using accessibility APIs on any platform is helpful, but not required.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group is looking for an Accessibility Engineer to help us explore, define, and build accessibility solutions for the next generation of interactive computing for our platform. As a member of this team, you will have a unique opportunity to work with some of Apple's most advanced technologies (AR, VR, ML, CV) to help create empowering solutions for all users, regardless of their physical abilities."}, "200456990": {"jobID": "200456990", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Studies Program Manager, Health", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456990/studies-program-manager-health?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. degree in biomedical engineering, any engineering field or human-research related subject area"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years of shown project management experienceProven understanding of human research studies lifecycle and adaptability to varying levels of data collection requirementsStrong organizational and leadership skills with a track record of timely project deliverySelf-motivated and proactive with critical thinking and resourcefulness to drive projects to successExcellent cross-functional and executive level communication skillsAble to prioritize issues and track the details as well as be in touch with the big pictureFlexible and comfortable with ambiguity — able to rapidly optimize across many variables to problem solve and effectively guide decisionsB.S. degree in biomedical engineering, any engineering field or human-research related subject area-  Experience working with and handling vendors and/or external study sites-  Experience in budgeting and financial forecasting at a program level-  Experience in R&D or consumer product development a plus-  familiarity with the changing dynamics of research and development will help you thrive in this role-  Some travel may be required, up to approximately 10%", "jobDescription": "The Health Group conceives of and proves out exciting new technologies for Apple’s future health and wellness products. We are seeking a Studies Program Manager to lead human study efforts in collecting data critical to the development and validation of new health sensors and algorithms. Our team works in highly innovative and dynamic environment with a high sense of urgency. If this sounds like you, read on!"}, "200445945": {"jobID": "200445945", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Studies Program Manager, Health", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445945/studies-program-manager-health?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. degree in biomedical engineering, any engineering field or human-research related subject area"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years of shown project management experienceSolid understanding of human research studies lifecycle and adaptability to varying levels of data collection requirementsStrong organizational and leadership skills with a track record of timely project deliverySelf-motivated and proactive with critical thinking and resourcefulness to drive projects to successExcellent cross-functional and executive level communication skillsAble to prioritize issues and track the details as well as be in touch with the big pictureFlexible and comfortable with ambiguity — able to rapidly optimize across many variables to problem solve and effectively guide decisionsB.S. degree in biomedical engineering, any engineering field or human-research related subject area-  Experience working with and handling vendors and/or external study sites-  Experience in budgeting and financial forecasting at a program level-  Experience in R&D or consumer product development a plus - familiarity with the changing dynamics of research and development will help you thrive in this role-  Some travel may be required, up to approximately 10%", "jobDescription": "The Health Group conceives of and proves out exciting new technologies for Apple’s future health and wellness products. We are seeking a Studies Program Manager to lead human study efforts in collecting data critical to the development and validation of new health sensors and algorithms. Our team works in highly innovative and dynamic environment with a high sense of urgency. If this sounds like you, read on!"}, "200379089": {"jobID": "200379089", "origin_search": null, "posted": "May 12, 2022", "jobTitle": "Sense Hardware Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200379089/sense-hardware-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. EE/CS/Physics or M.S. with 5+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Experience developing system architecture, sensor systems analysis, and modeling.Strong fundamentals in sensor design and the impact of impairments on sensor performance.Exceptional HW/SW problem solving skills.Strong SW development skills in C/C++, Python, MATLAB programing.Strong algorithm prototyping and development experience.Good understanding of optical and/or RF sensors and signal processing.Large scale data analysis and knowledge of statistical techniques.Strong communication, documentation and presentation skills.Ph.D. EE/CS/Physics or M.S. with 5+ years of relevant industry experience", "jobDescription": "The Special Project Group (SPG) at Apple is currently looking for an exceptional candidate for a sense hardware architecture engineer. As a successful applicant you will be responsible for developing and evaluating sensing hardware architecture for autonomous systems via simulation, testing and analysis. You will work cross functionally with domains experts in sensor hardware, signal processing implementation, autonomy algorithms, systems engineering, and safety to perform system level trade-offs and provide robust assessments of architectural options. You must possess hands-on experience in sensor system modeling, data analysis, and software module development. A strong knowledge in physics of sensors, systems analysis, and algorithm development is also needed. You must feel passionate about developing complex systems with multi-disciplinary teams and delivering within aggressive timelines."}, "200336178": {"jobID": "200336178", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Wireless Embedded Software Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200336178/wireless-embedded-software-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master in Electrical Engineering, Wireless Communications or equivalent majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Experience in developing embedded real-time software for Cellular SoCsFundamental knowledge and understanding of embedded processors and real-time OS conceptsSolid understanding of baseband system/architecture (core, cache, memory, bus, interrupts, sleep/wake, clock, power control, dynamic frequency and voltage scaling, SPMI, PCIe, etc)Experience in developing low level driver software for embedded platformsExcellent software engineering skills, including driver software design, implementation, validation and debugging and proficiency in C/C++Solid experience on debugging methodologies and strategies (e.g. logging, crash analysis) for real-time embedded systems.Strong communication and interpersonal skills and ability to work in multi-disciplinary teamsEmbedded Modem development experienceMaster in Electrical Engineering, Wireless Communications or equivalent majors", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems (WTE) organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a a highly collaborative team-player who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product. In this role, you will be a key member  defining and working on Platform software design and development collaborating with Cellular Protocol Stack, RF and other teams."}, "200451997": {"jobID": "200451997", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal IP Post Silicon Validation – Data Converter", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451997/analog-mixed-signal-ip-post-silicon-validation-data-converter?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n10 years of experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in AMS test development that includes: review specification document; draft validation plan; build test bench; and perform data collection with automationStrong fundamental understanding of Data Converters, Filters, and FFT TransformationExperience in Cellular, WIFI, or BT system validation is a strong plusProficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, etc.Experienced in scripting language, Python preferred, to automate test and analyze dataDetail-oriented & Emphasis on quality of resultsInitiative in taking ownership & responsibility to drive deliverablesStrong verbal and written communication skillsHands-on lab experience including soldering/instrumenting systems is a plusBachelors Degree\n10 years of experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200450890": {"jobID": "200450890", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded 5G/4G Cellular ASIC Physical Layer Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450890/embedded-5g-4g-cellular-asic-physical-layer-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience with hardware control for physical layer 4G/5G or other modem data path processingUnderstanding of 5G and 4G 3GPP protocolsDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with C and C++, compilers, build and source code control toolsSignificant experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programmingSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs,JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a 5G/4G Cellular ASIC Physical Layer Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200438237": {"jobID": "200438237", "origin_search": null, "posted": "Nov 18, 2022", "jobTitle": "Hardware Engineer - Early Career", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438237/hardware-engineer-early-career?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Pursuing an undergraduate or graduate degree in Electrical Engineering, Computer Engineering and/or Computer Science or related field of study."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Previous internship/co-op or project work in computer architecture, VLSI, design, logic design, or circuit designStrong teamwork skills with the ability to collaborate with multiple functional teams across a variety of fieldsExperience with C/C++, Verilog, VHDL, Python, Perl, and/or Spice is beneficialCurrently enrolled in an undergraduate or graduate program in Computer Engineering, Electrical Engineering, Computer Science or related fieldsWill be graduating with a minimum of a Bachelor's degree by September 2023Pursuing an undergraduate or graduate degree in Electrical Engineering, Computer Engineering and/or Computer Science or related field of study.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Learn more about your EEO rights as an applicant.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. Learn more.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. If you’re applying for a position in San Francisco, review the guidelines applicable in your area.Apple participates in the E-Verify program in certain locations as required by law. Learn more about the E-Verify program.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace. Learn more.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you have the unrivaled and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nOur Hardware Technologies team is responsible for Apple’s breakthrough custom silicon and hardware technologies including battery, applications processors, storage controllers, sensors silicon, display silicon and other chipsets across Apple’s entire product line. \n\nYou will work among the best engineers in the world on our research and development team. We have positions within all major areas of hardware design, including, but not limited to CPU, GPU, SoC and AMS."}, "200260763": {"jobID": "200260763", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Systems Engineer - Calibration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200260763/systems-engineer-calibration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS (or PhD) in relevant field (EE, Physics, Systems Engineering, Mechatronics)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years work experience in system design, integration and productization in Consumer Electronics, Medical or Aerospace domainExpertise in one or more areas of calibration methodologies used in optics, display, motion sensing, or cameraHands-on knowledge of linear algebra concepts for computer visionKnow-how of 6DOF tracking technologiesExperience integrating cameras, displays, and motion sensors into consumer electronics products, with an understanding of optics/sensor/image pipeline is strongly preferredProficient in statistical concepts and expertise in data analysis tools like: JMP/Mini-tabExperience with prototyping/evaluating proof of concept system calibration techniques in lab environmentDetailed, disciplined, methodical approach, with good documentation habitsGreat teammate with exceptional conversational & written communication, negotiation & presentation skillsScripting skills and understanding of low level software (firmware & drivers in C or C++) a plusKnow-how of graphics rendering pipelines is a plusMS (or PhD) in relevant field (EE, Physics, Systems Engineering, Mechatronics)", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it!"}, "200459113": {"jobID": "200459113", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "CAD Engineer - PDV", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459113/cad-engineer-pdv?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Previous industry experience in Silicon chip design flowsKnowledge in Calibre/ICV runset coding for DRC/LVS/ERC/MFILL is requiredTapeout support and chip level PDV debug experience is a plusKnowledge/scripting in programming languages such as Perl, Python, Tcl, Shell, Makefile or C.Understanding in Silicon technology and experience with flow development in advanced nodesMinimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAs a member of our CAD team, you will architect, develop, maintain and improve physical design verification (PDV) flows. The role requires you to work on flow and runset development for various technology nodes and tool sets. Working alongside the CAD team, you will have the opportunity to learn and collaborate with the custom digital/analog/mixed-signal design, physical design (PD) and chip integration teams. You will need to have experience with design rule checks (DRC) and layout versus schematic (LVS) runsets, writing from scratch and/or modify existing ones. Knowledge with Dummy Metal Fill generation and Design for Manufacturability (DFM) rules is a plus."}, "200317982": {"jobID": "200317982", "origin_search": null, "posted": "Dec 1, 2021", "jobTitle": "Senior Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200317982/senior-firmware-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Expertise in C or C++ for Embedded SystemsDeep experience working with analog and digital sensorsKnowledge of embedded communication methods (e.g. UART, SPI, I2C) including specification and design of software-layer protocolsExperience implementing firmware in RTOS and bare metal environmentsProven capability to apply software best practices to firmware designsProven board bring-up and debug skillsStrong communication and collaboration skillsExperience with unit testing, static analysis, and continuous integration8+ years of relevant experience preferred", "jobDescription": "The Human Interface Device group is looking for motivated, experienced engineers to join the multitouch firmware development team. The HID group designs and ships firmware for the best sensing interfaces in the world across iPhone, iPad, AirPods, Mac, health sensors, and more. We get involved from the very earliest project phases years before a new product launch, specifying custom silicon, bringing up novel hardware with Apple’s EE teams, following through to refining the user experience with our algorithms, software, and Quality partners, and supporting factory builds of millions of units! The HID Mac multitouch firmware team develops firmware for MacBook trackpads, Mac accessories, and iPad accessories, as well as supporting other touch programs. \n\nAs our products ship to millions of customers, our team’s impact is felt around the world! We play a critical role in the design and production of Apple’s best in class MacBook input devices and touch accessories. If you join our team, you will have immediate exposure to shipping products and help shape our future roadmap as we continue to explore new architectures and technologies."}, "200448230": {"jobID": "200448230", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics (GPU) Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448230/graphics-gpu-performance-analysis-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to work well in a team and be productive under aggressive schedulesExcellent communications skills, self-motivated and well organizedProficient Python programmerStrong software debug skills is viewed as necessary for this roleExperience with Tableau and/or SplunkOpenGL/CL and/or Metal API programming experience3D graphics architecture knowledgeBS + 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? In our Silicon Technologies group we help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this role as part of the GPU Performance Analysis team, you will be responsible for developing tools and content needed to aid performance analysis, tuning, and debug of Apple’s GPU products."}, "200463649": {"jobID": "200463649", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Software Engineer - Prototyping", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463649/software-engineer-prototyping?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science, Electrical Engineering, Robotics, Physics, Applied Mathematics or related fields"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Prototype. You will be creating interactive prototypes in close collaboration with designers. Prototypes will include custom interfaces with non-linear, multi-step interactions, 3D graphics, and lots and lots of settings to experiment with different behaviors. You will build these prototypes using Apple API and frameworks and you will distribute these prototypes internally on Apple devices with unreleased, unstable hardware and software. We often prefer rapidly prototyping an experience to “building the real thing” but knowing when a component deserves to be refined and made reusable is important.Integrate. You will work with experimental internal frameworks and algorithms. This will often require Swift, Objective-C and C++. You will bridge the gap between our engineer and design collaborators to help shape both API and algorithm developmentEnable. You will work on tools and frameworks that will enable less technical people to create interactive prototypes. This may involve integration with other commonly used design apps. 3D packages, scripting languages, and environments.BS or MS in Computer Science, Electrical Engineering, Robotics, Physics, Applied Mathematics or related fields", "jobDescription": "Prototyping is an exploratory design team. We design software to explore what new hardware might bring to our current and future products. It is our job to invent and propose new features and sometimes entirely new products. Over the past decade we have incubated products like iPad, Pencil, and the Apple TV Siri Remote. We pioneered force and haptics for Multi-touch Trackpads, iPhone, and Apple Watch. We were instrumental in the interface design and development of multi-camera systems, LiDAR, TrueDepth, Face ID, Animoji, and depth photography. We express our ideas through pictures, animation, video and code. The work we do is on a 3–5-year timescale — if it makes it into a product..."}, "200437789": {"jobID": "200437789", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "AIML - Engineering Manager, Siri Personalized Behavior Modeling", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437789/aiml-engineering-manager-siri-personalized-behavior-modeling?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS in Computer Science or equivalent preferred Ph.D."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$299,000,"}, "benefits": null, "requirements": "8+ years of overall experience with 5+ years building and leading a team of high-performing software engineersLeadership skills necessary to build, lead, and develop a team around a unified visionProven experience in shipping systems to productionExperience in tools, frameworks, and prototype developmentInterpersonal skills with expertise in distilling complicated topics to a broader audienceIn-depth experience crafting fault-tolerant high-performing systemsPreferred: Experience with NL systemsBS/MS in Computer Science or equivalent preferred Ph.D.• Understanding of ML models and how to integrate with them• Hands-on experience with on-client development (preferably with Swift or Objective-C)", "jobDescription": "The team at Apple doesn’t just build products - we build the kind of wonder that’s revolutionized entire industries. It’s the diversity of our people and the ideas that inspire the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Siri lives at the intersection of high-scale and groundbreaking technology. The home is a space where this intersection can have an even bigger impact while done with Apple’s promise of privacy. \n\nOn the Siri Personalized Behavior Modeling team, you will align, drive, and build solutions that take advantage of our users' individual behavior to create their perfect personalized experience."}, "200440659": {"jobID": "200440659", "origin_search": null, "posted": "Nov 10, 2022", "jobTitle": "IoT Wireless Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440659/iot-wireless-performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in WiFi/BT or Thread/ZigBee (802.15.4) Functional or Performance TestingExperience in WiFi/BT coexistence Functional or Performance TestingDevelopment experiences in scripting languages, such as Python, C/C++ or Objective-CGood Understanding and working knowledge of WiFi /BT/Thread/ZigBee (802.15.4) protocolsExperience in debugging wireless sniffers, protocol analyzers to debug and root cause issues (like Wireshark, Ellisys Protocol Analysis, etc)Ability to develop test cases and test methodologiesAbility to develop and debug automation test casesDesign and Develop innovative ideas that address automation and execution problems.Thrive in a collaborative environment and comfortable working with cross-functional teamsSupport development in debugging and reproducing issuesCan clearly communicate and driving multiple projects across many teamsEnthusiastically passionate and inquisitiveLaser-focused on the smallest details that are meaningful to our customersBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "jobDescription": "bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin our Wireless Technologies and Ecosystems (WTE) Org and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. If you're passionate about quality and innovation, we may have the job for you.\n\nThe WTE team is looking for a highly qualified software test engineer to help ensure quality for any of the Wireless Technologies - like Thread/WiFi/BT/ZigBee - for all iOS, Apple Watch, Apple TV and Mac OS platforms."}, "200399383": {"jobID": "200399383", "origin_search": null, "posted": "Jan 3, 2023", "jobTitle": "Cellular Software Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200399383/cellular-software-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience in Cellular Protocol Stack software development is preferredStrong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingKnowledge of Embedded RTOS essentialExperience in 5G NR and RRC is a strong plus.Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP/ETSI standardsHands on experience developing test specification, test case implementation and analysis.Thrive in a collaborative environment and can clearly communicate while confidently developing software in highly cross functional projects.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering or Computer Science or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200465464": {"jobID": "200465464", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Cellular Software Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465464/cellular-software-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Experience in Cellular Protocol Stack software development is preferredStrong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingKnowledge of Embedded RTOS essentialExperience in 5G NR and RRC is a strong plus.Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP/ETSI standardsHands on experience developing test specification, test case implementation and analysis.Thrive in a collaborative environment and can clearly communicate while confidently developing software in highly cross functional projects.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering or Computer Science or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200458031": {"jobID": "200458031", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "AIML - Sr Data Scientist, Siri in the Home & Media, AIML Data", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458031/aiml-sr-data-scientist-siri-in-the-home-media-aiml-data?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Master’s degree in a technical or quantitative field such as Statistics, Mathematics, Computer Science, Engineering, Economics or Physics (PhD preferred)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "5+ years experience or equivalent as a data science practitioner.Proficiency with applying quantitative methods to structured & unstructured data for exploratory data analysis, pattern recognition, insights generation, metrics development, and scaling reports.Strong programming skills in data manipulation & processing (SQL & Python preferred).Experience with understanding the complexity of user behavior via deep-dive investigations as well as designing, analyzing, and interpreting A/B experiments.Self-motivated and curious with demonstrated creative and critical thinking capabilities and an innate drive to figure out and improve how things work.High tolerance for ambiguity. You find a way through. You anticipate. You connect and synthesize.Excellent verbal and written communications skills with demonstrated experience in authoring & presenting analytical insights via papers & presentations.Demonstrated experience in cultivating stakeholder relationships and influencing decisions with data.Master’s degree in a technical or quantitative field such as Statistics, Mathematics, Computer Science, Engineering, Economics or Physics (PhD preferred).", "jobDescription": "Would you like to help shape the intelligent assistant of the future? Want to contribute to transforming how human beings interact with technology through voice across hundreds of millions of customers and billions of interactions?\n\nWe are looking for a Sr. Data Scientist to drive product understanding and insights for the Siri Assistant. The focus area for this role is the use of Siri in the home environment across many Apple products and use cases such as Music, Video, Home Automation, and many other Siri-assisted services and features as we work to create the intelligent home of the future with iPhone, iPad, HomePod, Apple TV, and Apple Watch. Siri enables voice control of devices as well as providing a vast array of services. You will define metrics for new AI capabilities, investigate product weaknesses, and work with product leads to inform the product strategy with data."}, "200446276": {"jobID": "200446276", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Marketing Technology Strategist, Apple TV, Sports", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446276/marketing-technology-strategist-apple-tv-sports?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "You're a self-starter who is dedicated and demonstrates creative and critical thinking abilitiesYou’re passionate about digital marketing and marketing strategyYou’re ready to innovate new digital marketing solutions and continually optimize legacy solutionsStrong interpersonal skills and can communicate clearly and concisely across multiple audiences and partners, including the ability to explain analytical outcomes and technical roadblocks to business termsExperience with cross-functional influence; translating between business owners and technical teamsAbility to handle multiple projects and thrive in a very dynamic environmentExcellent organizational skills and attention to detailYou should exhibit confidence in calling out issues on project status and schedulesStrong presentation skills, with the ability to deliver impactful presentations at all levels of the organizationAbility to work well under pressure, with validated experience working on complex, international, large-scale, time-critical projectsResults-oriented, upbeat and focused with a strong passion to learn and succeedA deep familiarity with the Apple ecosystem of services and hardware (Mac OS X, iOS, Apple TV, Apple Music, iTunes, App Store, iBooks, Podcasts, News, Arcade, etc.)Knowledge of Android and Chrome ecosystemsComfortable working with APIs and explaining those to Sports performance marketing partners as neededBasic understanding of web technologies and CMS systems, in order to draft tools requirement documents and direct work of software engineers", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nWe're growing and urge you to apply. We believe the role would place you in a highly-energized environment with some of the most creative individuals in the industry where you would be inspired to share your years of experience along with providing extraordinary support for the team. \n\nApple is seeking an entrepreneurial leader with a passion for digital marketing, marketing strategy, and sports to help grow Apple TV. This role will work with a wide variety of functional teams, with a focus on building marketing technology solutions that enable and enhance meaningful programs with partners through our many communication channels."}, "200467348": {"jobID": "200467348", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Haptics Hardware Engineer - EE", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467348/haptics-hardware-engineer-ee?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.Sc or PhD degree in Electrical Engineering, Mechatronics, Applied Physics or equivalent\nRelevant industry experience is a plus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong EE, circuit, signal processing and electromagnetism backgroundGood understanding of sensors and associated signal chainFundamental knowledge and experience in physics, mechanical engineeringKnowledge of statistics fundamentalsProficiency in MATLAB, SPICE, Simulink, or similar simulation and modeling toolsFamiliarity with modeling electro-mechanical systemsYou should be team oriented and be able to thrive in collaborative multi-functional environment as well \u2028as have excellent written and verbal communication skillsM.Sc or PhD degree in Electrical Engineering, Mechatronics, Applied Physics or equivalent\nRelevant industry experience is a plus", "jobDescription": "The Haptic Engineering team develops state of the art Haptic solutions and technologies that are central to Apple’s products, including the iPhone and Apple Watch. The key goal is to enable the world’s best user-experience. New challenges arise every single day that require the sharp analytical skills of talented and smart individuals. The team features a highly multi-functional and hands-on environment that cultivates engineering perfection, creativity, and innovation. \n\nWe are looking for a Hardware Design Engineer to own the design, development, and validation of next-generation Haptic Technologies. You will be working with different actuation and sensing technology from the concept phase to mass production. Also, you will be responsible to integrate these technologies in complex consumer electronics system."}, "200414576": {"jobID": "200414576", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "Software QA Engineer - Video Apps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200414576/software-qa-engineer-video-apps?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree in Computer Science and 5+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years experience in software testing, that includes mobile/desktop apps, testing cloud based frameworks and APIsStrong knowledge of software development lifecycle, testing methodologies, QA terminology and processesStrong technical expertise and understanding of system interdependenciesExperience with cloud based editing is a plusExperience with photo/video/film editing is a plusAnalytical, methodical, inquisitive and persistent problem solver committed to driving quality forwardAbility to abstract technical details and effectively communicate to audiences at different levelsProficient at balancing multiple efforts simultaneously and meeting strict deadlinesProven bug detection, isolation, and regression skillsOutstanding interpersonal and communication skills (oral and written)Can extract user scenarios from software feature descriptions and requirements to translate them into effective test plans and casesBachelor's Degree in Computer Science and 5+ years relevant experience required.CloudKit experience is a plusFramework/API Testing is a plusScripting knowledge a plus (Swift, Python, Javascript, etc.)", "jobDescription": "Imagine what you could do here! The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThe Video Apps team is looking for a senior level software QA engineer that has experience in testing iOS/macOS apps, cloud based frameworks and APIs. Ideally we are looking for someone with a passion and/or background in video editing to contribute to the production of innovative tools for creative professionals, video makers and visual storytellers."}, "200460082": {"jobID": "200460082", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "GNSS Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460082/gnss-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS is required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Experience in wireless SoC or system validation.Knowledge of wireless SoC, microprocessor, memory, peripherals, I/O characterization.Experience with digital interfaces such as USB/SPMI/SPI/UART/I2C/JTAG.Familiarity with lab equipment such as logic analyzer, spectrum analyzer, signal generators, etc.Experience with version control (Git) and issue tracking tools (JIRA).Validation knowledge of wireless system, digital signal processing and statistics is preferable.Strong Python programming required, C/C++ and other scripting preferred.Experience of hardware design, verification, board design, FPGA, schematics/layout is a plus.GNSS/Cellular validation experience preferred.Strong written and verbal communication skills.BS + 3 years of relevant industry experienceBS is required", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Do you like to solve problems? \n\nGlobal Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13,000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. \n\nOur GNSS team is part of Apple's cellular SoC team. We are a vertically coordinated engineering team spanning RF, mixed-signal analog design, systems engineering, RTL design, DV, firmware and software engineering, test, and validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Validation Engineer, you will be a key member of our highly innovative GNSS design team, developing GNSS technology and SoC for novel ultra-low-power location-based applications."}, "200456598": {"jobID": "200456598", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Repair Center Operations Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456598/repair-center-operations-program-manager?team=CUST", "jobLocation": {"remote": "not specified", "city": "Jeffersonville", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS degree in engineering (industrial, or mechanical preferred) is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5-7 years of industry work experience, leading Repair Operations, New Products, Supply Chain Management (Service/Operations), Customer Support, Development or Service/Operations EngineeringConsistent track record of solving complex problems, i.e., developing creative manufacturing solutions and sourcing suppliers to supply and/or design machine solutionsAgility exploring complex data sets using data analytics tools (e.g., Tableau)Ability to manage competing priorities in a data-driven and results oriented manner25 to 50% domestic travelBS or MS degree in engineering (industrial, or mechanical preferred) is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nApple is seeking an elite Operations Program Manager (OPM) to support its Global Repair Center/AppleCare Repair Services business. This position is an individual contributor role that provides Operations, Manufacturing and Quality expertise.\n\nThis individual is responsible for guiding daily operational activities as they pertain to Repair Center (RC) operations supporting AppleCare ensuring the best service and highest quality manufacturing practices possible. The ideal candidate is a professional with experience in factory operations and a data-oriented approach."}, "200429151": {"jobID": "200429151", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "Systems Software Engineer (Virtualization)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200429151/systems-software-engineer-virtualization?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or higher in Computer Science/Computer Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "C and C++ programming skills.Objective-C or Swift experience is a plus.Understanding of operating systems internals.Previous experience with virtualization (Intel or ARM) is a plus, as is experience with kernel and device driver development.Familiarity with UIKit or SwiftUI a plus.Collaborative approach: Strong written and verbal communicationBS or higher in Computer Science/Computer Engineering", "jobDescription": "Do you see the big picture and love setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group we ensure that the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully coordinated operating systems that combine hardware, software, and apps into a single Apple experience."}, "200452908": {"jobID": "200452908", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452908/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong software skills in C/C++.Familiarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is a huge plusExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is ideal experience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 10 years relevant industry experience", "jobDescription": "Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200346533": {"jobID": "200346533", "origin_search": null, "posted": "Nov 4, 2022", "jobTitle": "Software Engineer- Object Storage", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200346533/software-engineer-object-storage?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS or PhD, in Computer Science, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "A successful track-record and proven experience as a backend internet services software developer.Proven aptitude for building, launching and operating large-scale production internet services.Deep knowledge of Java (or C#), Java libraries, non-blocking and thread safe programming.Some exposure to structured or unstructured storage and caching.Understanding of file system handling on Linux.Knowledge of continuous integration, testing methodologies, TDD and agile development methodologies.Open to pair programming.At least 5 years of experience building and operating distributed systems.BS, MS or PhD, in Computer Science, or equivalent experience.", "jobDescription": "Come help us build the next generation cloud platform to support internet services across Apple.  Our software provides storage at massive scale and with the highest reliability to product teams at Apple. We are looking for a passionate Software Engineer with experience in developing large-scale services and infrastructure to join our friendly, collaborative team."}, "200459360": {"jobID": "200459360", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Silicon Validation PVT Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459360/silicon-validation-pvt-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree and a minimum of 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Exposures to post-Silicon validation, silicon bringup, testing/debug/root cause of circuit marginalities, product engineering, foundry manufacturing, etc.Understanding test execution through both functional mode and DFX hooksYou are comfortable working primarily in a lab environmentYou have strong scripting skills in one of the major languages: eg. Perl, python, Tcl, bashYou have good experimental technique, techniques of problem localization and root-causeYou have system level understanding of CPU/SoC architecture, Memories (DDR, NAND), SystemsGood data analysis skills and attention to detailsNice-to-haves (in at least one and preferably several areas):Chip design background in circuit/physical design (timing closure, power, etc.) or DV (correlating SW signatures to block level tests).Post silicon physical debug background in speed-path/Vmin, memory arrays, clocking or yield improvements.Post silicon logic debug background in exercising various DFX features, analyzing scandump/memdump, suggesting tests in both system level or to DVDeep understanding of boot process, boot-loaders, embedded software, micro-kernel and able to tweak system tests.Product engineering background and familiarity with ATE coverage, margin, binning, scan pattern generation, etc.Good IP knowledge in some PHY blocks (eg. DDR, PCIe, USB, etc)Bachelor's Degree and a minimum of 10 years of relevant experience.", "jobDescription": "Imagine what you could do here!  At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.  \n\nAs part of Silicon Validation Team, you will focus on silicon validation, debug and root cause related to anomalous behaviors using system work-loads. (circuit marginalities, process-design interactions, logic bugs)."}, "200420092": {"jobID": "200420092", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Software Engineer, System Services & Daemons", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420092/software-engineer-system-services-daemons?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Expert level C, exposure to Objective-CExperience with daemon and library developmentCreative, critical thinking and troubleshooting skillsExcellent collaborative skillsExceptional professionalism, with the ability to deliver solid work on tight schedulesExcellent written and verbal communicationA genuine passion for consumer devicesB.S. in Computer Science or equivalent experienceAdditional Success Factors:Development experience on macOS and/or iOSExperience with common embedded hardware architecturesFamiliar with cryptographic concepts and techniquesFamiliar with open source technologies and development communitiesFamiliar with Xcode", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole.  That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, comprehensive user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices.\n\nThe Core OS organization is seeking an extraordinary engineer to work on state-of-the art technology for macOS, iOS, tvOS and watchOS. You should have a strong understanding of operating system fundamentals and experience working throughout the stack. As a member of the team, you would participate in all stages of software development, from new feature design and implementation, to maintenance and bug fixing of released code. You will develop and improve unit tests and performance tests, and may also work on diagnosing and resolving customer reported issues."}, "200444209": {"jobID": "200444209", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Streaming Media Formats Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444209/streaming-media-formats-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Software development experience in CExcellent analytical, programming and debugging skillsExperience in working with industry standard media file formats (e.g., ISOBMFF) and implementing authoring support for such formats.BS or MS in CS/CE or equivalentNice to have but not required:Proficiency in multi-threaded developmentObject oriented programming skills in either C++, Objective-C, or SwiftKnowledge of existing audio, visual and caption format standards is a plus (MPEG-2 TS, MP4, WebM, CEA-608, WebVTT, etc)Knowledge of streaming media protocols: HTTP Live Streaming (HLS), DASH.Experience in developing AR/VR and immersive video streamingSolid understanding of media codecs, formats, transports and container protocols", "jobDescription": "Apple's Interactive Media Group (IMG) is looking for a creative and dedicated engineer with leadership skills to join our streaming media team. This technology powers the streaming media experiences on all of Apple’s platforms (iPhones/iPads, Apple TV, Apple Watch and macOS) by building on core technologies and frameworks such as Core Media, AVFoundation.   The Streaming Media engineering team is looking for a software engineer to work on designing and implementing support for next generation audio/visual media formats in our streaming stack. If you are passionate about solving complex problems with sophisticated and creative solutions, then this job maybe a flawless fit for you."}, "200420093": {"jobID": "200420093", "origin_search": null, "posted": "Sep 9, 2022", "jobTitle": "CoreMedia Software Screener & Developer Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420093/coremedia-software-screener-developer-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. or M.S. in EE/CS or equivalent domain experience with a focus in software engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "2+ years of software development experience in C or C++ on embedded platformsExperience with debugging a complex software system, preferably in the media domainExperience with and understanding of real-time multithreaded programming systemsB.S. or M.S. in EE/CS or equivalent domain experience with a focus in software engineeringDesired but not required:Experience with Xcode and the iOS/macOS development toolchainDevelopment experience with ARM processorsExperience in developing and debugging media systems", "jobDescription": "The Interactive Media Group (IMG) provides the media and graphics foundation across all of Apple's innovative products. The CoreMedia engineering team within IMG is responsible for implementing software services around linear audiovisual media. This includes local media playback, video-on-demand and live streaming of multimedia content. Our media engine is used across Apple products such as Safari, TV, Photos, Music, Videos, FaceTime, iMovie on iOS and macOS as well as 3rd party applications. \n\nOur team is looking for a software engineer with a technical and programming background to help screen, triage and debug issues for our team. You will also help in the improvement and development of existing and new features. \n\nExperience in development and debugging of large software systems and/or significant components of such systems is desired. Experience with media playback and transcoding systems is preferred."}, "200446471": {"jobID": "200446471", "origin_search": null, "posted": "Dec 22, 2022", "jobTitle": "Wireless Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446471/wireless-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BSEE or equivalent with + 3 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "4-10 years of wireless/RF industry experience with preferred 2 or more years of wireless module development experience from early concept to MP for consumer electronic devices.Strong RF design background. Additional experience in packaging, product engineering, ATE, and reliability engineering is highly desirable.Strong data analysis skills including yield analysis (Cpk), and retest rate analysis, required for data sheet closuresAbility to define best engineering methods for custom Wireless module and component development during prototyping phase.Excellent problem-resolution skills are expected to address technical issues during development and rampVery good communication skills, verbal and written, including the capability to drive meetings to make key decisions on wireless technologies.Experience in setting up project schedules and work breakdown structures while communicating risks with prioritization is a plus.Ability to travel internationally.Minimum BSEE or equivalent with + 3 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! \nThe Wireless Module Engineer (WME) is well-versed in multiple fields for wireless module development: RF design, packaging, product engineering (including yield analysis), ATE, and reliability engineering. The WME will use their expertise to develop wireless modules from early concept to ramp, communicate risks/priorities (Design/Reliability/Yield) to executives, and lead cross-functional problem-solving. They will also drive all RF module and component vendor meetings and ensure that the vendors are adhering to the internal processes. WME will be responsible for formulating component and module development guidelines. The position will support multiple product lines from the Hardware Technology organization from early concept through ramp."}, "200449241": {"jobID": "200449241", "origin_search": null, "posted": "Dec 22, 2022", "jobTitle": "Wireless Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449241/wireless-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BSEE or equivalent with + 10 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "4-10 years of wireless/RF industry experience with preferred 2 or more years of wireless module development experience from early concept to MP for consumer electronic devices.Strong RF design background. Additional experience in packaging, product engineering, ATE, and reliability engineering is highly desirable.Strong data analysis skills including yield analysis (Cpk), and retest rate analysis, required for data sheet closuresAbility to define best engineering methods for custom Wireless module and component development during prototyping phase.Excellent problem-resolution skills are expected to address technical issues during development and rampVery good communication skills, verbal and written, including the capability to drive meetings to make key decisions on wireless technologies.Experience in setting up project schedules and work breakdown structures while communicating risks with prioritization is a plus.Ability to travel internationally.Minimum BSEE or equivalent with + 10 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! \nThe Wireless Module Engineer (WME) is well-versed in multiple fields for wireless module development: RF design, packaging, product engineering (including yield analysis), ATE, and reliability engineering. The WME will use their expertise to develop wireless modules from early concept to ramp, communicate risks/priorities (Design/Reliability/Yield) to executives, and lead cross-functional problem-solving. They will also drive all RF module and component vendor meetings and ensure that the vendors are adhering to the internal processes. WME will be responsible for formulating component and module development guidelines. The position will support multiple product lines from the Hardware Technology organization from early concept through ramp."}, "200452082": {"jobID": "200452082", "origin_search": null, "posted": "Dec 22, 2022", "jobTitle": "Wireless Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452082/wireless-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BSEE or equivalent with + 3 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "4-10 years of wireless/RF industry experience with preferred 2 or more years of wireless module development experience from early concept to MP for consumer electronic devices.Strong RF design background. Additional experience in packaging, product engineering, ATE, and reliability engineering is highly desirable.Strong data analysis skills including yield analysis (Cpk), and retest rate analysis, required for data sheet closuresAbility to define best engineering methods for custom Wireless module and component development during prototyping phase.Excellent problem-resolution skills are expected to address technical issues during development and rampVery good communication skills, verbal and written, including the capability to drive meetings to make key decisions on wireless technologies.Experience in setting up project schedules and work breakdown structures while communicating risks with prioritization is a plus.Ability to travel internationally.Minimum BSEE or equivalent with + 3 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! \nThe Wireless Module Engineer (WME) is well-versed in multiple fields for wireless module development: RF design, packaging, product engineering (including yield analysis), ATE, and reliability engineering. The WME will use their expertise to develop wireless modules from early concept to ramp, communicate risks/priorities (Design/Reliability/Yield) to executives, and lead cross-functional problem-solving. They will also drive all RF module and component vendor meetings and ensure that the vendors are adhering to the internal processes. WME will be responsible for formulating component and module development guidelines. The position will support multiple product lines from the Hardware Technology organization from early concept through ramp."}}