{"200460985": {"jobID": "200460985", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Small Display EE Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460985/small-display-ee-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Project/Program Management expeirence in a relevant industryExperience in Hardware EngineeringExperience working with fast paced New Product DevelopmentExperience working with Asian suppliers and manufacturers preferred (CM/JDM/OEM)Working knowledge of electronics assembliesUnderstanding of high-volume manufacturing processInteraction with large cross functional teamsStrong critical thinking, communication, detail oriented, and presentation skills with demonstrated leadership in dynamic, fast-paced environmentsAbility to travel internationallyBS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly.  Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products! \n\nApple is looking for an outstanding Engineering Program Manager to join the Display team."}, "200169032": {"jobID": "200169032", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "Watch Touch HW-Senior Sensing Design and Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200169032/watch-touch-hw-senior-sensing-design-and-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. + 10 years or PhD + 3 years in Electrical Engineering, Physics or industry experience equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Multi-disciplinary understanding of EE, ME, and Physics principlesStrong EE fundamentals and experience with analog/mixed signal designProven working proficiency in algorithms development / signal processing as applied to sensor systemsProficiency in MATLAB, SPICE, or similar simulation and modeling / scripting toolsExcellent written and verbal communication skills along with collaboration and leadership skillsFamiliarity with mechanical design principles, FEA, and advanced materials is a plusProficiency in COMSOL, Maxwell, or similar FEA tools is a plusAnalog circuit design experience requiredExperience with scripting languages (MATLAB, Python etc.) requiredKnowledge of electrical, thermal, and mechanical systems is preferredExperience with high volume mass production is a plusM.S. + 10 years or PhD + 3 years in Electrical Engineering, Physics or industry experience equivalent", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200452656": {"jobID": "200452656", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Modem and RF System Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452656/modem-and-rf-system-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be crucial for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in low power algorithm design and High Level Synthesis (HLS) for power critical applications is helpful.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc. a plusKnowledge of cellular communication standards: 5GNR, 4G LTE, 3G (HSPA), 2G GSM.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS with 3+years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? We are searching for a dedicated engineer with 10+/- years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200452612": {"jobID": "200452612", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Modem and RF System Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452612/modem-and-rf-system-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 10+years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be crucial for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in low power algorithm design and High Level Synthesis (HLS) for power critical applications is helpful.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc. a plusKnowledge of cellular communication standards: 5GNR, 4G LTE, 3G (HSPA), 2G GSM.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS with 10+years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? We are searching for a dedicated engineer with 10+/- years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200459045": {"jobID": "200459045", "origin_search": null, "posted": "Mar 4, 2023", "jobTitle": "eDiscovery Leader", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459045/ediscovery-leader?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Advanced degree or certification in relevant legal technology processes, training or certification in digital forensics and membership to relevant industry associations preferred. JD or equivalent preferred with admission to at least one US state bar."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$199,000", "max": "$299,000,"}, "benefits": null, "requirements": "5+ years team leadership and management; demonstrated experience building and managing diverse teams delivering eDiscovery support10+ years hands-on experience working in eDiscovery, with a preference of in-house experienceA thorough understanding of the eDiscovery process and lifecycle; must have demonstrated experience leading all aspects of each step in the Electronic Discovery Reference Model (EDRM)Experience leveraging ML/automation in the eDiscovery lifecycle; demonstrated experience in legal service providers, vendors, and external counsel on the application of analytics in the eDiscovery lifecycleProven leadership abilities with an emphasis on coaching, and mentoring a diverse team, collaboration, and executive stakeholder managementTechnically proficient in eDiscovery industry standard technologies (e.g., Relativity, Brainspace, OpenText, etc.)Ability to operate in a fast-paced, dynamic environment with matrixed reporting while delegating to your teamCuriosity and ability to identify gaps, propose solutions, and take ownership of projects while balancing time, quality, cost, and riskAbility to foster and facilitate teamwork by cultivating relationships, mentoring, collaborating, and effectively communicating with teammates and cross-functional partnersMaintains high ethical standards both personally and professionally; shows integrity and fairness in dealings with others; is reliable and trustworthySound judgment, discretion, and ability to properly handle confidential and sensitive informationAdvanced degree or certification in relevant legal technology processes, training or certification in digital forensics and membership to relevant industry associations preferred. JD or equivalent preferred with admission to at least one US state bar.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nApple is seeking an experienced eDiscovery Leader to join the Legal Operations & Global Security team. We are looking for a leader to provide expert advice on the development and continuous evolution of the Apple eDiscovery program and to guide its strategy. In this role you’ll mentor and lead a diverse team of eDiscovery analysts and assistants."}, "200450224": {"jobID": "200450224", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Analog Layout Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450224/analog-layout-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Typically requires more than 8 years of experience in analog/mixed-signal layout design of deep sub-micron CMOS circuits.Experience implementing analog layouts to achieve tight matching, low noise, and low power consumption.  Layouts may include analog blocks, resistors, capacitors, pad IOs, ESD structures, etc.High level of proficiency in custom and standard cell based floor-planning and hierarchical layout assembly.Must understand techniques for managing IR drop, RC delay, electromigration, self-heating and coupling capacitance.Must recognize failure prone circuit and layout structures, have experience with analog and DFM best practices, and proactively work with circuit designer to identify the best approach to solving problems.High level proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc. reports.Knowledge of MENTOR GRAPHICS or CADENCE layout tools.Scripting skills in PERL or SKILL are considered a plus, but not required.Excellent communication skills and able to work with cross-functional teams.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "As a member of the layout team, you will be working on the latest technology nodes to create world-class custom analog designs. This is a fast-paced work environment with endless learning opportunities working on a multi-disciplinary team with members of design, integration, CAD and technology engineering."}, "200451501": {"jobID": "200451501", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "PMU Hardware Electrical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451501/pmu-hardware-electrical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with hardware development from specification to bring up and downstream support.Schematics and PCB design experience preferred.Knowledge of power integrity analysis and design.Ability to design or guide high quality PCB layouts into fabrication.Skilled at component development and selection.Familiarity with microcontroller/FPGA/logic design and programming.Resourceful in an electronics lab environment using real time oscilloscopes, analyzers, function generators, automation hardware, power supplies, and electronic loads.Coding or software development in Python.Enjoys working in a lab environment.Familiarity using Cadence Allegro for multi-layer board layout is a plus.Coordination and collaboration with team members on complex projects.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Are you interested in designing hardware as part of silicon development at Apple? Join our team developing custom mixed-signal integrated circuits for Apple’s next generation product lines! Our small team has already shipped hundreds of millions of chips into several Apple product lines, including new products launched this year. We are looking for a passionate engineer that is enthusiastic about embedded hardware design. You will work closely with a diverse and creative team to craft sophisticated test systems for pioneering power supplies. This role includes a broad scope of work including simulations, software, bringup, debug, extraction, and analysis, working closely to a wide range of people across functions and being a key contributor to the silicon development effort!"}, "200453475": {"jobID": "200453475", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Wireless Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453475/wireless-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS in EE or CS with + 3 years experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong understanding of SoC/FPGA architecture and silicon micro-architectureExperience in writing basic embedded software routines and test scriptsExperience with hardware/software interactionSolid Digital logic fundamentals including timing analysis, state-machine debug and/or RTL/test-bench development Experience with high-speed memory systems and communication interfacesGood understanding of MAC + Protocol specifications for digital interfacesExperience in crafting tests to target specific portions of silicon designs and digital interconnectsHands on debug experience with usage of modern lab equipment (DSOs, Logic Analyzers, Protocol Analyzers)Familiarity with interpreting and navigating schematics and layoutStrong desire to deep-dive system level issues and drive problems to closure in a team-based environment with a proactive demeanorMinimum BS in EE or CS with + 3 years experience is required.", "jobDescription": "Are you passionate about changing the world? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. \n\nCome join a team of expert software and hardware engineers with a diverse set of backgrounds (Cellular Modems, Connectivity solutions, Device Drivers, CPUs and caching, kernel programming, embedded systems) to test Apple's next generation Wireless SoCs! As part of the Silicon Validation team, you will define and develop test coverage to evaluate functional blocks and debug silicon issues."}, "200254638": {"jobID": "200254638", "origin_search": null, "posted": "Jun 7, 2021", "jobTitle": "Senior 3D Graphics & Front End Web Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200254638/senior-3d-graphics-front-end-web-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BA, BS or MS CS/CE/EE (or equivalent) in the area of Computer Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with 3D Graphics on Web (WebGL, Three.js, related frameworks)5+ years professional experience building responsive, user friendly web applicationsProficient understanding of base front end development technologies including HTML5/CSS3/JavaScriptSignificant experience with JavaScript frameworks and client side state management using React.js / ReduxKeen eye for design, user experience, and detailStrong experience using best practices when working with REST APIsBuilding reusable components and front-end libraries for future useExperience in developing secure web applications and knowledge of application vulnerabilities such as Cross Site Scripting (XSS), Cross Site Request Forgery (CSRF) etc.Good communication and personal skills: ability to interact and work well with members of other functional groups in a project team and a strong sense of project ownershipBA, BS or MS CS/CE/EE (or equivalent) in the area of Computer Engineering or related fieldExperience with 2D visualization libraries like D3 is a plus", "jobDescription": "The Autonomous System’s Visualization team is in search of a curious and innovative team player who is passionate about leveraging cutting edge blend of 3D graphics and web technology, to deliver experiences that surpass user expectations. Our team works on many impactful web applications with 3D graphics and services at Apple where quality and performance cannot be sacrificed."}, "200458039": {"jobID": "200458039", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Wireless Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458039/wireless-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 0+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "BS and 0+ years of relevant industry experience.Wireless/Wired communication block/system verification experience preferred.Advanced knowledge of SystemVerilog, SystemVerilog Assertion (SVA), and DV methodology.Solid verification skills in problem solving, constrained random testing, and debugging.Verification experience of one or more of the following a plus: MAC, PHY, DMA, timer, AMBA bus and fabric, encryption/decryption engine.Knowledge of wireless protocols such as Bluetooth, WLAN, or Zigbee a plus.Should be a great teammate with excellent communication skills and the desire to take on diverse challenges.BS and 0+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.BS+ 0 years of relevant experience. MS preferred.", "jobDescription": "Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nAs a Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of communication subsystem including MAC, PHY, and interfaces. With deep understanding of communication systems and protocols, you will interact with DV methodologists, designers and communication systems engineers to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification."}, "200451506": {"jobID": "200451506", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "PMU Design Verification Engineer: Analog & Mixed Signal", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451506/pmu-design-verification-engineer-analog-mixed-signal?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Ability to verify analog/mixed-signal designs in a collaborative team environment.Proficient in hardware descriptive languages: Verilog, System-Verilog, and/or Verilog-AMS code.Familiarity with authoring analog assertion checks to catch bugs.Capability to identify failure mechanisms and review verification results in analog IC designs.Ability to write test plans, present results, and communicate clearly with multi-functional teams.Comfortable with running simulations through compute clusters while optimizing simulation and wall time.Understanding of both power management and related auxiliary circuitry: switching converters, linear converters, reference circuitry, bandgaps, data converters, and/or clock generators.Have a familiarity with verification methodologies and tools: simulators, waveform viewers, execution automation, coverage collection, gate level simulations.Experience developing scalable and portable test benches.A background that includes scripting or programming languages is preferred. These include, but are not limited to, TCL, Skill, Python, and/or PERL.Your familiarity with analog behavioral models is also a plus.BS and a minimum of 10 years of relevant industry experience", "jobDescription": "Did you know that Apple is hiring analog & mixed signal verification engineers? We are looking for engineers that are enthusiastic to find bugs! You have the opportunity to work with a creative team to craft test plans and enable production-quality first silicon. As a member of the analog and mixed signal verification team, you will be working with specialists for full-chip verification of the state of the art mixed-signal systems used in Apple’s world-leading products!"}, "200451505": {"jobID": "200451505", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "PMU Design Verification Engineer: Analog & Mixed Signal Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451505/pmu-design-verification-engineer-analog-mixed-signal-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Ability to verify analog/mixed-signal designs in a collaborative team environment.Proficient in hardware descriptive languages: Verilog, System-Verilog, and/or Verilog-AMS code.Familiarity with authoring analog assertion checks to catch bugs.Capability to identify failure mechanisms and review verification results in analog IC designs.Ability to write test plans, present results, and communicate clearly with multi-functional teams.Comfortable with running simulations through compute clusters while optimizing simulation and wall time.Understanding of both power management and related auxiliary circuitry: switching converters, linear converters, reference circuitry, bandgaps, data converters, and/or clock generators.Have a familiarity with verification methodologies and tools: simulators, waveform viewers, execution automation, coverage collection, gate level simulations.Experience developing scalable and portable test benches.A background that includes scripting or programming languages is preferred. These include, but are not limited to, TCL, Skill, Python, and/or PERL.Your familiarity with analog behavioral models is also a plus.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Did you know that Apple is hiring analog & mixed signal verification engineers? We are looking for engineers that are enthusiastic to find bugs! You have the opportunity to work with a creative team to craft test plans and enable production-quality first silicon. As a member of the analog and mixed signal verification team, you will be working with specialists for full-chip verification of the state of the art mixed-signal systems used in Apple’s world-leading products!"}, "200451958": {"jobID": "200451958", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Timing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451958/timing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 3+ years relevant experience required. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Knowledge of the ASIC design flow, synthesis, static timing analysis, scripting, and netlist generation.Understanding of UPF and low-power design & implementation techniques.Hands-on experience in timing/SDC constraints generation, analysis, and management. Knowledge of timing corners, operating modes, process variations, and signal integrity-related issues.Exposure to industry standard Timing, Logic Equivalence, Physical Design and Synthesis toolsKnowledge of basic SoC Architecture and HDL languages like Verilog to collaborate with our logic design team for timing fixes and functional ECOs.Experience with script-based tool automation and familiarity with API’s and scripting languages such as Perl/Tcl is a plus.BS with 3+ years relevant experience required. MS preferred.", "jobDescription": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. All of this is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply."}, "200433248": {"jobID": "200433248", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Wireless Standard and System Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200433248/wireless-standard-and-system-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Master’s degree or PhD in Electrical Engineering/Computer Science with 5 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Extensive experience with MAC layer and cross layer designStrong knowledge of IEEE 802.11n/ac/ax and protocols and applications essential, including high-level architectureStrong in running both link and system-level simulationKnowledge of internet protocol suite is a plusExperience as an active contributor in standard organizations is a plusExceptional verbal and written communication skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsSelf-motivated, obsessively passionate and seek to solve everyday problems in innovative waysMaster’s degree or PhD in Electrical Engineering/Computer Science with 5 years of relevant experience.", "jobDescription": "As a Wireless Standard and System Engineer, you are responsible for innovative design of next generation wireless technology! You will be representing Apple in wireless standard bodies and driving the companies strategic interest in those organizations. With this phenomenal opportunity, you are working with the world-class team to create innovation and generate new IPs that benefit our product lines. You will be working with various dynamic teams internally and externally in driving our global standardization activities."}, "200463801": {"jobID": "200463801", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Business Development / Strategy & Planning Lead - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463801/business-development-strategy-planning-lead-apple-media-products?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS or BA required\n\n-  MBA or equivalent degree a benefit"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$107,000", "max": "$209,500,"}, "benefits": null, "requirements": "Minimum 3 years experience with time spent in corporate finance, investment banking, management consulting and/or similar strategy and planning functions in a global, fast-paced organizationExperience with media content and subscription businessesOutstanding analytical skills; ability to conceive, structure, perform, direct, and effectively communicate sophisticated data analysisHigh level of enthusiasm, innovation and dedication with ability to adapt easily to change and multitaskAbility to coordinate, lead, and influence cross-functional teams across all levelsAbility to communicate effectively, both written and verbal, with senior executives, including via formal presentationsGreat attention to detailProficiency in Excel, Keynote, and Tableau; knowledge of SQL a plus-  BS or BA required\n\n-  MBA or equivalent degree a benefit", "jobDescription": "Come be a part of one of the fastest growing businesses at Apple! Apple’s Services team is seeking an experienced, thoughtful, and entrepreneurial individual with a passion for media and entertainment to help massively grow its Services business, including Apple Music, TV+, Arcade, News+, Fitness+, iCloud, and Apple One.\n\nThe Business Development, Strategy & Planning Lead will support global growth efforts with a focus on developing new business opportunities, uncovering ways to optimize existing partnerships, as well as helping drive analyses of key strategic projects. The candidate will also be responsible for leading the BD team’s planning function, which includes forecasting, modeling, and performance analysis for Apple Services global BD channels. \n\nThis high-impact role requires a highly motivated and experienced teammate with great attention to detail who is able to work with multiple teams to meet hard deadlines. The candidate will drive cross-functional and cross-LOB projects that expand our Services growth opportunities and thus will include frequent interaction with key internal and external partners, including product, marketing, finance, analytics, operations, and engineering.\n\nThe candidate should have excellent presentation and communication skills. This role will be highly visible within the organization since senior leadership depends heavily on this team’s analyses to drive important business decisions globally."}, "200451474": {"jobID": "200451474", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Circuits QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451474/circuits-qa-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "We are looking for applicants with experience in SRAM or Standard Cell Library development, EDA automation or Quality Assurance.Proficient in scripting in Perl, Python and/or TCL.Good understanding of transistor level design, SRAM and/or Standard cell circuits, cell characterization and library validation.Experience with various EDA tools for synthesis, place-route, Verilog simulation, spice simulation, formal verification, DRC/LVS, RC extraction and/or library characterization.Familiarity of Verilog syntax, liberty models and variation format.Knowledge of timing, power, noise, and IR analysis.BS and a minimum of 3 years of relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world! Your efforts will be groundbreaking, often literally. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never-before envisioned. We have an extraordinary opportunity for digital design QA Engineers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact delivering high quality products to market quickly."}, "200450228": {"jobID": "200450228", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Custom Logic and Mixed-signal Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450228/custom-logic-and-mixed-signal-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The ideal candidate will have minimum of 3 years of industry experience and possess the following qualifications:Experience in transistor- and gate-level custom logic design.Experience in transistor- and gate-level static timing and noise analysis.Experience in mixed-signal design such as PLL and SerDes is a plus.Experience in SRAM design is a plus.Experience with NanoTime, PrimeTime, and Tempus STA tools is a plus.Proficiency in circuit modeling and simulation, including SPICE models and worst-case corner selection.Good understanding of tool algorithms for noise glitch, cross-talk delay, and margining with OCV / AOCVM / POCV.Familiarity with synthesis, logic equivalence, DFT, and backend related methodologies and tools.Familiarity with ECO techniques and implementation is a plus.Strong communication and interpersonal skills.MSEE or PhD is required.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "Imagine what you could do here at Apple? Together we could help craft the next generation of the world’s finest devices. New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish. The Display and Touch Silicon (DTS) team is searching for a self-motivating engineer for the role of Custom Logic and Mixed-signal Design engineer.\n\nAs a member of the DTS team, we will be working on the leading-edge technology to build best-in-class custom mixed-signal designs used to connect our world-class products to the world as well as optimizing their performance. You will become part of a development team that cultivates engineering excellence, creativity, and innovation. Collaboration across teams is a key component of success at Apple. The right candidate will thrive in this type of environment. Dynamic, smart people and inspiring, innovative technologies are the norm here. Will you help us design the next generation of revolutionary Apple products?"}, "200453772": {"jobID": "200453772", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "GPU Physical Verification Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453772/gpu-physical-verification-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We value ability in all aspects of ASIC integration including Floorplanning, Clock and Power distribution, global signal planning, I/O planning and hard IP integration.Deep experience at full chip with configuration, methodology, and analysis of physical design verification checks: DRC, LVS, ERC, Process ANT, PERC, and ESD. Background with top to block correlation and reporting is required.Knowledge in general partition PNR flow and understanding how to support partition owners in solving physical design verification issues.Familiar with hierarchical design approach, and techniques that enable physical design verification that is correct by construction. Familiar with GDS assembly, GDS requirements for hard macros.Depth of expertise on integrating IP from both internal and external vendors and able to specify and drive IP requirements in the physical domain.Experience with large subsystem designs (>20M gates) with frequencies in excess of 1GHz applying innovative technologies.Experience in technical project leadership and achieving results that have had impact on project completion and objectives.Track record of applying creative thinking to strategically solve problems that have impact for a project, group, or organization.Consistent record in solving complex PD and multi-functional problems, achieving results directly and/or leading a team of engineers to innovate and achieve extraordinary GPU designs.From a CAD tool perspective, experience with Floorplanning tools, P&R flows, mainstream Physical Design Verification tools (e.g. Mentor) is required. Familiar with TCL scripting.We are looking for candidates with a minimum of BS + 10 years of relevant experience.", "jobDescription": "Do you love creating sophisticated solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient GPU! You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions! Joining this group means crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices. This role requires a mix of strategic engineering along with hands-on experience in physical design and large chip integration, being responsible for realizing complete physical design verification closure from early design planning to tapeout."}, "200463851": {"jobID": "200463851", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Product Design Engineer - Battery", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463851/product-design-engineer-battery?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS plus 3 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "3+ years of hands-on mechanical product design engineering.Experience with any of the following 3D CAD Tools: Unigraphics UG, Solidworks, ProEngineer, etc.Demonstrated understanding of DOE, GD&T, SPC, or CP/CPK techniques.Experience in Design for Manufacturability (DFM), Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing.Experience with precision parts and component design.Assembly experience is a plus.Consumer electronics experience preferred. Otherwise experience in medical devices, automotive components, injection molding, jigs/tooling/fixtures, consumer appliances, or other parts with tight tolerancesPCB/flex design, material science, and basic chemistry is considered a plus, but not required.You have the ability to communicate efficiently with multi-functional team members and be able to efficiently collaborate to achieve project goals.BS plus 3 years of industry experience.", "jobDescription": "Are you looking to push the limits of what’s considered feasible? As part of our Battery Engineering group, you’ll aid us in crafting creative battery solutions that deliver more energy in smaller spaces than ever before. We work across subject areas to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new battery technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what batteries can do and improve the product experience for our customers across the world!\n\nAs the NPI Mechanical/Product Design resource for our systems; we own module development from initial system architecture through ramp. In this role, you will apply your mechanical design engineering skills and ability to lead the end-to-end mechanical development and integration of innovative modules into next-generation Apple products."}, "200462547": {"jobID": "200462547", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Physical Design Methodology and CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462547/physical-design-methodology-and-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Demonstrated depth and experience in CAD flow or PD Methodology developmentProficiency with Tcl, Python or Perl scripting languagesExpert knowledge of industry standard PNR toolsDeep understanding and experience in analysis aspects of Physical Design - extraction, timing, noise, physical verification, EMIRHands on experience with high performance and low power implementation flowsExperience using or supporting signoff tools for design closureBe able to drive tool/flow improvements independently, present findings to broad audienceExperience with chip level design is a plus: floorplanning, pin assign, feed through insertion, custom clock, high speed bus, pad ring, assemblyMinimum requirements of BS degree + 10 years of industry experience", "jobDescription": "As part of the Hardware Technology CAD team, you’ll help design our next-generation, high-performance, power-efficient SoCs. You will work on world class CPU, GPU, Analog/Mixed Signal and SOC designs by developing flows, tools and methodologies for future Apple products. You will explore and enable new technology nodes, stdcells and tools for design teams. You will collaborate with design teams and tool vendors to improve PPA (Power, Performance, Area) and design productivity. You will actively work on developing internal methodologies using your understanding of CAD algorithms and ML\n\nWe are looking for passionate engineers to join our team. In this role, you will be impacting a wide range of chips used across Apple’s world-class products (iPhone, iPad, Mac, Apple Watch, Airpods…)!"}, "200466221": {"jobID": "200466221", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Training Instructional Designer, AppleCare", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466221/training-instructional-designer-applecare?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree or equivalent required; Master's or higher degree in a related field a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum 3+ years of instructional systems design experience on projects involving adult learning audiencesCall center or customer service exposure and experienceExperience designing simulated learning solutionsAbility to effectively navigate ambiguityExperience analyzing, building, and assessing curricula for asynchronous and synchronous classroom-based or virtual training environmentsSuperb written and verbal communication skills and proficiency writing instructional contentShown ability to create content for a global audienceFluency with instructional systems design models and methodologies, authoring tools, and learning management systems integrationEffectiveness working with global and virtual teamsExperience with project management and time management tools and methodologiesProficiency with word processor and presentation software applications including Pages and KeynoteExperience authoring training content in a LCMSExposure to Web authoring and multimedia tools such as basic HTML, Dreamweaver, and PhotoshopExperience with JavaScript and CSS a plus but not requiredBachelor’s Degree or equivalent required; Master's or higher degree in a related field a plus.", "jobDescription": "The people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of these people that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.  \n\nThe AppleCare Instructional Designer works with business partners to identify training needs and create instructor-led, web-based, and virtual training using cutting-edge technology and innovative solutions. You will partner with multiple teams to forecast potential contact drivers, plan troubleshooting, and curate a learning experience for our Advisors that meets them “where they are.”  \n\nYou will challenge learners’ understanding through relevant activities, author measurable learning objectives, and develop materials that promote transfer, retention, and application. You’ll work under tight deadlines with minimal supervision in a fast-paced, dynamic environment where quality, creativity, and accountability are tradition."}, "200463177": {"jobID": "200463177", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Mixed Signal Modeling/Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463177/mixed-signal-modeling-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant industry experience is required. MSEE or beyond is preferred.\nCoursework emphasis on the design of analog/RF building blocks is nice to have"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong fundamentals in analog/RF circuit concepts/topologies.Expert in RNM coding in SystemVerilog.Experience working with Cadence mixed signal verification environment.Ability to read analog schematics and extract related main functionality.Experience modeling mixed signal/RF blocks including biasing networks, power regulators, bandgaps, Opamp’s, OTA’s, data converters, LNA, PA, mixers, couplers, splitters, combiners, etc…Experience modeling high frequency PLL’s is desired.BS + 10 years of relevant industry experience is required.BS + 10 years of relevant industry experience is required. MSEE or beyond is preferred.\nCoursework emphasis on the design of analog/RF building blocks is nice to have", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and support millions of Apple’s customers every single day! In this role, you will work within the analog mixed-signal design team to model complex custom circuits in order to verify system-level functionality and performance expertly. This is meaningful and rewarding cross-disciplinary position, with a high degree of collaboration and openness across multiple teams. This role will provide the opportunity to work on state of the art mixed-signal systems used in Apple’s world-leading SoCs."}, "200459597": {"jobID": "200459597", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "ASIC Digital Design Engineer Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459597/asic-digital-design-engineer-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS+10 Years of Relevant Industry Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BS+10 Years of relevant industry experience. Advanced degree preferred.10+ years of digital design experience in complex multi-million gate architectures and deep sub-micron technologies, achieving multiple tape-outs with a majority of the tape-outs reaching MP with first silicon.Drive and improve digital design methodology to achieve high quality first silicon.Hands on experience with FPGA emulation, silicon bring-up, characterization and debug.Experience with mixed signal design is highly desired.Experience with display interconnect standards - MIPI, DP, HDMI is a definite plus.Experience with display pipeline elements and/or TCON development is highly desired.Able to work with cross functional teams within Apple and external vendors across geographical boundaries to resolve architectural and implementation challenges with an eye towards schedule.Good verbal and written communication skills.BS+10 Years of Relevant Industry ExperienceSome travel required.", "jobDescription": "Are you a leader? Do you want to utilize your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively? Can you deliver on a predictable and dynamic schedule? We have an extraordinary opportunity for senior level engineers to drive and lead technical engagements between Apple and silicon suppliers working on groundbreaking technologies! \n\nThe Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, and AppleTV. Apple is looking for remarkable applicants for our Display Digital Design lead role to work with multi-functional teams and external vendors to define, develop and productize the next generation of devices."}, "200451970": {"jobID": "200451970", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CAD Custom EM/IR Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451970/cad-custom-em-ir-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "We are counting on your expertise in developing EM and IR related flows and automation for better accuracy and efficient runs.You are experienced in usage of EMIR analysis tools and knowledgeable on their working principles and methods, including hierarchical AOT (Analog-on-Top) analysis.You are familiar with custom design environment and flows, such as schematic/layout design, simulation, extraction, physical verification and timing analysis.You have experience in supporting design teams with ramping the work environment, correct settings and reliable runs.You can work directly with the tool vendors, and drive them to resolve tools bugs as well as implement required improvements.Your communication skills are excellent, and like the rest of us at Apple you love working in an open and multi-cultural environment.Minimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming phenomenal products very quickly. Do you want to bring passion and dedication to your job? There's no telling what you could accomplish at Apple.\n\nThe people who work here have reinvented entire industries with Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices - we continue to strengthen our commitment to leave the world better than we found it!\n\nAs a key member of our best-in-class CAD Group, you will be part of building innovative designs. We will apply your hands-on experience in power EM/IR analysis to define, develop and refine the methodologies and flows which enable transistor-level as well as gate level analysis. Major tasks will include functional static / dynamic IR analysis, scan mode IVD analysis, package model handling, power EM analysis, SigEM, power switch modeling, design abstraction and reuse for EM/IR purposes, IP / SoC level EMIR sign-off / ECO, and much more.\n\nAre you ready to join some of the world's leading engineers, and help us deliver the next generation of ground-breaking Apple products?"}, "200451969": {"jobID": "200451969", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless SoC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451969/wireless-soc-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "This position requires familiarity with the ASIC design flowKnowledge of digital design, SoC architecture, and HDL languages like VerilogExposure to design methodologies and industry standard EDA toolsExperience with AXI/AHB bus fabric and processor sub-systemsUnderstanding of UPF and low-power design & implementation techniques is a plusSelf-starter and willingness to learnBS required.", "jobDescription": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. All of this is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply!"}, "200451966": {"jobID": "200451966", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless SoC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451966/wireless-soc-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "This position requires familiarity with the ASIC design flowKnowledge of digital design, SoC architecture, and HDL languages like VerilogExposure to design methodologies and industry standard EDA toolsExperience with AXI/AHB bus fabric and processor sub-systemsUnderstanding of UPF and low-power design & implementation techniques is a plusSelf-starter and willingness to learnBS with 3+ years relevant experience required.", "jobDescription": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. All of this is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply!"}, "200332527": {"jobID": "200332527", "origin_search": null, "posted": "Sep 28, 2022", "jobTitle": "Systems Engineer - Power Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200332527/systems-engineer-power-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in relevant field (EE, Physics)\n10+ years work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "You have a consistent track record in developing products with challenging low power requirementsStrong background in PMIC specs and product integration of PMICsStrong background in converter topologiesSound EE fundamentalsStrong understanding of electrical design trade-offs, manufacturing complexities, and characterization methodologiesUnderstanding of battery architecturesUnderstanding of battery performance and challenges involved in integrationUnderstanding of thermal performance and challenges in productsAbility to learn quickly and become familiar with overall product goals and challengesStrong social skills across organizations and at the executive levelExcellent written skills for clear reporting of data analysis and conclusionsBS/MS/PhD in relevant field (EE, Physics)\n10+ years work experience", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it!\n\nWe are seeking a highly motivated, upbeat Power Architect to address power-performance-thermal challenges faced in our products.  You have an analytical mind for requirements trade-off analysis impacting system performance and product experience.  This role requires excellent analytical skills and very good written and verbal communication skills."}, "200397312": {"jobID": "200397312", "origin_search": null, "posted": "Jun 30, 2022", "jobTitle": "Media Infrastructure Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200397312/media-infrastructure-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of industry experience & project management experienceExperience in hybrid on premise and cloud compute capacity planning, build out, and compute benchmarking (ex. Deadline, OpenCue)Experience in setup and management of production tracking databases and version control systems (ex. Shotgrid, Ftrack, Perforce)Experience building high performance hybrid cloud computing and storage, virtualization, Kubernetes, in service of media and entertainment workflowsExperience programming in Python (C, C++, Objective-C, or Swift a plus)Scale out storage management such as NetApp, Qumulo, PureUnderstanding and management experience with Cisco network architecturePython experience is a plusBS in Computer Science or equivalent experience", "jobDescription": "Are you interested in joining an award-winning team devoted to doing exciting and innovative work?\n\nAs a company, Apple strives to surprise and delight our millions of customers, and our team in particular makes a point of operating at the intersection of imagination and technology! You will be a core contributor in our team to develop and maintain a modern deployment system for cloud services and applications. You will be responsible for system bringup, deployment, reliability, security and service scalability. You will interact with other members of a talented, inclusive, cross-discipline team. This is a highly collaborative environment that is results driven through critical thinking, goal-oriented action, follow through, open communication, and cool under pressure.\n\nDo you want to be a vital part of a diverse organization crafting groundbreaking technology? Then we want to hear from you!"}, "200464195": {"jobID": "200464195", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "CAD Engineer – Analog/RF Simulation Flow & Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464195/cad-engineer-analog-rf-simulation-flow-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 10 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong expertise in circuit simulations with Analog/RFIC design and/or related CAD/automation support areas involving various technology nodes and tape out.Expertise with Cadence ADE environment including knowledge of Schematic Editor, PDK, CDF, Callbacks, Netlisting, Analog Design Environment (ADE-L/XL/GXL/Maestro), OCEANProficient in Spice simulators, including Spectre, Spectre RF, AFS (BDA), Hspice, ADS, GoldenGate, AMS Designer, XA, Hsim, and FineSim.Strong ability to solve simulation accuracy, speed and capacity issues. Knowledge of AC, DC, Tran, Harmonic Balance, S-parameters, Periodic noise, PSS simulations.Expertise in device level SOA checks, ERC asserts, statistical simulations using Monte Carlo, PVT and Reliability/aging analysis involving Self-Heating is a plus.Experience in evaluating simulation and environment related CAD tool/product applications and driving EDA vendors to meet design requirements.Understand custom IC designs, and knowledge of Post-layout DSPF/SPF extraction. Knowledge of behavioral RTL/AMS circuits, experience in Verilog- A/AMS. Knowledge of PDK and spice models qualification.Efficient programming skills in SKILL language, Python, Perl, TCL, or Shell. Ability to provide automations for rapid and dynamic design needs. Knowledge in Perforce and/or regressions is preferred.Good written and verbal communication skills, and the ability to collaborate well with multi-functional teams and external vendors.Minimum requirement of BS + 10 years of relevant industry experience.", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nAs a member of our CAD team, you will architect, develop, maintain and enhance simulation methodology and solutions for our Analog, RF and mixed-signal designs. \n\nThe role requires working with different technology nodes and provide flows/methodologies for the different tool sets. Working in a small CAD team, you will be collaborating with the analog, mixed-signal, and RF circuit design teams. The role will also involve partnering with layout design, technology, and 3rd party EDA tool vendors to drive and coordinate effort of developing and validating simulation flows, enhancing custom design environment, validating checks and doing results analysis."}, "200464505": {"jobID": "200464505", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "CAD Engineer – Analog/RF Simulation Flow & Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464505/cad-engineer-analog-rf-simulation-flow-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 10 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Strong expertise in circuit simulations with Analog/RFIC design and/or related CAD/automation support areas involving various technology nodes and tape out.Expertise with Cadence ADE environment including knowledge of Schematic Editor, PDK, CDF, Callbacks, Netlisting, Analog Design Environment (ADE-L/XL/GXL/Maestro), OCEANProficient in Spice simulators, including Spectre, Spectre RF, AFS (BDA), Hspice, ADS, GoldenGate, AMS Designer, XA, Hsim, and FineSim.Strong ability to solve simulation accuracy, speed and capacity issues. Knowledge of AC, DC, Tran, Harmonic Balance, S-parameters, Periodic noise, PSS simulations.Expertise in device level SOA checks, ERC asserts, statistical simulations using Monte Carlo, PVT and Reliability/aging analysis involving Self-Heating is a plus.Experience in evaluating simulation and environment related CAD tool/product applications and driving EDA vendors to meet design requirements.Understand custom IC designs, and knowledge of Post-layout DSPF/SPF extraction. Knowledge of behavioral RTL/AMS circuits, experience in Verilog- A/AMS. Knowledge of PDK and spice models qualification.Efficient programming skills in SKILL language, Python, Perl, TCL, or Shell. Ability to provide automations for rapid and dynamic design needs. Knowledge in Perforce and/or regressions is preferred.Good written and verbal communication skills, and the ability to collaborate well with multi-functional teams and external vendors.Minimum requirement of BS + 10 years of relevant industry experience.", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nAs a member of our CAD team, you will architect, develop, maintain and enhance simulation methodology and solutions for our Analog, RF and mixed-signal designs. \n\nThe role requires working with different technology nodes and provide flows/methodologies for the different tool sets. Working in a small CAD team, you will be collaborating with the analog, mixed-signal, and RF circuit design teams. The role will also involve partnering with layout design, technology, and 3rd party EDA tool vendors to drive and coordinate effort of developing and validating simulation flows, enhancing custom design environment, validating checks and doing results analysis."}, "200440038": {"jobID": "200440038", "origin_search": null, "posted": "Nov 2, 2022", "jobTitle": "Engineering Project Manager, Retail and Events Product Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440038/engineering-project-manager-retail-and-events-product-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA degree or 5- 10+ years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Identify and direct all resources required to execute successful projectsCreate and maintain project timelines, develop product strategyCollaborate and facilitate communication across engineering managers, operations manager, marketing managers and our OEM partners to meet schedule, and quality goals.Lead cross-functional communication between project teams and external vendorsProvide timely issue resolution and critical path managementOffer multiple levels of status across a wide spectrum of individual contributors to executive managementPossess strong presentation skillsUnderstand technical issues and drive them to closure by bringing together key stakeholders for decision makingWork on multiple projects simultaneouslyExcellent communication, organizational and leadership skillsAbility to juggle multiple tasks, dates, deadlines, and deliverablesAbility to filter and distill relevant information for the right audienceSelf motivated and proactive with demonstrated creative and critical thinking capabilitiesAbility to work in a high-pressure fast paced environmentUnderstands and deals well with rapid development cycles; remains flexible and calm in the face of ambiguityExperience with portable consumer electronics devices and familiarity with mechanical enclosure partsDetailed knowledge of product development processes as well as a strong understanding of manufacturing processesExperience interfacing with Operations, Mechanical Engineering/Design and MarketingBS/BA degree or 5- 10+ years of industry experience", "jobDescription": "As an Engineering Project Manager within the Product Design organization you will be responsible for managing the development and implementation process for our Retail and Events.\n\nIf you're passionate about innovation and building technology that will make a difference, we may have the job for you!  \n\nIn this role you will drive the day-to-day activities to meet the overall program objectives, product integration and ensure trade compliance as well as consumer laws are met enabling the product to ship worldwide."}, "200456741": {"jobID": "200456741", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Legal Counsel, IP Litigation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456741/legal-counsel-ip-litigation?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "JD degree or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$172,000", "max": "$258,500,"}, "benefits": null, "requirements": "5-15 years of major law firm and/or in-house patent litigation experienceStrong technology interest and aptitudePreference given to candidates who have significant trial experienceExcellent communication, analytical, organization, and negotiation skills are essentialFederal Circuit clerkship experience is a plusJD degree or equivalent", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nDo you love taking on big challenges without precedent? Do you possess a deep knowledge of the legal field and a passion for innovation? As a part of our Legal group, you’ll help uphold Apple’s high ethical and corporate standards, as well as defend our intellectual property. You’ll help provide legal support for all our products and businesses across the globe. Working for a company that invents entire categories and industries means you’ll be challenged to creatively apply your deep legal expertise to rare and often unexplored aspects of the law. Together with your team, you’ll provide the critical support needed worldwide for all Apple products and businesses.\n\nWe are looking for a patent litigator with great judgment and communication skills, and a demonstrated ability to manage the day to day progress of patent cases. You will be a self-starter who can quickly learn Apple's patent litigation docket and practices, identify and manage risks and exposures, and find strategic opportunities for resolution."}, "200455835": {"jobID": "200455835", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Processor Emulation and FPGA Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455835/cpu-processor-emulation-and-fpga-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceThe primary skills required for this job are RTL design, simulation, expertise in mapping designs to emulation, improving model performance, excellent communication skills, and ability to work in a fast-paced exciting environment.The ideal candidate should have extensive experience in the following areas:Hardware Emulation/FPGA Platforms and tools (Palladium, Zebu, and/or HAPS)Computer ArchitectureRTL developmentVHDL, Verilog, SystemVerilog (DPI and transactors)Simulation acceleration knowledge and FPGA prototypingGate-level understanding of RTL and SynthesisLogic simulation: VCS, NCSIM/VerilogProgramming/scripting skills (C, C++, Python)Software Debug tools (e.g. gdb)CPU and SOC system level debuggingMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!"}, "200451507": {"jobID": "200451507", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "PMU Design Verification Engineer: Analog & Mixed Signal Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451507/pmu-design-verification-engineer-analog-mixed-signal-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to verify analog/mixed-signal designs in a collaborative team environment.Proficient in hardware descriptive languages: Verilog, System-Verilog, and/or Verilog-AMS code.Familiarity with authoring analog assertion checks to catch bugs.Capability to identify failure mechanisms and review verification results in analog IC designs.Ability to write test plans, present results, and communicate clearly with multi-functional teams.Comfortable with running simulations through compute clusters while optimizing simulation and wall time.Understanding of both power management and related auxiliary circuitry: switching converters, linear converters, reference circuitry, bandgaps, data converters, and/or clock generators.Have a familiarity with verification methodologies and tools: simulators, waveform viewers, execution automation, coverage collection, gate level simulations.Experience developing scalable and portable test benches.A background that includes scripting or programming languages is preferred. These include, but are not limited to, TCL, Skill, Python, and/or PERL.Your familiarity with analog behavioral models is also a plus.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Did you know that Apple is hiring analog & mixed signal verification engineers? We are looking for engineers that are enthusiastic to find bugs! You have the opportunity to work with a creative team to craft test plans and enable production-quality first silicon. As a member of the analog and mixed signal verification team, you will be working with specialists for full-chip verification of the state of the art mixed-signal systems used in Apple’s world-leading products!"}, "200451374": {"jobID": "200451374", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Timing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451374/timing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Prefers extensive and relevant experience in Physical Design on high PHY and/or SOC designsDeep knowledge of industry standards and practices in Timing closures, Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route Experience in developing and implementing STA constraintsDeep understanding of all aspects of Timing flow, Physical construction, Integration and Physical VerificationConfirmed knowledge of Basic SoC Architecture and HDL languages like Verilog to collaborate with our logic design team for timing fixesExperienced user of industry standard Timing, Physical Design and Synthesis toolsDeep Understanding of scripting languages such as Perl/TclBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and outstandingly hardworking Timing Design Engineer. As a member of our multifaceted group, you will have the outstanding and phenomenal opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day.\n\nIn this role, you will be at the center of a PHY design effort collaborating with architecture, CAD, logic design teams, with a critical impact on delivering outstanding PHY designs. You will be directly involved in timing closure and/or physical designs of outstanding PHY design."}, "200458129": {"jobID": "200458129", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "CAD Engineer - AMS Simulation Flow and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458129/cad-engineer-ams-simulation-flow-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficient in using industry-standard mixed-signal simulation tools, such as Cadence - Xcelium (Incisive), SimVision, AMS Designer; Synopsys - VCS, Verdi; Mentor – Symphony, QuestaFamiliarity with industry-standard analog simulation tools, including Cadence Spectre, Synopsys CustomSim/PrimeSim (XA)/HSPICE/Finesim, Mentor AFSThe ability to solve simulation accuracy, speed, and capacity issuesExperience with AMS techniques, including disres, binding, IE setup, Connect Modules, AMSD block, wreal, TCL probes, real number modeling, UDNs, etc.Strong understanding of behavioral and functional circuit description languages, including SystemVerilog, VerilogA, Verilog, Verilog-AMS, VHDLUnderstanding of custom IC designs and transistor description formats, SPICE, DSPF, etc., and functional modelingAdvanced programming skills, mainly in Perl, Python, TCL, SKILL, and ShellKnowledge of Schematic Editors, PDK, CDF, Callbacks, netlistingExperience with Virtuoso Analog Design Environment (ADE-Explorer/Assembler/L/XL/GXL) is desirableExcellent written and verbal communication skills, project planning capabilities, and collaboration with cross-functional teamsMinimum requirements of BS degree + 10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chips (SoCs). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nAs a member of our CAD team, you will architect, develop, maintain and enhance AMS (Analog/Mixed-Signal) simulation methodology and solutions for our analog, RF, and mixed-signal designs. The role requires you to work with different technology nodes and provide flows/methodologies for the different tool sets. You will be collaborating closely with design teams. You will drive and coordinate efforts to develop and validate AMS/co-simulation flows, providing ease of use, speeding up design validation, and ensuring functional silicon."}, "200458783": {"jobID": "200458783", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "CAD Engineer - AMS Simulation Flow and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458783/cad-engineer-ams-simulation-flow-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in using industry-standard mixed-signal simulation tools, such as Cadence - Xcelium (Incisive), SimVision, AMS Designer; Synopsys - VCS, Verdi; Mentor – Symphony, QuestaFamiliarity with industry-standard analog simulation tools, including Cadence Spectre, Synopsys CustomSim/PrimeSim (XA)/HSPICE/Finesim, Mentor AFSThe ability to solve simulation accuracy, speed, and capacity issuesExperience with AMS techniques, including disres, binding, IE setup, Connect Modules, AMSD block, wreal, TCL probes, real number modeling, UDNs, etc.Strong understanding of behavioral and functional circuit description languages, including SystemVerilog, VerilogA, Verilog, Verilog-AMS, VHDLUnderstanding of custom IC designs and transistor description formats, SPICE, DSPF, etc., and functional modelingAdvanced programming skills, mainly in Perl, Python, TCL, SKILL, and ShellKnowledge of Schematic Editors, PDK, CDF, Callbacks, netlistingExperience with Virtuoso Analog Design Environment (ADE-Explorer/Assembler/L/XL/GXL) is desirableExcellent written and verbal communication skills, project planning capabilities, and collaboration with cross-functional teamsMinimum requirements of BS degree + 10 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chips (SoCs). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nAs a member of our CAD team, you will architect, develop, maintain and enhance AMS (Analog/Mixed-Signal) simulation methodology and solutions for our analog, RF, and mixed-signal designs. The role requires you to work with different technology nodes and provide flows/methodologies for the different tool sets. You will be collaborating closely with design teams. You will drive and coordinate efforts to develop and validate AMS/co-simulation flows, providing ease of use, speeding up design validation, and ensuring functional silicon."}, "200459317": {"jobID": "200459317", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Systems Engineering Program Manager (EPM) - SCG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459317/systems-engineering-program-manager-epm-scg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS degree in engineering/computer science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "4+ years experience in HW/Systems Program Management or Engineering Management work, managing cross-functional teams on HW/SW integration in development and architecture phases.Solid project management skills and attention to detail. Ability to manage multiple projects with competing priorities.Understands and deals well with rapid development cycles; remains flexible and calm in the face of uncertainty.Ability to filter and distill relevant information for the right audience, coupled with excellent verbal and written communication skills.Self motivated and proactive with demonstrated creative and critical thinking capabilities.Preferred- Experience with antennas preferredBS/MS degree in engineering/computer science or equivalent experience.", "jobDescription": "Do you want to be right in the middle of delivering something truly remarkable?\n\nApple is seeking an experienced System Engineering Program manager to work with internal and external cross-functional teams to realize and exciting new capability. This EPM role will be heavily focused on working with the team to design, validate, manufacture, and deploy the HW/SW systems needed to enable an exciting new capability. This EPM will be responsible for aligning and driving trade studies, make vs buy decisions, as well as, the development, validation, and manufacturing programs to bring these systems into use. \n\nEPMs facilitate good communication and offer multiple levels of status across a wide spectrum of individual contributors to executive management. In addition, they will drive day-to day program activities, development planning, execution & risk assessments to meet overall program objectives for development projects.\n\nOur teams feature a collaborative environment with creative people and cutting edge technologies. Engineering excellence is expected and encouraged. Come, join us in crafting solutions the world doesn’t know of yet!"}, "200417195": {"jobID": "200417195", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Retail Online WW Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200417195/retail-online-ww-program-manager?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS preferred, MBA desirable"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$234,000,"}, "benefits": null, "requirements": "You are an excellent teammate with a “hands-on” and “can do” attitude that can influence through collaboration and leadership. Being able work effectively with other teams and taking them along for the journey is critical.You possess excellent communication and presentation skills at all levels of the organization (from specialists to senior leaders) and across multiple teams (RCC, Product, Store Ops, Ops, Finance, etc)Possess prioritization skills to constantly focus on the most important project in a constantly evolving environmentAnalytical, curious and creative mind setAbility to see the big picture while also zooming into the micro level technical detailA driver who is self-motivated and operates with a phenomenal sense of urgencyAbility to drive progress under immense degree of ambiguity and be comfortable working in an unstructured environmentExcellence and keen eye for detail should be a habitAbility to make key decisions and deliver results under very tight timelinesPassion for the customer experienceAbility to troubleshoot problems quickly and think creatively to solve problemsThe successful candidate will be experienced in the development and delivery of initiatives that will improve end to end customer experience, specialist workflows, improve performance and deliver a best in class customer experience within the functions at a global level..Can quantify results of strategy and tactical initiatives and drive decisions based on data.Must understand the end-to-end impact to the RCC teams, our customers and our Specialists when making strategic decisions on programs and initiatives that we will be supporting.Able to quickly gain credibility and mobilize resources across a WW organization covering multiple time zones.. Be able to make critical decisions, influence decisions and facilitate change management through collaboration and leadershipTeam player with a positive attitude, empathizing with multiple points of view but able to make the hard call and move onComfortable changing/evolving what’s not broken, looking for alternatives and never stop asking whyBA/BS preferred, MBA desirable5+ years experience of program and/or project management, contact center environment or relevant e-Commerce experience.1-2 years experience working in a global capacityJoin a worldwide company that welcomes the whole wide world.Our customers are all over the world, so it’s by design that Apple employees are all over the world, too. And we know our ability to continue creating the world’s most innovative products depends on people who represent the variety of the human experience and who inspire us with great thinking. Because the broader the backgrounds and perspectives, the bigger the ideas.At Apple, we’re not all the same. And that’s our greatest strength. We draw on the differences in who we are, what we’ve experienced, and how we think. Because to create products that serve everyone, we believe in including everyone.", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe Retail Customer Care Optimization team is seeking a highly-motivated professional to manage WW programs that span across the Retail Contact Center, Apple Online, Retail Stores and other customer-facing channels. Our global Support teams provide customer service support across Web, Mobile, and many different contact center locations around the world."}, "200452530": {"jobID": "200452530", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Next Generation Wireless Modem Prototype Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452530/next-generation-wireless-modem-prototype-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proven track record in prototyping of cellular 4G/5G user equipment or base station systems using proof-of-concept HW or FPGA platformsExperience in setting up and managing lab activities including defining end-to-end setup with DUT, emulators, faders, RF transceivers and lineups, and OTA chambersExperience in deploying test equipment solutions for cellular user equipment or base station tests for RF, PHY and e2e behavior and performance measurementsKnowledge of 3GPP LTE or NR standards including UE physical layer, UE procedures, packet processing layer, radio resource control and managementExperience with network performance and power monitoring toolsPrior experience coordinating with leading wireless infrastructure partners for feature development and demos both in lab and field is a plusPrior experience generating contributions based on research findings for wireless standardization bodies or consortia is a plusBS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Smart people and inspiring, innovative technologies are the norm here. Are you ready to be part of a team transforming wireless technology? Come and work on challenges that no one has solved yet! We invite you to join us to help deliver the next groundbreaking Apple product."}, "200452521": {"jobID": "200452521", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Next Generation Wireless Modem Prototype Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452521/next-generation-wireless-modem-prototype-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven track record in prototyping of cellular 4G/5G user equipment or base station systems using proof-of-concept HW or FPGA platformsExperience in setting up and managing lab activities including defining end-to-end setup with DUT, emulators, faders, RF transceivers and lineups, and OTA chambersExperience in deploying test equipment solutions for cellular user equipment or base station tests for RF, PHY and e2e behavior and performance measurementsKnowledge of 3GPP LTE or NR standards including UE physical layer, UE procedures, packet processing layer, radio resource control and managementExperience with network performance and power monitoring toolsPrior experience coordinating with leading wireless infrastructure partners for feature development and demos both in lab and field is a plusPrior experience generating contributions based on research findings for wireless standardization bodies or consortia is a plusBS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Smart people and inspiring, innovative technologies are the norm here. Are you ready to be part of a team transforming wireless technology? Come and work on challenges that no one has solved yet! We invite you to join us to help deliver the next groundbreaking Apple product."}, "200458035": {"jobID": "200458035", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Wireless Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458035/wireless-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 0+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "BS and 0+ years of relevant industry experience.Wireless/Wired communication block/system verification experience preferred.Advanced knowledge of SystemVerilog, SystemVerilog Assertion (SVA), and DV methodology.Solid verification skills in problem solving, constrained random testing, and debugging.Verification experience of one or more of the following a plus: MAC, PHY, DMA, timer, AMBA bus and fabric, encryption/decryption engine.Knowledge of wireless protocols such as Bluetooth, WLAN, or Zigbee a plus.Should be a great teammate with excellent communication skills and the desire to take on diverse challenges.BS and 0+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.BS+ 0 years of relevant experience. MS preferred.", "jobDescription": "Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nAs a Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of communication subsystem including MAC, PHY, and interfaces. With deep understanding of communication systems and protocols, you will interact with DV methodologists, designers and communication systems engineers to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification."}, "200406425": {"jobID": "200406425", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - California State University Chico", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406425/apple-support-college-program-california-state-university-chico?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Chico", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$23.00", "max": "$23.00."}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406712": {"jobID": "200406712", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Texas A&M University, College Station", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406712/apple-support-college-program-texas-a-m-university-college-station?team=STDNT", "jobLocation": {"remote": "not specified", "city": "College Station", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406839": {"jobID": "200406839", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of Texas at Arlington", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406839/apple-support-college-program-university-of-texas-at-arlington?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Arlington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406462": {"jobID": "200406462", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Florida State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406462/apple-support-college-program-florida-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Tallahassee", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406849": {"jobID": "200406849", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Winston-Salem State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406849/apple-support-college-program-winston-salem-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Winston-Salem", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406713": {"jobID": "200406713", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Texas Southern University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406713/apple-support-college-program-texas-southern-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Houston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406777": {"jobID": "200406777", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of Central Florida", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406777/apple-support-college-program-university-of-central-florida?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200451972": {"jobID": "200451972", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless SoC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451972/wireless-soc-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "This position requires familiarity with the ASIC design flowKnowledge of digital design, SoC architecture, and HDL languages like VerilogExposure to design methodologies and industry standard EDA toolsExperience with AXI/AHB bus fabric and processor sub-systemsUnderstanding of UPF and low-power design & implementation techniques is a plusSelf-starter and willingness to learnBS with 3+ years relevant experience required.", "jobDescription": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. All of this is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply!"}, "200452236": {"jobID": "200452236", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Physical Design Methodology and CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452236/physical-design-methodology-and-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of Bachelors Degree + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in CAD flow or PD methodology development.Proficiency with Tcl, Python or Perl scripting languages.Expert knowledge of industry standard PNR tools.Deep understanding and experience in analysis aspects of Physical Design - extraction, timing, noise, physical verification, EMIR.Hands on experience with high performance and low power implementation flows.Experience using or supporting signoff tools for design closure.Be able to drive tool/flow improvements independently, present findings to broad audience.Minimum requirements of Bachelors Degree + 10 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? In this role you'll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAs part of the Hardware Technology CAD team, you’ll help design our next-generation, high-performance, power-efficient SoCs. You will work on world class CPU, GPU, Analog/Mixed Signal and SOC designs by developing flows, tools and methodologies for future Apple products! You will explore and enable new technology nodes, stdcells and tools for design teams. You will collaborate with design teams and tool vendors to improve PPA (Power, Performance, Area) and design productivity. You will actively work on developing internal methodologies using your understanding of CAD algorithms and ML.\n\nWe are looking for passionate engineers to join our team. In this role, you will be impacting a wide range of chips used across Apple’s world-class products!"}, "200450097": {"jobID": "200450097", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Wireless Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450097/wireless-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Wireless/Wired communication block/system verification experience.Advanced knowledge of SystemVerilog and DV methodology.Solid verification skills in problem solving, constrained random testing, and debugging.Verification experience of one or more of the following: MAC, PHY, DMA, timer, AMBA bus and fabric, encryption/decryption engine.Knowledge of wireless protocols such as Bluetooth, WLAN, or Zigbee a plus.Experience with SystemVerilog Assertion (SVA) a plus.Should be a great teammate with excellent communication skills and the desire to take on diverse challenges.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nAs a Wireless Design Verification Engineer, you will be responsible for pre-silicon RTL verification of communication subsystem including MAC, PHY, and interfaces. With deep understanding of communication systems and protocols, you will interact with DV methodologists, designers and communication systems engineers to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification."}, "200451376": {"jobID": "200451376", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal IP Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451376/analog-mixed-signal-ip-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Preferred validated experience in IP design integration and implementation with multiple clock domains and multiple power domains.Deep knowledge and experience in various tools such as RTL simulation, lint, logic equivalence, version control, synthesis, static timing analysis, CDC, RDC in order to generate gate level netlist and perform various checks.Working experience with the physical design teamsDeep knowledge of VLSI design methodology ranging from RTL to sign-off and familiarity with programming language such as Perl, Tcl, shell scriptsIdeal candidate will be familiar with version control, CVS, Perforce, ClearCase.Excellent interpersonal skills and interaction experience with sub block owners, physical design teams and different engineering groupsBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and uncommonly hardworking AMS front end integration engineer. As a member of our wide-ranging group, you will have the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day.\n\nIn this role, you will be involved with PHY design effort collaborating with architecture, CAD, logic design teams, with a critical impact on delivering outstanding PHY designs."}, "200451371": {"jobID": "200451371", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "IP Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451371/ip-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine, CA", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Preferred validated experience in IP design integration and implementation with multiple clock domains and multiple power domains.Deep knowledge and experience in various tools such as RTL simulation, lint, logic equivalence, version control, synthesis, static timing analysis, CDC, RDC in order to generate gate level netlist and perform various checks.Working experience with the physical design teamsDeep knowledge of VLSI design methodology ranging from RTL to sign-off and familiarity with programming language such as Perl, Tcl, shell scriptsThe ideal candidate will be familiar with version control, CVS, Perforce, ClearCase.Excellent interpersonal skills and interaction experience with sub block owners, physical design teams and different engineering groupsBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and uncommonly hardworking AMS front end integration engineer. As a member of our wide-ranging group, you will have the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day.  In this role, you will be involved with PHY design effort collaborating with architecture, CAD, logic design teams, with a critical impact on delivering outstanding PHY designs."}, "200450229": {"jobID": "200450229", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Custom Logic and Mixed-signal Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450229/custom-logic-and-mixed-signal-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "The ideal candidate will have minimum of 3 years of industry experience and possess the following qualifications:Experience in transistor- and gate-level custom logic design.Experience in transistor- and gate-level static timing and noise analysis.Experience in mixed-signal design such as PLL and SerDes is a plus.Experience in SRAM design is a plus.Experience with NanoTime, PrimeTime, and Tempus STA tools is a plus.Proficiency in circuit modeling and simulation, including SPICE models and worst-case corner selection.Good understanding of tool algorithms for noise glitch, cross-talk delay, and margining with OCV / AOCVM / POCV.Familiarity with synthesis, logic equivalence, DFT, and backend related methodologies and tools.Familiarity with ECO techniques and implementation is a plus.Strong communication and interpersonal skills.MSEE or PhD is required.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "Imagine what you could do here at Apple? Together we could help craft the next generation of the world’s finest devices. New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish. The Display and Touch Silicon (DTS) team is searching for a self-motivating engineer for the role of Custom Logic and Mixed-signal Design engineer.\n\nAs a member of the DTS team, we will be working on the leading-edge technology to build best-in-class custom mixed-signal designs used to connect our world-class products to the world as well as optimizing their performance. You will become part of a development team that cultivates engineering excellence, creativity, and innovation. Collaboration across teams is a key component of success at Apple. The right candidate will thrive in this type of environment. Dynamic, smart people and inspiring, innovative technologies are the norm here. Will you help us design the next generation of revolutionary Apple products?"}, "200464760": {"jobID": "200464760", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "US-Senior Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464760/us-senior-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "CambridgeSide", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to collaborate with the store leadership team to develop strategic plans across multiple business groups, improving process and surpassing standards to drive the business in the storeProven ability to inspire, coach, train, and develop store team members to consistently provide exceptional customer service and drive for resultsExperience adapting to challenges, providing support, and guiding communications in a constantly changing retail environment• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome — a retail background is not necessary.• You have a passion for learning about Apple technology and products.• You’re fluent in English (both written and spoken) and the local language. Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a real passion for helping others learn and grow?   The challenges and opportunities of a continuously evolving business make leadership at the Apple Store a rewarding career. It’s your job as a Senior Manager to lead the staff and operations of one or more store areas and seek solutions and results that create a high-performing work environment. By reading situations quickly and acting courageously, you are able to build success for the business and promote the Apple brand through unparalleled customer service."}, "200446106": {"jobID": "200446106", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "US-Senior Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446106/us-senior-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Various Locations within New York City Metro Area", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.15", "max": "$75.45/hr,"}, "benefits": null, "requirements": "Ability to collaborate with the store leadership team to develop strategic plans across multiple business groups, improving process and surpassing standards to drive the business in the storeProven ability to inspire, coach, train, and develop store team members to consistently provide exceptional customer service and drive for resultsExperience adapting to challenges, providing support, and guiding communications in a constantly changing retail environment• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome — a retail background is not necessary.• You have a passion for learning about Apple technology and products.• You’re fluent in English (both written and spoken) and the local language. Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a real passion for helping others learn and grow?   The challenges and opportunities of a continuously evolving business make leadership at the Apple Store a rewarding career. It’s your job as a Senior Manager to lead the staff and operations of one or more store areas and seek solutions and results that create a high-performing work environment. By reading situations quickly and acting courageously, you are able to build success for the business and promote the Apple brand through unparalleled customer service."}, "200460763": {"jobID": "200460763", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460763/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Professional coding skills in Verilog or SystemVerilogSophisticated knowledge of standard ASIC design and verification flows including RTL design, simulation and testbench development, coverage analysis and constrained random testingAdvanced knowledge of HVL methodology like UVM/OVM is a big plusExperience with SystemVerilog Assertion (SVA)Experience writing scripts in languages such as Perl or Python is a plusExperience with Formal Verification is a plusBS and 3+ years of relevant experience required.", "jobDescription": "Imagine what you could do here at Apple! New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love working on challenges that no one has solved yet? Bring passion and dedication to your career, and there's no telling what you could accomplish.\n\nOur Display Technologies Engineering team is working on the next generation of groundbreaking products using best in class tools, flows and methodologies. Come join our team and be a part of the excitement!"}, "200459670": {"jobID": "200459670", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Product Design Engineer - Home", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459670/product-design-engineer-home?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Mechanical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "2+ years of experience in product designStrong engineering fundamentals and high personal motivationDesign intelligence: accurate mechanical intuition, creative problem solving, inquisitive nature, attention to detailStrong communication skills: written, visual, and verbal. Ability to clearly convey design ideas and contribute to brainstormsExperience developing parts and assemblies in 3-D CADExperience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing.Working knowledge of finite element analysis theory and modeling.Flexibility and comfort working in a quickly changing environment.Ability to travel internationally (up to 20%).BS in Mechanical Engineering", "jobDescription": "The Home Product Design team is inventing the next generation of products for the home. Our PD team is responsible for conceiving, designing, testing, troubleshooting, and bringing into production new products that define the home and music experiences. We work closely with many different disciplines across various organizations including Industrial Design, Audio Engineering, Packaging, Sensing, Hardware, Operations and Marketing (among others) to develop the best products for our customers. We are known for producing the industry’s best performing and most beloved home devices, with the goal of bringing them to many more customers in the years to come.\n\nEfficiently integrating so many different pieces into brand new products means every day is different. Time might be spent on ideation in the ID studio, creating a plan to integrate and test brand new technologies in never before seen form factors, or going deep on design details - sometimes all in one day. Always with an eye towards sustainable, cost effective, high performing, and beautiful products.\n\nKey Qualifications:\n\nStrong engineering fundamentals and high personal motivation\nDesign intelligence: accurate mechanical intuition, creative problem solving, inquisitive nature, attention to detail\nStrong communication skills: written, visual, and verbal. Ability to clearly convey design ideas and contribute to brainstorms\nExperience developing parts and assemblies in 3-D CAD\nExperience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing.\nWorking knowledge of finite element analysis theory and modeling.\nFlexibility and comfort working in a quickly changing environment.\nAbility to travel internationally (up to 20%).\n\n\nDescription:\n\nWe are looking for a highly motivated product design engineer. As a member of our team you would be expected to:\n\nWork collaboratively with various disciplines including Industrial Design, operations, and cross-functional engineering teams\nBrainstorm concepts and solutions to a wide variety of complex engineering problems\nDevelop, prototype, evaluate, and troubleshoot new designs\nLead design reviews and contribute to peer design reviews\nPresent your work to cross-functional teams and executives\nGenerate detailed specifications and drawings\nCommunicate with internal manufacturing teams and external vendors to optimize designs for function, cosmetics, and manufacturability\nConduct failure analysis and design of experiments (DOEs) to determine root cause and implement corrective actions\nValidate and characterize designs through multiple iterations\nDevelop deep technical knowledge by taking design from concept to production\nEnsure that designs meet cosmetic and functional requirements to provide best in class hardware for our customers"}, "200451948": {"jobID": "200451948", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Timing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451948/timing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS required. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Knowledge of the ASIC design flow, synthesis, static timing analysis, scripting, and netlist generation.Understanding of UPF and low-power design & implementation techniques.Hands-on experience in timing/SDC constraints generation, analysis, and management. Knowledge of timing corners, operating modes, process variations, and signal integrity-related issues.Exposure to industry standard Timing, Logic Equivalence, Physical Design and Synthesis toolsKnowledge of basic SoC Architecture and HDL languages like Verilog to collaborate with our logic design team for timing fixes and functional ECOs.Experience with script-based tool automation and familiarity with API’s and scripting languages such as Perl/Tcl is a plus.BS required. MS preferred.", "jobDescription": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. All of this is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply."}, "200452223": {"jobID": "200452223", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Physical Design Methodology and CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452223/physical-design-methodology-and-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of Bachelors Degree + 0 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Comfortable with Tcl, Python or Perl scripting languagesKnowledge or experience with industry standard physical design tools is a plusGood fundamental knowledge of VLSI design principles through coursework or work experienceExposure to analysis aspects of Physical Design - timing, noise, physical verification, electrical analysis is a plusMinimum requirements of Bachelors Degree + 0 years of industry experience", "jobDescription": "As part of the Hardware Technology CAD team, you’ll help design our next-generation, high-performance, power-efficient SoCs. You will work on world class CPU, GPU, Analog/Mixed Signal and SOC designs by developing flows, tools and methodologies for future Apple products! You will explore and enable new technology nodes, stdcells and tools for design teams. You will collaborate with design teams and tool vendors to improve PPA (Power, Performance, Area) and design productivity. You will actively work on developing internal methodologies using your understanding of CAD algorithms and ML.\n\nWe are looking for passionate engineers to join our team. In this role, you will be impacting a wide range of chips used across Apple’s world-class products!"}, "200406697": {"jobID": "200406697", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Prairie View A&M University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406697/apple-support-college-program-prairie-view-a-m-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Prairie View", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a university in the U.S.\n2.7 GPA preferred\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience, including comprehensive issue resolutionPotential for tailoring communication and style to differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS, Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a university in the U.S.\n2.7 GPA preferred\nComputer Science, Business, Engineering and Computer Information Systems majors are preferredAvailability to attend approximately six to nine weeks of required online training on a fixed schedule that may include weekends (training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m CST and 10:30 p.m. CST and one eight hour shift on Saturdays, including holidays, between the hours of 7:00 a.m and 10:30 p.m CST, with the possibility to flex up or down hours depending upon business needsSuccessful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskHigh-speed Internet service (10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency) from a reliable providerApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including, customer support. We expect everything from an Advisor that our customers do and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200370006": {"jobID": "200370006", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "WW Digital Customer Lifecycle Strategist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200370006/ww-digital-customer-lifecycle-strategist?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Completion of an undergraduate degree or equivalent experience \n\nMBA preferred but not required\n\nConsulting in digital, e-commerce, marketing experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$107,000", "max": "$209,500,"}, "benefits": null, "requirements": "Experience building and designing a customer lifecycle strategy across a matrix organizational structure for a multi-national e-commerce company.Experience identifying and advocating lifecycle strategy and programs that deliver a combination of automated, personalized, in-app/on-site and/or outbound communications at scale.Experience planning and measuring customer lifetime value including forecasting program performance across key critical metrics.Retail (online and stores), carriers, or product launch experience strongly preferredExperience working in a global organization on multi-market, multi-language projects preferredExperience leading, running and measuring large-scale engagement and marketing initiativesStrong program and project manager skillsAble to engage, influence and balance needs of multiple partners at varying levelsAble to hone in on business challenges, use insights, debate ideas, and develop an informed point of viewExtraordinary storyteller with strong written and verbal communication skills; strong at building and delivering compelling presentationsStrong passion for leveraging complex data sets and predictive analytics to design meaningful experiences.Team-player, strong collaboratorAble to work independently and with ambiguity innovating down to the details to develop a new ideaConsistently achieves results and persists in the face of challengesCompletion of an undergraduate degree or equivalent experience \n\nMBA preferred but not required\n\nConsulting in digital, e-commerce, marketing experience preferred", "jobDescription": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries! It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Are you ready to join Apple, and help us leave the world better than we found it?\n\nApple’s Retail Commercial Marketing team is seeking a WW Digital Customer Lifecycle Strategist to support the strategy development and execution of marketing campaigns for product programs within Apple Retail - across apple.com, in the Apple Store app, and in over 500 stores globally.\n\nWe are looking for someone who has demonstrated experience in designing customer comms and engagement strategies across digital and physical channels. In this role, you will be responsible for designing the customer engagement journey across moments with Apple Retail — where all of Apple comes together. You will obsess over the customer journey and actively use complex data sets, cross-functional takeaways and customer preferences to drive your decisions."}, "200406708": {"jobID": "200406708", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Sonoma State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406708/apple-support-college-program-sonoma-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Rohnert Park", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$27.75", "max": "$27.75."}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406449": {"jobID": "200406449", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Fayetteville State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406449/apple-support-college-program-fayetteville-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Fayetteville", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406826": {"jobID": "200406826", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of North Texas", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406826/apple-support-college-program-university-of-north-texas?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Denton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406703": {"jobID": "200406703", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - San Diego State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406703/apple-support-college-program-san-diego-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$23.00", "max": "$23.00."}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406813": {"jobID": "200406813", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of Houston", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406813/apple-support-college-program-university-of-houston?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Houston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406754": {"jobID": "200406754", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University North Carolina, Charlotte", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406754/apple-support-college-program-university-north-carolina-charlotte?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Charlotte", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406472": {"jobID": "200406472", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Howard University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406472/apple-support-college-program-howard-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Washington DC", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406829": {"jobID": "200406829", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of Texas at Dallas", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406829/apple-support-college-program-university-of-texas-at-dallas?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Dallas", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200447519": {"jobID": "200447519", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "ASIC Digital Design Engineer Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447519/asic-digital-design-engineer-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS+10 Years of Relevant Industry Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "BS+10 Years of relevant industry experience. Advanced degree preferred.10+ years of digital design experience in complex multi-million gate architectures and deep sub-micron technologies, achieving multiple tape-outs with a majority of the tape-outs reaching MP with first silicon.Drive and improve digital design methodology to achieve high quality first silicon.Hands on experience with FPGA emulation, silicon bring-up, characterization and debug.Experience with mixed signal design is highly desired.Experience with display interconnect standards - MIPI, DP, HDMI is a definite plus.Experience with display pipeline elements and/or TCON development is highly desired.Able to work with cross functional teams within Apple and external vendors across geographical boundaries to resolve architectural and implementation challenges with an eye towards schedule.Good verbal and written communication skills.BS+10 Years of Relevant Industry ExperienceSome travel required.", "jobDescription": "Are you a leader? Do you want to utilize your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively? Can you deliver on a predictable and dynamic schedule? We have an extraordinary opportunity for senior level engineers to drive and lead technical engagements between Apple and silicon suppliers working on groundbreaking technologies! \n\nThe Custom Silicon Management Group provides critical custom silicon for all mobile products including iPhone, iPad, and AppleTV. Apple is looking for remarkable applicants for our Display Digital Design lead role to work with multi-functional teams and external vendors to define, develop and productize the next generation of devices."}, "200376241": {"jobID": "200376241", "origin_search": null, "posted": "Sep 14, 2022", "jobTitle": "Sr. iOS Framework Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200376241/sr-ios-framework-engineer-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent Objective-C/Swift programming skills.Deep understanding of multi-threaded programming and synchronization.Experience in crafting APIs and broad experience in system design.Experience in building shipping iOS frameworks, daemons, XPC services.Excellent software design, problem solving and debugging skills.Experience with embedded systems and C++ is a plus.Experience with building Swift UI applications is a plus.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmers. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmers that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \u2028\u2028Apple benefits programmers vary by country and are subject to eligibility requirements.\u2028\u2028Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "As a member of the Special Projects Group, you will be part of a team building infrastructure and tools for exciting new hardware that will shape the future. We are building the iOS components that will power exciting new functionality in upcoming products both for internal developer workflows and for the customer experience.\n\nYou will work in a startup-like environment where products are still being defined and developed, giving you the chance to influence some of the core tools and design choices. You will be part of every stage of development from concept to deployment\n\nIf you're passionate about the user experience, want to be part of a group that works on very early stage products, have the opportunity to shape them, and relish the opportunity to deliver the next amazing Apple product, we may be the team for you!"}, "200448218": {"jobID": "200448218", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448218/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 3+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200459900": {"jobID": "200459900", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Business Development Commercial Analyst - AppleCare", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459900/business-development-commercial-analyst-applecare?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BA/BS degree plus extensive experience in finance industry. \nMS/MBA preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$135,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proven experience in Finance or Commercial operations within a high performance organization-  Understanding of or willingness to learn the AppleCare, device protection, and service businesses-  Demonstrate a passion, energy, and focus on developing and growing multi-million dollar business programs globally-  A strong command of business and financial modeling is critical to success in this role-  Excellent presentation, written, verbal and interpersonal communication skills-  Self-starter with an analytical orientation, strategic vision, and strong executional track record-  Strong quantitative, critical thinking, and decision-making skills with ability to synthesize and distill large amounts of data into action plans-  Demonstrated success providing vision and strategy while leading and developing high- performance teams in a dynamic, global organization-  Advanced knowledge of Excel requiredBA/BS degree plus extensive experience in finance industry. \nMS/MBA preferred.", "jobDescription": "At Apple, we believe in hard work, a fun environment, and the creativity and innovation that only comes about when hardworking people from a diverse set of backgrounds approach problems from varying perspectives. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. \n\nIf you’re excited by the idea of making a real impact and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job... Just be prepared to dream big!\n\nAs part of the AppleCare Business Development team, you will team up with key partners to develop and ensure the flawless execution of AppleCare’s worldwide commercial strategy along with regional sales strategies and programs. You will be a member of the WW Sales team and passionate about delivering top-line results for AppleCare as a part of Apple’s broader services strategy.\n\nThe successful candidate for this role will have the ability to: \n\nBuild and analyze commercial proposals and business cases\nFormulate, negotiate, and execute commercial strategies to help drive program growth\nDevelop long-standing partnerships with both internal and external partners\nProblem solve to help deliver innovative programs in support of AppleCare goals\n\nThis is a high profile, central role in the global team."}, "200451236": {"jobID": "200451236", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Digital Layout Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451236/digital-layout-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "We are looking for applicants experience in custom layout design of deep SubMicron CMOS circuits used in high performance microprocessors.Experience designing low noise, low power datapaths, SRAM, Register files layout structures, etc.High level proficiency in layout floorplanning, standard cell planning and hierarchical layout assembly.Good understanding of issues with RC delay, electromigration, self heating and cross capacitance.Recognize failure prone circuit and layout structures, dedicatedly work with designers for the best approach to problems.Great skills on interpretation of CALIBRE DRC, ERC, LVS, etc. reports.Knowledge of MENTOR GRAPHICS or CADENCE layout tools.Scripting skills in CSH, PERL or SKILL are considered a plus, but not required.Experience in layout automation is considered a plus, but not required.Experience in memory compiler development is considered a plus, but not required.Excellent communication skills and able to work with multi-functional teams.BS and a minimum of 3 years relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions?\n\nAs part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned.\n\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Digital Layout Designers!\n\nIn this highly visible role, you will be a member of Apple’s custom layout team, working on the latest technology nodes to create extraordinary custom digital macros, libraries, etc. This is a fast paced work environment with endless learning opportunities working in the design team with members of integration, CAD, circuit and technology engineering."}, "200464017": {"jobID": "200464017", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Business Development, Music Content", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464017/business-development-music-content?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree in Business or related subject, MBA or equivalent degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$106,500", "max": "$160,500,"}, "benefits": null, "requirements": "3 to 6 years of relevant industry work experience.Exceptional understanding of the global music licensing landscape.Intimate understanding of the digital music and content distribution industry.Outstanding business development, negotiation and partnership leadership skills.Proven track record working in international, cross-functional teams and a high growth environment.Excellent presentation, written and verbal communication skills.Willingness to travel.BA/BS degree in Business or related subject, MBA or equivalent degree preferred.Experience working in commercial and/or licensing roles within the music industry, ideally within music services.", "jobDescription": "The people here at Apple don’t just build products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! \n\nWe are seeking an expert in label and artist licensing rights to support commercial licensing relating to such rights. This is a key role to support the rapid expansion and growth of Apple Music and all use of musical content across the Apple ecosystem. We're growing and encourage you to apply. We believe the role would place you in a highly-energized environment with some of the most passionate individuals in the industry where you would be inspired to share your experience along with providing extraordinary support for the team. \n\nYou will be supporting the IS&S team’s global growth efforts with a focus on developing new partnership opportunities, negotiation of deal framework and terms, as well as supporting special strategic projects."}, "200451961": {"jobID": "200451961", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless SoC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451961/wireless-soc-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "This position requires familiarity with the ASIC design flowKnowledge of digital design, SoC architecture, and HDL languages like VerilogExposure to design methodologies and industry standard EDA toolsExperience with AXI/AHB bus fabric and processor sub-systemsUnderstanding of UPF and low-power design & implementation techniques is a plusSelf-starter and willingness to learnBS required.", "jobDescription": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. All of this is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply!"}, "200351995": {"jobID": "200351995", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "WW Product Planning Training/Instructional Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200351995/ww-product-planning-training-instructional-designer?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree in relevant field preferred\n3-5 years in Instruction design/ training role"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$96,500", "max": "$188,000,"}, "benefits": null, "requirements": "Storyboarding, authoring, and developing content for classroom and self-guided training courses using Apple’s learning management system.Create micro trainings that are combinations of video interviews, written content and voiceovers – help compile trainings using Apple based software.Review and test current curriculum offerings, providing feedback, technical writing support, and suggestions for improvement.Contribute to new curriculum or program ideas - Ability to identify learning gaps and propose creative solutionsBachelors degree in relevant field preferred\n3-5 years in Instruction design/ training role", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\nThe people here at Apple don’t just craft products - we build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!\nThe Training/Instructional Designer will be responsible for supporting functional experts in developing materials to support tool and process trainings for the WW Product Planning teams. \nThis person will participate in design, development, and delivery of courses across various mediums, including audio, video, keynote, graphic/animated components and written documentation. \nThis person will also assist in creating content and writing scripts in collaboration with SMEs in the organization"}, "200441770": {"jobID": "200441770", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Sr. Safety Engineer, Special Projects Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441770/sr-safety-engineer-special-projects-group?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Degree in engineering\nMinimum of 10 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Assessing safety critical system designsAssessing high voltage systems design safetyAssessing mechanical system design safetyPerforming Hazard Analysis and/or Failure Modes Effects Analysis (FMEA)Providing regulatory and standards guidance and interpretations for compliance and strategic planningDeveloping research and test plans to support safety arguments for interpretation, exemptions or to support regulatory changeDegree in engineering\nMinimum of 10 years of relevant industry experience.Excellent verbal and written communication skillsStrong technical backgroundEEO Statement:Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "SPG group is looking for an exceptional engineer with multi-disciplinary product development experience with safety critical systems such as high voltage safety, battery safety, mechanical safety as well as experience in hazard and risk analysis and requirements development. You will work in a highly cross functional environment creating system requirements, identifying hazards & performing risk analyses and mitigations for safety issues early in the design/development process. You will collaborate closely with a variety of teams to ensure designs are implemented, verified, and validated according to system requirements and safety targets. You will also provide guidance to and create policy for the safe development, build and testing of new technologies."}, "200461029": {"jobID": "200461029", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Senior System Product Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461029/senior-system-product-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor of Science in Mechanical Engineering required\nMaster of Science preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "10+ years of hands-on, detailed product design experienceStrong analytical skills with regard to mechanical engineering theoryExperience working in technical project groups in a professional environmentProficiency in 3D CAD (any modeling package)GD&T knowledge and experience releasing and reviewing 2D drawingsProficiency in performing tolerance analysesWorking knowledge of FEA principlesPractical experience working through DFM challenges with external vendorsWide knowledge of basic engineering materials and manufacturing processesExperience with vendor FAI/CPK dimensional reportsConsumer electronics knowledge in a majority of these disciplines: industrial design, optics and lenses, cameras, sensors, displays, PCBs and flexes, silicon, antennas, batteries, thermalsExcellent communication skills (verbal and written) including emails, preparing slide presentations, and presenting technical concepts to multi-disciplinary teamsCreative problem solving, with experience in failure analysis, root cause investigation, and DOE creationDetail orientated and capable of handling multiple assignments at onceExperience designing for weight reductionExperience collaborating with Asian manufacturing facilities, specifically in high-volume mass productionBachelor of Science in Mechanical Engineering required\nMaster of Science preferred", "jobDescription": "Mac… iPod… iPhone… iPad… WATCH… what’s next? We are a team of passionate engineers who are designing, prototyping, analyzing, and eventually launching that next new product category at Apple! As a Product Designer on this team, you will be given ownership over the mechanical design of specific parts or modules within the product and will be responsible for the analysis, assembly, and reliability of these parts. Our goal is to ensure the highest quality product for our customers. In this role you will engage in frequent multi-disciplinary collaboration with teams like Industrial Design, Project Management, Materials, Manufacturing, EE, Display, Camera, Antenna, Battery, and more."}, "200450200": {"jobID": "200450200", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "SoC Physical Design Engineer, Top Level", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450200/soc-physical-design-engineer-top-level?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Needs to be familiar with aspects of ASIC integration including floorplanning, clock and power distribution, global signal planning, I/O planning, and hard IP integration.Experience with typical SoC issues such as multiple voltage and clock domains, ESD strategies, mixed signal block integration, and package interactions.Familiar with a hierarchical design approach, top-down design, budgeting, timing and physical convergence.Experience integrating IP from both internal and external vendors and be able to specify and drive IP requirements in the physical domain is required.Experience with large SoC designs (>20M gates) with frequencies in excess of 1GHz using innovative sub 45nm technologies.A detailed understanding of database management issues is required.From a CAD tool perspective, experience with floorplanning tools, P&R flows, global timing verification and physical design verification flows is required.Familiar with various process-related design issues including Design for Yield and Manufacturability, multi Vt strategies and thermal Mgt.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this highly visible role, you will be responsible for implementing complete chip design from netlist to tapeout."}, "200460790": {"jobID": "200460790", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Physical Design Methodology and CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460790/physical-design-methodology-and-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 0 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Comfortable with Tcl, Python or Perl scripting languagesKnowledge or experience with industry standard physical design tools is a plusGood fundamental knowledge of VLSI design principles through course work or work experienceExposure to analysis aspects of Physical Design - timing, noise, physical verification, electrical analysis is a plusMinimum requirements of BS degree + 0 years of industry experience", "jobDescription": "As part of the Hardware Technology CAD team, you’ll help design our next-generation, high-performance, power-efficient SoCs. You will work on world class CPU, GPU, Analog/Mixed Signal and SOC designs by developing flows, tools and methodologies for future Apple products. You will explore and enable new technology nodes, stdcells and tools for design teams. You will collaborate with design teams and tool vendors to improve PPA (Power, Performance, Area) and design productivity. You will actively work on developing internal methodologies using your understanding of CAD algorithms and ML.\n\nWe are looking for passionate engineers to join our team. In this role, you will be impacting a wide range of chips used across Apple’s world-class products (iPhone, iPad, Mac, Apple Watch, AirPods…)!"}, "200448901": {"jobID": "200448901", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Layout Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448901/analog-layout-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. EE & CS or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Excellent communication skills and able to work with multi-functional teamsFamiliar with CAD tools like Virtuoso, Innovus, Calibre is a plusProgramming knowledge in SKILL, Perl, and/or Python is a bonusConcentration in Mixed-Signal and RF Integrated Circuits is helpfulB.S. EE & CS or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Silicon Engineering is seeking creative Layout Designers to design the next generation of Apple’s world-leading systems-on-chip (SOCs). Apple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad! Our Analog/Mixed-Signal (AMS) circuits connect them to the physical world!\n\nAnalog Layout is a crucial component of the hardware design process. Layout Engineers work alongside circuit designers to transform design ideas into silicon. Apple’s world-leading SOCs are built using robust tool-suites, the most advanced nodes, and modern layout methodologies.\n\nThis job may be right for you if:\n\nYou want to accelerate your career. Thrive in a fast-paced, multifaceted, and results oriented environment.Are passionate about working with the world’s most advanced technology. Enjoy collaborating with a very passionate and experienced team. Have a good understanding of engineering fundamentals. Want opportunities to challenge yourself and broaden your skillset. Want to work every single day to craft products that enrich people’s lives."}, "200448784": {"jobID": "200448784", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "SOC Thermal Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448784/soc-thermal-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Extensive experience in thermal analysis and modeling of System on Chip (SoC), IC packages and mobile devices.Deep fundamental understandings on thermal conduction, convection and radiation.Experience in modeling transient thermal response and reduced-order modeling.Knowledge of semiconductor, package, PCB or mobile device design and thermal testing.Experience working with IC physical design parameters affecting electrical and thermal performance of packaging technologies.Knowledge of SoC design methodology, low-power techniques and thermal analysis methods.Knowledge of advanced packaging assembly processes along with electrical and thermal characteristics of packages.Ability to drive and lead cross-functional teams to execute on “design for thermal”.Tool Familiarity: Ansys Ice Pak, Sentinel-TI, Fluent, Cadence Allegro, Redhawk etc.BS and 10+ years of relevant industry experienceBS and 10+ years of relevant industry experience", "jobDescription": "Do you love working on challenges that no one has yet solved? Do you like changing the game? Envision what you could do here. At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nWe are looking for a self-motivated and ambitious individual who will work closely with multi-functional teams to optimize mobile device’s thermal performance and participate in advanced IC packaging research and development."}, "200315024": {"jobID": "200315024", "origin_search": null, "posted": "Dec 22, 2022", "jobTitle": "Haptic Module Process Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200315024/haptic-module-process-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS in ME, EE, or Physics as minimum. Ph.D. is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years experience working with mechatronic systems with high precision mechanicsExperience working with subcontractors to develop equipment, materials, and process to manufacture small, precision electromechanical systems.Experience with transition from development to production ramp of consumer, high volume manufacturing.Work closely with internal cross functional teams - Product Design, Test, Electrical Engineering, Product Engineering, and OperationsAbility to work with international teams and travelMS in ME, EE, or Physics as minimum. Ph.D. is preferred.", "jobDescription": "Apple designs consumer products that touch millions. The Haptic Engineering group is responsible for the development, test, and qualification of haptic hardware for Apple products.\nWe are looking for an outstanding Haptics Module process engineer to work on new hardware engineering projects."}, "200451369": {"jobID": "200451369", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Timing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451369/timing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Preferred relevant experience in Physical Design experience on high PHY and/or SOC designsDeep knowledge of industry standards and practices in Timing closures, Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route Experience in developing and implementing STA constraintsDeep understanding of all aspects of Timing flow, Physical construction, Integration and Physical VerificationConfirmed knowledge of Basic SoC Architecture and HDL languages like Verilog to collaborate with our logic design team for timing fixesExperienced user of industry standard Timing, Physical Design and Synthesis toolsDeep Understanding of scripting languages such as Perl/TclBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and extraordinarily talented Timing Design Engineer. As a member of our multifaceted group, you will have the outstanding and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day.\n\nIn this role, you will be at the center of a PHY design effort collaborating with architecture, CAD, logic design teams, with a critical impact on delivering outstanding PHY designs. You will be directly involved in timing closure and/or physical designs of outstanding PHY design."}, "200452237": {"jobID": "200452237", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "PHY Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452237/phy-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10 + years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be important for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in low power algorithm design and High Level Synthesis (HLS) for power critical applications is helpful.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc..Knowledge of cellular communication standards: 5GNR, 4G LTE.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS and 10 + years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team redefining hardware technology? We are searching for a dedicated engineer with 10+/- years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200452242": {"jobID": "200452242", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "PHY Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452242/phy-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10 + years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be important for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in low power algorithm design and High Level Synthesis (HLS) for power critical applications is helpful.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc..Knowledge of cellular communication standards: 5GNR, 4G LTE.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS and 10 + years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team redefining hardware technology? We are searching for a dedicated engineer with 10+/- years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200452676": {"jobID": "200452676", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Modem and RF System Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452676/modem-and-rf-system-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "In-depth knowledge of wireless communication systems with hands-on experience in lab testing & characterization.Deep-knowledge of communication system theory and signal processing will be crucial for this role to design algorithms such as timing recovery, filter design, signal estimation and detection, automatic gain control, RF impairments estimation and correction, channel estimation, equalization, forward-error correction, OFDM, MIMO detection, etc.Experience with Matlab, C/C++ and/or Python for algorithm development, modeling (floating-point and fixed-point) and link-level simulation.Experience in low power algorithm design and High Level Synthesis (HLS) for power critical applications is helpful.Experience in chip bring-up including the use of lab equipment such as protocol test equipment, spectrum analyzers, signal generators, power meters, etc. a plusKnowledge of cellular communication standards: 5GNR, 4G LTE, 3G (HSPA), 2G GSM.Strong analytical skills (linear algebra, random processes, detection and estimation, etc.)BS with 3+years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \n\nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? We are searching for a dedicated engineer with 10+/- years’ experience to join our exciting team of innovators. In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200463340": {"jobID": "200463340", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Camera FEA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463340/camera-fea-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Mechanical Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Mechanical design using CAD 3D molding and drafting package Experience with NX a plusBasic structural and thermal Finite Element Analysis (FEA)Tolerance analysis of high complexity and precision mechanical designs with excellent understanding of GD&TDemonstrated ability design for plastic injection moulding and metal stamping for mass productionExperience with various materials (research, selection, testing, process ability)Author documentations on mechanical inspection and fixture designPCB design experience a plusExperience with testing, reliability and qualification of systemsBS/MS in Mechanical Engineering or related fieldOccasional travel to manufacturing partners is requiredApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics. If you’d like more information about your EEO rights as an applicant. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. If you are applying for a position in San Francisco.Apple participates in the E-Verify program in certain locations as required by law. Learn more.Apple's committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Learn more.Apple is a drug-free workplace. Learn more.", "jobDescription": "Why Apple?   \n\nDo you love taking on big challenges that require exceptionally creative solutions? Imagine what you could do here. At Apple, new ideas have a way of becoming outstanding products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe Camera Hardware Engineering group is responsible for all research, design, development, test, and qualification of camera hardware for Apple products. We are searching for an extraordinary Hardware Engineers to take ownership in the development of very high performance compact camera modules. We are seeking an engineer to take leadership of camera hardware projects in engagements with product and technology teams."}, "200451508": {"jobID": "200451508", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "PMU Design Verification Engineer: Analog & Mixed Signal Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451508/pmu-design-verification-engineer-analog-mixed-signal-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to verify analog/mixed-signal designs in a collaborative team environment.Proficient in hardware descriptive languages: Verilog, System-Verilog, and/or Verilog-AMS code.Familiarity with authoring analog assertion checks to catch bugs.Capability to identify failure mechanisms and review verification results in analog IC designs.Ability to write test plans, present results, and communicate clearly with multi-functional teams.Comfortable with running simulations through compute clusters while optimizing simulation and wall time.Understanding of both power management and related auxiliary circuitry: switching converters, linear converters, reference circuitry, bandgaps, data converters, and/or clock generators.Have a familiarity with verification methodologies and tools: simulators, waveform viewers, execution automation, coverage collection, gate level simulations.Experience developing scalable and portable test benches.A background that includes scripting or programming languages is preferred. These include, but are not limited to, TCL, Skill, Python, and/or PERL.Your familiarity with analog behavioral models is also a plus.BS and a minimum of 10 years of relevant industry experience", "jobDescription": "Did you know that Apple is hiring analog & mixed signal verification engineers? We are looking for engineers that are enthusiastic to find bugs! You have the opportunity to work with a creative team to craft test plans and enable production-quality first silicon. As a member of the analog and mixed signal verification team, you will be working with specialists for full-chip verification of the state of the art mixed-signal systems used in Apple’s world-leading products!"}, "200448797": {"jobID": "200448797", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Softgoods Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448797/softgoods-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BS in Mechanical Engineering, Industrial or Product Design, required; MS Preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong 3D and 2D CAD skills (NX, Solidworks or ProE/Creo preferred)At least 3 years of experience designing and developing consumer goods products utilizing a variety of soft and hard materials (textiles, leather, foams, metals, plastics)Machinery operation (Mill, lathe, laser cutter, 3D printer, etc.)Designer and makerStrong presentation skills (Keynote or Powerpoint)OTHER SKILLS AND TRAINING WE LIKE TO SEE:Knowledge of soft goods materials (textiles, films, synthetics, leather, adhesives, etc.)Knowledge of soft goods assembly process (bonding, cutting, stitching, welding, etc.)Understanding of high volume mass production environments-  BS in Mechanical Engineering, Industrial or Product Design, required; MS Preferred.This role will require travel to our global supply base.Domestic travel between Boulder and SCV.", "jobDescription": "Why Apple?\n\nAt Apple we believe our products begin with our people. By hiring a diverse team we drive creative thought. By giving that team everything they need we drive innovation. By hiring incredible engineers and designers we drive precision. And through our collaborative process we create memorable experiences for our customers.\n\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives.\n\nWhy Softgoods?\n\nApple’s Softgoods Engineering team is relatively new to Apple. We work with textiles, leather, silicone and soft polymers. Our mission is to use these incredible materials to enable new product categories, and to enhance Apple’s existing product lines. Bringing Apple engineering and precision to products made of soft materials is an exciting challenge and requires a creative and open minded approach.\n\nWe have a talented team of people from a wide variety of backgrounds. We all work together in a beautiful customized lab where we design, develop and engineer the best softgoods products in the world.\n\nIf this sounds like an exciting challenge, we hope you will consider a place in our team!"}, "200449251": {"jobID": "200449251", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "RF Passive Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449251/rf-passive-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 10+ years' of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years' of relevant industry experience.Demonstrates deep knowledge on electromagnetic theory, microwave engineering and antenna engineering.Proficiency with EM passive designs and familiarity with EM simulation tools like HFSS, Peakview, EMX, Momentum or Helic. Experience on chip EM modeling is helpful.Familiar with on-wafer measurement, have experience using VNA, TDR, LCR meters etc.Excellent academic background with industry related work experience beyond graduate school studies.Good written and verbal communication skills.- BS and 10+ years' of relevant industry experience.", "jobDescription": "Do you love working on challenges that no one has solved yet? Do you like changing the game? Envision what you could do here! At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nWe are looking to hire a Chip Passive Design Engineer in a group at Apple that develops RF chips that will be used in Apple mobile devices. You will be responsible for on chip inductors / transformers/ caps/ transmission lines, as well as on chip filters, phase shifters, and couplers etc. You will orchestrate the process from design to tape-out and work closely with multi-functional teams including RF design team, packaging design team, CAD, process teams etc."}, "200460746": {"jobID": "200460746", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Digital Mixed Signal (DMS) Modeling and Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460746/digital-mixed-signal-dms-modeling-and-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS + 3 years of relevant experience required. MS or PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proven experience in developing and verifying real-numbered analog and RF behavioral models in SystemVerilogProven understanding of SystemVerilog, RNM, UDN/UDT/UDR, wreal, and Verilog-AMSUnderstanding of AMS and RF blocks like filters, ADC, DAC, VCO, A/DPLL, SerDes, LNA, Mixer, etc.Working experience in Cadence Virtuoso Schematic Composer and ADEExperience with Analog Assertion Based VerificationExperience in UVM TB development will be a strong plusExperience in crafting synthesizable modeling is a plusExperience in writing scripts in languages such as Perl or PythonExcellent teammate with excellent communication skillsBS + 3 years of relevant experience required. MS or PhD preferred.", "jobDescription": "Imagine what you could do here at Apple! Together we could help craft the next generation of the world’s finest devices. New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish.\n\nOur Digital Mixed Signal (DMS) Modeling and Verification team is searching for a self-motivated, passionate individual who can tackle diverse challenges in verifying digital/mixed-signal designs. In this highly visible role, you will be at the center of chip design efforts collaborating with multiple teams with a critical impact on getting functional products to millions of customers quickly. You will become part of a hands-on development team that fosters engineering excellence, creativity and innovation.\n\nWill you help us design the next generation of revolutionary Apple products?"}, "200464429": {"jobID": "200464429", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Film Marketing Lead - Apple TV+ Marketing", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464429/film-marketing-lead-apple-tv-marketing?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent. MBA or relevant graduate work a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$156,000", "max": "$235,000,"}, "benefits": null, "requirements": "Consumer marketing expertise with direct responsibility for launching films at a streamer, studio or distributor; preferably, at least 12 years, including international experienceProven experience running robust portfolio of creatively led 360-campaigns, from film strategy to implementing the tactics; you can show how you delivered resultsExcellent ability to collaborate cross-functionally across PR/Communications, film awards campaigns, adjacent business teams, content producers, and filmmakers.Experience around film festivals and exhibitor relationsExperience working directly with talent, representation and creators to partner on campaignsExperience developing brand partnerships and integrations with internal teams and third party partnersStellar executive written and verbal communication. Able to present ideas simply in presentations and documents in a clear manner.A highly strategic and analytical approach to decisions and problem-solving; the skill to balance data-driven decisions with experience, instinct, and creativity.Excellent organizational, scheduling, project management and multi-tasking skills with proven attention to detail.A reputation for being a leader among your peers, inspiring teams to deliver their best work for the best content by demonstrating thoughtful and inclusive leadership. You are ready to develop and mentor mid-career marketers in their professional growth.International experience and an understanding of how to translate content for a global audienceBachelors degree or equivalent. MBA or relevant graduate work a plus.", "jobDescription": "Apple is seeking an entertainment marketing professional with a track record of building world-class campaigns to join our growing team. This role will lead global marketing launch campaigns for upcoming Apple Original Films across a diverse range of content.\n\nYou will focus on crafting strategies, building meaningful relationships, and partnering with many teams to implement integrated marketing plans that drive viewership and subscriber growth for Apple TV+. You will carry a title through from greenlight through launch and sustain phases of the campaign.\n\nYou'll be the main point of contact with all internal teams, executives, creatives, and filmmakers, working with them to collaborate on and communicate different facets of the campaign throughout the lifecycle of the project. You know how to lead direct reports and inspire peers to do their best work.\n\nIdeally, you've led the marketing of high-profile entertainment properties and have a strong foundation in crafting clear and distinctive positioning, creative strategy, and informed media approaches that cross-functional teams can implement upon. You know how to tell stories on any platform that drive audience anticipation and engagement. You listen and collaborate with internal departments/teams to align early on overall strategy and goals. Your love for film and pop culture pushes you to thrive in a quick moving environment and be an excellent teammate."}, "200453770": {"jobID": "200453770", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "GPU Electrical Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453770/gpu-electrical-analysis-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep experience planning, implementing, and analyzing power delivery networks. Emphasis will be with on-die high frequency power delivery, but exposure to off-die concepts and models is required.Expertise working with different types of power-gated delivery techniques are crucial, including distributed and ring methods. Experience with in-rush current analysis and mitigation techniques recommended.Experience with bump planning and redistribution layer routing strategies, including methods for working with IO bumps and edge encroachment scenarios.Experience with fundamentals of Signal/Power Integrity checks for Electromigration and Static Noise checks. Circuit design and simulation background a plus, but not required.Background with Power Integrity analysis methodologies including Static IR and Dynamic Voltage drop checks, involving both Vectorless and Vectored approaches.We value a consistent record in all aspects of ASIC integration including Floorplanning, Clock and Power distribution, global signal planning, I/O planning, and hard IP integration.Depth of expertise with large SoC designs (>20M gates) with frequencies in excess of 1GHz using innovative technologies.Experience in technical project leadership and getting results that have had impact on project completion and objectives.Track record of applying creative thinking to strategically solve problems that have impact for a project, group, or organization.Consistent record in solving complex PD and multi-functional problems, achieving results directly and/or leading a team of engineers to innovate and achieve extraordinary GPU designs.From a CAD tool perspective, prior experience with power integrity tool (e.g. Redhawk, Voltus) is required. Additional experience with timing verification, SPICE simulation/analysis, and Physical Design Verification Flows are a plus.We are looking for candidates with a minimum of BS + 10 years of relevant experience.", "jobDescription": "Do you love creating sophisticated solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient GPU! You’ll ensure Apple products and services can seamlessly and expertly handle the tasks that make them beloved by millions! Joining this group means crafting and building the technology that fuels Apple’s devices. Together, we enable our customers to do all the things they love with their devices. This role requires a mix of strategic engineering along with hands-on experience in physical design and large chip integration, being responsible for realizing the complete electrical analysis closure from early design planning to tapeout."}}