{"200458906": {"jobID": "200458906", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "Platform Architecture Security Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458906/platform-architecture-security-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proven track record of delivering security-focused features while working on end-to-end solutions with SW, Systems, Business/Factory Operations, Server, and Field Repair/Customer Care (e.g. AppleCare).Ability to facilitate development/design conversations with multiple engineering partners, document decisions/opens, and drive closure in a timely manner.Ability to build both a high-level program plan, as well as a detailed micro-schedule; and to drive each accordinglyProven success in driving multi-functional alignment, and being a change agent where vitalOutstanding documentation and self-organization; driving action item follow-up to ensure program momentum is maintained.Self-motivated and upbeat to mitigate program risks, close opens, and unblock critical path issues at the program level (including escalations of resource priorities).Leadership capabilities in being able to connect team members across an organization, and experience presenting to Sr Management/Executives.Familiarity with Product Fraud, Tampering, and Repair; including a basic understanding of future legislative initiatives such as Right-to-Repair.Familiarity with security concepts and architectures (e.g. encryption vs. signing vs. attestation, knowledge of various security architectures such as HW vs. SW key protection, secure boot technologies, and/or secure cloud storage platforms).BS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norms here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nAre you a leader? Do you want to apply your engineering background to make big things happen? Can you influence, connect, get results and communicate optimally? Can you deliver results while running a complex schedule? \n\nAs a Platform Architecture Security Engineering Program Manager within the Hardware Technology team, you will lead security-focused programs and features for Apple products, silicon, services, and a wide variety of multi-functional security initiatives.\n\nWe are looking for a dedicated Engineering Program Manager or a technical leader who is passionate about getting into program management and inspiring the team to collaborate and deliver innovative designs within schedule constraints. The ideal candidate needs to be able to dig into sophisticated technical topics while balancing the strategic needs of the project and the tradeoffs involved in technology development."}, "200458497": {"jobID": "200458497", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Senior Embedded Software Engineer - AirPods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458497/senior-embedded-software-engineer-airpods?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proficiency in C/C++, some embedded software experience is preferredProficiency in at least one high-level programming language (Java, Scala, Python, Swift, Objective-C or equivalent)Proficiency with scripting (bash, perl, python or equivalent)Working knowledge of SQL and database fundamentalsExcellent collaborative skills, should be a great team playerOutstanding written and verbal communicationYou are curious and have excellent analytical and problem solving skillsYou possess a growth mindsetExperience with debuggers such as gdb, lldb, etc is preferredBS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "The AirPods Firmware team is looking for an enthusiastic engineer to join our team. This is an individual contributor role to design and develop the software of the core platform for AirPods. You will have the opportunity to drive the technology and product development for AirPods with a wide cross-functional team."}, "200457628": {"jobID": "200457628", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457628/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Strong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsBS or MS in Electrical Engineering or equivalent", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200427359": {"jobID": "200427359", "origin_search": null, "posted": "Sep 20, 2022", "jobTitle": "Senior Software Engineer, TDG Apps- Measure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200427359/senior-software-engineer-tdg-apps-measure?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Track record of building complex and delightful applications or user-facing systems for Apple platforms (macOS, iOS, iPadOS, watchOS, tvOS).Attention to detail and passion for one’s work.Comfort with collaborative and highly cross-functional environmentsProficiency in a systems programming language, such as Objective-C, Swift, C/C++, etc.Material experience in one or more of Apple’s application development frameworks (e.g. UIKit, AppKit, SwiftUI, Catalyst).We are considering candidates of all experience levels, from new grads to seasoned developers.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceThe following qualifications are beneficial, but not required, to be an impactful member of the Measure team:-Familiarity any of the following Apple technologies: ARKit, SceneKit, Metal, RealityKit.-Familiarity with computer vision techniques and algorithms-Proficiency in macOS, iOS, or Unix development practices.-Experience in 3D Graphics, Real Time Graphics, or 3D Math.-Experience building AR/VR apps either professionally or personally.-Interest or proficiency in UI/UX design.-An interest and passion for AR/VR Technologies.", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Senior Software Engineer to help us maintain the Measure app and build cutting-edge new features for next-generation platforms. \n\nMeasure ships with every iPhone and iPad, and is used by millions of people around the world every day. As a core member of the Measure team, you will work closely with organizations across Apple (Human Interface, Frameworks, etc.) to design, architect, integrate, and implement features that use AR to empower our users in their everyday lives."}, "200455625": {"jobID": "200455625", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Wireless Software and Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455625/wireless-software-and-systems-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Electrical Engineering, Wireless Communications or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience in Software development/system engineeringDevelopment experiences with real-time operating systemsExperience in writing software for multi-threaded environmentsStrong Software Engineering skills including Design, Programming in C, C++ or Objective C and DebuggingWorking experience with Open source Software is a plusExperience in developing frameworks and APIs is a plusKnowledge of IOT protocols such as IEEE 802.15.4, Bluetooth, Zigbee or Thread Mesh is a plus.Home automation experience is a plus (Bluetooth, ZigBee, z-Wave, Thread Mesh)Consistent record of project deliverables from concept to commercializationPassionate and inquisitive with a focus on solving everyday problems in innovative waysAttention to the smallest details that are meaningful to customersBachelor's degree in Electrical Engineering, Wireless Communications or equivalent", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems organization and be part of an extraordinary team of engineers. We work with cross functional teams to drive innovation and develop products used by millions worldwide. Apple’s Wireless Software Architecture team is seeking dedicated, highly motivated and self-directed engineers to work across layers on innovative cellular technologies. The position involves identifying and developing core wireless technologies that solve everyday problems for customers using iPhone, iPad, Watch and other wireless product lines."}, "200448957": {"jobID": "200448957", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Software Development Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448957/software-development-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or Master degree in Electrical Engineering, Computer Engineering or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Deep technical and functional understanding of software development and quality assurance methodologies, processes, and toolsExtensive hands-on experience in software engineering automation tools (e.g. SW version control systems like git, test schedulers like Jenkins, etc)Expert-level skills in programming/scripting languages: Java (required), Groovy (required), Python (useful), shell (useful)Ability to design SW and integrate with other solutions independentlyProficiency in CI/CD practices, concepts and workflowsGood experience in test scheduler approaches (e.g. Jenkins CI, pipelines) including adjustment and/or development of non-standard add-ons to such toolFamiliarity with DevOps/Agile, test-driven development practicesExcellent knowledge of desktop and distributed software engineering tools and databases.Familiarity with test frameworks like Junit or SeleniumAbility to document requirements and specificationsCollaborative, innovative, creative, and go-getter attitudeExcellent communication skillsBachelor or Master degree in Electrical Engineering, Computer Engineering or equivalent degree", "jobDescription": "Wireless Technologies & Ecosystems (WTE) team is looking for a highly qualified & self-motivated Engineer with a passion for software development & test processes (CI/CD) and designing/implementing end to end frameworks to automate development for large projects and teams and improve quality of SW for Apple products. In collaboration with other engineers inside and outside of the team you will work to define and optimize workflows, design complex components and integrate open-source, customized and fully custom solutions into a single business-critical product which is in daily use by thousands of developers. Your focus will be to accelerate software testing/delivery algorithms and tools and with the ultimate goal of zero escapes and full automation."}, "200446241": {"jobID": "200446241", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Senior Software Engineer, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446241/senior-software-engineer-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent is required; Master's degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "8 or more years of industry experience building scalable micro services or data driven platforms.Strong computer science fundamentals.Prior experience with Java/Scala/C++ or equivalent.Expertise in NoSQL datastores ( e.g Cassandra )Proficiency in data processing technologies (e.g Kafka, Spark, Flink )Experience crafting scalable micro services.Familiarity with cloud paradigms ( e.g AWS )Proven ability to work on sophisticated problems and systemsStrong problem solving and debugging skills.Have the ability to communicate effectively, both written and verbal, with technical and non-technical multi-functional teams.A desire to work in a fast-paced and challenging work environment.Bachelor's degree in Computer Science or equivalent is required; Master's degree preferred.", "jobDescription": "At Apple, we work every day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy."}, "200464540": {"jobID": "200464540", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Hardware Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464540/hardware-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Prefer M.S. degree in Computer Engineer or Electrical Engineering."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BS in electrical or computer engineering required, MS preferredMinimum 3 years relevant industry experience.  High-volume consumer electronics system experience preferred.Lab skills: oscilloscopes, logic analyzers, electronic loadsExperience with schematic capture and PCB physical design using Cadence Concept and Allegro or similar CAD toolsDesign experience in digital logic, simulation, power conversion and deliveryFamiliarity with RF/wireless conceptsExperience with high-speed serial and memory interfaces including signal integrity design and measurement fundamentalsExcellent written and verbal communication skillsCommand line interface and scripting skillsSpecific deep expertise in several of the following areas is a plus: CPU or GPU microarchitecture, batteries, power management, analog design, audio, wireless, DisplayPort, PCIe, Thunderbolt, USB, SPI, I2C, UART, analog sensors, interconnectStatistical data analysis and visualization (ex. JMP) is a plusTravel to foreign contract manufacturer (estimate 5 weeks per year)Prefer M.S. degree in Computer Engineer or Electrical Engineering.Travel to foreign contract manufacturer (estimate 5 weeks per year)", "jobDescription": "Apple is seeking an EE for iMac electrical & system design integration. The candidate will design, implement, test, and debug the electrical subsystem of the world’s best professional desktop computers within a collaborative cross-functional team.\n\nOur engineers rely on skills in computer system architecture, schematic design, digital and analog circuits, power and voltage regulator integration, high speed signal integrity concepts, PCB design, bring up and system level troubleshooting to surprise and delight millions of customers."}, "200352693": {"jobID": "200352693", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "WiFi App QA- Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200352693/wifi-app-qa-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Computer Science or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$190,000,"}, "benefits": null, "requirements": "4+ years of experience working as a Software QA Automation EngineerSolid understanding of 802.11 WLAN/WiFi (a, b, g, n, ac, ax), and Networking protocols basics (TCP/IP, UDP..)Experience in one or more Scripting/Programming Languages including Python, Swift or Objective CAbility to investigate, debug and triage automation problems and independently work towards resultsExperience in creating automated setups and implementing continuous integration systemsBachelor’s degree in Computer Science or related field", "jobDescription": "The Technology Development Group is looking for an exceptional WiFi Apps QA-Automation Engineer to help us build the next generation of Augmented Reality (AR) interactive solutions for Apple platforms. You’ll partner in testing and developing the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless and networking solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ wireless connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nQuality is an important aspect of our products, and as a WiFi Apps QA-Automation Engineer you will have a significant impact on helping to deliver functional and stable products to our internal development teams and millions of customers. If you are a highly motivated engineer with aspirations to build powerful automation, cultivate learning, and lead automation efforts across teams at Apple, we want to talk to you!"}, "200440697": {"jobID": "200440697", "origin_search": null, "posted": "Mar 4, 2023", "jobTitle": "Hardware Prototyping Engineer - Display & Optics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440697/hardware-prototyping-engineer-display-optics?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD degree or MS degree with 5+ years of experience working on related field preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Experience in technology development projects in R&D environment or similar early-phase stagesHands-on experience in designing, building and optimizing fixtures, prototypes and equipment systemsDemonstrated experience in process development, characterization, and data analysis to enable, improve and realize new design architecturesPassion for innovation and motivated to constantly learn new areas and skills to expand knowledge and scopeProficient in 3D CAD (NX, and /or Solidworks) and manufacturing techniquesExperience / skills in one of the following fields are highly preferred- Intermediate programing and data analysis experience in Matlab / Python, JMP, or similar tools- Experience in opto-mechnical system, optical metrology or precision instruments- Experience in mechanical and/or optical simulation software (Ansys, Comsol, Zemax)Experience in mechatronics, robotics, and control systemsPhD degree or MS degree with 5+ years of experience working on related field preferred.", "jobDescription": "Apple is looking for a highly motivated Hardware Prototyping Engineer to join Panel Process and Optics (PPO) Engineering Team to explore new display and optical module architectures for future Apple products.\n\nThe Hardware Prototyping Engineer is expected to work quickly and smartly to help determine the viability of ideas and technologies. The ideal candidate for this role is comfortable working in a dynamic and creative environment, with uncertain requirements and shifting dependencies. Projects will require rapid experimentation and prototyping without sacrificing quality or attention to detail.\n\nWe work at a fast pace and require everyone to be highly self-motivated. The ideal person for this role loves to tinker, learn new things and bring new ideas to life. This is a hands-on interdisciplinary development role that will require versatility across a variety of tasks in a highly collaborative environment."}, "200465549": {"jobID": "200465549", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Display Silicon Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465549/display-silicon-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE / MSEE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience leading chip architecture and/or digital design and integration (preferably in display technology)Experience is design and development and launch of high volume ICs in consumer electronicsKnowledge of digital, analog & IC design fundamentals, rigorous process development and analytical methodology, which lead to high quality design, is requiredEffective wriNen and verbal communicaBon skillsBSEE / MSEEPreferred Qualifications•Experience in developing and manufacturing high volume products and vendor management• Proficiency in MATLAB, Python, Verilog or similar simulation, design and modeling tools•Knowledge in electronic displays, image quality, or graphics subsystem•Ability to conduct experiments during silicon debug, gathering and analyzing data", "jobDescription": "Design, develop, and launch next-generation Display Technologies in Apple products.\nThe Display team develops cutting-edge display solutions and technologies that are central to Apple’s products. The key goal of the Display team is to enable the world’s best display experience.\nIn this highly visible role, you will be leading the effort to develop the next generaBon Apple display ICs: defining display silicon architecture & requirements, working with external vendors as well as internal design teams for all phase of the silicon development, validating silicon functionality & performance in the module and system, and qualifying the ICs for mass production."}, "200451382": {"jobID": "200451382", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "SerDes Micro Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451382/serdes-micro-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience leading the definition of high-speed SERDES receiver, transmitter, and clocking blocksDeep understanding of adaptation and optimization algorithmsDeep understanding of communications and information theoryProficiency in equalizers, timing recovery and system identificationProficiency in DSP concepts and applicationsFamiliarity with mixed-signal modeling in Python/MATLAB/C/C++Experience in system design and performance tradeoffFamiliarity with simulation tools for analog, digital, and/ or mixed-signal circuitsFamiliarity with Machine Learning conceptsExperience in firmware or embedded software development is a plusBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Analog Mixed-Signal (AMS) Team is seeking a self-motivated SERDES Micro Architect to drive the definition of our next generation IPs. The SERDES IPs will be used in Apple silicon offering breakthrough power and performance for iPhone, iPad, Mac, and Apple Watch."}, "200448219": {"jobID": "200448219", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "SerDes Micro Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448219/serdes-micro-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience leading the definition of high-speed SERDES receiver, transmitter, and clocking blocksDeep understanding of adaptation and optimization algorithmsDeep understanding of communications and information theoryProficiency in equalizers, timing recovery and system identificationProficiency in DSP concepts and applicationsFamiliarity with mixed-signal modeling in Python/MATLAB/C/C++Experience in system design and performance tradeoffFamiliarity with simulation tools for analog, digital, and/ or mixed-signal circuitsFamiliarity with Machine Learning conceptsExperience in firmware or embedded software development is a plusBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Analog Mixed-Signal (AMS) Team is seeking a self-motivated SERDES Micro Architect to drive the definition of our next generation IPs. The SERDES IPs will be used in Apple silicon offering breakthrough power and performance for iPhone, iPad, Mac, and Apple Watch."}, "200455252": {"jobID": "200455252", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Force Hardware - Sensor Design & Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455252/force-hardware-sensor-design-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Degree in Electrical Engineering, Mechanical Engineering, Mechatronics, Physics, or related field.\nM.S. and 4+ years (or B.S. and 6+ years) of related industry experience in a module design and integration,\nsystems engineering, and/or product engineering role."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong background in board-level analog and mixed-signal circuits and/or embedded systems; hands-on experience in module-level design.Proficiency in simulation tools (such as COMSOL/SPICE), scripting languages (such as Python/MATLAB), and statistical analysis software (such as JMP).Ability to independently drive technical issues to resolution, including coordinating efforts across teams.Excellent critical analysis, statistical analysis, and logic/reasoning skills.Excellent written/verbal communication, teamwork, and leadership skills.Direct experience with sensor design and integration.Cross-functional experience in a high-volume production environment.Background and experience with automation for test and characterization.Degree in Electrical Engineering, Mechanical Engineering, Mechatronics, Physics, or related field.\nM.S. and 4+ years (or B.S. and 6+ years) of related industry experience in a module design and integration,\nsystems engineering, and/or product engineering role.", "jobDescription": "Come join the Sensor Technology Team! We're a multi-disciplinary, problem-solving team developing state-of-the-art sensing solutions and technologies that are central to Apple’s products, including the iPhone, iPad, Apple Watch, AirPods, and more. As part of this team, you'll have an opportunity to participate in development from proof-of- concept all the way through end-product launch.\nThe key goal of the Sensor Technology Team is to enable the world’s best user experience. New challenges arise every day that require the sharp analytical skills of talented and smart individuals. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200462291": {"jobID": "200462291", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Software Engineer, OS Security", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462291/software-engineer-os-security?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience/skills in system programming"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "A genuine passion for creating effective and pragmatic security technologiesUnderstanding of past, current, and emerging security exploitsStrong C and systems programming skillsExperience with kernel and operating systems internalsReady to balance concurrent priorities on tight schedulesExcitement to work with other software, hardware, marketing, and support teams to provide the best security solutions for Apple’s productsExcellent partnership and interpersonal skills. We collaborate with a broad range of engineering teams involved in these products, and on all of their code.BS in Computer Science or equivalent experience/skills in system programmingPREFERRED EXPERIENCE:-  iPhone OS and Mac OS X exposure (end user, administrator and/or developer)-  Involvement in open source technologies and development communities such as FreeBSD and LinuxGREAT TO HAVE:-  Kernel programming-  Hypervisor design and architecture-  Swift experience", "jobDescription": "Apple’s OS Security team is looking for a motivated software engineer to join us to maintain, design and deploy world-class containment mechanisms throughout our operating systems. These mechanisms ensure our technologies are resilient and never just one mistake away from compromise. Here you’ll join and have a chance to learn from a group of people dedicated to building the most secure operating systems in the world. And you’ll have the opportunity to do it not just for a small subset of technology enthusiasts or experts, but for millions to use in their daily lives.\n\nAs part of the Security Engineering and Architecture group, our goal is for our users to feel confident that our devices have their back every time they interact with an Apple product. We work across the company, from designers in our Human Interface group, to engineers in our Silicon Engineering group. Along with our colleagues, we make technology deep within the Operating System and lift it all the way up through the software stack to build features that connect world class security engineering technology directly to users, right at the time they need it. As an engineer on the team, we’ll help you grow your autonomy here and invest your time into the most promising areas to make a difference. You will be able to see your impact on every product Apple makes, and watch your impact grow with your career here.\n\nHere, you’ll work with and influence teams across Apple, and the world, to make technology that does right by its users in every life it touches. This isn’t just something we write in our job descriptions, it’s why our group exists. Come help us push further."}, "200287299": {"jobID": "200287299", "origin_search": null, "posted": "Oct 24, 2022", "jobTitle": "Software Developer, Cellular (C/C++)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200287299/software-developer-cellular-c-c?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Strong Software Engineering skills including design, programming (C, C++, script) and debuggingHighly motivated and self-directedExcellent debugging skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seeks to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degreeExperience with cellular protocol stacks 2G, 3G, LTE and 5G NR is a huge plus", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product. New grads encouraged to apply!"}, "200460068": {"jobID": "200460068", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Software Engineer, Core Services - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460068/software-engineer-core-services-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science. At least 5 years of professional software engineering experience preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expert knowledge of developing scalable Java web applications with very stringent latency requirements.Knowledge of JVM or functional languages like Clojure.Self-driven; ability to work in a fast-paced environment, and agility to build features that span cross-functional teams.Strong object oriented design and analysis skills coupled with a deep understanding of data structures and algorithms.Experience in designing and implementing RESTful APIs.Exceptional debugging, critical thinking, and interpersonal skills.Experience writing effective unit and integration tests.Experience with Solr / Lucene or other NoSQL solutions (Redis / Memcached / Cassandra / Voldemort / MongoDB etc.) is a plus.BS or MS in Computer Science. At least 5 years of professional software engineering experience preferred.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here. The Core Services team at Apple Media Products is looking for a software engineer to help build scalable and creative features that delight hundreds of millions of customers around the world on App Store, Apple Arcade, Apple Music, Apple TV+, Apple Books, Podcasts, MusicKit, iTunes etc. across multiple platforms on iOS, macOS, tvOS, and watchOS."}, "200448521": {"jobID": "200448521", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "SoC Correlation Product Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448521/soc-correlation-product-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Experience with system level characterization using functional / virus like worst case use cases & correlating to ATE.Understanding of PDN impact on Vmin, ATE test content, system level test programs/ functional content and test hardware.Experience working with and driving cross functional teams.Statistical data analysis tools to perform high volume characterization & production data analysis.Experience in scripting (Python, JMP, PERL etc.) is a plus.BS and a minimum of 3+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). \n\nJoining this group means you’ll be responsible for crafting and building the technology that operates Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product! \n\nWe are seeking a multifaceted engineer to develop system level test programs for debug, characterization, qualification, and production of SoC devices."}, "200406407": {"jobID": "200406407", "origin_search": null, "posted": "Aug 21, 2022", "jobTitle": "Technical Partner Manager - Apple Home", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406407/technical-partner-manager-apple-home?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in Computer Science, Electrical Engineering, or related degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Ability to learn & understand technical requirements written by othersAbility to multi-task, prioritize & follow throughSelf-starting and independent, working with limited supervisionProject management experienceExperience in multi-functional collaborationKnowledge of hardware and software development on embedded systemsExcellent problem solving skillsBachelors in Computer Science, Electrical Engineering, or related degree.3-5 years embedded software development experience.Working knowledge of networking Wi-Fi routers.Understanding of protocols such as Thread, Bluetooth®, Wi-Fi.Software development experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. The iOS Home team builds the foundation that enables an entire ecosystem of secure and intelligent home connectivity. We are developing technologies and crafting experiences that revolutionize the way people harmonize with the Home enabled accessories around them. \n\nThe Apple Home Partner Engineering team is looking for a highly motivated Technical Partner Manager to assist partners in integrating Apple Home solutions in their products. You are responsible for handling communication and tracking issues found during new product introduction (NPI) / certification between internal stakeholders and Apple Home partners."}, "200442503": {"jobID": "200442503", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Sr. Software Engineer - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442503/sr-software-engineer-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Extensive professional software development experience in Java and/or C++ with strong understanding of Object oriented concepts and designExperience and deep understanding with distributed data stores like Kafka, Cassandra, Redis, Solr etc.Strong production debugging and performance tuning skillsDeep understanding of data architecture and related problems.Experience working on complex problems and distributed systems where scalability and performance are extremely important (every millisecond counts)Should be independent and able to effectively work with cross functional teamsOur customers love what we do at Apple and we want the same from our engineers - Passion for building the best systems!B.S. in Computer Science or equivalent experienceExpertise in the following areas is a huge plus but not required:• Experience in designing and implementing RESTful API and services, gRPC is a plus.", "jobDescription": "The Apple Media Products (AMP) Data Services Team is looking for extraordinary engineers to design and build best of breed systems for dealing with our complex and ever-growing data and infrastructure needs. We are a key part of the Apple ecosystem, supporting millions of users and billions of transactions. We're looking for someone ready to work at huge scale and have a hand in bringing amazing new products and services to market."}, "200452199": {"jobID": "200452199", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Senior Software Engineer, Employee Experience & Productivity", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452199/senior-software-engineer-employee-experience-productivity?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS degree in computer science or equivalent field plus 7+ years experience or MS/PhD degree plus 4+ years experience, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of experience in Java, Spring, Multi-Threading, REST, Data Caching, NoSQL technologies5+ years of experience in design, development and deployment of distributed, large-scale, low-latency, cloud based, stateless REST APIs/web services for web applicationsUnderstanding of web service technologies such as REST, JSON, SOAP, HTTP, SSL, SAML, WSDL.Hands on experience in Messaging Solutions like KafkaHands on experience in Search Solutions like SOLR, ElasticSearchExperience with Cloud TechnologiesExperience in handling implementation challenges in the area of architecture, design, integration, infrastructure and scaleExperience with NoSQL databases like MongoDBAbility to work in a diverse, fast-paced environment and optimally collaborating across teams.Solid understanding of concurrency, scalability and fault tolerant designs.Strong problem solving skillsExperience building highly performing and scalable backend components (a keen eye to performance/responsiveness of the backend services is a must for this role).Ability to wear multiple hats and a can-do attitude.Ability to work independently with minimal direction.Additional requirementsHAVING THE FOLLOWING ARE PLUSES FOR THIS ROLE:Experience with Spring Reactor or Reactive Java applicationsKnowledge of HR and/or Recruiting systemsKnowledge of application development using workflow technologiesExperience with leading and mentoring EngineersBS degree in computer science or equivalent field plus 7+ years experience or MS/PhD degree plus 4+ years experience, or equivalent.", "jobDescription": "Are you meticulously organized and highly observant? Join our Information Systems and Technology group and play a vital function on one of two Apple teams: Software and Services and Corporate Functions. From Apple ID to the Apple website to our data centers around the globe, our diverse collection of engineers, designers and creators manage the massive systems and services that so many people rely on every single day. We also build the custom tools that empower other Apple employees to solve problems on their own. Joining this group means you’ll be part of the Apple nerve center. You could play a meaningful role in helping Apple connect with over a billion customer devices around the world. Or you could help over 130,000 employees stay connected with each other and our suppliers. Together, you and your team will help everyone at Apple do what they do best: explore every possibility.\n\nIS&T Corporate Systems team is looking for a creative and motivated Senior Software Engineer with excellent problem solving and interpersonal skills! They would work on the Integrations track with our team of high-performing software engineers. Our teams foster a collaborative environment with creative, smart & fun people using innovative technologies. Engineering excellence is expected. Come join us for this once in a lifetime opportunity in building solutions for Apple that has worldwide impact."}, "200458798": {"jobID": "200458798", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Wireless PHY RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458798/wireless-phy-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS +0 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "We'd like you to have:Have taken relevant courses such as DSP/wireless communications/machine learning and VLSI logic designUnderstanding of DSP communication algorithms and trade-offs between performance and complexityGood knowledge in modern logic design techniquesExcellent communication skills and self-motivationFamiliar with Verilog/Vhdl/SystemVerilog and MATLAB/C programming languagesBS +0 years of relevant experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}, "200425902": {"jobID": "200425902", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Sr. Manager, Systems & Application Engineering - Retail Technology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425902/sr-manager-systems-application-engineering-retail-technology?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS degree in Computer Science and/or related work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$343,500,"}, "benefits": null, "requirements": "Demonstrated ability with proven experience of 8+ years with 3+ years in an engineering leadership/management role delivering complex technology solutions in a leading consumer products and/or retail organizationConsistent track record of developing, managing, and leading teams of technology professionalsUnderstanding of and experience in Agile software developmentFamiliarity with and (ideally) experience in Audio Visual (AV) technology (hardware and software)Understanding of, and experience with Continuous Integration Testing tools and standard methodologiesDemonstrated ability to work with and develop relationships with product managers, business partners, engineering, and other teams to implement large scale enterprise systems. Knowledge of retail systems is a plusExcellent meeting facilitation, written, verbal, and presentation skillsAbility to travel domestically and internationallyBA/BS degree in Computer Science and/or related work experience", "jobDescription": "The Interactive Systems & Application Engineering team within Retail Technology is responsible for the development of cutting edge in-store customer experiences as well as the tools that help bring those experiences to life. Our apps and cloud services are deployed across Apple Stores worldwide and are essential to supporting award-winning Today At Apple programming and the ever-evolving Apple Retail experience.\n\nApple is looking for a dynamic and versatile Senior Manager to lead the Interactive Systems & Application Engineering team. This team is responsible for designing, developing, and managing the customer-facing interactive systems in our Retail stores.\n\nWe're growing and urge you to apply. We believe this role would place you in a highly-energized environment with some of the most creative individuals in the industry where you'd be inspired to share your years of experience while providing exceptional support to the overall team."}, "200464864": {"jobID": "200464864", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Cellular Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464864/cellular-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS in Computer Science or Electrical Engineering of related discipline"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands on experience in embedded system software development.Strong Software Engineering skills including design, programming (using C, C++), scripting and debuggingDemonstrated ability to write thoughtful, maintainable codeExcellent problem solving, critical thinking, and communication skillsExperience in cellular protocols or wireless software development is a plusExperience in Access Stratum is a strong plusMS in Computer Science or Electrical Engineering of related discipline", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! We are looking for an individual who can excel in a fast-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200459963": {"jobID": "200459963", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "FPGA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459963/fpga-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Candidates should be skilled in the following:Designing logic with FPGAs (e.g. Verilog, SystemVerilog)Writing test benches to validate RTL implementations in simulationWriting scripts (i.e. Python or C) to validate RTL implementations on the benchHands-on bringup and debug of PCBs that have standard digital interfaces (e.g. SPI, I2C, LVDS)Using standard lab equipment (e.g. multimeters, oscilloscopes, spectrum analyzers)Experience working with systems that include analog sensors, ADCs, FPGAs, embedded microcontrollersWorking with multiple cross-functional teams (e.g. software, mechanical, optical) to balance design tradeoffsWork well in a team environmentBS and 3+ years of relevant industry experience.", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? \n\nThis role is all about making systems that have never been made before. Building and integrating \ncomplex components, working with cross-functional engineering teams, and making devices that live up \nto high expectations. This role requires an engineer who is not afraid to take on challenges, and knows \nhow to balance innovation with practicality. You will work with members of the cross-functional \nengineering team to define and implement custom hardware that supports and drives our prototype \nplatforms and instruments. You will be expected to reduce high level feature requests to practical and \nimplementable hardware designs, while understanding and balancing implementation tradeoffs."}, "200377297": {"jobID": "200377297", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "DataLab Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200377297/datalab-engineering-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Background in computer science, mathematics, or similar quantitative field with a minimum of 8 years professional experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Experience designing and building ad hoc and managed data science and analytics environments using various (Spark, Hadoop, Kafka, Snowflake, Vertica) distributed technologiesExperience with platform approaches to data architecture at scale and supporting data science teamsYou understand modern data architectures, stay on top of developments, and are aware of what other leading players are doingThe ability to manage, cultivate, and grow teams of engineers and analystsExperience with and ability to design for multiple cloud environments including Amazon Web Services, Microsoft Azure, Google Cloud Platform, or similar.Experience with DataBricks, Jupyter, SageMaker or equivalent tool stacksYou take a value-driven approach to data management, seeking to enable the productive use of data while delivering on our privacy commitmentsSnowflake, SparkSQL, Hive, Athena, Druid, Presto, Cassandra, or other Big Data query engine experience a plusAdvanced skills using one or more scripting languages (e.g., Python, bash, etc.) a plusExperience with applying data encryption and data security standardsA passion to reinforce and enrich an engineering team environment, driving team engagement and satisfaction and most meaningfully, a sense of humor and an eagerness to learnBackground in computer science, mathematics, or similar quantitative field with a minimum of 8 years professional experience", "jobDescription": "At Apple, we work every day to build products that enrich people’s lives! Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. \n\nOur technology and services power advertising in Apple News and Search Ads in the App Store. Our platforms are highly performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy.\n\nThe Ad Platforms Engineering team is seeking a leader to help build a robust data analysis, development, and experimentation environment. This leader will be accountable for defining and delivering a solution to empower users in all roles to use data successfully and efficiently. In this role you will work as the technical manager of a multi-functional engineering team driving the development, execution, and continuous improvement of new and existing policies, capabilities, and process. You will directly enable both our core products and our internal teams of ML Engineers, Data Scientists, analysts, and business users.\n\nYou will play a meaningful role in building an environment that delivers on Apple's privacy commitments to our customers while enabling our teams to change the way advertising works with data. You will collaborate closely across our engineering, algorithms, data insights, and product organizations to deliver relevant data and capabilities to inform our strategy and decisions.\n\nA successful candidate will have previous experience leading teams of engineers and architects and designing cloud based data exploration and processing systems. They will have experience with Amazon Web Services, Microsoft Azure, Google Cloud Platform, or similar. Additionally a keen understanding of data storage and processing technologies such as Spark, Kafka, EMR, Hadoop, EKS, Snowflake, Redshift, and similar."}, "200448971": {"jobID": "200448971", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448971/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE w/ 2+ years experience or Ph.D in EE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "At least 2 years of relevant industry experienceStrong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsMSEE w/ 2+ years experience or Ph.D in EE", "jobDescription": "Design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200402328": {"jobID": "200402328", "origin_search": null, "posted": "Jul 15, 2022", "jobTitle": "Hardware Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200402328/hardware-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Extensive experience with system architecture and associated tradeoffs for complex electronic systems that span hardware, software and mechanical aspectsExcellent communication skills  and demonstrated ability to work cross-functionally with a wide range of stakeholders including EE design, software, mechanical engineering, thermal, etc.Ability to develop system architecture options that meet requirements, analyze system performance, and make recommendations based on various optimization criteria.Strong system modeling experience at functional and physical levels, preferably in SysML and/or Matlab Simulink.Familiarity with autonomous systems and associated technologies including high performance compute, sensing and actuation sub-systems.Working knowledge of CAN, LIN, Ethernet, and high-speed serial linksStrong understanding of analog and digital circuit design", "jobDescription": "The Hardware Architecture Team in the Special Projects Group (SPG) is responsible for defining and specifying hardware architecture for Apple’s autonomous system development."}, "200436937": {"jobID": "200436937", "origin_search": null, "posted": "Jan 5, 2023", "jobTitle": "AI/ML - Machine Learning Researcher, Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436937/ai-ml-machine-learning-researcher-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD, or equivalent practical experience, in Computer Science, or related technical field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Demonstrated expertise in deep learning with publication record in relevant conferences (e.g., NeurIPS, ICML, ICLR, CVPR, ICCV, ECCV, KDD, ACL, ICASSP, InterSpeech) or a track record in applying deep learning techniques to productsProficient programming skills in Python and one of the deep learning toolkits such as PyTorch, Tensorflow, or JaxAbility to work in a collaborative environment.PhD, or equivalent practical experience, in Computer Science, or related technical field", "jobDescription": "We are a group of engineers and researchers responsible for information intelligence at Apple. We build systems to connect Apple users to information in products ranging from search and Siri to on-device intelligence.\n\nWe are looking for researchers who are passionate about developing algorithms, techniques, and systems that delight millions of users in Apple products and in the process push the frontier of deep learning."}, "200323924": {"jobID": "200323924", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Senior Software Engineer, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200323924/senior-software-engineer-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent is required; Master's degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "8 or more years of industry experience building scalable micro services or data driven platforms.Strong computer science fundamentals.Prior experience with Java/Scala/C++ or equivalent.Expertise in NoSQL datastores ( e.g Cassandra )Proficiency in data processing technologies (e.g Kafka, Spark, Flink )Experience crafting scalable micro services.Familiarity with cloud paradigms ( e.g AWS )Proven ability to work on sophisticated problems and systemsStrong problem solving and debugging skills.Have the ability to communicate effectively, both written and verbal, with technical and non-technical multi-functional teams.A desire to work in a fast-paced and challenging work environment.Bachelor's degree in Computer Science or equivalent is required; Master's degree preferred.", "jobDescription": "At Apple, we work every day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy."}, "200456986": {"jobID": "200456986", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "Manager, Mechanical Quality Engineer (MQE Manager)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456986/manager-mechanical-quality-engineer-mqe-manager?team=NA", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Engineering (Mechanical Engineering, Industrial Engineering, Manufacturing Engineering, Industrial Technology, Manufacturing systems engineering, Chemical engineering or similar)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$225,000,"}, "benefits": null, "requirements": "5+ years of experience in manufacturing and Quality Control, including 2+ years of managing a team of engineersExperience developing process quality plans, supplier quality audits, and driving corrective actions and failure analysis efforts.Working knowledge of mechanical quality and reliability concepts, supplier management, and general manufacturing operations.Experience with the development and evaluation of measurement systemsProject management experience and a solid understanding of problem solving tools including design of experiments, root cause analysis and statistical analytical toolsExperience with any of the following: mechanical enclosures, castings, plastic parts, injection molding, stamping, tooling, jigs, fixtures, or automotive high volume quality manufacturing engineeringInternational experience, particularly in Asia is a plusTravel internationally to supplier sites - 30%BS in Engineering (Mechanical Engineering, Industrial Engineering, Manufacturing Engineering, Industrial Technology, Manufacturing systems engineering, Chemical engineering or similar)", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.   \n\nThe people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it."}, "200178623": {"jobID": "200178623", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "AR/VR Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200178623/ar-vr-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Newport Beach", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSCS or comparable degree and/or relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "3 Years - Back end technologies (GoLang and/or NodeJS) or Front End (Typescript and/or Javascript)2 Years - Database designSoftware ParallelismDistributed System developmentObject-oriented ProgrammingBSCS or comparable degree and/or relevant experience-Bonus Qualifications:-C++-Experience with existing media workflows-Familiarity with Audio, Video and Image formats-3D Math", "jobDescription": "The Technology Development Group (TDG) is working with some of Apple's most advanced and exciting technologies, including augmented reality (AR) and virtual reality (VR) explorations. As a member of our fast-paced organization, you will have the opportunity to be part of a rapidly evolving team, driving experiences that will delight and inspire millions of people. Our commitment to excellence and our creativity enable our customers to do amazing things. We build technology that inspires people. What inspires you? Creating something new and finding solutions for complex problems? Working with world-class innovators? All of the above? Then we want to talk to you about this job opportunity. We are looking for motivated individuals interested Media Centric Software Engineering to work with our team of high-performing and risk-taking innovators to create services that are out of this world."}, "200461633": {"jobID": "200461633", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Product Definition - Wireless Connectivity Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461633/product-definition-wireless-connectivity-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Master’s degree in electrical engineering or a related field. PhD/Doctorate preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Industry experience in wireless system architecture and engineering.Excellent knowledge of wireless connectivity technologies and standards, including WiFi, IEEE 802.11 family (ax, be, ay), Bluetooth, 802.15.4, etc.Knowledge of key RF metrics and what drives them.Familiar with wireless system performance benchmarking including TRP, TIS, efficiency, latency, power.Knowledge of line-up analysis, calibration and compensation methods, and product integration challenges.Need to have at least one option for scientific scripting, such as MATLAB or PythonHand-on experience using RF test equipment such as spectrum analyzers, vector signal generators, channel emulators, etc.Strong analytical and problem-solving skillsStrong collaborative mind-set and excellent interpersonal communication skillsMaster’s degree in electrical engineering or a related field. PhD/Doctorate preferred", "jobDescription": "Join our wireless organization and drive innovation that matters! We’re looking for engineers with solid fundamentals in wireless technologies and RF systems to help us bring the next generation of wireless technologies into Apple’s products. \n\nAs part of the Product RF Definition team, you’ll be responsible for the intersection of RF technologies and product integration. With your unique knowledge, creativity, and passion, you could join us and help bring new wireless products to millions of Apple customers."}, "200451147": {"jobID": "200451147", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "SoC Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451147/soc-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Demonstrated expertise in SoC hardware architecture in the area of consumer electronics. Experience in the areas of Wireless and Cellular technologies such as LTE/5G NR is preferred.Must have outstanding SoC and system architecture fundamentals backed with substantial experience. This means a good understanding of power and performance tradeoffs, transient and steady-state performance states, idle and dynamic power states, as well as how SoC data and control flows interact.Sound understanding of Microprocessor Subsystems, Memory Controllers and Communication Fabrics.Good understanding the Digital ASIC Flow and Debug methodology.Solid understanding of electrical and thermal considerations at the chip, package and system levels.Good understanding of hardware-software interfaces.Excellent communication skills across organizations and at the executive level.Excellent written skills for clear and concise reporting.Excellent organization skills to prioritize conflicting requirements.Strong cross-site teamwork skills with the willingness to work independently.BS and 10+ years of relevant experience.", "jobDescription": "We’re a unique team of innovative, diverse individuals who have come together from multiple backgrounds to create advanced Cellular Architectures. The people who work here are generalists in nature, and together we complement each other. It is the passion of exploring uncharted territory that makes us thrive.\n\nOur team is seeking a highly motivated and experienced SoC Architect to help drive strategic 5G Cellular Modem technology, analyze key architectural trade-offs in coordination with cross-functional domain experts."}, "200464546": {"jobID": "200464546", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Hardware Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464546/hardware-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Prefer M.S. degree in Computer Engineer or Electrical Engineering."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BS in electrical or computer engineering required, MS preferredMinimum 3 years relevant industry experience.  High-volume consumer electronics system experience preferred.Lab skills: oscilloscopes, logic analyzers, electronic loadsExperience with schematic capture and PCB physical design using Cadence Concept and Allegro or similar CAD toolsDesign experience in digital logic, simulation, power conversion and deliveryFamiliarity with RF/wireless conceptsExperience with high-speed serial and memory interfaces including signal integrity design and measurement fundamentalsExcellent written and verbal communication skillsCommand line interface and scripting skillsSpecific deep expertise in several of the following areas is a plus: CPU or GPU microarchitecture, batteries, power management, analog design, audio, wireless, DisplayPort, PCIe, Thunderbolt, USB, SPI, I2C, UART, analog sensors, interconnectStatistical data analysis and visualization (ex. JMP) is a plusTravel to foreign contract manufacturer (estimate 5 weeks per year)Prefer M.S. degree in Computer Engineer or Electrical Engineering.Travel to foreign contract manufacturer (estimate 5 weeks per year)", "jobDescription": "Apple is seeking an EE for iMac electrical & system design integration. The candidate will design, implement, test, and debug the electrical subsystem of the world’s best professional desktop computers within a collaborative cross-functional team.\n\nOur engineers rely on skills in computer system architecture, schematic design, digital and analog circuits, power and voltage regulator integration, high speed signal integrity concepts, PCB design, bring up and system level troubleshooting to surprise and delight millions of customers."}, "200464543": {"jobID": "200464543", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Hardware Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464543/hardware-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Prefer M.S. degree in Computer Engineer or Electrical Engineering."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BS in electrical or computer engineering required, MS preferredMinimum 3 years relevant industry experience.  High-volume consumer electronics system experience preferred.Lab skills: oscilloscopes, logic analyzers, electronic loadsExperience with schematic capture and PCB physical design using Cadence Concept and Allegro or similar CAD toolsDesign experience in digital logic, simulation, power conversion and deliveryFamiliarity with RF/wireless conceptsExperience with high-speed serial and memory interfaces including signal integrity design and measurement fundamentalsExcellent written and verbal communication skillsCommand line interface and scripting skillsSpecific deep expertise in several of the following areas is a plus: CPU or GPU microarchitecture, batteries, power management, analog design, audio, wireless, DisplayPort, PCIe, Thunderbolt, USB, SPI, I2C, UART, analog sensors, interconnectStatistical data analysis and visualization (ex. JMP) is a plusTravel to foreign contract manufacturer (estimate 5 weeks per year)Prefer M.S. degree in Computer Engineer or Electrical Engineering.Travel to foreign contract manufacturer (estimate 5 weeks per year)", "jobDescription": "Apple is seeking an EE for iMac electrical & system design integration. The candidate will design, implement, test, and debug the electrical subsystem of the world’s best professional desktop computers within a collaborative cross-functional team.\n\nOur engineers rely on skills in computer system architecture, schematic design, digital and analog circuits, power and voltage regulator integration, high speed signal integrity concepts, PCB design, bring up and system level troubleshooting to surprise and delight millions of customers."}, "200443026": {"jobID": "200443026", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "System Frameworks Software Engineer - App Intents", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443026/system-frameworks-software-engineer-app-intents?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree at least 15 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Passion for building, developing, and shipping softwareDeep practical skills and knowledge of protocol- and/or object-oriented programmingKeen ability to translate technical capabilities, questions, and constraints into prototypesBS / MS in Computer Science OR equivalent degree at least 15 years of experience-  Experience programming with Swift and/or Objective-C is preferred-  Experience working on developer-facing frameworks OR experience working with Apple frameworks in customer-facing iOS and/or macOS applications is preferred-  Attention to detail, creativity, passion, and superior communication and collaboration skills-  Knowledge of AR/VR technologies, 3D graphics, and/or game engines is NOT required for this roleApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "The Technology Development Group (TDG) is looking for a Software Engineer to help us push the limits on the next generation of interactive experiences on our platform. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day.\n\nSystem frameworks are at the core of unleashing the potential of AR/VR on Apple’s platforms. Do you want to be at the forefront of ideating, building, and shipping groundbreaking experiences that build on top of the incredible capabilities of AR and VR? Our team is uniquely positioned at the intersection of design, frameworks, operating systems, and low-level software — by joining us you will work closely with peers across these functions to deliver life-changing products and experiences to our customers across all of Apple’s operating systems."}, "200448216": {"jobID": "200448216", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "SerDes Micro Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448216/serdes-micro-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical subject area with minimum 10 years of meaningful experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience leading the definition of high-speed SERDES receiver, transmitter, and clocking blocksDeep understanding of adaptation and optimization algorithmsDeep understanding of communications and information theoryProficiency in equalizers, timing recovery and system identificationProficiency in DSP concepts and applicationsFamiliarity with mixed-signal modeling in Python/MATLAB/C/C++Experience in system design and performance tradeoffFamiliarity with simulation tools for analog, digital, and/ or mixed-signal circuitsFamiliarity with Machine Learning conceptsExperience in firmware or embedded software development is a plusBS degree in technical subject area with minimum 10 years of meaningful experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Mixed Signal Design team is seeking a very creative software architect to help change the way we design our Analog Mixed-Signal IPs. These IPs will power our next-generation mobile silicon, including future versions of our iPhone, iPad, and Apple Watch devices. \n\nAnalog Mixed-Signal (AMS) Team is seeking a self-motivated SERDES Micro Architect to drive the definition of our next generation IPs. The SERDES IPs will be used in Apple silicon offering breakthrough power and performance for iPhone, iPad, Mac, and Apple Watch."}, "200459174": {"jobID": "200459174", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "R&D Test Engineer / Technician", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459174/r-d-test-engineer-technician?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Phoenix", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Engineering degree, diploma or equivalent with relevant years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of relevant experience as a Test Engineering / Technician / Lab ManagerExcellent written and verbal communication skills and solid teamwork and leadership skillsExperience with test design and execution and results reportingExperience / Understanding of the V&V processExperience with sensor technology is a plusLinux and Python experience is a plusEngineering degree, diploma or equivalent with relevant years of experience", "jobDescription": "We are looking for a motivated, field test engineer / technician with excellent problem solving and communication skills. The person will be responsible for overall device management, device assembly, troubleshooting, automated integration & systems testing, and support for automated continuous deployment. This role will require cross-functional collaboration with various business partners to fully define test objectives that will measure various performance metrics."}, "200375601": {"jobID": "200375601", "origin_search": null, "posted": "May 4, 2022", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200375601/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. in EE or Physics. M.S. or Ph.D. preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "5 -10 years of industry level experience in design and/or project management.Background in project management and scheduling.Understanding and experience with the HW/SW aspects of a sophisticated system.Experience at working with suppliers and contract manufacturers.Prior working experience in semiconductor design or manufacturing, qualification and production.Must have strong problem-solving skills.Must be highly motivated self-starter and a phenomenal teammate who can thrive in a dynamic startup-like environment.Must be able to work well with others.Willingness and ability to travel: 10% travel estimate in 5-10 day trips.Excellent oral and written communication skills. Excellent presentation skills.Dynamic and “can do” attitude with the desire to work with an extraordinary team and product.B.S. in EE or Physics. M.S. or Ph.D. preferred.PREFERRED SKILLS-  Previous work experience in integrated circuit design, integrated circuit device physics, RF/microwave circuit design, semiconductor manufacturing, semiconductor backend processing, semiconductor packaging, RF measurements using vector network analyzer, spectrum analyzers and call boxes, antenna design-  Software design experience in Python, C, C++", "jobDescription": "Join our wireless team and drive innovation that matters! At Apple, you will be a part of a team that is responsible for design and development of various Apple products. You will have a once-in-a-lifetime opportunity to deliver outstanding performance for our wireless products and participate in pushing the boundaries of achievable radiation performance in wireless devices."}, "200329077": {"jobID": "200329077", "origin_search": null, "posted": "Aug 24, 2022", "jobTitle": "System Software Engineer – Sensing and Connectivity System Engineering Team", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200329077/system-software-engineer-sensing-and-connectivity-system-engineering-team?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent with operating system focus desired."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Implements kernel drivers for large operating systemsDemonstrates in-depth knowledge of C and C++Has a deep interest in system programming concepts, e.g. memory and process managementFamiliar with buses such as UART/USB/SPI/PCIeDelivers on time under tight schedulesHas excellent analytical, programming and debugging skillsHandles unexpected challenges under pressureThrives in a collaborative environment and can clearly communicate technical detailsLeads multiple projects across many teamsSeeks to solve everyday problems in innovative ways as a passionDrives towards the right solution not just any solutionBachelor's degree in Computer Science or equivalent with operating system focus desired.", "jobDescription": "Here in Sensing and Connectivity we work on a diverse set of fundamental technologies that are critical to making Apple Apple. We help integrate wireless technologies such as WiFi, Bluetooth and Ultra-Wideband into compelling solutions. We take data from the world around us such as acceleration, orientation and location to provide more immersive experiences. iPhone, iPad, AirPods, Apple Watch, Mac, Apple TV, HomePod, AirTag, name an Apple product and our team has made major contributions to its success!"}, "200460832": {"jobID": "200460832", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Display Technologies Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460832/display-technologies-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Strong technical background (engineering or science)Experience as a technical project lead, lead engineer, responsible for delivering a product or product componentProgram/project management experience in product development or equivalentExtensive experience with large cross functional teamsExperience in product development: concept & feasibility, development and launchExperience working with teams of diverse technical backgrounds and quickly learning from themAbility to apply analytical thinking to product development needsAbility to connect, network and influence others within a large product organizationBS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly.  Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products! \n\nApple is looking for an outstanding Engineering Program Manager to join the Display team."}, "200452214": {"jobID": "200452214", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CAD Engineer - Full-Stack Web Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452214/cad-engineer-full-stack-web-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of Bachelors Degree + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "To succeed within this role, you should have shown experience in several of the following areas:In-depth knowledge of JavaScript, React, and client-side development frameworksProficiency in Python and related server-side frameworks (FastAPI, Django)Strong Database model design skills, including Graph, Document, and Relational systemsDesigned and optimized of RESTful services and GraphQL APIsKnowledge on development and deployment tools (Git, Perforce, Docker, TeamCity, Jenkins)Comfort within Linux/Unix environments, experience in scripting languagesUnderstanding of software engineering practices (agile, code review, automated builds, regressions testing)Familiarity with data reporting and data visualization engines (Splunk, Tableau) a plusMinimum requirement of Bachelors Degree + 3 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help support the design and manufacturing our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nWe are looking for an individual who is passionate about joining Apple’s engineering team as a Full-Stack Web Developer. The Hardware Technologies team designs the best silicon on the planet and you could be a key part of enabling our success."}, "200340349": {"jobID": "200340349", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AR/VR System UI Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200340349/ar-vr-system-ui-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science, Computer Graphics, or a related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "Experience with iOS/macOS UI application development (e.g. AppKit, UIKit, SwiftUI)Proficiency in C, C++, Objective-C, and/or SwiftBS/MS in Computer Science, Computer Graphics, or a related field-  Attention to detail, passion and the ability to master new applications and technologies quickly-  Fast technical uptake and ability to quickly switch context-  Willingness to go up and down the software stack to debug, diagnose, and fix issues, even outside your comfort zone-  Strong communication, teamwork and cross-team collaboration skills-  Solid understanding of software engineering techniques, methodologies and practices-  Swift and SwiftUI is a plus-  AR/VR experience is a plus, but not required-  Performance tools and optimization is a plusApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "The Technology Development Group (TDG) is looking for a passionate software developer to help us build the UI frameworks and system UI that will power the next generation of applications for our platform. This team is working in close collaboration with cross-functional teams across the SW and HW stack. As a member of our organization, you will assist us in designing and implementing our UI frameworks, 3D rendering technology, system shell, and contribute to overall product definition."}, "200463563": {"jobID": "200463563", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Wireless Charging Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463563/wireless-charging-firmware-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S., M.S. in Electrical & Computer Engineering, Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent programming skills with knowledge of C/C++.Strong understanding of operating systems, hardware, and embedded systems.Proven experience in writing complex kernel drivers and embedded firmware.Collaborates well with cross functional engineering teams.Passionate about new technology bring-up with hardware/software dependencies.B.S., M.S. in Electrical & Computer Engineering, Computer Science or equivalent experience", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device's identity as a whole. That's because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience! Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS and watchOS. By crafting these distinct, holistic user experiences, you'll continue to uphold and advance the excellence people expect from Apple devices! We are looking for an exceptional software engineer to design and implement wired and wireless battery charging software and firmware for the next generation Apple products. New challenges arise every day that require the sharp problem-solving skills of passionate & smart individuals. You will be required to explore novel system power and charging software algorithms and ship them into our products. The influence of the proposed innovations will span across system architecture, hardware, kernel drivers, firmware, and global system behavior, striving to satisfy both word class system performance and power delivery constraints at the same time."}, "200419826": {"jobID": "200419826", "origin_search": null, "posted": "Sep 10, 2022", "jobTitle": "Senior Engineer, Apple Game Center Frameworks", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200419826/senior-engineer-apple-game-center-frameworks?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in computer science or equivalent.\n\nAdditional Requirements"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience with C/C++ API development.Proficiency in or capacity for a wide range of game engines and programming environments.Passion for games and the developers who build them.BS in computer science or equivalent.\n\nAdditional RequirementsGrowing access to Apple APIs to new game engines and programming environments.Unity Engine plugin developmentC# and Microsoft Common Language Runtime (or Mono)PRIOR EXPERIENCES THAT ARE A PLUS FOR THIS ROLE:Swift, Objective-C, or other Apple platform toolkitsUnreal Engine, especially plugin developmentClient/server networking applications", "jobDescription": "Apple Arcade and Game Center are at the core of Apple’s growing games business. We strive to both provide an excellent experience for our existing game developers and to attract a broader spectrum of game developers to Apple platforms.\n\nAs a senior game developer experience engineer on the Game Center Frameworks team, you will help shape the next generation of games across the Apple ecosystem. Your work will grow the Apple Arcade portfolio and enable developers to offer amazing gaming experiences."}, "200408077": {"jobID": "200408077", "origin_search": null, "posted": "Oct 24, 2022", "jobTitle": "Model Maker", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200408077/model-maker?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or BA in Industrial Design or Entertainment Design preferred. Computer Graphics, 3D Animation/Modeling, Fine Arts or Engineering will be also be considered."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$38.94", "max": "$69.23/hr,"}, "benefits": null, "requirements": "An ideal candidate will have a strong passion and enthusiasm for an Anatomical 3D modeling career.Proficiency in ZBrush is preferred, as is the ability to go beyond the limitations of software tools and manually manipulate or refine surfaces.Candidates may also be familiar with rendering, visualization, 2D drawing, image editing, and manufacturing software packages.An understanding of polygonal or other solid modeling CAD programs is especially helpful. (ZBrush, Meshlab, Geomagic, Magics, Solidworks)Skilled in anatomical Sculpture using traditional materials: Clay, etc…Experience in creation of various types of molds from sculptures, Lifecasting a plus.Experience in various prototype and archival casting materials.3+ years experience building anatomical models.Natural curiosity and willingness to explore the best ways to build models based on both logic and intuition.Excellent teamwork and communication skills.BS or BA in Industrial Design or Entertainment Design preferred. Computer Graphics, 3D Animation/Modeling, Fine Arts or Engineering will be also be considered.PREFERRED QUALIFICATIONS-  Experience with imaging technologies-  Experience modeling other body parts and building realistic dynamic models", "jobDescription": "Apple is looking for candidates with a strong interest and aptitude in digital 3D modeling for the Video Engineering team! We are looking for an individual who would enjoy creating a wide variety of models, utilizing both known techniques as well as creating new techniques as the applications demand."}, "200456616": {"jobID": "200456616", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "AR/VR Display Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456616/ar-vr-display-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Hands on experience developing Display software stackComfortable working close to hardwareExperience in developing kernel drivers, embedded firmware, system frameworks, user-space daemons, etcIn-depth knowledge of C/C++Ability to work under tight schedule and deliver on timeExcellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersStrong communication and collaboration skillsBS in Computer Science/Computer Engineering or equivalent experience/skills.", "jobDescription": "The Technology Development Group at Apple is actively looking for a highly motivated Software Engineer to contribute and build Apple’s future technologies in Augmented Reality (AR) and Virtual Reality (VR) space. The successful candidate will demonstrate deep knowledge in end to end Display software stack. Candidate is expected to be proficient in operating systems concepts, software development, embedded firmware development and C/C++ programming. Role entails designing and developing real-time software stack for Apple's revolutionary AR/VR roadmap.\n\nOur team builds technology that defines industry standards, and therefore we seek people who thrive to innovate. Tenacity and the passion to learn are skills we value on our team, and if you want to impact millions of customers by working on the most advanced technology solutions, we want to talk to you."}, "200464181": {"jobID": "200464181", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "CPU Architecture Opportunities at Apple", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464181/cpu-architecture-opportunities-at-apple?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Various Locations within United States", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Some of the relevant degrees include: Computer Science, Computer Engineering, Electrical Engineering, or related degreesExtensive knowledge of CPU Architecture", "jobDescription": "Do you have an uncommon desire to seek out and solve exceedingly difficult challenges rather than the easy ones? Do you grow with adversity? Do you believe that truly valuable and meaningful accomplishments are the result of pushing the limits of perseverance? Do you believe that a world-class team with relentless drive can surpass even their own high expectations? We do! But we also realize this job isn’t for everyone. What we do isn’t easy but you don’t take the easy path. Apple is seeking a highly motivated and ambitious engineers to join our group that is driving advanced exploration for next generation iPhone, iPad, and Mac CPU architectures.\n\nThe CPU architecture and performance team is responsible for exploring and defining micro-architecture that will push the performance and efficiency of our CPU designs to an even more advanced level. The team is composed of experts with deep experience in architecture, ISA definition, performance micro-architecture, power control architecture, performance modeling, power modeling, simulation environment, and workload analysis. We define or have an impact on the CPU designs from our smallest to largest devices, while working cross-functionally with software and system partners across Apple to improve our roadmap and the end user experience.\n\nThe team has offices in Cupertino, CA, Beaverton, OR, Austin, TX, and Cambridge, MA."}, "200248956": {"jobID": "200248956", "origin_search": null, "posted": "May 18, 2021", "jobTitle": "Camera Hardware Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200248956/camera-hardware-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Electrical Engineering or industrial experience equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum 3-5 years relevant industry experience. High-volume consumer electronics system experience preferredExperience with schematic capture and PCB design using Cadence Concept and Allegro or similar CAD toolsDesign and simulation experience with Hi-speed serdes (MIPI, Displayport, HDMI, PCIE, etc)Broad experience with both analog and digital circuits, e.g. small signal conditioning, low noise power supply, high-speed and serial control interfacesStrong knowledge of layout strategies for Rigid PCB, Flex, and Rigid-Flex including material selection, Stack-up planning, EMI minimization, signal integrity, noise suppression and design for manufacturing, testing and reliability (DFM, DFT, DFR)Comfort and ability to use all types of electronic test equipments such as Oscilloscope, VNA, spectrum analyzer, electrical loads and signal generatorsExcellent written and verbal communication skillsCommand line interface and scripting skillsStatistical data analysis and visualization (ex. JMP) is a plusBS/MS in Electrical Engineering or industrial experience equivalent.Knowledge of CMOS image sensor, ISP or image processing is desirable;Familiarity with camera and optics technologyOccasional travel will be required", "jobDescription": "Why Apple?\n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.\n\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\nThe Camera Hardware Engineering group is responsible for the design, development, and innovation of camera hardware for all related Apple products. Our target is to deliver superior camera hardware to enable best-in-class camera user experience. We are looking for an enthusiastic, high energy individual who can help us with tomorrow’s challenges."}, "200458900": {"jobID": "200458900", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Platform Architecture Security Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458900/platform-architecture-security-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Relevant experience in High Tech and/or Product SecurityProven Technical Program Management / Engineering Management experience.Consistent track record of delivering security-focused features while working on end-to-end solutions with SW, Systems, Business/Factory Operations, Server, and Field Repair/Customer Care (e.g. AppleCare).Ability to facilitate development/design conversations with multiple engineering team members, document decisions/opens, and drive closure in a timely manner.Ability to build both a high-level program plan, as well as a detailed micro-schedule; and to drive each accordinglyDemonstrated success in driving multi-functional alignment, and being a change agent where vitalOutstanding documentation and self-organization; driving action item follow-up to ensure program momentum is maintained.Self-motivated and upbeat to mitigate program risks, close opens, and unblock critical path issues at the program level (including escalations of resource priorities).Leadership capabilities in being able to connect team members across an organization, and experience speaking publicly to Sr Management/Executives.Consistent track record of handling and leading through ambiguity.Ability to influence without authority, including the ability to influence Sr Management and multi-functional leadershipShowed strength in applying breadth and depth across multiple technical fields, as well as a validated capacity to pick up sophisticated new topics quickly.Absolute clarity in communication, including the ability to craft a compelling narrative around sophisticated topicsFamiliarity with Product Fraud, Tampering, and Repair; including a basic understanding of future legislative initiatives such as Right-to-Repair.Familiarity with security concepts and architectures (e.g. encryption vs. signing vs. attestation, knowledge of various security architectures such as HW vs. SW key protection, secure boot technologies, and/or secure cloud storage platforms).BS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norms here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product!\n\nAre you a leader? Do you want to apply your engineering background to make big things happen? Can you influence, connect, get results and communicate optimally? Can you deliver results while running a complex schedule? \n\nAs a Platform Architecture Security Engineering Program Manager within the Hardware Technology team, you will lead security-focused programs and features for Apple products, silicon, services and a wide variety of multi-functional security initiatives."}, "200380611": {"jobID": "200380611", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Senior AR/VR Triage Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380611/senior-ar-vr-triage-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "2-3 years experience with software triage. BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proven experience (2+ years) in triage and root-cause analysis of issues for software that ships at-scale preferably with software that ships on Apple platforms (iOS, watchOS, tvOS etc.)Experience with debugging, regressions and bisection techniques.Exceptional attention to detail to examine, debug and recognize failure patterns.Strong analytical and problem-solving skills with a diligent mentality.Flexibility and ability to adapt in a dynamic environment.Excellent organizational skills.Excellent written and verbal communication skills.Familiarity with software engineering workflow systems - Jira, Github etc.2-3 years experience with software triage. BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceExperience with scripting languages like Python, Javascript etc desirable.Familiarity with Objective-C, Swift iOS desirable", "jobDescription": "The Technology Development Group (TDG) is looking for Senior AR/VR Triage Engineers to help us build cutting-edge applications for our next-generation interactive computing platforms. Imagine yourself facilitating the development of amazing applications built on top of Apple’s most advanced technologies, while developing your expertise in Augmented and Virtual Reality (AR/VR). As a member of our organization you will assist us in crafting future products that will delight, inspire and empower millions of people."}, "200461180": {"jobID": "200461180", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "ProWorkflow Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461180/proworkflow-engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware and software engineering, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "7+ years in a software engineering role with a deep understanding of operating system fundamentals and performance analysis & debug.Excellent interpersonal skills and ability to work cross-functionally from silicon to SW teams.Desire and willingness to manage and lead system performance architects and engineers, helping them to grow and excel in their careers and impact.Experience rapidly prototyping software solutions from frameworks to applications.Passion and desire to learn new things, from deep technical topics to user workflows.Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware and software engineering, we still want to hear from you.• Experience managing & leading a team of engineers with diverse abilities.• Experience in a compiler, GPU driver, OS kernel, virtual memory, virtualization or performance teams. Also SOC analysis, modeling, and projections would be a bonus.• Developed & shipped or been part of team shipping software related to digital content creation.• Knowledge and experience with GPU programming (CUDA, OCL, OGL, DX) and parallel programming paradigms. (TBB, GCD, OpenMP, etc)", "jobDescription": "Do you like working on challenging multidisciplinary problems, analyzing micro-architecture and system architecture performance one minute and then analyzing, debugging, and fixing OS and framework source code the next? Do you also enjoy prototyping innovative solutions both in HW and SW? \n\nIf so, this may be the team for you!\n\nThe Pro Workflow team (PWF) in HWE at Apple is looking for a candidate to lead our PWF Engineering function. The PWF Engineering team is an interdisciplinary group of performance architects and experienced content creation professionals drawn from the film production world. The team works directly with PWF creatives to analyze their workflows, looking for opportunities to improve the HW, SW, and applications through optimizations, feature requests, and innovation."}, "200463883": {"jobID": "200463883", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Embedded Power Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463883/embedded-power-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "4+ years experience in wireless product developmentExperienced in doing low level driver development for cellular modem productsStrong expertise in the area of power management system/SW architecture & power flows, design and implementation of modem power driversStrong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingExperience in debugging complex race conditions between SW and HW power management flowsHardworking, inquisitive and collaborative and seeks to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customerBachelors or Masters in Electrical Engineering or Computer Science or equivalent.", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \nJoin the Wireless Technologies and Ecosystems team and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200463893": {"jobID": "200463893", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Embedded Power Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463893/embedded-power-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "4+ years experience in wireless product developmentExperienced in doing low level driver development for cellular modem productsStrong expertise in the area of power management system/SW architecture & power flows, design and implementation of modem power driversStrong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingExperience in debugging complex race conditions between SW and HW power management flowsHardworking, inquisitive and collaborative and seeks to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customerBachelors or Masters in Electrical Engineering or Computer Science or equivalent.", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \nJoin the Wireless Technologies and Ecosystems team and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200303531": {"jobID": "200303531", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Software Engineer, Safari UI and Analytics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200303531/software-engineer-safari-ui-and-analytics?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Passion for developing highly visible, product-defining featuresStrong object-oriented programming and design skillsDetailed knowledge of Objective-C, Swift, C++, or CExcellent debugging and problem solving skillsWillingness to work at all layers of the software stackExperience with statistics, data analytics, or related fields is welcome but not requiredBS in Computer Science or related field, or equivalent work experience.", "jobDescription": "We’re looking for an engineer to use a data-driven approach to help define the future of web browsing"}, "200448103": {"jobID": "200448103", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Senior WebKit Media Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448103/senior-webkit-media-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or equivalent and 4+ years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Familiarity and experience with pointer-based languages, C or C++ preferred.Understanding of data structures and algorithms.Excellent debugging, critical thinking, and interpersonal skills.Familiarity with web technologies, including HTML5 video and Web Audio.Basic knowledge of macOS and web browsers.BS or equivalent and 4+ years of relevant experience", "jobDescription": "The WebKit team seeks a senior software engineer excited to work on innovative technology for the world’s most popular web engine! Weʼre looking for senior engineers with outstanding critical thinking skills, a passion for quality, and the desire to push the web forward!\n\nWe are looking for someone who will be responsible for bringing the latest media technologies to the web.\n\nThe WebKit framework powers many system applications, including Safari, Mail, and Books."}, "200464898": {"jobID": "200464898", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Senior Software Engineer - Apple Cloud Distributed Key-Value Store", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464898/senior-software-engineer-apple-cloud-distributed-key-value-store?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS or PhD in Computer Science (MS or PhD preferred), or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "At least 10 years of experience building and operating software systemsAt least 5 years of experience building and operating distributed systemsProven track record for building, launching and operating large-scale production internet servicesKnowledge of Java (or C#) and non-blocking and thread safe programmingKnowledge of distributed databases, distributed storage, or similar mass-scale Distributed SystemsBS, MS or PhD in Computer Science (MS or PhD preferred), or equivalent experience.", "jobDescription": "Apple systems have huge scale and store many exabytes of data.\nThe Apple Object Store is a massive scale storage system that provides the foundation of data storage across Apple. The Apple Key-Value Store provides the metadata storage to make that happen, as well as supports other distributed Key-Value workloads within Apple Cloud platform."}, "200449884": {"jobID": "200449884", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Packaging Substrate Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449884/packaging-substrate-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "We are looking for an individual with experience as a process integration, manufacturing, R&D engineer in substrate industry In-depth knowledge of substrate technologyFamiliarity with PKG process & criteria is a plusOutstanding technology development & project management skillsStrong communication & collaborative skillsBS and 3+years of relevant industry experience-BS and 3+ years of relevant industry experience", "jobDescription": "Do you love working on challenges that no one has solved yet? Do you like changing the game? Envision what you could do here. At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!"}, "200442597": {"jobID": "200442597", "origin_search": null, "posted": "Nov 18, 2022", "jobTitle": "WatchOS Software QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442597/watchos-software-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent on-the-job experience in QA"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "An enthusiasm for customer-focused design, and high-quality technologyPassion for debugging difficult problems and driving results with multi-functional teamsCreative thinker and strong problem solver with meticulous attention to detailProven experience in Software Quality Assurance creating test plans for new products and featuresAt ease and adaptable in a dynamic and informal atmosphereExcellent communication skills are a requirement due to the high level of interaction with engineering teams, management, and other organizations within AppleHighly organized, creative, self-motivated, and passionate about achieving resultsComfortable moving between different server and data environmentsBS in Computer Science or equivalent on-the-job experience in QA", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!  \n\nThe Apple Watch QA team is seeking a QA Engineer to help us ensure that our Watch experience is rock-solid and customer-focused. We're looking for critical thinkers who would like to play a key role qualifying Watch applications and the frameworks that support them. We practice nimble, fast-paced development that relies heavily on a tight relationship between Engineering and QA.  \n\nAs a member of our passionate group in Apple Watch QA, you will have the unique and rewarding opportunity to shape and improve the software that allows our products to delight and inspire millions of Apple’s customers every day"}, "200380178": {"jobID": "200380178", "origin_search": null, "posted": "May 16, 2022", "jobTitle": "Manufacturing Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380178/manufacturing-quality-engineer?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Engineering (Mechanical Engineering, Industrial Engineering, Manufacturing Engineering, Industrial Technology, Manufacturing systems engineering, Chemical engineering or similar)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$156,000,"}, "benefits": null, "requirements": "2+ years of experience in engineering, manufacturing or Quality Control.Experience developing process quality plans, supplier quality audits, and driving corrective actions and failure analysis efforts.Working knowledge of mechanical quality and reliability concepts, supplier management, and general manufacturing operations.Experience with the development and evaluation of measurement systemsProject management experience and an understanding of problem solving tools including design of experiments, root cause analysis and statistical analytical toolsExperience with any of the following: mechanical enclosures, castings, plastic parts, injection molding, tooling, jigs, fixtures, or high volume quality manufacturing engineering (e.g. Automotive, Consumer Electronics, Medical Devices, Etc)BS in Engineering (Mechanical Engineering, Industrial Engineering, Manufacturing Engineering, Industrial Technology, Manufacturing systems engineering, Chemical engineering or similar)", "jobDescription": "2+ years of experience in engineering, manufacturing or Quality Control.\n\nExperience developing process quality plans, supplier quality audits, and driving corrective actions and failure analysis efforts.\n\nWorking knowledge of mechanical quality and reliability concepts, supplier management, and general manufacturing operations.\n\nExperience with the development and evaluation of measurement systems\n\nProject management experience and an understanding of problem solving tools including design of experiments, root cause analysis and statistical analytical tools\n\nExperience with any of the following: mechanical enclosures, castings, plastic parts, injection molding, tooling, jigs, fixtures, or high volume quality manufacturing engineering (e.g. Automotive, Consumer Electronics, Medical Devices, Etc)"}, "200459844": {"jobID": "200459844", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Wireless PHY RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459844/wireless-phy-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS +0 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "We'd like you to have:Have taken relevant courses such as DSP/wireless communications/machine learning and VLSI logic designUnderstanding of DSP communication algorithms and trade-offs between performance and complexityGood knowledge in modern logic design techniquesExcellent communication skills and self-motivationFamiliar with Verilog/Vhdl/SystemVerilog and MATLAB/C programming languagesBS +0 years of relevant experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}, "200387625": {"jobID": "200387625", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Sensor Hardware Engineer — Health Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200387625/sensor-hardware-engineer-health-technologies?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. or MS Degree in EE or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Fundamental understanding of analog circuits, analog / digital converters, as well as digital serial communication protocols like I2C/SPI, etc.Experience in schematic capture and PCB layout techniques, including noise performance optimization, component selection, thermal control, etc.Experience working with Command Line Interfaces (CLI), being able to interface and communicate with prototype HW, adjust settings, and perform lab bench performance characterizations and evaluations.Working with Architects, Test Engineer, and QA engineers to define, propose HW verification / validations plan including owning and capturing the plan in engineering requirements documentation.Conduct failure and root-cause analyses, including assessments of user customer impact in order to drive HW mitigations and improvements.Ph.D. or MS Degree in EE or equivalent.Should thrive in fast-paced environment, be highly organized, and be able to multitask. Excellent communication, and interpersonal skills. Demonstrated ability to work as a key member of a team. Strong analytical, and problem-solving skills. Detail oriented.May travel in the future to product manufacturing facilities both domestic and international to ensure the sensing HW module is being tested properly and working with HW Test teams improve, add control Factory Test FOMs and their distribution limits.", "jobDescription": "The Health Technologies Hardware Prototyping & Development Team conceives and proves out exciting new technology for Apple’s future products and features. In this role you can be involved in the end-to-end new product development cycle, from s proof of concept HW development to  factory production — ultimately working to invent, produce, and improve HW technologies that seek to improve human quality of life."}, "200462235": {"jobID": "200462235", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Product Manager, Retail Contact Center Applications", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462235/product-manager-retail-contact-center-applications?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Advanced knowledge of the software development lifecycle (SDLC)Project and Product management (PMP, SCRUM/Agile, Waterfall) methodologiesUser Acceptance Testing (UAT)Business Analysis; building narratives and business cases with dataEffective communication, both written and verbal, across all levels of the organizationExperience in one or more of the following UX design areas:-  software user interface-  wireframes/mockups-  human-computer interaction-  usability and user researchTechnically able to lead and participate in discussions involving infrastructure, APIs, programming languages, and other technical subject matter.BA/BS or equivalent experienceDirect product development experience in a technical environment, preferably software development3 to 5 years Product Ownership experiencePMP certification a plusUI/UX Design experience a plusSoftware Programming experience a plusWireframe experience a plusMac & Keynote experience preferred", "jobDescription": "Are you passionate about creating a world class customer experience? This Austin-based role will serve as the business-side owner of a software product, or group of software products, used by Retail Contact Center (RCC) Specialists. \n\nYou will need to be able to understand: the needs of our RCC Specialist community, their workflow and processes, and the underlying technologies comprising the platform(s). With this understanding, you will then work cross-functionally to design and translate business needs into clear and functional design requirements for your partner teams.\n\nTo be successful, you will need: a passion for creating great user experiences, a high degree of proactive self-motivation, organization, follow-through, and the ability to communicate effectively with people of various technical proficiencies. You will interact and collaborate with stakeholders across all business functions, levels and locations.\n\nIdeally you will have experience with: E-commerce order and support processes, contact center tools/processes, graphic user interfaces, project oversight, and user acceptance testing (UAT). You should also have a proven comfort level with one or more software development methodologies (i.e. Agile).\n\nYou have a record of leading complex projects, delivering high quality results on time, taking ownership of issues and tasks, and making the hard calls. You are a creative thinker, demonstrate an unending curiosity, are a dedicated worker and well organized, and not afraid to go above and beyond to get the job done."}, "200463081": {"jobID": "200463081", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "AIML - Sr Program Manager, Hybrid Cloud FinOps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463081/aiml-sr-program-manager-hybrid-cloud-finops?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE/CS/CE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "10+ years of Program and/or Financial management with experience covering as many of the following as possible: cloud services, internet services, distributed computing, and a large-scale & international user baseStrong working understanding of Excel and financial modeling. Prior data analysis experience (SQL, Tableau, Superset, Python/Jupyter Notebooks, etc.).Strong technical experience with cloud infrastructure, large scale systems, Linux/server operating systems running on containers, big data, and networking. Bonus points for past Engineering experience.Self-motivated, independent, and proactive. Demonstrated creative and critical thinking capabilities. Can quickly (realtime) triage, prioritize, and lead multi-functional teams under pressure.Outstanding communication and presentation skills, written and verbal, to all levels of an organization. High operational precision and attention to detail.Highly developed drive to improve how things work, with proven track record of driving dramatic improvements for team quality, performance, agility, or effectiveness.BS/MS EE/CS/CE or equivalent", "jobDescription": "At Apple, great ideas have a way of becoming great products, services and customer experiences very quickly. Bring your passion to your job and there's no telling what you could accomplish. Apple offers a collaborative work environment that fosters creativity and innovation. Every new product, service, or feature we invent is the result of people working together to make each other's ideas stronger. That happens here because every one of us strives toward a common goal - crafting the best customer experiences.\n\nAs a member of the AIML PM team, you will analyze cost data and applying cost optimizations across public clouds and Apple’s private cloud that supports development engineers, internal users, and billion+ customers of Apple around the world. We’re looking for people with a consistent track record of identifying and delivering on cost optimization opportunities across public clouds. You will have the opportunity to partner with the engineering teams and other product managers to work across the entire AIML org to build the tools, define processes, improve engineering efficiencies, and ensure resiliency for these services."}, "200457350": {"jobID": "200457350", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Wireless SoC NPI Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457350/wireless-soc-npi-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience working in Wireless connectivity systems and/or SoC silicon development.Prior Wireless connectivity SoC product/test/validation and debug engineering experience preferred.Knowledge of Wireless connectivity systems for 2 or more modern communications standards, WiFi /BT, and UWB Wireless connectivity systems/standards preferred.Extraordinary teammate and creative problem solver with the ability to lead technical teams and multi-functional groups against plans.High-tech industry experience with a track record of hands-on product development, program management, project management or engineering management.Results-oriented and dedicated with validated creative and critical thinking capabilities.Excellent written and oral communication skills.BS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, thoughtful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! Come to Apple and work within a team to deliver a broad range of wireless technologies. \n\nThis is an extraordinary opportunity to engage with the latest technologies and chip in to groundbreaking Apple products year after year. You will go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. Apple seeks a technical leader to program lead our groundbreaking Wireless connectivity chipsets to meet performance, quality, and schedule requirements for Apple products. \n\nYou will be responsible for multi-functional team coordination, communication, and representation across Wireless connectivity systems and the silicon engineering ecosystem from concept to production. A technical background crafting products and test engineering for Wireless connectivity products will be key to your success in this role. Ideally, you will also have project management experience in some aspects of Wireless connectivity platform/system development. You will also work in a multidimensional engineering environment where advanced multi-tasking skills and real-time crisis management are all desired strengths for this position."}, "200455251": {"jobID": "200455251", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Force Hardware - Sensor Design & Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455251/force-hardware-sensor-design-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Degree in Electrical Engineering, Mechanical Engineering, Mechatronics, Physics, or related field.\nM.S. and 4+ years (or B.S. and 6+ years) of related industry experience in a module design and integration,\nsystems engineering, and/or product engineering role."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong background in board-level analog and mixed-signal circuits and/or embedded systems; hands-on experience in module-level design.Proficiency in simulation tools (such as COMSOL/SPICE), scripting languages (such as Python/MATLAB), and statistical analysis software (such as JMP).Ability to independently drive technical issues to resolution, including coordinating efforts across teams.Excellent critical analysis, statistical analysis, and logic/reasoning skills.Excellent written/verbal communication, teamwork, and leadership skills.Direct experience with sensor design and integration.Cross-functional experience in a high-volume production environment.Background and experience with automation for test and characterization.Degree in Electrical Engineering, Mechanical Engineering, Mechatronics, Physics, or related field.\nM.S. and 4+ years (or B.S. and 6+ years) of related industry experience in a module design and integration,\nsystems engineering, and/or product engineering role.", "jobDescription": "Come join the Sensor Technology Team! We're a multi-disciplinary, problem-solving team developing state-of-the-art sensing solutions and technologies that are central to Apple’s products, including the iPhone, iPad, Apple Watch, AirPods, and more. As part of this team, you'll have an opportunity to participate in development from proof-of- concept all the way through end-product launch.\nThe key goal of the Sensor Technology Team is to enable the world’s best user experience. New challenges arise every day that require the sharp analytical skills of talented and smart individuals. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200442193": {"jobID": "200442193", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Audio Screening & Triage Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442193/audio-screening-triage-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. or higher in Computer Science, Computer Engineering, Audio Engineering, Electrical Engineering, Music Technology, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$94,000", "max": "$171,000"}, "benefits": null, "requirements": "3-5+ years of experience in general test engineering.Experience and familiarity with Python and JavaScript a requirement.Strong problem solving and debugging skills along with a diligent mentality.Exemplary written communication skills, and diligent, yet confident personal communication skills.Familiarity with real-time audio handling (sample rates, buffering, PCM, drivers, etc.).A foundational understanding of electronics, audio technology, and recording studios.Expert-level familiarity with macOS and iOS platformsB.S. or higher in Computer Science, Computer Engineering, Audio Engineering, Electrical Engineering, Music Technology, or equivalent experience.ML and/or CoreAudio API experience is a plus", "jobDescription": "Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you.\n\nThe Interactive Media Group (IMG) provides the audio, video, and graphics foundation across all of Apple's innovative products, including iPhone, iPod, iPad, Apple TV, Apple Watch, iTunes, and macOS, as well as professional and consumer applications from Final Cut, Logic and iWork. The Audio QA group provides audio software test support across all of Apple’s products.\n\nWe are seeking a creative and organized triage engineer to join our screening and triage team as we field audio bugs from engineering, developers, and customers—truly, the whole world. In this role, you will interact with an extensive breadth of audio issues spanning across all of our hardware and software products, including accessories. Critical yet thoughtful thinking is your strong suit—you are able to identify and appreciate nuances between products and features related to audio."}, "200452600": {"jobID": "200452600", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "HID-Senior Systems SW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452600/hid-senior-systems-sw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Deep experience developing system software such as drivers or frameworks. Strong C/C++ and object-orientated programming skills. Excellent debugging skills Experience with profiling code in both kernel and userspace. Ability to quickly familiarize yourself with code you’ve never seen before, and understand the pertinent functionality. Strong verbal and written communications skills Self advised, analytical, and work well in a team environment. Comfortable working at both higher and lower levels of softwareBS or MS in CS/CE", "jobDescription": "The Human Interface Devices Software team is responsible for delivering high-quality drivers, frameworks and tools supporting sensing technologies across all Apple products. Primarily supporting the multi-touch technology, we have deep experience developing systems software and building stacks that enable the best user-experience. We work closely with Algorithms, Firmware, Design, and UI teams to ensure sensor and software performance is optimized across all layers of the stack."}, "200459468": {"jobID": "200459468", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "HID-System SW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459468/hid-system-sw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Deep experience developing system software such as drivers or frameworks.Strong C/C++ and object-orientated programming skills. Excellent debugging skillsExperience with profiling code in both kernel and userspace.Ability to quickly familiarize yourself with code you’ve never seen before, and understand the pertinent functionality.Strong verbal and written communications skillsSelf advised, analytical, and work well in a team environment.Comfortable working at both higher and lower levels of softwareBS or MS in CS/CE", "jobDescription": "The Human Interface Devices Software team is responsible for delivering high-quality drivers, frameworks and tools supporting sensing technologies across all Apple products. Primarily supporting the multi-touch technology, we have deep experience developing systems software and building stacks that enable the best user-experience. We work closely with Algorithms, Firmware, Design, and UI teams to ensure sensor and software performance is optimized across all layers of the stack."}, "200434443": {"jobID": "200434443", "origin_search": null, "posted": "Dec 1, 2022", "jobTitle": "Paid Digital Analyst - Channel Marketing", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434443/paid-digital-analyst-channel-marketing?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/BA degree required; MS degree a plus - ideally in an analytical field such as Economics, Statistics, Mathematics, Software Engineering, Finance, Applied Sciences, etc."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$188,500,"}, "benefits": null, "requirements": "5+ years digital analytics experience, with a focus on business insights and strategic recommendationsExpertise in digital advertising/marketing attribution, measurement, and cross-channel measurement (display + SEM + paid social channels)Proficiency in programming languages such as SQL, Python or R.Proficiency with databases including SQL queries and visualization tools (e.g.Tableau)Ability to develop A/B test experimentation design and analysisMeticulous attention to detail, an ability to collaborate effectively between strategy, activation and data groupsExcellent data visualization and storytelling skillsExcellent written and verbal communication skills and keen ability to synthesize complex data pointsStrong troubleshooting skillset for data discrepancies and an understanding of data pipelinesAbility to work independently with agility, and prioritize effectivelyBS/BA degree required; MS degree a plus - ideally in an analytical field such as Economics, Statistics, Mathematics, Software Engineering, Finance, Applied Sciences, etc.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe Services Advertising team at Apple is responsible for cultivating awareness, building product education, and driving new customer acquisition across Apple’s full suite of first party services through a variety of marketing channels. We are looking for an experienced Paid Digital Analyst, with a focus on digital advertising channel performance across multiple KPIs, to compile channel specific reporting data as well as communicate key insights, offerings, and recommendations to stakeholders."}, "200445887": {"jobID": "200445887", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Cellular Software Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445887/cellular-software-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Experience in Cellular Protocol Stack software development is preferredStrong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingKnowledge of Embedded RTOS essentialExperience in 5G NR and RRC is a strong plus.Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP/ETSI standardsHands on experience developing test specification, test case implementation and analysis.Thrive in a collaborative environment and can clearly communicate while confidently developing software in highly cross functional projects.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering or Computer Science or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200465457": {"jobID": "200465457", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Cellular Software Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465457/cellular-software-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Experience in Cellular Protocol Stack software development is preferredStrong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingKnowledge of Embedded RTOS essentialExperience in 5G NR and RRC is a strong plus.Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP/ETSI standardsHands on experience developing test specification, test case implementation and analysis.Thrive in a collaborative environment and can clearly communicate while confidently developing software in highly cross functional projects.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering or Computer Science or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200460496": {"jobID": "200460496", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Sr. Full-Stack Engineer, Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460496/sr-full-stack-engineer-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-BSCS or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum of 5 years experience in a professional programming positionKnowledge of modern Java stack (Spring Boot and related)Experience in UI Technologies (i.e. React, Angular, Javascript)Sophisticated experience with programming languages (i.e. Java, Python, C++).Familiarity querying search engines (i.e. SOLR, ElasticSearch)Excellent troubleshooting and problem-solving skills.Aptitude to independently learn new technologiesCollaborative, team-oriented attitudeFamiliarity with digital media formats for video is helpful-BSCS or equivalent work experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. \n\nThanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and multi-functional, offering greater exposure to the array of opportunities here."}, "200449857": {"jobID": "200449857", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "SOC Power Management Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449857/soc-power-management-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Knowledge of embedded SoC architectures and hardware/software dependenciesPrevious experience in writing and debugging complex kernel driversExperience in performance tuning and analysis of systemsDemonstrated innovative, critical thinking and troubleshooting skillsHighly professional, with the ability to deliver work on tight schedulesExcellent collaborative skillsExtraordinary written and verbal communicationKnowledge of C and C++MS in Computer Science or equivalent experience5 years of experience in the embedded power management spaceProven track record leading new technology development with hardware/software dependenciesUnderstanding of system and silicon power management is a plus, including clock and power gating, DVFS, C-states/P-states, voltage managementExperience with new platform hardware bring-upExperience with OS device drivers", "jobDescription": "We are looking for an exceptional software engineer to lead, design and implement CPU and SoC power management software for Apple’s new product platforms!\n\nIn this unique and highly visible role, you will be at the center of feature developments and system power optimizations. We work with hardware and system teams and lead the bring-up and development of SoC power management features from pre-silicon to final product commercial release. You will also be required to prototype and explore novel CPU/SoC power management schemes and work with design teams to influence future chip designs. The impact of the proposed innovations will span across CPU/SoC micro-architecture and driver design, striving to lead the future products to aggressive battery life targets."}, "200461305": {"jobID": "200461305", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "RF User Research Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461305/rf-user-research-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BS in Electrical Engineering (or related major) required, MS preferred\n\n-  3+ years of proven experience post Bachelor’s degree with a concentration or extensive work in RF/wireless technologies, object-oriented programming, data analysis/visualization, statistics and human-centered research"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience working with RF and wireless connectivity technologies (e.g. Bluetooth, WiFi, and UWB), preferably for consumer productsExperience with data processing and visualization skills using R, Python, Matlab, or a similar languageExperience setting up research plans and schedulesExperience identifying and directing resources required to implement successful researchExperience collaborating with multi-functional teams to resolve technical issuesStrong grasp of the theory behind RF and wireless connectivity technologiesStrong organizational and social skills, both verbal and writtenStrong analytical and problem-solving abilitiesWillingness and ability to travel within the USA-  BS in Electrical Engineering (or related major) required, MS preferred\n\n-  3+ years of proven experience post Bachelor’s degree with a concentration or extensive work in RF/wireless technologies, object-oriented programming, data analysis/visualization, statistics and human-centered research", "jobDescription": "Apple is seeking an RF Research Scientist to apply their technical expertise in RF technology to user research in support of the design and development of Apple’s wireless products. \n\nThis role will support all phases of product development in the context of wireless connectivity during common everyday use. They will work closely with multi-functional teams including Human Factors, Antenna Design, RF Design, QA, Software, and more.\n\nIf you are passionate about RF technologies and obsessed with the user experience, we encourage you to apply."}, "200452103": {"jobID": "200452103", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless Module Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452103/wireless-module-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS with + 3 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep understanding of Wireless technologies.Extraordinary skill in Hardware and Software integration, problem solving and optimization.Responsible for crafting DUT Control boards.Programming experience in C/C++/Matlab/Python required.Experience with data/yield analysis, JMP or similar tool a plus.Experience working with and programming multiple Mass production RF testers: Litepoint, Advantest and Teradyne.Very driven and self-motivated. Capable of driving vendors, test partners and setting test strategies.Skilled at driving cross-functional decision and cooperating with other test teams (upstream/downstream) for a sound end-to-end product test strategy.Minimum BS with + 3 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! Ready to join our RF Design team? \n\nThe Wireless Module Test Engineering Lead (WMTE) will be responsible for designing and driving strategy for all high-volume RF module tests at the module factories adhering to the internal processes/objectives. The Lead engineer is responsible for research, design, and development of test methodologies at the module vendors for multiple Wireless technologies (Wifi/UWB/GPS/Cellular/NFC). They would need to work with multiple chipsets across wireless technologies and plan the appropriate high volume test strategy. This position will support multiple product lines from the Hardware Technology organization from early concept through MP. The WMTE will apply a confirmed EE/RF background to understand technical details, issues and risks."}, "200452099": {"jobID": "200452099", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless Module Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452099/wireless-module-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS with + 10 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Deep understanding of Wireless technologies.Extraordinary skill in Hardware and Software integration, problem solving and optimization.Responsible for crafting DUT Control boards.Programming experience in C/C++/Matlab/Python required.Experience with data/yield analysis, JMP or similar tool a plus.Experience working with and programming multiple Mass production RF testers: Litepoint, Advantest and Teradyne.Very driven and self-motivated. Capable of driving vendors, test partners and setting test strategies.Skilled at driving cross-functional decision and cooperating with other test teams (upstream/downstream) for a sound end-to-end product test strategy.Minimum BS with + 10 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! Ready to join our RF Design team? \n\nThe Wireless Module Test Engineering Lead (WMTE) will be responsible for designing and driving strategy for all high-volume RF module tests at the module factories adhering to the internal processes/objectives. The Lead engineer is responsible for research, design, and development of test methodologies at the module vendors for multiple Wireless technologies (Wifi/UWB/GPS/Cellular/NFC). They would need to work with multiple chipsets across wireless technologies and plan the appropriate high volume test strategy. This position will support multiple product lines from the Hardware Technology organization from early concept through MP. The WMTE will apply a confirmed EE/RF background to understand technical details, issues and risks."}, "200452108": {"jobID": "200452108", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Module Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452108/wireless-module-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS with + 10 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep understanding of Wireless technologies.Extraordinary skill in Hardware and Software integration, problem solving and optimization.Responsible for crafting DUT Control boards.Programming experience in C/C++/Matlab/Python required.Experience with data/yield analysis, JMP or similar tool a plus.Experience working with and programming multiple Mass production RF testers: Litepoint, Advantest and Teradyne.Very driven and self-motivated. Capable of driving vendors, test partners and setting test strategies.Skilled at driving cross-functional decision and cooperating with other test teams (upstream/downstream) for a sound end-to-end product test strategy.Minimum BS with + 10 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! Ready to join our RF Design team? \n\nThe Wireless Module Test Engineering Lead (WMTE) will be responsible for designing and driving strategy for all high-volume RF module tests at the module factories adhering to the internal processes/objectives. The Lead engineer is responsible for research, design, and development of test methodologies at the module vendors for multiple Wireless technologies (Wifi/UWB/GPS/Cellular/NFC). They would need to work with multiple chipsets across wireless technologies and plan the appropriate high volume test strategy. This position will support multiple product lines from the Hardware Technology organization from early concept through MP. The WMTE will apply a confirmed EE/RF background to understand technical details, issues and risks."}, "200437634": {"jobID": "200437634", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Wireless Charging Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437634/wireless-charging-firmware-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S., M.S. in Electrical & Computer Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Excellent programming skills with knowledge of C/C++.Strong understanding of operating systems, hardware, and embedded systems.Proven experience in writing complex kernel drivers and embedded firmware.Collaborates well with cross functional engineering teams.Passionate about new technology bring-up with hardware/software dependencies.B.S., M.S. in Electrical & Computer Engineering or equivalent experience", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience! Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS and watchOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices! We are looking for an exceptional software engineer to design and implement wired and wireless battery charging software and firmware for the next generation Apple products. New challenges arise every day that require the sharp problem-solving skills of passionate & smart individuals. You will be required to explore novel system power and battery management software algorithms and ship them into our products. The influence of the proposed innovations will span across system architecture, hardware, kernel drivers, firmware, and global system behavior, striving to satisfy both word class system performance and power delivery constraints at the same time."}, "200451477": {"jobID": "200451477", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Chip Level Library & Design Optimization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451477/chip-level-library-design-optimization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "A minimum of 10 years of experience in advanced FinFet technology development (e.g. device, integration, process, flows, EDA), circuit design, Semiconductor R&DProven understanding of advanced CMOS device behavior, with practical understanding of device physics and analysis, and their impact to SoC design PPA metricsThorough knowledge and understanding of yield (for a product or a technology learning vehicle), including defect pareto development and Failure Analysis methodology, Benchmarking practiceStrong data analysis (and statistical analysis) skills; proficiency with a broad set of data analysis tools for both device and yield analysisSolid understanding to perform basic circuit analysis, extraction, and SPICE simulation for PPA benchmarking applicationsGreat interpersonal skills to champion initiatives internally and externally, for effective communication with executive management and external partnersTechnical, analytical, and multi-functional collaboration skillsBS and a minimum of 10 years of relevant industry experience", "jobDescription": "Do you love building without precedent? As part of our Digital Design IP group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking! Join us in an exciting silicon design group that's responsible for crafting innovative ASICs. You’ll play an integral role in designing the tools that allow us to bring customers experiences they’ve never before envisioned. We have an extraordinary opportunity in advanced process technology, foundation IP (logic, memory) design, for implementation pathfinding and optimization engineer. In this highly visible role, you will be at the heart of a new advanced technology definition for the future iPhone, Mac, watch processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200451017": {"jobID": "200451017", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Motion Sensor Algorithm and Estimation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451017/motion-sensor-algorithm-and-estimation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Engineering, Robotics or CS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "8+ years of related experience and skilled in the of development, theory, design, modeling, and implementation of sensor fusion algorithms based on inertial sensors + external aiding. eg. Kalman filters, batch least squares, complementary filters, etc…Deep understanding of kinematics, dynamics and equations of motion for dynamic systems.Experience with platform modeling that includes kinematics for joint motion, rotary sensing (encoders), and inertial state propagation.Expert in calibration and signal processing of motion sensors and intrinsic parameters.MS or PhD in Engineering, Robotics or CSNice to Haves:-  Experience implementing and releasing software/algorithm designs into products.-  Experience with source control (Git) on multi developer projects", "jobDescription": "One of Apple’s R&D groups is currently seeking a motion sensor algorithm and estimation engineer. This engineer will develop custom signal processing, state estimation and calibration routines for a host of motion sensors in novel controls  applications. This individual will drive algorithm design, signal processing, characterization and system level integration. Typical work products will include signal processing and estimation algorithm designs or embedded implementation, performance analysis, proofs of concept, and integration plans.  \n\nDoes working on new technology excite you? Innovation is in your hands! We are ready to help you help us grow!"}, "200451530": {"jobID": "200451530", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer - Full-Stack Web Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451530/cad-engineer-full-stack-web-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "To succeed within this role, you should have shown experience in several of the following areas:In-depth knowledge of JavaScript, React, and client-side development frameworksProficiency in Python and related server-side frameworks (FastAPI, Django)Strong Database model design skills, including Graph, Document, and Relational systemsDesigned and optimized of RESTful services and GraphQL APIsKnowledge on development and deployment tools (Git, Perforce, Docker, TeamCity, Jenkins)Comfort within Linux/Unix environments, experience in scripting languagesUnderstanding of software engineering practices (agile, code review, automated builds, regressions testing)Familiarity with data reporting and data visualization engines (Splunk, Tableau) a plusMinimum requirements of BS degree + 3 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help support the design and manufacturing our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nWe are looking for an individual who is passionate about joining Apple’s engineering team as a Full-Stack Web Developer. The Hardware Technologies team designs the best silicon on the planet and you could be a key part of enabling our success."}, "200430900": {"jobID": "200430900", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "System Architecture Engineering Program Manager (EPM) - Silicon focus - Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200430900/system-architecture-engineering-program-manager-epm-silicon-focus-technology-development-group-tdg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Required: BS/MS in CE/EE/CS or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Understanding of the System on chip (SOC) architecture and design.Deep understanding of the interactions between SOC and consumer electronic System ArchitecturesAbility to translate a customer use-case to technical detailsDemonstrated ability to work through architecture tradeoffs, specifically in systems with custom silicon components.Proven track record of managing silicon and system validation for advanced hardware productsStrong technical background in Electrical, Mechanical, or Software Engineering5+ years of relevant hardware engineering experience in consumer electronics3+ years of project management experienceProactive and highly self-motivated; good critical thinking capabilities and strong attention to detailAbility to operate well in an environment with rapid development cycles and constant changeRequired: BS/MS in CE/EE/CS or equivalent work experience", "jobDescription": "Do you enjoy tackling ambiguous problem statements, evaluating technical trade-offs, driving teams to recommendations that are strongly grounded in customer experience? Apple’s Technology Development Group (TDG) is looking for an experienced, highly technical EPM to join the team driving System Architecture definition and validation of a new product category. If you have broad experience across various key hardware technologies (e.g displays, cameras, RF, custom silicon), and strong product/customer sense, we’d love to hear from you!!!"}, "200459615": {"jobID": "200459615", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "SW Engineering Program Manager (EPM) - Connectivity/Wireless - Technology Development Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459615/sw-engineering-program-manager-epm-connectivity-wireless-technology-development-group?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS CE/EE/CS or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "6+ years of hands-on engineering or project management experience in system or wireless softwareAbility to understand new technologies and dive into detailsExtraordinary verbal /written communication skills, ability to distill information for the right audienceSelf-motivated, collaborative, curious, pro-active with demonstrated critical thinking capabilityGreat attention to detailBS/MS CE/EE/CS or equivalent work experience.Prior experience in any of the below areas is desiredWireless ConnectivityNetworkingDistributed computeCloud PlatformsPrivacy and Security", "jobDescription": "The Technology Development Group at Apple is looking for a software engineering program manager (EPM) to drive connectivity solutions for AR experiences. We are looking for a self-motivated teammate with experience in system or wireless software who thrives in a fast paced environment. If the idea of being part of a multi-disciplinary team that is shaping the future of interactive experiences appeals to you, we want to hear from you!"}, "200460129": {"jobID": "200460129", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Bluetooth Audio Engineer (AirPods)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460129/bluetooth-audio-engineer-airpods?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MS/BS in Computer Science / relevant field with ~2+ years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Some background in wireless audio or audio processing and/or audio routing/transportExpertise in C/C++Software development experience and driven to learnMS/BS in Computer Science / relevant field with ~2+ years experience", "jobDescription": "Join our Headphone & Accessories team and drive innovation that matters! We craft and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. If you're a strong software engineer and are passionate about building awesome Bluetooth solutions, we may have the job for you.  The team is looking for a self-driven software engineer to design, debug, build data pipelines, tools, manage quality  and part of team developing the next generation of wireless audio experience and personal device connectivity."}, "200449898": {"jobID": "200449898", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Assembly Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449898/assembly-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in Semiconductor Packaging field.Working knowledge in materials characterization and analysisSolid understanding of large FCBGA package, MCM package, 2.5D packaging and 3D packaging technology.General understanding of packaging technologies, assembly processes, IC packaging materials, reliability standards, FA techniques, etc.Good communication skills that can enable you to work well with internal multi-functional teams and overseas suppliers.Ability to work independently and solve projects with minimum supervision.Good engineering problem solving skills with strong engineering physics and fundamentals.Can use package design softwares, APD, Virtuoso, etc.Working knowledge in memory packaging.Good program management skill-  BS and +10 years of relevant industry experience", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? We are looking for a hardworking and passionate IC Packaging Engineer to join our team!\n\nIn this highly visible role, you will develop advanced packaging technologies, define assembly baseline processes, decide package BOM, establish package design rules that are optimized for performance, reliability, yield and cost for a variety of projects including SoC!"}, "200450177": {"jobID": "200450177", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Assembly Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450177/assembly-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and 3+years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience in Semiconductor Packaging field.Working knowledge in materials characterization and analysisSolid understanding of large FCBGA package, MCM package, 2.5D packaging and 3D packaging technology.General understanding of packaging technologies, assembly processes, IC packaging materials, reliability standards, FA techniques, etc.Good communication skills that can enable you to work well with internal multi-functional teams and overseas suppliers.Ability to work independently and solve projects with minimum supervision.Good engineering problem solving skills with strong engineering physics and fundamentals.Can use package design softwares, APD, Virtuoso, etc.Working knowledge in memory packaging.Good program management skillBS and 3+years of relevant industry experience-  BS and 3+years of relevant industry experience", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? We are looking for a hardworking and passionate IC Packaging Engineer to join our team!\n\nIn this highly visible role, you will develop advanced packaging technologies, define assembly baseline processes, decide package BOM, establish package design rules that are optimized for performance, reliability, yield and cost for a variety of projects including SoC!"}, "200429828": {"jobID": "200429828", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Software Engineering Manager - Audio and Media Technologies AVConference Foundation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200429828/software-engineering-manager-audio-and-media-technologies-avconference-foundation?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science / Computer Engineering or equivalent required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "3-5 years experience as an engineering manager leading a software team.Experience with development in an embedded real-time environment with experience in C, C++, or Objective-CExperience with basic networking protocols, Audio/Video compression, and low latency streaming media is highly desirable.Experience with software development in consumer voice and video conferencing platforms is a strong plus: WebRTC, VoIP, RTP, UDP, Audio Codecs, IR.92/94, etc.Ability to lead multiple projects under driven time constraints to achieve meaningful results for our customers and multi-functional teams.Ability to positively mentor and develop your team, lead with software and engineering excellence, and maintain a total dedication towards accomplishing our goals.BS/MS in Computer Science / Computer Engineering or equivalent required", "jobDescription": "The Audio and Media Technologies (AMT) team provides the media and graphics foundation across all of Apple’s innovative products, including iPhone, iPad, Apple TV, iPod, and Mac OS. We are seeking an expert software engineering manager to join our team. You will be owning an existing team responsible for the audio conferencing aspects of FaceTime, Group FaceTime, HomeKit IP Cameras, WiFi Calling, Phone Continuity and much more!"}, "200439243": {"jobID": "200439243", "origin_search": null, "posted": "Oct 25, 2022", "jobTitle": "Unity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439243/unity-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSCs or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience with C/C++ API development.Proficiency in or capacity for a wide range of game engines and programming environments.Passion for games and the developers who create them.BSCs or equivalentDesired experience:Unity Engine plugin developmentC# and Microsoft Common Language Runtime (or Mono)PRIOR EXPERIENCES THAT ARE A PLUS FOR THIS ROLE:Swift, Objective-C, or other Apple platform toolkitsUnreal Engine, especially plugin developmentClient/server networking applications", "jobDescription": "Apple Arcade and Game Center are at the core of Apple’s growing games business. We aim to both provide an excellent experience for our existing game developers and to attract a broader range of game developers to Apple platforms.\n\nAs a senior game developer experience engineer on the Game Center Frameworks team, you will help shape the next generation of games across the Apple ecosystem. Your work will grow the Apple Arcade portfolio and enable developers to offer great gaming experiences.\n\nOur team strives to build a diverse, inclusive team and healthy, balanced work environment. We believe that every engineer brings unique skills and perspective. Come work with us and translate your talent into great experiences for a global audience of customers and other developers!"}, "200448526": {"jobID": "200448526", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "SoC Correlation Product Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448526/soc-correlation-product-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with system level characterization using functional / virus like worst case use cases & correlating to ATE.Understanding of PDN impact on Vmin, ATE test content, system level test programs/ functional content and test hardware.Experience working with and driving cross functional teams.Statistical data analysis tools to perform high volume characterization & production data analysis.Experience in scripting (Python, JMP, PERL etc.) is a plus.BS and a minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). \n\nJoining this group means you’ll be responsible for crafting and building the technology that operates Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product! \n\nWe are seeking a multifaceted engineer to develop system level test programs for debug, characterization, qualification, and production of SoC devices."}, "200448519": {"jobID": "200448519", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "SoC Correlation Product Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448519/soc-correlation-product-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Experience with system level characterization using functional / virus like worst case use cases & correlating to ATE.Understanding of PDN impact on Vmin, ATE test content, system level test programs/ functional content and test hardware.Experience working with and driving cross functional teams.Statistical data analysis tools to perform high volume characterization & production data analysis.Experience in scripting (Python, JMP, PERL etc.) is a plus.BS and a minimum of 3+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). \n\nJoining this group means you’ll be responsible for crafting and building the technology that operates Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product! \n\nWe are seeking a multifaceted engineer to develop system level test programs for debug, characterization, qualification, and production of SoC devices."}, "200463639": {"jobID": "200463639", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Software QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463639/software-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Computer Engineering, Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$190,000,"}, "benefits": null, "requirements": "2+ years of quality engineering experienceFamiliarity with OS concepts and low level system software and driversStrong knowledge of Unix and Unix shell scriptingDemonstrated ability to own a complete functional area of an application or productGood understanding of software QA methodologies & practicesAbility to communicate technical concepts to a non-technical audienceAbility to solve difficult problems with innovative and maintainable solutionsMeticulous, analytical, methodical and creative problem solver committed to driving quality forwardBachelor’s degree in Computer Engineering, Computer Science or equivalent experienceAbility to triage and solve problems involving user/kernel boundary, multi-threading and synchronizationIn-depth understanding of iOS and MacOSFamiliarity with AR/VR technologies", "jobDescription": "The Technology Development Group (TDG) is working with some of Apple's most advanced and exciting technologies, including augmented reality (AR) and virtual reality (VR) explorations. As a member of our fast-paced organization, you will have the opportunity to be part of a rapidly evolving team, driving experiences that will delight and inspire millions of people. We’re looking for a creative and motivated test engineer with excellent problem solving and communication skills. As a valued member of our dynamic organization, you will have the rare and rewarding opportunity to craft new products and experiences that will delight and inspire millions of people every single day!"}, "200454902": {"jobID": "200454902", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Health Sensor Electrical Engineer - Health Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200454902/health-sensor-electrical-engineer-health-technologies?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Master’s or Ph.D. in Electrical Engineering, Biomedical Engineering, or related discipline"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Experience creating health devices or measurement of biological signalsProficiency in Python, Matlab, or similar simulation and modeling toolsExperience with sensorsExperience with user study design and data analysis is preferredStrong analytical and problem-solving skillsAbility to focus down to the detailsSolid teamwork skillsAbility to communicate clearlyMaster’s or Ph.D. in Electrical Engineering, Biomedical Engineering, or related discipline", "jobDescription": "Design and develop next-generation Health Technologies for Apple products.\nThe Health Technologies team initiates exciting new technologies for Apple’s future products and proves feasibility.  We are seeking a highly motivated engineer to join a cross-functional team to help develop sensors, systems, and applications for the areas of health, wellness, and fitness.  The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation."}, "200453093": {"jobID": "200453093", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Build Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453093/build-systems-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with cloud orchestration technologies, such as KubernetesDevelopment experience with Swift, Objective-C, and scripting languagesFamiliarity with application and service monitoring tools and techniquesExperience with debugging and triaging of issues in unfamiliar code basesExperience developing for Apple platformsA data-driven approach to problem solvingBS in Computer Science or equivalent experience-  Excellent collaborative skills, with strong written and verbal communication-  A dedicated, motivated attitude, with the ability to deal with ambiguity or uncertainty-  A positive and respectful attitude-  Apple may require you to travel to other office locations from time-to-time", "jobDescription": "Our team is on a mission to provide innovative infrastructure and tools to make engineers more productive and make software easier to create, build, and distribute. We believe that streamlining software engineering is an important part of unlocking developer creativity and innovation, and we enjoy when Apple customers see that in the products we ship.\n\nWe are looking for distributed build systems engineers to join our efforts. You'll be developing novel distributed architectures and products for accelerating software build and test cycles. We are applying unique and innovative ideas to old problems and welcome new contributors who are excited by the opportunity to significantly impact the shape and direction of our product. If you enjoy working on build systems and distributed systems, then we have many exciting problems to work on!\n\nIn this position, you will be encouraged to work across the stack, operating multi-functionally with our partner teams, including those focused on cloud infrastructure, operating system feature development, and site reliability engineering for our team’s services and beyond. Your work will directly impact Apple’s ability to produce, test, and deliver software to not only Apple’s internal teams, but to millions of customers.\n\nWe believe that every engineer brings unique skills and perspective. Far more than any specific experience or skill, we are looking for engineers who want to build great reliable software and services, learn and develop their skills, and ultimately enable others to develop amazing applications. You would join a small, tight-knit group of engineers who build exciting new technology, and have fun while doing so."}, "200427361": {"jobID": "200427361", "origin_search": null, "posted": "Oct 21, 2022", "jobTitle": "Ad Platforms: Analytics Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200427361/ad-platforms-analytics-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Background in computer science, mathematics, or similar quantitative field with a minimum of 3 years professional experienceExperience working with business users and translating their needs into technical solutions and the ability to communicate technical concepts to a business-focused audienceUNIX admin and general server administration experience requiredTableau Desktop/Server development and administrationExperience with the practical application of data warehousing concepts, methodologies, and frameworks using traditional (Vertica, Teradata, etc.) and modern (SparkSQL, Hadoop, Kafka) distributed technologiesAdvanced skills using one or more scripting languages (e.g., Python, bash, etc.)SQL expertise, data modeling, and relational database experienceHive, SparkSQL, Cassandra, Snowflake and Redshift experience a plusExperience using Spark, Kafka, Hadoop, or similar distributed data technologies a plusMost importantly, a sense of humor and an eagerness to learn", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.\n\nOur technology and services power advertising in Apple News and Search Ads in the App Store. Our platforms are highly performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy. \n\nThe Ad Platforms Data Insights team is seeking a Reporting Data Engineer supporting the development of next generation of analytical solutions. In this role you will work as a key member of a data-centric team to drive the development, execution, and continuous improvement of core data analytics infrastructure and processes. You will be a key enabler for teams of analysts, data scientists, and business users. Successful candidates will have experience building data aggregations, Tableau dashboards, and developing automation pipelines and ETLs. In addition, the ideal candidate will have hands-on experience working with multiple data storage and analysis toolsets—including modern distributed technologies such as SparkSQL, Presto, Hive, Kafka, Redshift, and Snowflake—is a plus."}, "200441072": {"jobID": "200441072", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch Sensing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441072/iphone-touch-sensing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Ph.D. in Electrical Engineering or equivalent experience,\nMasters degree in Electrical Engineering + 3 years of industry experience or,\nBachelors degree in Electrical Engineering + 5 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Fundamental knowledge of sensor physics, analog analysis, circuit design, linear algebra and statistics.Experience with sensor and systems integration preferred.Hands-on experience in system-level design, architecture, characterization and validation.Attention to detail with proven collaboration and leadership skills.Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams.Proficiency in MATLAB, SPICE, or similar simulation and modeling tools.Excellent written and verbal communication skills and solid teamwork.Experience with high-volume mass production is a plus.Ph.D. in Electrical Engineering or equivalent experience,\nMasters degree in Electrical Engineering + 3 years of industry experience or,\nBachelors degree in Electrical Engineering + 5 years of industry experience.", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including EE, Math, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200389054": {"jobID": "200389054", "origin_search": null, "posted": "Oct 10, 2022", "jobTitle": "Software Engineering Internship", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200389054/software-engineering-internship?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Pursuing BS/MS/PhD program in Computer Science, Electrical Engineering, Computer Engineering, Data Science, Design, or related fields."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You may meet or have interest in any one of the following qualifications:Strong object-oriented design skills, coupled with a deep knowledge of data structures and algorithmsProficiency in one or more of the following developer skills: Java, C/C++, PHP, Python, Ruby, Unix, MySQL, Clojure, Scala, Java Script, CSS, HTML5Experience in sophisticated methodologies such as Data Modeling, Validation, Processing, Hadoop, MapReduce, Mongo, PigExperience with web frameworks such as AngularJS, NodeJS, SproutCoreProven experience in application development in Objective-C for macOS or iOS a plusClient-Server protocol & API design SkillsAble to craft multi-functional requirements and translate them into practical engineering tasksA fundamental knowledge of embedded processors, with in-depth knowledge of real time operating system concepts.Excellent debugging and critical thinking skillsExcellent analytical and problem-solving skillsAbility to work in a fast paced, team-based environmentPursuing BS/MS/PhD program in Computer Science, Electrical Engineering, Computer Engineering, Data Science, Design, or related fields.", "jobDescription": "Imagine what you could do here. At Apple, extraordinary ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple’s University Recruiting team is looking for a highly motivated, engineering students with a strong background in Back-End Engineering, Core OS, and Web Development to join its team of highly skilled software engineers.\n\nOur software engineers are the brains behind some of the industry’s biggest breakthroughs! macOS, Siri, Apple Maps, and iCloud — not to mention the system-level software for iPhone and Apple TV — all started here. These teams are on the front line of our constant charge toward innovation! We are actively seeking enthusiastic interns who can work full-time for a minimum of 12-weeks."}}