{"200464590": {"jobID": "200464590", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "RFIC Layout Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464590/rfic-layout-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience in custom RF/analog layout for radio transceivers with extensive knowledge of deep sub-micron CMOS (FinFet experience is a must)Knowledgeable in layout techniques for device matching, minimizing parasitics, RF shielding, and high frequency routing.Solid understanding of RC delay, electromigration, and coupling.Understanding of guard rings, DNW, PN junctions, and advanced process effects such as LOD, WPE, etc.High level proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc. in FinFet Technology.Knowledge of CADENCE layout tools.Excellent communication skills and able to work with cross-functional teams.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Wireless SoC Radio Team designs state-of-art highly energy efficient CMOS radios, from RF to bits. To deliver these radios, our team is responsible for the design of a wide range of RF, analog, and mixed-signal blocks from RF front-end amplifiers to data converters, including baseband filters, baseband and RF phase-locked loops, crystal oscillators, and bandgap references. We are working on new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this role, you will work closely with the RFIC design team to layout and verify custom RF and analog IP for complex SoC products. You will have a critical impact on developing Apple’s state-of-the-art radios and getting them into hundreds of millions of products."}, "200460776": {"jobID": "200460776", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Software Engineering Manager, Apple Media Products - Core Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460776/software-engineering-manager-apple-media-products-core-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science, plus 10 years minimum experience in related field required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Experience leading complex engineering projects from inception to production.Can see the big picture, set a vision, and grow the team and platform in accordance to that vision.Enjoys deep technical and product discussions. Has attention to detail and can context switch across multiple projects.Can provide hands-on technical leadership, including mentoring, guiding, and motivating the engineers.Experience leading and growing a team, including hiring and performance management.Excellent communication skills. Can effectively communicate complex ideas and make compelling arguments.Effectively collaborate with engineers, product managers, designers, collaborators, partners, etc.Hands-on experience working on scalable web services and features that span multi-functional teams.Strong analysis skills coupled with a deep understanding of data structures and algorithms.Experience with NoSQL data stores like Solr, Elastic Search, Redis, Memcached, Cassandra, Voldemort, etc.Experience with Java. Any other JVM or functional languages like Clojure is a plus.BS or MS in Computer Science, plus 10 years minimum experience in related field required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you can accomplish. \n\nWould you like the stimulation and challenges of building world-class, extraordinary scalable systems that power App Store, Music, TV+, Fitness+, Arcade and many more? Then this is the opportunity for you at Apple! We strive to provide a flawless experience for millions of customers and developers. \n\nThe Apple Media Products (AMP)Core Services team is looking for an Engineering Manager to lead an outstanding team of Software Engineers that owns, develops, and maintains the online content system that houses all the catalog and editorial metadata used to power our Apple services. \n\nWith the online content system being a key player in our stack, you will be central in the development of new features across all Apple Media Product services. \n\nCome be part of the incredible team that owns critical infrastructure and drives new features."}, "200462052": {"jobID": "200462052", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Software Engineer (Virtualization)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462052/software-engineer-virtualization?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or higher in Computer Science/Computer Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent C and C++ programming skillsA basic understanding of modern silicon design - FPGA/ASIC, etc.Strong understanding of modern computer/software architectureStrong understanding of operating systems internalsAbility to deliver solid work on tight schedulesExcellent collaborative skills, with strong written and verbal communicationPrevious experience with silicon virtualization (Intel or ARM) is a plusExperience with Pyhon is a plusExperience with Objective-C or Swift is a plusBS or higher in Computer Science/Computer Engineering", "jobDescription": "Do you see the big picture and love setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group we ensure that the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. \n\nBe a part of making the next generation of Apple virtualization products. We work across the entire system, from the kernel up through libraries, frameworks, and applications. As an engineer you will have a major impact on the design and implementation of Apple virtual machines and virtualization frameworks as well as virtualizing operating system products, collaborating closely with experts throughout Apple’s software and hardware organizations."}, "200442627": {"jobID": "200442627", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AIML - Sr Program Manager, Technical Learning", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442627/aiml-sr-program-manager-technical-learning?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree in Learning & Development, Software Engineering, Business, or related fields \nProfessional proficiency in English"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "Experience delivering technical learning for technical audiencesDepth of experience with software engineering on Apple platforms (iOS, macOS, Objective-C, Swift, Xcode)Shown success in working with senior leaders and multiple stakeholders to influence alignment and actionPassion for adult learning and championing a culture of developmentDemonstrated success in negotiating, contracting, and communicating within an organizational frameworkProven track record to work well individually and in teams, work under tight achievements, and successfully balance multiple tasksExcellent oral, written, and interpersonal communication skills. Facilitation or teaching skills preferred5-years' proven experience crafting and implementing learning and development solutionsMinimum 3 years of demonstrated ability in consultancy or client relationship managementBachelor's Degree in Learning & Development, Software Engineering, Business, or related fields \nProfessional proficiency in English", "jobDescription": "Imagine what you can accomplish at Apple! We design products and services loved by people around the world, and we revolutionize entire industries. Behind every adventurous idea is a team of Apple employees, committed to the hard work it takes to make a dream become a reality. Developing opportunities for our employees to come together — to learn, to share, and to encourage one another — is essential to our work. It builds a sense of wonder and possibility that leads to the kind of innovation only Apple can deliver.\n\nThe AIML University team is looking for a Technical Learning Program Manager. You will be the face of technology training for AIML. You will uncover technical learning needs, influence learning strategy, and build solutions that support engineers. \n\nJoin the AIML University team and design employee opportunities as unique as you’d expect from Apple!"}, "200451217": {"jobID": "200451217", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Digital Circuits Debug Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451217/digital-circuits-debug-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "We are looking for applicants with design experience in advanced technology nodes.This is a hands-on role. You will perform independent simulation, analysis and data process to draw significant circuit insights.Experience in one or multiple of the following areas is highly desirable: SRAM circuits, custom circuit design, silicon debug.Understanding of CPU architecture is a plus.Deep understanding of deep sub-micron device physics, leakage mechanisms, technology interactions with device behavior.Ability to conduct experiments during silicon debug, gathering & analyzing data; and applying scripting to support efficient handling of ATE data.Ability to work seamlessly with multi-functional teams and bring results.Experience in scripting languages (Python /Perl or others) and CAD automation tools.Knowledge of industry standard circuit and design tools.BS and a minimum of 3 years relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned!\nYou will join an exciting silicon design group that is responsible for designing innovative ASICs. We have an extraordinary opportunity for a circuit design engineer to lead the debug of advanced custom digital megacells (SRAM memories, on-chip sensors, ML accelerators data path) and enable successful ramp of our SOCs."}, "200357423": {"jobID": "200357423", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Sr. Mechanical Engineer - Equipment Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200357423/sr-mechanical-engineer-equipment-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MS or BS in Mechanical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "MS in Mechanical Engineering or equivalent experience7+ yrs. mechanical system design experience (tool, fixture, mechatronics, electronics packaging, optics)3D CAD experience required (NX, Solid works, Pro/E)Disciplined in drafting & GD&T practicesExperience with analysis: FEA, Tolerance stackup, Error budget, RCAKnowledge of manufacturing methods (precision machining, heat treatments etc.)Excellent written & verbal communication skillsPreferred Qualifications:MS in Mechanical Engineering or equivalent experience10+ yrs. experience in equipment development, ideally in high volume production environments5+ yrs. experience in opto-mechanical design (camera\\optical mounts, kinematic mounts, compliant mechanism design)Experience in designing stand-alone equipment for consumer electronics products/modulesExperience designing mechanical outlines for PCB, FPC, connectors etc.Experience in design of high precision mechanisms & motion control systemsExperience in designing for low particle environments/cleanroomsKnowledge of machine/computer vision systemsKnowledge of optical system integration, alignment and stability testingKnowledge of robotics, automation and wafer/DUT handling systemsProgramming knowledgeOther: TravelInternational travel is required.  10%MS or BS in Mechanical Engineering-  MS in Mechanical Engineering or equivalent experience-  10+ yrs. experience in equipment development ideally in mass production environments-  5+ yrs. experience in opto-mechanical design (camera\\optical mounts, kinematic mounts, compliant mechanism design)-  Experience in crafting stand-alone functional test stations ideally for consumer electronics products/modules-  Experience designing mechanical outlines for PCB, FPC, connectors etc.-  Experience in design of high precision mechanisms & motion control systems-  Experience in designing for low particle environments/cleanrooms-  Knowledge of machine/computer vision systems-  Knowledge of optical system integration, alignment and stability testing-  Knowledge of robotics, automation and wafer/DUT handling systems-  Programming knowledge", "jobDescription": "Apple is looking for a Sr. Mechanical Engineer to join the panel-process and Optics Engineering team. The PPO team features a collaborative environment with highly creative, smart people developing technologies and solutions to characterise display and sensing modules for various Apple products and emerging technologies.  The team features opportunities for individuals to contribute across a wide spectrum of disciplines and product lines, working closely with product design, optics, electrical and software engineering to deliver world class products and cutting-edge technologies.  \n\nPosition involves leading the design, development and deployment of production systems with integrated automation for touch, sensing and display modules for mass production. The role impacts the entire gamut of Apple products and emerging technologies."}, "200462045": {"jobID": "200462045", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Software Engineer (Virtualization)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462045/software-engineer-virtualization?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or higher in Computer Science/Computer Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Excellent C and C++ programming skillsA basic understanding of modern silicon design - FPGA/ASIC, etc.Strong understanding of modern computer/software architectureStrong understanding of operating systems internalsAbility to deliver solid work on tight schedulesExcellent collaborative skills, with strong written and verbal communicationPrevious experience with silicon virtualization (Intel or ARM) is a plusExperience with Pyhon is a plusExperience with Objective-C or Swift is a plusBS or higher in Computer Science/Computer Engineering", "jobDescription": "Do you see the big picture and love setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group we ensure that the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. \n\nBe a part of making the next generation of Apple virtualization products. We work across the entire system, from the kernel up through libraries, frameworks, and applications. As an engineer you will have a major impact on the design and implementation of Apple virtual machines and virtualization frameworks as well as virtualizing operating system products, collaborating closely with experts throughout Apple’s software and hardware organizations."}, "200461100": {"jobID": "200461100", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Editor, Stocks, Apple News", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461100/editor-stocks-apple-news?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s or Master’s degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$118,500", "max": "$224,000,"}, "benefits": null, "requirements": "You have strong editorial judgement and excellent writing skills, and can make curation decisions independently.You have experience working on business, personal finance, or related news beats, and are comfortable reading about markets — and working under time-sensitive deadlines.You’ve worked in a variety of CMSs, and have a keen understanding of both analytics data and the tools that support state-of-the-art editorial.Bachelor’s or Master’s degree preferred- Use your journalistic experience, sound editorial judgment, and team standards to source and select stories for our Local News feature, with an emphasis on quality, accuracy, topic diversity, and liveliness!- Write sharp and engaging headlines with the Apple News audience in mind. Work with our copy editors to ensure your work meets all aspects of our house style.- Work closely with your counterparts in Apple News’ publisher relations and engineering departments. This could include providing editorial input on the look and feel of new products, or improving the backend tools the team uses. Track the progress of product updates with our editorial goals in mind.- Maintain relationships with editors and engineers at a variety of local publications.- Understand the critical metrics for your projects and — with News leadership — work toward them strategically. Play an active role in communicating and explaining your work to an internal audience. Share takeaways from your projects with the editorial team and to the larger News org.- Surface bugs and other performance issues.- Work with editorial team members to ensure that the best local stories and publishers get the most exposure possible.", "jobDescription": "Editors at Apple News highlight the best and most engaging content in both the News and Stocks apps. This role will help us develop new ways of covering business and finance news in both places. You will make real-time decisions based on the day’s events, curate content, write copy, and communicate directly with our publisher partners."}, "200462085": {"jobID": "200462085", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Staff Contacts Frameworks Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462085/staff-contacts-frameworks-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in CS or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "8+ years experience in deeply conversant with client-server synchronization, especially WebDAVAbility to deeply analyze multi-client synchronization problemsExcellent communication and collaborative skills in a highly collaborative environmentObject-oriented programming experienceUpbeat, adaptable, and results oriented with a positive attitudeBachelors in CS or equivalent work experience.Experience in developing an iOS or macOS application from end to endAPI design and framework developmentInterest in performance and algorithmsNavigate large code bases and fast-paced environments with aplomb", "jobDescription": "Looking to make a difference and have your code drive forward communication technology? Come join our collaborative, driven team! Contacts are at the center of how people communicate on all Apple platforms. Your impact will extend beyond Contacts, as you contribute to driving the iOS and macOS platforms forward!"}, "200443117": {"jobID": "200443117", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Cellular Protocol Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443117/cellular-protocol-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum of 2 years experience with embedded/telecom/wireless areas.Strong Software Engineering skills including design, programming (C, C++, script) and debugging.Experience in 3G, 4G or 5G NR technology is a strong plus.Highly motivated and self-directed.Excellent debugging skills.Solid understanding of 3GPP/ETSI standards.Thrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200395294": {"jobID": "200395294", "origin_search": null, "posted": "Jun 24, 2022", "jobTitle": "Depth Sensor Characterization Engineer - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200395294/depth-sensor-characterization-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MSc/PhD in electrical engineering, EECS, physics, or a similar field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "You will have 2+ years of relevant experience in characterization and validation of avalanche photodiode (APD or SPAD) image sensors, other image sensors, or any silicon / non-silicon photo detectors.Experience in electro-optical mass-production screening test or characterization of imaging solutions and/or sensor functional validation (analog and logic-oriented).Proficiency in modeling and data analysis tools (e.g. MATLAB, etc.)Programming skills to develop software/firmware/scripts for validation, characterization, and prototyping.Excellent analytical and problem-solving skills.MSc/PhD in electrical engineering, EECS, physics, or a similar field.", "jobDescription": "Why Apple? \n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Camera Hardware Engineering group is responsible for the design, development, and innovation of camera hardware for all related Apple products. Our target is to deliver superior camera hardware to enable best-in-class camera user experience. As a key member of the Core Sensing Devices team, you will be responsible for the modeling, design, optimization, and validation of pixels, in-pixel circuits, and development of new sensors. In your new role, you will be at the center of efforts to develop new depth sensing technology, and you will engage with multi-functional teams working on many aspects of system, module, circuit, and device development."}, "200466721": {"jobID": "200466721", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Battery Electrochemistry Modeling - Engineering Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466721/battery-electrochemistry-modeling-engineering-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "B.S.+ 10 years of relevant experience. Ph.D. preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "BS +10 years of relevant industry experience in physics-based modeling of thermo-electrochemical and mechanical performance/safety characterization of lithium cells.Strong understanding of battery materials, chemistry, and manufacturing processes.Experience in cell aging mechanism identification, characterization, and modeling.Strong background using standard experimental techniques or developing new testing techniques to enable high accuracy of modeling.Ability to drive effectively with other specialists and teams to build and validate high-fidelity, high-accuracy models with test data and cell design/manufacture documentation.Knowledge of various, the latest testing techniques and standard processes.Expertise in numerical methods of optimization, statistical analysis and data evaluation, visualization.Demonstrated ability to develop and implement advanced electrochemical models for Li-ion batteries.Proficiency in programming and simulation tools such as MATLAB, Simulink, and COMSOL.Experience in numerical methods of PDEs and ODEs.Proven ability to mentor the team as well as drive technical development roadmap.Ability to own and drive large-scale development projects as an individual contributor.Previous experience in leading a small engineering team is a plus.Strong leadership and project management skills.B.S.+ 10 years of relevant experience. Ph.D. preferred.", "jobDescription": "Are you looking to push the limits of what’s considered feasible? As part of our Battery Engineering group, you’ll be a team member to craft creative battery solutions that deliver more energy in smaller spaces than ever before! We are looking for a highly skilled and experienced Li-ion Battery Electrochemical Modeling Engineering Lead to join our team! You will be responsible for leading the development and implementation of advanced Li-ion battery electrochemical models and simulation tools to improve battery performance, reliability, and safety. You will also be responsible for mentoring a team of electrochemical engineers. \n\nThe role is focused on the research and development of cell performance and aging mechanisms and modeling to capture relevant physics underlying these behaviors in the early design architecture phase in order to guide the design decisions and trade-offs. The work will involve multi-disciplinary expertise, primarily electrochemistry (special focus on Li-ion batteries in consumer electronics), mechanical and thermal engineering as well as software development. This role entails deep expertise in the field of battery electrochemistry modeling, and testing as well as numerical methods of data analysis, modeling, and optimization."}, "200120865": {"jobID": "200120865", "origin_search": null, "posted": "Oct 28, 2022", "jobTitle": "AR/VR Accessibility Frameworks Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200120865/ar-vr-accessibility-frameworks-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree OR equivalent experience and at least 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience writing AR/VR or iOS applicationsAptitude for independently learning new technologiesExcellent cross-functional and communication skillsExcitement to build software that makes a tangible difference in peoplesʼ lives!BS / MS in Computer Science OR equivalent degree OR equivalent experience and at least 3 years of experience• Knowledge of either UIKit or AppKit APIs.• Experience with at least one of the following languages and related development tools: ObjectiveC, Swift, C++, or C• Experience with assistive technologies is nice to have, but not required.• Experience using accessibility APIs on any platform is helpful, but not required.", "jobDescription": "The Technology Development Group is looking for an Accessibility Engineer to help us explore, define, and build accessibility solutions for the next generation of interactive computing for our platform. As a member of this team, you will have a unique opportunity to work with some of Apple's most advanced technologies (AR, VR, ML, CV) to help create empowering solutions for all users, regardless of their physical abilities."}, "200446440": {"jobID": "200446440", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Software Engineer – Wireless Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446440/software-engineer-wireless-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 3+ years of relevant industry experience required\n\nMS or Ph.D. in CS/EE is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands-on SW experience using modern C++ (C++14 or later) and PythonUnderstanding of test-driven and API-driven development methodologiesDeep understanding of algorithm and data structure designHands-on experience in software performance and optimizationExperience with large-scale code-base and repo managementExperience working with OS kernel to support parallel computing and emulationExcellent verbal and written communication skillsKnowledge of network protocols and/or wireless technologies is a plusBS and 3+ years of relevant industry experience requiredBS and 3+ years of relevant industry experience required\n\nMS or Ph.D. in CS/EE is preferred", "jobDescription": "Would you like to be a key member of the Wireless Architecture team to build a state-of-art, high fidelity and high-performance wireless system simulation platform? Your ideas, passion, and dedication are going to craft Apple’s current and future wireless technologies including 5G, WiFi, Bluetooth, and emerging technologies in an unprecedented way. This is a unique opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day!\n\nThe simulation platform calls for sophisticated and rigorous architecture to cover in-depth details of wireless networking technologies in rich use cases under diverse radio environments. In-depth knowledge of modern C++, performance and release engineering, together with mature judgment is key to success. As a critical thinker, you appreciate the deep nature of science and engineering in wireless communications systems. You are a clear communicator, capable of translating sophisticated yet fuzzy ideas into coherent and structured software. You love learning from wireless system experts in Apple’s multi-functional teams. You love creating opportunities to bring synergy in. You lead by helping others in a tangible way."}, "200462854": {"jobID": "200462854", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Developer Tools Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462854/developer-tools-engineering-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Engineering, Electrical Engineering, Computer Science, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$343,500,"}, "benefits": null, "requirements": "Positive and respectful attitude in a diverse environment.Strong interest in tools and systems that support developing, building, testing, and releasing software.Excellent programing, technical architecture, and system design skills.Experience growing, mentoring, and managing a team of high-performing engineers from diverse backgrounds.Preferable: Experience owning the full lifecycle of an internally- or externally-facing product, including design and analysis, feature prioritization, collecting early feedback, launch, and customer onboarding.BS in Computer Engineering, Electrical Engineering, Computer Science, or equivalent experience.", "jobDescription": "Our team is on a mission to provide innovative infrastructure and tools that impact engineers’ work by making software easier to create, build, test, and distribute. We believe that streamlining software engineering is an important part of unlocking developer creativity and innovation, and we enjoy when Apple customers see that in the products we ship.\n\nWe are looking for an exceptional engineering manager interested in improving the quality and velocity of developing software across Apple, using their technical knowledge and real-world experience leading teams focused on cloud-native development environments or scalable backend services for building, testing, indexing, integrating, or deploying code.\n\nWe believe that every member of a team brings unique skills and perspective. Far more than any specific experience or skill, we are looking for technically hands-on engineering managers who want to design, build, and ship reliable software and services that solve real-world problems, develop their own skills while mentoring their team, and ultimately enable others to develop amazing applications. You would join a small, tight-knit group of engineers who build exciting new technology, and have fun while doing so."}, "200461629": {"jobID": "200461629", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Product Definition - Wireless Connectivity Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461629/product-definition-wireless-connectivity-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Master’s degree in electrical engineering or a related field. PhD/Doctorate preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Industry experience in wireless system architecture and engineering.Excellent knowledge of wireless connectivity technologies and standards, including WiFi, IEEE 802.11 family (ax, be, ay), Bluetooth, 802.15.4, etc.Knowledge of key RF metrics and what drives them.Familiar with wireless system performance benchmarking including TRP, TIS, efficiency, latency, power.Knowledge of line-up analysis, calibration and compensation methods, and product integration challenges.Need to have at least one option for scientific scripting, such as MATLAB or PythonHand-on experience using RF test equipment such as spectrum analyzers, vector signal generators, channel emulators, etc.Strong analytical and problem-solving skillsStrong collaborative mind-set and excellent interpersonal communication skillsMaster’s degree in electrical engineering or a related field. PhD/Doctorate preferred", "jobDescription": "Join our wireless organization and drive innovation that matters! We’re looking for engineers with solid fundamentals in wireless technologies and RF systems to help us bring the next generation of wireless technologies into Apple’s products. \n\nAs part of the Product RF Definition team, you’ll be responsible for the intersection of RF technologies and product integration. With your unique knowledge, creativity, and passion, you could join us and help bring new wireless products to millions of Apple customers."}, "200394319": {"jobID": "200394319", "origin_search": null, "posted": "Jun 21, 2022", "jobTitle": "Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200394319/firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE/EE or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid C or C++ coding ability for Embedded SystemsExperience working with microcontrollers with analog and digital sensorsUnderstanding of wireless protocols, ideally BluetoothExperience in BT profiles and Application requirement analysis and component level design preferred, not requiredExperience implementing firmware in bare-metal or RTOS environmentsProven capability in applying coding best-practices to firmware designsWorking knowledge of one or more communication protocols (e.g., UART, I2C, SPI, USB)Proven board bring-up and debug skillsStrong communication and collaboration skillsBS or MS in CS/CE/EE or equivalent industry experienceExperience with one or more microcontrollers cores ( ARM, AVR, MSP430, PIC, 8051 ) Debugging skills with JTAG, SWD, Oscilloscopes, and Logic analyzers Some assembly experience is helpful Development experience on Unix, Linux, or macOS is preferred macOS and/or iOS programming experience is helpful Familiarity with input technologies is helpful. Experience with debugging / Analysis Tools like BT Air sniffers.", "jobDescription": "Come join a team of creative, upbeat, and hard-working firmware engineers responsible for next-generation Human Interface Devices for iPhone, iPad, Mac, and more. We are looking for dedicated individuals who enjoy creating firmware for microcontrollers, prototyping concepts, investigating new technologies, and ultimately delivering high-quality products. This is a great opportunity to be at the focal point of many multi-functional interactions with the Hardware, Software, Quality Engineering, and Product Design teams."}, "200451478": {"jobID": "200451478", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Chip Level Library & Design Optimization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451478/chip-level-library-design-optimization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "A minimum of 10 years of experience in advanced FinFet technology development (e.g. device, integration, process, flows, EDA), circuit design, Semiconductor R&DProven understanding of advanced CMOS device behavior, with practical understanding of device physics and analysis, and their impact to SoC design PPA metricsThorough knowledge and understanding of yield (for a product or a technology learning vehicle), including defect pareto development and Failure Analysis methodology, Benchmarking practiceStrong data analysis (and statistical analysis) skills; proficiency with a broad set of data analysis tools for both device and yield analysisSolid understanding to perform basic circuit analysis, extraction, and SPICE simulation for PPA benchmarking applicationsGreat interpersonal skills to champion initiatives internally and externally, for effective communication with executive management and external partnersTechnical, analytical, and multi-functional collaboration skillsBS and a minimum of 10 years of relevant industry experience", "jobDescription": "Do you love building without precedent? As part of our Digital Design IP group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking! Join us in an exciting silicon design group that's responsible for crafting innovative ASICs. You’ll play an integral role in designing the tools that allow us to bring customers experiences they’ve never before envisioned. We have an extraordinary opportunity in advanced process technology, foundation IP (logic, memory) design, for implementation pathfinding and optimization engineer. In this highly visible role, you will be at the heart of a new advanced technology definition for the future iPhone, Mac, watch processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200451481": {"jobID": "200451481", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Chip Level Library & Design Optimization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451481/chip-level-library-design-optimization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "A minimum of 10 years of experience in advanced FinFet technology development (e.g. device, integration, process, flows, EDA), circuit design, Semiconductor R&DProven understanding of advanced CMOS device behavior, with practical understanding of device physics and analysis, and their impact to SoC design PPA metricsThorough knowledge and understanding of yield (for a product or a technology learning vehicle), including defect pareto development and Failure Analysis methodology, Benchmarking practiceStrong data analysis (and statistical analysis) skills; proficiency with a broad set of data analysis tools for both device and yield analysisSolid understanding to perform basic circuit analysis, extraction, and SPICE simulation for PPA benchmarking applicationsGreat interpersonal skills to champion initiatives internally and externally, for effective communication with executive management and external partnersTechnical, analytical, and multi-functional collaboration skillsBS and a minimum of 10 years of relevant industry experience", "jobDescription": "Do you love building without precedent? As part of our Digital Design IP group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking! Join us in an exciting silicon design group that's responsible for crafting innovative ASICs. You’ll play an integral role in designing the tools that allow us to bring customers experiences they’ve never before envisioned. We have an extraordinary opportunity in advanced process technology, foundation IP (logic, memory) design, for implementation pathfinding and optimization engineer. In this highly visible role, you will be at the heart of a new advanced technology definition for the future iPhone, Mac, watch processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200451476": {"jobID": "200451476", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Chip Level Library & Design Optimization Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451476/chip-level-library-design-optimization-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "A minimum of 10 years of experience in advanced FinFet technology development (e.g. device, integration, process, flows, EDA), circuit design, Semiconductor R&DProven understanding of advanced CMOS device behavior, with practical understanding of device physics and analysis, and their impact to SoC design PPA metricsThorough knowledge and understanding of yield (for a product or a technology learning vehicle), including defect pareto development and Failure Analysis methodology, Benchmarking practiceStrong data analysis (and statistical analysis) skills; proficiency with a broad set of data analysis tools for both device and yield analysisSolid understanding to perform basic circuit analysis, extraction, and SPICE simulation for PPA benchmarking applicationsGreat interpersonal skills to champion initiatives internally and externally, for effective communication with executive management and external partnersTechnical, analytical, and multi-functional collaboration skillsBS and a minimum of 10 years of relevant industry experience", "jobDescription": "Do you love building without precedent? As part of our Digital Design IP group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking! Join us in an exciting silicon design group that's responsible for crafting innovative ASICs. You’ll play an integral role in designing the tools that allow us to bring customers experiences they’ve never before envisioned. We have an extraordinary opportunity in advanced process technology, foundation IP (logic, memory) design, for implementation pathfinding and optimization engineer. In this highly visible role, you will be at the heart of a new advanced technology definition for the future iPhone, Mac, watch processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200403891": {"jobID": "200403891", "origin_search": null, "posted": "Aug 9, 2022", "jobTitle": "Hardware System Engineer – iPhone System Technologies — SOC", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200403891/hardware-system-engineer-iphone-system-technologies-soc?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSEE/MSEE/PhD"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "3+ years of experiencesStrong EE fundamentals and problem solving skillsDeep understanding of mobile SoC architecture and functionalityStrong experience and knowledge in SOC functionality and performance testing and validationHands-on experience in SoC/board/system-level bring up, issue debug, and testing, lab equipments to measure power/thermal/performanceHigh level of knowledge in mobile system power delivery and PMICValidated engineering passion, initiative, innovation, and creativityScripting languages (Python, Perl, Shell, etc.)BSEE/MSEE/PhD", "jobDescription": "The iPhone HW Engineering team is seeking an enthusiastic electrical hardware engineer to work on the iPhone system technologies areas. The ideal candidate will work with multi-functional teams to perform in-depth analysis, testing, and validation of iPhone SoC power and performance, and improvement of systems design."}, "200348308": {"jobID": "200348308", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200348308/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE w/ 2+ years experience or Ph.D in EE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 2 years of relevant industry experienceStrong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsMSEE w/ 2+ years experience or Ph.D in EE", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200464090": {"jobID": "200464090", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Senior Software Engineer - Apple Cloud Security", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464090/senior-software-engineer-apple-cloud-security?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors degree(B.S) or Masters (M.S) in Computer Science, Engineering or related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of work experience in infrastructure or security engineering.Experience using development and integration processes (Ci/CD).Proficiency in the following languages: Golang, Java.Experience working with and understanding design of distributed systems with high performance and availability.Experience with gRPC.Experience operating Linux and macOS, and scripting languages like Bash.Understanding principles of building and deploying software, process, and monitoring (software lifecycle).Ability to work in a collaborative team environment, listen, provide empathy, and raise the best in your peers.Bachelors degree(B.S) or Masters (M.S) in Computer Science, Engineering or related field.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple's committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "jobDescription": "People at Apple don’t just build products they craft the kind of experience that have revolutionized entire industries. The diverse collection of our people and their ideas encourage innovation in everything we do. Imagine what you could do here! Join Apple, and help us leave the world better than we found it.\n\nThe Apple Cloud Security team builds and provides secure systems and infrastructure that fuel Apple’s services (such as iCloud, iTunes, Siri, and Maps). As part of the Apple Cloud Security team, you will help lead the security needs of Apple’s services around the world. You will build and integrate the security controls, guardrails, and frameworks that help protect our customers data in Apple’s infrastructure.\n\nYour effort will help build solutions to a variety of outstanding security challenges. Join us, and you’ll play a meaningful role in ensuring the highest standard of security for one of the most-watched companies in the world."}, "200451041": {"jobID": "200451041", "origin_search": null, "posted": "Jan 7, 2023", "jobTitle": "Senior Software Integration and Tooling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451041/senior-software-integration-and-tooling-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS, MS or higher in Computer Science, Computer Engineering or Electrical Engineering and relevant majors."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years of software development and integration experienceFamiliarity with parallel build pipelines, automated build, continuous integration (CI), and test automation systems. Experience with Jenkins, Gerrit and similar tools is a strong plus.Proficient in at least one scripting language (Bash/python/Groovy, perl) and one object-oriented programming languages (Java, C++, Swift, etc)Highly competent with Git version-control system, and agile workflows. Deep understanding of software configuration management (SCM). Experience with Xcode and/or GNU Make is a plus.Excellent written and verbal communication skills are needed to collaborate closely with cross functional development teamsKnowledge/Experience in Cellular Protocol Stack is a plusHands-on experience with RF lab equipment (CMW 500, Agilent 8960, Anritsu 8820C, spectrum analyzer, oscilloscope, etc.) is a strong plusBS, MS or higher in Computer Science, Computer Engineering or Electrical Engineering and relevant majors.", "jobDescription": "Join our Wireless Technologies and Eco-Systems Engineering (WTE) team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. We're a passionate and critical team that helps drive design, develop and integrate cellular chipsets in Apple products. You will join a hands-on development team that nurtures creativity and generates novel solutions to deliver engineering perfection."}, "200436475": {"jobID": "200436475", "origin_search": null, "posted": "Oct 17, 2022", "jobTitle": "Senior Deep Learning Compiler Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436475/senior-deep-learning-compiler-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Masters's degree or higher in Computer Science or equivalent field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Passion for developing and optimizing compilers for modern architecturesWorking knowledge of compiler architecture, front-end and middle-end optimizations, scheduling, register allocation, back-end code generationExperience with neural networks inference on dedicated SOC or GPUHigh level C++ programming expertiseExcellent problem solving and debugging skillsProven track record of building high quality production softwareExcellent communication and collaboration skillsMasters's degree or higher in Computer Science or equivalent field.", "jobDescription": "We live in a mobile and device driven world, where Deep Learning technology enables a new class of applications.\n\nAre you passionate about enabling unique user experience such as Face ID, Animoji, AR games? Imagine the countless possibilities powered by Artificial Intelligence.\n\nIn the Video Engineering team, we are dedicated in providing hardware acceleration using the new proprietary Apple Neural Engine SOC to enable real time, low power and high performance execution of Deep Learning workloads.\n\nOur success is the result of very talented people working in an environment which cultivates creativity, partnership and cross functional collaboration.\n\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives.\n\nWill you help us design the next generation of revolutionary Apple Products?"}, "200467423": {"jobID": "200467423", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Silicon Validation Debug Tools Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467423/silicon-validation-debug-tools-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 10 years relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Exposures to post-Silicon validation, silicon bringup, testing/debug/root cause of circuit marginalities, product engineering, foundry manufacturing, etc.Understanding test execution through both functional mode and DFX hooksYou are comfortable working primarily in a lab environmentYou have strong scripting skills in one of the major languages: eg. Perl, python, Tcl, bashYou have silicon validation testing and debug experienceYou have a good working knowledge of hardware debug technologies (eg JTAG, on-chip debug structures)Silicon Validation Testing and Debug experienceExperience/Expertise in Programming (C, C++) and Scripting in a Linux environment in the development of hardware debug tools and flowsExperience interfacing software with hardware debug technologies (e.g. JTAG, on-chip debug structures)You know hardware architectures - SOCs, CPU, GPU.You have effective communication skillsEmbedded software development experience and exposure to Pre-Silicon and Emulation verification/validation is a plusBachelor's degree and a minimum of 10 years relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.\n\n As part of the Silicon Validation team you will focus on development/co-development of Silicon Debug Tools for Apple’s Mobile SOCs. The expectation is that interface with teams including software, architecture, design, verification, emulation, silicon validation to develop software solutions to improve debug flow and process. In addition, you will be involved with Silicon bring-up, testing and debug."}, "200447649": {"jobID": "200447649", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Platform Privacy Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447649/platform-privacy-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS Computer Science or equivalent professional experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$269,000,"}, "benefits": null, "requirements": "Passion for user privacy3+ years practical experience in managing software engineering and client development teamsAbility to solve complex problems independentlyStrong collaboration, communication, interpersonal, and organizational skillsProficiency in Objective-C, Swift, or another C-based languageExperience with developing software for Apple’s platformsFamiliarity with lower-level iOS and macOS frameworks, like XPCStrong background in data structures and system architectureBA/BS Computer Science or equivalent professional experience", "jobDescription": "At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish.\n\nApple delivers great features and great privacy to our users. The Platform Privacy team designs and ships innovative features within our products to continue to strengthen privacy and deliver a great user experience. This work involves working across the organization, and across the stack, from operating system internals to user interface. Your efforts will impact software platforms touching millions of our customers and developers worldwide. Imagine what you could do here!"}, "200372190": {"jobID": "200372190", "origin_search": null, "posted": "Apr 26, 2022", "jobTitle": "iPhone Hardware System Engineer - System Technologies - SoC", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200372190/iphone-hardware-system-engineer-system-technologies-soc?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MSEE/PhD"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong EE fundamentals and problem solving abilityProven fundamentals in electromagnetic field theory and modelingDeep understanding of mobile SoC architecture and functionalityStrong knowledge and experience in mobile systems as in iPhone, iPad, etcExperience and/or knowledge in mobile system power delivery and PMICProven engineering passion, initiative, innovation, and creativityHands-on experience in hardware SoC/board/system-level testing and validation, lab equipments, hardware debugging and system bring upScripting languages (Python, Perl, Shell, etc.)BS/MSEE/PhDBe willing to travel to work in factory build environments.", "jobDescription": "The iPhone HW Engineering team is seeking an enthusiastic electrical engineer for the position of Hardware Engineer - System Technologies. The ideal candidate will work with iPhone HW system cross-functional teams to perform in-depth analysis, testing, and validation of iPhone SoC performance and improvement of systems design."}, "200451084": {"jobID": "200451084", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Silicon Validation Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451084/silicon-validation-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 20+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "BS and 20+ years of relevant industry experience.The ideal candidate has managed pre/post silicon validation teams in semiconductor companies.Experience with bench equipment such as power supply, oscilloscope, signal generator, electronic load, spectrum analyzer, etc.Experience using GPIB, USB, I2C, SPI, MIPI, SPMI, UART interfaces, etc.Experience using Python for test automation.Ability to write and debug FW code is strongly preferred.Working knowledge with finite state machine (FSM), digital design, and verification is a plus.Strong analytical/problem solving skills and ability to guide critical decisions.Management experience is required.BS and 20+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nWe have an opportunity for a talented silicon validation manager to join our wireless SoC team, with experience in system validation, who understands that the tight interaction between pre-silicon design and post-silicon validation is the key to shipping quality products. In this role, you will work closely with both IC design teams, FPGA emulation teams as well as firmware and system teams within Apple as we drive execution from first silicon through to mass-production release. ou will work closely with both IC design teams, FPGA emulation teams as well as firmware and system teams within Apple as we drive execution from first silicon through to mass-production release."}, "200351066": {"jobID": "200351066", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Computer Vision Algorithm Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200351066/computer-vision-algorithm-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in Electrical Engineering, Computer Engineering, Computer Science, Optics or related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The ideal candidate will have 5+ years of algorithm development experience,Deep knowledge of image processing and computer visionRich experience in algorithm developmentExperience in camera based metrology is a plusFamiliarity with Matlab image processing toolbox or OpenCVProgramming skills in Matlab/C/C++/PythonExperience in data analysis and visualization with Matlab/Python/JMPSelf-motivated, responsible, excellent written and verbal interpersonal skillsMS/PhD in Electrical Engineering, Computer Engineering, Computer Science, Optics or related field.", "jobDescription": "The display technology team features a collaborative environment with creative, inquisitive talents, world-class products and innovative technologies. The team provides opportunities for individuals to contribute across a wide spectrum of fields. Outstanding engineering excellence and thoroughness are expected and encouraged. Innovation, IP and patent creation are highly supported and valued. Working without constraints to design and ship innovative products with best-in-class technologies and user experiences are the main goals."}, "200419747": {"jobID": "200419747", "origin_search": null, "posted": "Oct 5, 2022", "jobTitle": "Modem System Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200419747/modem-system-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in Electrical Engineering or Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of validation experience in wireless and telecoms industryDeep knowledge Cellular Radio technologies, protocols and procedures (5G NR, LTE, etc)3+ years of hands-on experience with testing cellular technologies (5G, LTE, IMS etc)Exposure to commercial test simulators and test systems such as: Anritsu, RS, Keysight call boxes for lab validationValidated ability to lead a complete functional area of an application or productAble to work independently and should be dedicatedValidated understanding of SQA methodologies & practicesExcellent communication & interpersonal skillsComfortable with solving problems/debugging/reproducing issuesScripting skills in any of the following: Perl, Python, Shell, JavaScript, RubyThrive in a collaborative environment and can clearly communicate while expertly driving multiple projects across many teamsObsessively hardworking and inquisitive, and seek to tackle everyday problems in innovative waysLaser-focused on the smallest details that are important to our customersBachelors in Electrical Engineering or Computer Science or equivalent", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) team and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200440234": {"jobID": "200440234", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Color Management Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440234/color-management-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD degree in Computer Science OR Electrical Engineering OR Equivalent Degree OR Equivalent Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Software development expertise in C, C++ or an equivalent languageScripting expertise in Matlab, Python or an equivalent languageComfort with describing problems using mathematicsInterest in media, color and display technologiesInterest in building algorithms & prototypes, and constructing visually compelling demosInterest in building tools & methodologies to characterize media and display color qualityBS/MS/PhD degree in Computer Science OR Electrical Engineering OR Equivalent Degree OR Equivalent Experience-  Problem solving and communication skills-  Ability to stay focused and prioritize your work-  Enjoy working in a collaborative environment", "jobDescription": "The Display and Color Technologies organization in Apple's Interactive Media Group is at the core of designing and implementing solutions for rendering visual media on displays. \n\nExamples of technologies include rendering high dynamic range video and games, media composition, ambient adaptation, and pro color features such as display presets. \n\nOur organization is also responsible for optimizing the subjective and objective color quality of media renditions, and working with key partners to adopt new media and display features.\n\nWe are looking for candidates with strong engineering and mathematical intuition who are excited to tackle new problems, working with a team from product conception to shipping production quality color and display features."}, "200450688": {"jobID": "200450688", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Display Metrology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450688/display-metrology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands-on experience of probe testing using probe cards: Experience with cantilever and/or MEMS probe card in cleanroom, System integration of probe card, prober, electrical and/or optical instruments, Experience of probing system for high volume production, Knowledge of probe card ME/EE design & validation is a plusKnowledge in one or more of following areas: Display design, characterization, calibration or test, Common interfaces for optical instrument, e.g. CCD/CMOS camera, spectrophotometers, colorimeter etc., Color science and image processing, Experience with software engineering methodologies, processes, and toolsApplication or firmware development in macOS or unix environmentsStrong programming skills in Python, MATLAB, or C/C++/Objective-C/SwiftExperience developing metrology systems, or its SW/FW sub-systemsExperience with software control of HW instrumentationDirect hands-on experience working with display products (OLED, LCD, and LED) having a strong passion and interest in this areaStrong problem solving skills; positive outlook and eagerness to step into uncharted technology spaces while being able to engineer solutions to meet project timelinesAbility to own areas of responsibility,  being able to self-motivate and work independentlyExcellent interpersonal skills; clear technical communication with teammatesThe position requires some international travel (up to 15%, after pandemic is over)", "jobDescription": "Apple’s Display Metrology Engineer is a terrific position for someone passionate about technology! Be part of the Display Technology team that fosters a collaborative environment with creative talents that build best-in-class products and groundbreaking technologies. Our team provides opportunities for individuals to chip in across a wide spectrum of disciplines. Engineering excellence and thoroughness are expected and encouraged. Innovation, IP and patent creation are highly supported and valued. Our team’s main goals are to constantly open up the boundaries to design and ship innovative products with outstanding technologies and user experiences"}, "200463845": {"jobID": "200463845", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch EE Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463845/iphone-touch-ee-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "•Bachelor’s degree + 2 years of experience\n•Master’s degree in Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong electrical engineering background in board-level analog and mixed-signal design.Demonstrated experience in all phases of circuit design, development and validation.Schematic design and layout experience (SPICE or Cadence experience a plus).Circuit simulation experience (LCR extraction, signal integrity, etc.).Proficient with using lab equipment (DMM, SMU, Oscilloscope, etc.).Proficiency in MATLAB and Python scripting tools.Excellent written and verbal communication skills and solid teamwork.•Bachelor’s degree + 2 years of experience\n•Master’s degree in Electrical Engineering", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including Electrical Engineering, Manufacturing process, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200455293": {"jobID": "200455293", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Automation Flow Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455293/soc-automation-flow-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate will have experience in the development and maintenance of automation within a hardware or software development environment.-  Significant experience scripting in Unix environment with Perl, Python, or Ruby-  Solid understanding of modern software development processes and standard methodologies-  Ability to design quantitative experiments, capture data, and analyze and present results-  Experience with batch job / cloud execution environments is a plus-  Experience with SQL and database configuration and operation is a plus-  Knowledge of hardware design verification tool configuration and operation is a plus-  Knowledge of hardware design verification methodologies is a plusMinimum of BS + 10 years relevant industry experience.", "jobDescription": "Does making the next phenomenal technology product excite you? Imagine what you could do here. At Apple, our new insights have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200456692": {"jobID": "200456692", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Connectivity RF Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456692/connectivity-rf-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience leading projects from definition stage to mass productionExperience in architectural discussion with cross-functional leaders related to power supply and digital design for connectivity solutionsExpert in one or more connectivity wireless system like WiFi, Bluetooth, UWB or NFCExperience with RF components and circuits design and integration into consumer productsExperience with at least one RF simulation tool such as HFSS, ADS, Matlab or SystemVueMust be an excellent communicator, both written and oralSuccessful track record of delivering highly innovative, and high quality communications productsWell organized and have the ability to be flexible in a changing work environmentInternational travel as needed (10%)B.S. and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before.\n\nWe have built the best RF hardware design team on the planet! We’re looking for a passionate individual to join our Connectivity RF Hardware team. We support WiFi, Bluetooth, UWB, NFC, GPS, and emerging technologies. As a RF Hardware Design Engineer at Apple, you will contribute to the architecture and product level design integration of next generation wireless radio solutions in all product categories including iPhone, iPad, Home, Watch, AirPods and more."}, "200286972": {"jobID": "200286972", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Cellular Protocol Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200286972/cellular-protocol-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering, Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingHighly motivated and self-directedExcellent debugging skillsExperience with cellular protocol stacks preferred 2G, 3G, LTE and 5G NR.Thrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seeks to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering, Computer Science or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200463089": {"jobID": "200463089", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "iPad Hardware System Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463089/ipad-hardware-system-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS Electrical/Computer Engineering or equivalent required; MS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong EE fundamentals including analog and digital designExperience working with dynamic multi-functional teamsAbility to analyze solutions and make system design trade-offsExcellent written and verbal communication/presentation skills--Experience in several of the following areas:Schematic capture and rigid/flexible PCB layoutFundamentals of Signal and Power IntegrityLow voltage power regulation and deliveryProven ability to understand technology and debug problems at varying levels of abstraction, from the system-level down to the silicon/transistor levelProven understanding of design and validation requirements for common interfaces (e.g. I2C, SPI, JTAG, I2S) and preferably high-speed interfaces (e.g. USB, MIPI, PCIe, HDMI, DP, Thunderbolt, DDR Memory, Ethernet)Understanding of computer architecture and design tradeoffsExposure to numerical modeling, simulation, and analysis tools such as Spice, 2d/3d field solvers, power & signal integrityUse of scripting languages to assist with hardware development, and data analysisBeyond technical capability, we prize curiosity, creativity, integrity, leadership, collaboration, and a passion for learningBS Electrical/Computer Engineering or equivalent required; MS preferred", "jobDescription": "The iPad hardware team is looking for engineers who are motivated by the opportunity to take on big challenges. Use your skills in electrical engineering, system integration, and collaboration with multi-functional teams to make design decisions that will benefit millions of iPad users worldwide!\n\nWe are a team of system electrical engineers that own entire products from concept to ship. We sit at the center of Apple’s wider engineering team, working multi-functionally with mechanical engineering, software, silicon engineering and other module teams such as wireless, battery, camera, sensing, display, and factory test."}, "200456699": {"jobID": "200456699", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "iOS Software Engineer – Human Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456699/ios-software-engineer-human-engineering?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science or related field, or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Technical proficiency with iOS software development (ideally with Swift)Extensive expertise with Swift, iOS or macOS fundamentals and frameworksStrong analytical and problem solving skills, including looking beyond the first answer for hidden issuesAbility to break down large features and implement practical solutionsCreative/critical thinking and high attention to detailStrong communication skillsBS degree in Computer Science or related field, or equivalent work experience.Nice to have:Experience with Combine frameworkExperience with SwiftUIFull-stack web development experienceServer Administration / DevOpsExtensive experience with UNIX shellExperience with containers (Docker, Kubernetes)", "jobDescription": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Imagine what you could do here. Bring passion and dedication to your job and there’s no telling what you could accomplish.\n\nWe are a team of software engineers developing web-based tools and applications for Apple teams. Our work empowers Apple engineers and researchers to build the products that inspire and delight millions every day. Dynamic, inspiring people and innovative technologies are the norm here.\n\nWe want you to join our team if you are a resourceful engineer with the desire to research and develop solutions that do not yet exist. Ideal candidates are comfortable breaking down problems and proposing multiple solutions. They strive for excellence but can balance progress and perfection. Working with us, you will become part of a hands-on development team that furthers engineering perfection, creativity, and innovation."}, "200447030": {"jobID": "200447030", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Large-Scale Developer Tools Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447030/large-scale-developer-tools-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Engineering, Electrical Engineering, Computer Science, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Positive and respectful attitude in a diverse environment.Strong interest in tools and systems that support developing, building, testing, and releasing software.Strong programming skills (preferably Swift or similar language).Preferable: Experience building, deploying, or maintaining production web services or CI/CD pipelines.Preferable: Experience with different testing types and approaches.BS in Computer Engineering, Electrical Engineering, Computer Science, or equivalent experience.", "jobDescription": "Our team is on a mission to provide innovative infrastructure and tools that impact engineers’ work by making software easier to create, build, test, and distribute. We believe that streamlining software engineering is an important part of unlocking developer creativity and innovation, and we enjoy when Apple customers see that in the products we ship.\n\nWe are looking for an exceptional software engineer to bring their knowledge and real-world experience in areas like test execution parallelization, software testing approaches, cloud services, and build/test/integration systems to build solutions that will directly improve the quality and velocity of developing software across Apple.\n\nWe believe that every engineer brings unique skills and perspective. Far more than any specific experience or skill, we are looking for engineers who want to build great reliable software and services, learn and develop their skills, and ultimately enable others to develop amazing applications. You would join a small, tight-knit group of engineers who build exciting new technology, and have fun while doing so."}, "200437672": {"jobID": "200437672", "origin_search": null, "posted": "Oct 20, 2022", "jobTitle": "Software QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437672/software-qa-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS, Computer Science/Engineering or relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Excellent knowledge of software development lifecycle, testing methodologies, and testing tools.Proven capabilities in end-to-end software product testing, with cross-functional teams delivering entertainment software experiences that integrate software and hardware.Experience developing detailed test plans, assessing risks, filing detailed defect reports, and providing relevant data for test reporting.Able to apply creativity and analytical thinking to all kinds of problems, to aid test case creation and execution.Ability to work independently and thrive while focusing on the details, such as spotting subtle problems, raising issues, and taking corrective action.Passionate about the customer experience and delivering software products that inspire, surprise, and delight.Excellent cross-functional communication and influencing skills, involving deep collaboration with engineering and design.Experience in QA of interactive entertainment software products/games desired but not required.BS/MS, Computer Science/Engineering or relevant industry experience", "jobDescription": "At Apple, we strive to build the best products and experiences that enrich people’s lives. As a member of our dynamic organization, you will have the rare and rewarding opportunity to craft new products that will delight and inspire millions of people every single day!\n\nQuality is an important aspect of our products, and as an SW QA Engineer you will have a significant impact on helping to deliver functional and stable products to millions of customers in a dynamic environment. You will bring your excellent communication and interpersonal skills, attention to detail, and real passion for a positive user experience.\n\nAs a SW QA Engineer, you will be working as an integrated member of a cross-functional team. You will participate in the design and execution of QA strategies and methods to deliver experiences that surprise and delight our customers.\n\nWe are seeking a QA professional with a strong foundation in software engineering QA methodologies and proven experience employing them to deliver successful creative interactive entertainment software experiences."}, "200448733": {"jobID": "200448733", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "SoC Characterization Product Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448733/soc-characterization-product-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "In depth knowledge of Semiconductor Manufacturing Process and proven understanding of Electronic Engineering Fundamentals and DFT concepts.Experience in system level/mother board characterization and data collection.Expertise in programming with Scripting languages (i.e., PERL, Python).Knowledgeable with test equipment (i.e., oscilloscope, logic analyzer, etc.)Board bring up, hardware design and PDN noise analysis experience is a plus.Excellent interpersonal skills to work with internal team members and external suppliersBS and a minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). \n\nJoining this group means you’ll be responsible for crafting and building the technology that operates Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product! \n\nIn this role, your responsibilities will involve Product Characterization on different setups and defining correlation between ATE and other logic boards. You will also focus on studying the impact of hardware on SOC performance."}, "200375857": {"jobID": "200375857", "origin_search": null, "posted": "Nov 9, 2022", "jobTitle": "Senior Apple GPU Compiler Analytics Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200375857/senior-apple-gpu-compiler-analytics-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong scripting language experience (we use Python)Knowledge and experience, an understanding of modern data analytics techniques and a working knowledge of at least one data analytics platformExperience with using and creating databasesInterpersonal and teamwork skills that demonstrate an ability to collaborate both with your peers and with other teams consisting of people with different expertiseB.S. in Computer Science or equivalent experienceIf you believe you have additional skills not listed here that would make you a good candidate for this position, please feel free to include a cover letter describing those skills and their applicability to the position.", "jobDescription": "The Apple GPU Compiler Analytics team is seeking a results-oriented software engineer with analytics background to work on developing quality and performance systems and metrics.\n\nOur team supports the GPU Compiler Backend Teams by providing tools and system to measure and report performance and quality metrics. \n\nWe create full stack reporting and analysis tools as well as create and support systems to generate and validate the necessary data to guide the teams in making engineering decisions."}, "200462498": {"jobID": "200462498", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "PCB Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462498/pcb-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors or equivalent technical experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$112,000", "max": "$186,600,"}, "benefits": null, "requirements": "6+ years of PCB Design ExperienceExperience with Allegro Software toolsExperience with developing high volume consumer electronic productsStrong verbal and written communication skillsDemonstrated success in a fast-paced design environmentBachelors or equivalent technical experience", "jobDescription": "Our team is looking for a PCB Design Engineer. As a PCB Designer for the Beats Engineering group at Apple, you will be working on board designs implementing cutting edge technologies. We are seeking a flexible and motivated individual with understanding of print circuit board design, high speed, audio systems, to build complex rigid flex PCBs using CAD applications and tools. \n\nIf you are passionate about audio, creating new products, and working with a team, then this would be the perfect opportunity for you."}, "200438802": {"jobID": "200438802", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Packaging Product Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438802/packaging-product-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree with an emphasis in Mechanical Engineering or Packaging Science, with at least 2 years of related industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience working with 3D and 2D CADInnovative thinking, high personal motivation, strong engineering fundamentalsOTHER SKILLS WE LIKE TO SEE:Flexibility and comfort working in a quickly changing environmentEffective verbal and written presentation skillsPrototyping experienceData-driven design approach to complex problemsExperience with design cycle from concept to manufacturing in mass-productionKnowledge of material science and FEAKnowledge of fiber-based materialsBS degree with an emphasis in Mechanical Engineering or Packaging Science, with at least 2 years of related industry experience", "jobDescription": "When was the last time you enjoyed a box as much as the product inside? At Apple, every customer interaction is an opportunity for surprise and delight! This philosophy extends beyond the product to its packaging, where every detail is thoughtfully considered.\n\nThe Packaging PD team is a diverse group of people responsible for the design and execution of structural packaging for all Apple products - from shippers to finished goods boxes. Our packaging delivers an outstanding customer experience, while protecting products throughout the shipping environment, and advancing Apple’s sustainability goals. We collaborate with a wide range of teams including Industrial Design, Marketing, Environmental, Operations and many others during the design process.  \n\nWe are seeking someone who approaches problem solving with passion, creativity, and curiosity. Apple’s approach to packaging is unique, so we value people who are eager to learn new skills and further improve their knowledge of packaging design, manufacturing processes, and sustainable materials. We welcome fresh influences from outside the standard packaging industry to promote innovation in creative ways"}, "200363050": {"jobID": "200363050", "origin_search": null, "posted": "Aug 5, 2022", "jobTitle": "WiFi and Coex Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200363050/wifi-and-coex-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in system-level design and development of radio co-existence (e.g., WiFi and BT co-ex) in embedded devicesExperience in WiFi driver SW development and integration with C/C++ in an embedded environmentUnderstanding on data structures, object-oriented design, and SW development methodologyIn-depth understanding and hands-on experience with WiFi protocols and 802.11 standardsGood understanding on BT protocols and use casesProficient understanding of TCP/IP and networking protocolsStrong analytical skill for problem-solving and system-level optimization (CPU cycle, memory, power, etc)Effective written and oral communication skills, particularly with technical content.Highly organized, creative, motivated, and passionate about achieving resultsBachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe success we are striving will be the result of very skilled people working in an environment which nurtures creativity, partnership, and thinking of old problems in new ways. \n\nThe mission of the WiFi Technology team - Build the world’s best WiFi experience and most innovative use cases by inventing and improving state-of-the-art technologies. We develop ground breaking WiFi technologies and ecosystems that are central to Apple’s products - the iPhone, Mac products, HomePod, and more! New challenges arise every day that require the sharp problem-solving skills of individuals. Are you in for these challenges? \n\nJoin us! We are looking for a forward-thinking, self-confident, experienced firmware engineer to design, develop & launch next-generation WiFi technologies in Apple products."}, "200450045": {"jobID": "200450045", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Assembly Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450045/assembly-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in Semiconductor Packaging field.Working knowledge in materials characterization and analysisSolid understanding of large FCBGA package, MCM package, 2.5D packaging and 3D packaging technology.General understanding of packaging technologies, assembly processes, IC packaging materials, reliability standards, FA techniques, etc.Good communication skills that can enable you to work well with internal multi-functional teams and overseas suppliers.Ability to work independently and solve projects with minimum supervision.Good engineering problem solving skills with strong engineering physics and fundamentals.Can use package design softwares, APD, Virtuoso, etc.Working knowledge in memory packaging.Good program management skill-  BS and +10 years of relevant industry experience", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? We are looking for a hardworking and passionate IC Packaging Engineer to join our team!\n\nIn this highly visible role, you will develop advanced packaging technologies, define assembly baseline processes, decide package BOM, establish package design rules that are optimized for performance, reliability, yield and cost for a variety of projects including SoC!"}, "200462215": {"jobID": "200462215", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Mac System Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462215/mac-system-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 5+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Subject matter expert and strong understanding of personal computing systems and product designPossesses strong technical breadth across several computer subsystem technologies, e.g., CPU, GPU, storage, memory, audio, display, input devices, power delivery, power management, networking, wireless, I/O, thermal management, cameras and sensorsAble to create, review and approve engineering requirement specification documentsUnderstands schematics, PCB layout & designs; has experience in bring-up, system debug and hands-on lab environmentsComprehends the roles of HW/FW/SW layers and how they interact in system designHas strong analytic, verbal, written and communication skills. Able to summarize and effectively communicate technical issues and actions to key stakeholders and leadership teamsMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 5+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you.", "jobDescription": "The Mac System Architecture team seeks an outstanding computer systems or technology architect to influence and drive new product designs. This position is a multi-disciplinary and cross-functional lead engineering role encompassing all aspects of computer system design. The candidate will have the skills and experience to create system architectures, surprise and delight our customers, and advance our products’ performance, size, power, thermal and cost goals.\nIf this role sounds like a fit, please consider applying!"}, "200462219": {"jobID": "200462219", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Mac System Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462219/mac-system-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 5+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Subject matter expert and strong understanding of personal computing systems and product designPossesses strong technical breadth across several computer subsystem technologies, e.g., CPU, GPU, storage, memory, audio, display, input devices, power delivery, power management, networking, wireless, I/O, thermal management, cameras and sensorsAble to create, review and approve engineering requirement specification documentsUnderstands schematics, PCB layout & designs; has experience in bring-up, system debug and hands-on lab environmentsComprehends the roles of HW/FW/SW layers and how they interact in system designHas strong analytic, verbal, written and communication skills. Able to summarize and effectively communicate technical issues and actions to key stakeholders and leadership teamsMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you have 5+ years of relevant industry experience but followed a different path to expertise in hardware engineering, we would still like to hear from you.", "jobDescription": "The Mac System Architecture team seeks an outstanding computer systems or technology architect to influence and drive new product designs. This position is a multi-disciplinary and cross-functional lead engineering role encompassing all aspects of computer system design. The candidate will have the skills and experience to create system architectures, surprise and delight our customers, and advance our products’ performance, size, power, thermal and cost goals.\nIf this role sounds like a fit, please consider applying!"}, "200448792": {"jobID": "200448792", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "IC Packaging Simulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448792/ic-packaging-simulation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Proven capability in mechanics and mathematics.Hands-on experience of major FEM tools (e.g., ANSYS, ABAQUS, Hypermesh, etc.).Proficiency with numerical simulation software tools and expert in Matlab and/or Scientific Python.Deep understanding of packaging materials and their mechanical behaviors.Knowledge of electronic packaging structures and processes, as well as its reliability, and package qualification requirements is a huge plus.Able to perform independent research and development work.Excellent written and verbal communication skills with ability to present ideas, design concepts, data and plan with high confidence at team meetings.- BS and 3+ years of relevant industry experience.", "jobDescription": "Do you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? \n\nWe are looking for a self-motivated Packaging Simulation Engineer who is proficient in FEM simulation with multi-year FEM software ANSYS or ABAQUS.\n\nThis position requires someone familiar with development process of simulation and characterization projects, that thrives in a multifaceted collaborative organization."}, "200451214": {"jobID": "200451214", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Digital Circuits Debug Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451214/digital-circuits-debug-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for applicants with design experience in advanced technology nodes.This is a hands-on role. You will perform independent simulation, analysis and data process to draw significant circuit insights.Experience in one or multiple of the following areas is highly desirable: SRAM circuits, custom circuit design, silicon debug.Understanding of CPU architecture is a plus.Deep understanding of deep sub-micron device physics, leakage mechanisms, technology interactions with device behavior.Ability to conduct experiments during silicon debug, gathering & analyzing data; and applying scripting to support efficient handling of ATE data.Ability to work seamlessly with multi-functional teams and bring results.Experience in scripting languages (Python /Perl or others) and CAD automation tools.Knowledge of industry standard circuit and design tools.BS and a minimum of 3 years relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned!\nYou will join an exciting silicon design group that is responsible for designing innovative ASICs. We have an extraordinary opportunity for a circuit design engineer to lead the debug of advanced custom digital megacells (SRAM memories, on-chip sensors, ML accelerators data path) and enable successful ramp of our SOCs."}, "200452359": {"jobID": "200452359", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Cellular RF Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452359/cellular-rf-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BSEE with 3+ years of directly relevant experienceExperience with radio hardware design and/or RF component designFamiliarity with the challenges of development for high-volume manufacturing.Hands on experience with RF circuits and hardware on the lab bench.Understanding of core technologies and physics that drive innovative RF performance.Proficient in wireless communications standards, wireless technology and communications market trends.Excellent written and verbal communicator, proven track record of working in a dynamic multi-functional team.Well organized and have the ability to be flexible in a changing work environment.Cellular Handset experience (preferred, not required)Experience with RF simulation tools (ADS, HFSS, Matlab) (preferred, not required)Experience with Python for test setup automation and data analysis (preferred, not required)BSEE and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Are you ready to join our RF Hardware Design team?\n\nThe RF Hardware Design Engineer will design, develop, and optimize radio frequency (RF) hardware circuits and systems for wireless communications devices. The engineer will primarily be responsible for development and integration of cellular radio platforms, and will be involved from initial concept study to the mass production phase. Some international and domestic travel may be required."}, "200450093": {"jobID": "200450093", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Cellular RF Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450093/cellular-rf-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and  3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BSEE with 3+ years of directly relevant experienceExperience with radio hardware design and/or RF component designFamiliarity with the challenges of development for high-volume manufacturing.Hands on experience with RF circuits and hardware on the lab bench.Understanding of core technologies and physics that drive innovative RF performance.Proficient in wireless communications standards, wireless technology and communications market trends.Excellent written and verbal communicator, proven track record of working in a dynamic multi-functional team.Well organized and have the ability to be flexible in a changing work environment.Cellular Handset experience (preferred, not required)Experience with RF simulation tools (ADS, HFSS, Matlab) (preferred, not required)Experience with Python for test setup automation and data analysis (preferred, not required)BS and  3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Are you ready to join our RF Hardware Design team?\n\nThe RF Hardware Design Engineer will design, develop, and optimize radio frequency (RF) hardware circuits and systems for wireless communications devices. The engineer will be primarily responsible for development and integration of cellular radio platforms, and will be involved from initial concept study to the mass production phase. Some international and domestic travel may be required."}, "200450034": {"jobID": "200450034", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Cellular RF Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450034/cellular-rf-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BSEE with 3+ years of relevant experienceExperience with radio hardware design and/or RF component designFamiliarity with the challenges of development for high-volume manufacturing.Hands on experience with RF circuits and hardware on the lab bench.Understanding of core technologies and physics that drive innovative RF performance.Proficient in wireless communications standards, wireless technology and communications market trends.Excellent written and verbal communicator, proven track record of working in a dynamic multi-functional team.Well organized and have the ability to be flexible in a changing work environment.Cellular Handset experience (preferred, not required)Experience with RF simulation tools (ADS, HFSS, Matlab)(preferred, not required)Experience with Python for test setup automation and data analysis (preferred, not required)BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices, strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Are you ready to join our RF Hardware Design team? \n\nThe Cellular RF Hardware Design Engineer will design, develop, and optimize radio frequency (RF) hardware circuits and systems for wireless communications devices. The engineer will be responsible for development and integration of cellular radio platforms, and will be involved from initial concept study to the mass production phase. Some international and domestic travel may be required when approved to do so."}, "200428856": {"jobID": "200428856", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Sr Audio DSP and Coding Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200428856/sr-audio-dsp-and-coding-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in CS or EE, Industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "5+ years experience in audio software developmentKnowledge and experience in ML.Proven experience and knowledge in audio signal analysis, subjective/objective audio quality assessment and psycho- acoustic models.Skillful in exploiting characteristics of human auditory perception and digital signal processing schemes in developing algorithms for audio applications.Experience in developing bit rate efficient and scalable audio coding algorithms.Excellent software programming (C, C++, and scripting languages such as Python) and optimization skills.MS/PhD in CS or EE, Industry experience", "jobDescription": "The Audio & Media Technologies (AMT) team is looking for a highly motivated and talented research and development engineer to work on audio coding and related signal processing algorithms. The AMT team is at the center of Apple’s innovative products, including the Mac, iPhone, iPad, Apple Watch, Apple TV, macOS, iOS, watchOS and tvOS. IMG’s Core Audio team provides audio foundation for various high profile features like Siri, phone calls, Face Time, media capture, playback, and API’s for third party developers to enrich our platforms. Are you a talented engineer who is passionate about building audio software products for millions of customers and care about overall user experience? You could revolutionize the audio experience for game and future audio technologies."}, "200446224": {"jobID": "200446224", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "AIML - Sr Data Science Manager, AIML Data", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446224/aiml-sr-data-science-manager-aiml-data?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "A passion for and track record in data analysis, A/B testing, and shaping data culture.5+ years in a managerial role, recruiting top talent, growing, and scaling analytics organizations.Ability to manage complex relationships across multiple functions and establish strong partnerships.Outstanding communication and presentation skills, written and verbal, to all levels of an organization.Technical expertise: experience in AB testing, statistical algorithms and developing analytic recommendations.Technical rigor - ability to work with engineering teams and develop sustainable solutions for rigorous analytics.Experience working with systems and products that are powered by machine-learned models and an understanding of natural language or speech-enabled products.Strong analytical product intuition - able to use data impact-fully in guiding development of products and user experiences.", "jobDescription": "Do you get excited by driving product impact via measurement and evaluation, for products and services used by hundreds of millions of people globally? The vision for the AIML Data organization is to improve products by using data as the voice of our customers. You will lead and continue to grow a team of data scientists specializing in experimentation. The team will be responsible for evaluating the impact of products or components, scaling statistical algorithms, metrics development, experimentation and opportunity analysis."}, "200360126": {"jobID": "200360126", "origin_search": null, "posted": "Mar 24, 2022", "jobTitle": "Module Process Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200360126/module-process-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. or M.S. degree in Mechanical Engineering, Physics, Material Science, with 3+ years of experience in related field preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Self-starter with demonstrated ability to lead a project from lab scale development to production without major last minute surprisesHands-on experience in the development of module processes & its integration in back-end processes of Flat Panel Display & Touch industry or other related industriesDemonstrated ability to perform DOE, data analysis, SPC controlProven track record in conducting failure mode analysis, root cause investigation, and problem solving for product yield and quality issue.Excellent written & verbal communication skills and demonstrated leadership abilityProject Management- Excellent data handling, documentation, critical milestone creation, and organization skillPh.D. or M.S. degree in Mechanical Engineering, Physics, Material Science, with 3+ years of experience in related field preferred", "jobDescription": "Apple is looking for a Sr. Module Process Engineer to join Panel Process and Optics (PPO) Engineering team. Module Process Engineers are responsible to develop new innovative manufacturing process technologies to tackle sophisticated design challenges that have direct impact to future product, quality and delivery of Apple Displays & Touch. Individual in this role will serve as a focal point in the process development of sophisticated key process modules from the concept/architecture stage through product engineering validation builds. We work at a fast pace and require everyone to be highly self-motivated. A successful candidate has a flexible mind and is able to tackle problems outside of their respective technical area!"}, "200457067": {"jobID": "200457067", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Cellular Protocol Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457067/cellular-protocol-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Electrical Engineering or Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands on experience in embedded system software development.Strong Software Engineering skills including design, programming (using C, C++), scripting and debuggingDemonstrated ability to write thoughtful, maintainable codeExcellent problem solving, critical thinking, and communication skillsExperience in cellular protocols or wireless software development is a plusExperience in Access Stratum is a strong plusBS/MS in Electrical Engineering or Computer Science or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200380742": {"jobID": "200380742", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Motion Sensing System Integration Engineer – Inertial Sensors", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380742/motion-sensing-system-integration-engineer-inertial-sensors?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MS/BS degree in engineering, preferably with 1+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "1+ years of hands-on experience in sensor system integration, preferredFundamental knowledge and experience in physics, mechanical, electrical, and material science engineering.Experience in characterization and validation of sensing systems including: theory of operation, signal processing, design trade-offs, design of experiments and failure root cause analysis.Hands on with C/C++/Python/MATLAB for data collection/analysis, automating instruments, development board bring-up, etc.Experience with using various types of electrical test equipmentsCapable of managing multiple tasks/projects in parallelExcellent written and verbal communication skills and solid collaboration skillsMS/BS degree in engineering, preferably with 1+ years of relevant industry experience.", "jobDescription": "Sensors bridge the gap between the physical and digital world. Every new feature and functionality opens a new doorway for the user to interact with their device or for the device to bring information to its user. The Motion Sensing Hardware Team focuses on defining and integrating MEMS accelerometers and gyroscopes across a variety of Apple products such as iPhones, iPads, AirPods, and Watch. Features we help enable include Fall Detection, Spatial Audio, Optical Image Stabilization, and many others. Our team enjoys a collaborative environment where creative and hard-working people advance the customer experience of our devices with innovative technologies.\n\nYou will play a key role in specifying, developing, characterizing, and validating motion sensing systems. You will also be working closely with various multi-functional teams within Apple to help deliver the best product that will surprise and delight our customers. Familiarity with MEMS sensor technologies such as inertial sensor performance metrics, inertial sensor usage and limitations, and system integration are a major plus!"}, "200446516": {"jobID": "200446516", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446516/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE w/ 2+ years experience or Ph.D in EE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 2 years of relevant industry experienceStrong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsMSEE w/ 2+ years experience or Ph.D in EE", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200351791": {"jobID": "200351791", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Software QA Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200351791/software-qa-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "5+ years of experience working as a Software QA Automation EngineerExperience in one or more Scripting/Programming Languages including Swift, Objective C or PythonExperience in automating tests at Unit, API, UI, non-UI levelExperience with Continuous Integration systemsExperience in implementing initiatives across teamsAbility to investigate, debug and triage difficult problems and independently work towards resultsAt ease and adaptable in a dynamic and informal environmentExcellent written and verbal communication skills are needed to facilitate close interaction with development teams, management, and other organizations within AppleBS in Computer Science or equivalent experienceApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programmes vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what can be accomplished!\n\nThe Central Quality Engineering team is seeking a mid to senior-level quality engineer to work on systems and processes that will enable easy sharing of automated tests across teams at Apple. If you are a highly motivated engineer with aspirations to build powerful automation, cultivate learning, and lead automation efforts across teams at Apple, we want to talk to you!"}, "200459823": {"jobID": "200459823", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "SoC Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459823/soc-embedded-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for candidates with a minimum of 10 years of experience and the following:10 years of embedded software experience, including debugging and characterizationExposure to SoC bring up and complex IPsExpert embedded C programmerProven leadership in problem solving, and delivery of high volume and high quality SWExperience using laboratory equipment (e.g., logic analyzer, digital oscilloscope)Experience reading and working from device and board schematicsBS and a minimum of 10 years relevant industry experience", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAt Apple, we go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product! \n\nJoining Apple as a SoC Embedded Software Engineer, you will craft and implement embedded software for System on a Chip (SoC) bring up and test. You will write software for Apple silicon in a bare metal environment, and work closely with the Silicon Validation and Software Engineering teams to bring up new silicon, and ensure the quality of every device when manufactured."}, "200466433": {"jobID": "200466433", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "5G Cellular Layer-1 FR2 Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466433/5g-cellular-layer-1-fr2-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Minimum Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, Wireless communication or equivalent experience.\nMasters or PhD in the above fields is a plus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Understanding of 5G and 4G 3GPP standards, with excellent knowledge on Physical Layer control procedures. Hands-on experience with L1 Software/Firmware in 5G FR2 development is desired and a huge plus for this role. Deep understanding of software engineering principles, and core computer science fundamentals.Highly competent with C and C++ programming, solid understanding of compilers, build and source code control tools Understanding of end to end cellular protocol layers and control and data plane will be a huge plus for this position Significant experience with embedded real-time programming for low latency and memory constrained applications. Experience with Real Time Operating Systems (RTOS) applications, multi-core, multi-threaded and concurrent programming.Experience with silicon prototyping, emulation systems, and virtual platforms. Proficiency in debugging embedded software systems.Familiarity with ETM, ETB, JTAG, and any other trace and debug tools.Minimum Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, Wireless communication or equivalent experience.\nMasters or PhD in the above fields is a plusApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of a world class 5G and beyond cellular modem team, you’ll craft sophisticated leading-edge embedded firmware that deliver more performance in our products than ever before. You’ll work across disciplines to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. Do you want to have an impact on every single Apple product? As a Cellular Layer 1 Software Engineer on this team focusing on FR2 cellular development, you will be at the center of the 5G/4G/multimode cellular firmware effort within a wireless technologies development group responsible for productizing state-of-the-art wireless SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a dynamic cross-functional organization, is not afraid to debate ideas openly, and is flexible enough to pivot on constantly evolving requirements.\nWe promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it. Join us to help deliver the next amazing Apple product!"}, "200461705": {"jobID": "200461705", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Depth Module Design Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461705/depth-module-design-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in relevant field (EE, ME, Optics, Physics)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Ability to lead cross-functional teams and take responsibility for project success. The ideal candidate will have deep expertise in hardware design, new product development from concept to mass production, leading cross-functional, diverse team(s) of scientists and engineers.Strong written and verbal communication skillsAdditional experience in at least 1-2 of the skills listed below are highly desired:Depth sensor design, characterization, testingMechanical Design of assemblies for high volume manufacturingElectronic circuit design:  Digital, power-supply, & analogOptical design of compact imaging opticsData analysis and statistics using MATLAB or JMPManufacturing processes for high-precision, high-volume modulesLaser and/or photonics integrated circuit design, fabrication, testingAbility to travel internationally to Asia/Europe to suppliers for support and FA (typically 20%)BS/MS/PhD in relevant field (EE, ME, Optics, Physics)", "jobDescription": "The Depth Hardware group at Apple develops depth-sensing hardware such as the revolutionary TrueDepth camera that powers FaceID and cutting edge LiDAR scanner.  This multi-disciplinary group of engineers is responsible for architecture, research, and manufacturing development of these highly complex sensing systems for Apple products.  The Depth Hardware team is seeking a Module Design Lead to lead development of Depth HW modules in engagements with product and technology teams."}, "200456703": {"jobID": "200456703", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Full Stack Software Engineer – Human Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456703/full-stack-software-engineer-human-engineering?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science/Engineering, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong fundamentals in object-oriented programming, data structures, and algorithmsExpertise architecting and developing full stack web applications with RESTful APIs3+years Python experienceWeb development experience with HTML5, CSS/SASS, and JavaScriptExperience with front-end frameworks such as Angular(preferred), React, or Vue.Experience with backend MVC frameworks such as Django(preferred), Rails, or SpringStrong understanding of relational database designExperience designing scalable software systemsDemonstrated UI/UX design abilitiesStrong communication skillsBS/MS in Computer Science/Engineering, or equivalentNice to have:● iOS development experience● Server Administration / DevOps● Extensive experience with UNIX shell● Experience with containers (Docker, Kubernetes)", "jobDescription": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Imagine what you could do here. Bring passion and dedication to your job and there’s no telling what you could accomplish. We are a team of software engineers developing web-based tools and applications for Apple teams. Our work empowers Apple engineers and researchers to build the products that inspire and delight millions every day. Dynamic, inspiring people and innovative technologies are the norm here. We want you to join our team if you are a resourceful engineer with the desire to research and develop solutions that do not yet exist. Ideal candidates are comfortable breaking down problems and proposing multiple solutions. They strive for excellence but can balance progress and perfection. Working with us, you will become part of a hands-on development team that furthers engineering perfection, creativity, and innovation."}, "200421210": {"jobID": "200421210", "origin_search": null, "posted": "Oct 11, 2022", "jobTitle": "Software Engineering Manager, Automation Frameworks", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200421210/software-engineering-manager-automation-frameworks?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$269,000,"}, "benefits": null, "requirements": "-  Lead a project and manage deliverables-  Understanding of automation workflows-  Experience in framework architecture design.-  Development experience in Objective-C or Swift-  Strong debugging and triaging capabilities-  Thrive in a collaborative environment and comfortable working with cross-functional teams-  Fervently passionate and inquisitive-  Confirmed understanding of statistics as it relates to data analysis is a plus-  Experience with Continuous Integration systems like xCode Server, Jenkins, Travis etc.Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nThe Wireless Frameworks and Services team is looking for a highly motivated and hardworking Engineering Manager to help lead a team of engineers to develop and maintain automation frameworks across all Apple platforms. (i.e Apple Watch, Apple TV, AirPods, iOS and macOS) The candidate should have excellent leadership skills, value an iterative approach to problem solving and possess solid communication skills."}, "200319990": {"jobID": "200319990", "origin_search": null, "posted": "Jun 28, 2022", "jobTitle": "Bluetooth Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200319990/bluetooth-firmware-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in computer science, computer engineering, electrical engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "2+ years of embedded software development experienceStrong coding skills, preferably in C, C++, and assemblyExcellent analytical and debugging skillsExperience in the design and development of embedded software for real-time operation, especially on ARM processorsUnderstanding of wireless protocols, ideally BluetoothPassionate, inquisitive, and seek to tackle everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersThrive in a collaborative environment and be able to communicate clearly while expertly driving projects across many teamsBachelor’s degree in computer science, computer engineering, electrical engineering, or equivalent experience", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of an outstanding team of engineers driving innovation and developing products used by millions worldwide. Our team is looking for a highly motivated embedded software engineer to design and develop Bluetooth for Apple’s latest products, including the next generation of Apple Watch, AirPods, iPhone, and iPad."}, "200460101": {"jobID": "200460101", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "iPhone/iPad Systems Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460101/iphone-ipad-systems-quality-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Engineering Degree or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "3+ years of QA or System Test experience, preferably on consumer-facing hardware/software products. Testing experience with mobile devices is a plus.Demonstrated QA skills with at least 2 complete product cycles, from inception to customer shipment.Committed to quality and passionate about customer experience.Strong analytical and troubleshooting skills. Sufficient knowledge of tools necessary for strong data analysis.Good understanding of Camera HW/SW functionalities and use cases.Excellent written and verbal communication skills and experience presenting data to cross-functional teams and/or leadership.Strong interpersonal skills; ability to collaborate and influence cross-functionally.Detail oriented and organized with a strong discipline of adhering to standards.Self-learner, independent and technically curious.Engineering Degree or equivalent experienceNice to have:-  Experience in automation using scripting or other languages (preferably Python, Swift)-  Experience leading or managing quality teams/projects", "jobDescription": "Are you passionate about customer experience and does the opportunity to shape product quality for millions of users sound exciting to you? Do you possess an upbeat personality with strong communication and interpersonal skills, attention to detail and a high bar for quality? Come join our team of creative engineers to influence the customer experience of iPhones, iPads and their related accessories!\n\nWe are the PSQ Devices iPhone/iPad quality team, and we are dedicated to improving the customer experience of Apple's innovative iPhones and iPads. We drive integrated system testing with an emphasis on hardware-centric risks and new software features for new/existing iPhone, iPads and its accessories. You will join a dynamic and curious group focused on testing with an out of the box approach, ranging from customer usage scenario research to designing complicated test procedures around it.\n\nCome join our team and see how we take an iOS device and make it function well with its ecosystem of related accessories, including contributing to the development and testing of smart keyboards, smart covers, pencils and other soft goods!"}, "200452098": {"jobID": "200452098", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless Module Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452098/wireless-module-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS with + 3 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Deep understanding of Wireless technologies.Extraordinary skill in Hardware and Software integration, problem solving and optimization.Responsible for crafting DUT Control boards.Programming experience in C/C++/Matlab/Python required.Experience with data/yield analysis, JMP or similar tool a plus.Experience working with and programming multiple Mass production RF testers: Litepoint, Advantest and Teradyne.Very driven and self-motivated. Capable of driving vendors, test partners and setting test strategies.Skilled at driving cross-functional decision and cooperating with other test teams (upstream/downstream) for a sound end-to-end product test strategy.Minimum BS with + 3 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! Ready to join our RF Design team? \n\nThe Wireless Module Test Engineering Lead (WMTE) will be responsible for designing and driving strategy for all high-volume RF module tests at the module factories adhering to the internal processes/objectives. The Lead engineer is responsible for research, design, and development of test methodologies at the module vendors for multiple Wireless technologies (Wifi/UWB/GPS/Cellular/NFC). They would need to work with multiple chipsets across wireless technologies and plan the appropriate high volume test strategy. This position will support multiple product lines from the Hardware Technology organization from early concept through MP. The WMTE will apply a confirmed EE/RF background to understand technical details, issues and risks."}, "200304245": {"jobID": "200304245", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Sr. Functional Safety Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200304245/sr-functional-safety-engineer-spg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BS/MS in engineering\n-  7 years work experience on multiple products that have entered production / safety engineering experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Ability to work in multidisciplinary environment (electronics, software, control systems, algorithm development, mechanical, thermal, etc.)In-depth understanding of complex mechatronic systemsDevelop new products from concept through productionExperience with Concept Trade Studies, Requirement Development and Allocation, andFunctional DecompositionFluency in system modeling tools such as State Machines, Data Flow Diagrams, Block Diagrams, and Context DiagramsExperience using deductive and inductive failure analysis tools such as FTA (Fault Tree Analysis) and FMEA (Failure Modes and Effects Analysis)Experience using problem solving tools such as Ishikawa diagrams (a.k.a. fishbone diagrams), 5 Whys, 8D, etc.First-hand understanding of systems engineering standards such as IEC 62304, IEC 61508, DO-178C, etc.First-hand experience using requirements management tools such as DOORS, TeamCenter, Polarion, etc-  BS/MS in engineering\n-  7 years work experience on multiple products that have entered production / safety engineering experienceApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their loved ones in significant ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programmes vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "Apple's Special Projects Group is looking for an exceptional engineer with experience in product safety analysis, requirements engineering, hazard & risk analysis, and multi-disciplinary product development experience in safety critical mechatronic applications. You will work in a highly cross functional environment decomposing product features into system requirements, identifying hazards and performing risk analyses, designing architectures to mitigate risks, and producing safety analyses. You will collaborate closely with a variety of product development teams to ensure designs are implemented, verified, and validated according to system requirements and safety targets.\n\nDoes working on autonomous technology excite you? Innovation is in your hands! We are ready to help you help us grow."}, "200444402": {"jobID": "200444402", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Product Design Engineer - Softgoods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444402/product-design-engineer-softgoods?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Mechanical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Some previous internships with production part design preferredGood engineering fundamentals (beam bending, free body diagrams, GD&T, etc…)3D and 2D CAD skills (NX preferred)Solid verbal and written presentation skills (Keynote or Powerpoint)Experience using spreadsheets to analyze engineering data (FAI/CPK, tolerance analysis)Experience engaging with manufacturersCreative problem solving, with experience in failure analysis, root cause investigation, and DOE creationBS in Mechanical EngineeringOTHER SKILLS AND TRAINING WE LIKE TO SEE:Knowledge of soft goods materials (synthetics, leather, adhesives)Knowledge of soft goods assembly process (bonding, cutting, stitching)MS degree in EngineeringBS in Mechanical Engineering", "jobDescription": "Why Apple?   \n\nAt Apple, we believe our products begin with our people. By hiring a diverse team we drive creative thought. By giving that team everything they need we drive innovation. By hiring incredible engineers we drive precision. And through our collaborative process we create memorable experiences for our customers. \n\nThese elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives.   \n\nWhy Softgoods? \n\nApple’s Softgoods Engineering team is relatively new to Apple. We work with textiles, leather, silicone and soft polymers. Our mission is to use these incredible materials to enable new product categories, and to enhance Apple’s existing product lines. Bringing Apple engineering and precision to products made of soft materials is an exciting challenge and requires a creative and open minded approach.  \n\nWe have an inclusive and talented team of people, from a wide variety of backgrounds. We all work together in a beautiful customized lab where we design, engineer, and develop the best Softgoods products in the world.   \n\nIf this sounds like an exciting challenge, we hope you will consider a place in our team!"}, "200445668": {"jobID": "200445668", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "WiFi Software Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445668/wifi-software-performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience. \n\nMasters or PhD preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong understanding of WiFi or Bluetooth, BLE protocolsExperience working with wireless sniffers, protocol analyzers to debug and root cause issuesBackground or research experience in RF, Digital, Wireless communicationsExperience in python for data analysis and visualizationProgramming in C or C++Knowledge of TCP/IP protocol suiteBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience. \n\nMasters or PhD preferred", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems (WTE) organization and be part of an outstanding team of engineers to drive innovation and develop products used by millions worldwide. Be ready to make something outstanding when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. We have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices and strengthens our dedication to leave the world better than we found it. Do you want to help deliver the next amazing Apple product? Then join the Connectivity Firmware Performance team!"}, "200452206": {"jobID": "200452206", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Workday Integrations Engineer, Employee Experience & Productivity", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452206/workday-integrations-engineer-employee-experience-productivity?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS degree in computer science or equivalent field plus 5+ years experience or MS/PhD degree plus 3+ years experience, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "4+ years of experience with Workday HCM Integration tools and services.At least one full implementation of an Workday HCM solution, with validated technical and integrations experience.Design, Build, Test, and Deploy Workday Integration solutions using Custom Reports, EIB, Core Connectors, Document Transforms, XSLT and Workday StudioExperience with Web Services and APIs (WSDL, SOAP, REST and WS standards)Ability to help resolve integration issues requiring in depth expertise in the Workday solutionDemonstrated integration experience in Human Resources related domains, (Payroll, Benefits, Recruiting, etc.)Strong knowledge of Cloud Computing, Web Services, and integration challengesDesign, implementation and support of new Workday HCM functionality, around both internal and external integrations.Build detailed integration specifications, field mappings, and system process designs to support the entire integration deployment life-cycleResearch integration failures, perform root cause analysis, and develop plans to mitigate and avoid future system issuesManaging system integrations within the architecture of the Workday systemAnalyzing and translating business and functional specifications and change requests into technical specificationsUnderstanding and follow Data Governance and ensure attention to data qualityUnderstanding and ensuring security and data privacy standardsWorkday Certification(s) is a bonusBS degree in computer science or equivalent field plus 5+ years experience or MS/PhD degree plus 3+ years experience, or equivalent.Security setup and implementation is a plusPayroll Connector Integration implementationBIRT and Reporting experienceSystem Monitoring and Auditing experience", "jobDescription": "Are you meticulously organized and highly observant? Join our Information Systems and Technology group and play a vital function on one of two Apple teams: Software and Services and Corporate Functions. From Apple ID to the Apple website to our data centers around the globe, our diverse collection of engineers, designers and creators manage the massive systems and services that so many people rely on every single day. We also build the custom tools that empower other Apple employees to solve problems on their own. Joining this group means you’ll be part of the Apple nerve center. You could play a meaningful role in helping Apple connect with over a billion customer devices around the world. Or you could help over 130,000 employees stay connected with each other and our suppliers. Together, you and your team will help everyone at Apple do what they do best: explore every possibility.\n\nIS&T Corporate Systems team is in midst of one of its biggest transformation initiatives. The program comprises a complete transformation of a custom built system to a cloud platform! We are looking for a Integrations Engineer to work on the Integrations track with our team of high-performing software engineers. Our teams foster a collaborative environment with creative, hard-working & fun people using innovative technologies. Engineering excellence is expected. Come join us for this once in a lifetime opportunity in building solutions for Apple that has worldwide impact."}, "200459150": {"jobID": "200459150", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Technical Program Manager - Core Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459150/technical-program-manager-core-technologies?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Mechanical Engineering or allied technical subject"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$138,500", "max": "$208,500,"}, "benefits": null, "requirements": "5+ years of experience in Manufacturing: Product Engineering, Process Engineering, Automation Engineering, or Program ManagementStrong technical skills, involving problem solving and issue root causing in a pressured environmentAbility to run full product line from start to finish, NPI to MPInterpersonal skills of leadership, project management, communication, collaboration, influencing and negotiation.Solid understanding of automation design, process design, and large scale manufacturingAssociated camera module components is preferred, but a deep semiconductor background is highly recommendedIn-depth understanding of wafer test, yield, wafer fab processes, wafer packaging, back-end issues.Familiarity with quality systems and controlAbility to present to Executive teams in a fast paced environmentConstant partnership with multiple functional teams across Apple and its suppliersWillingness and ability to travel internationally up to 30%.BS/MS in Mechanical Engineering or allied technical subject", "jobDescription": "Here at Apple we don’t just create products — we create the kind of wonder that’s revolutionized entire industries. It’s the diversity of our people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Product Technical Operations at Apple, and help us leave the world better than we found it."}, "200440742": {"jobID": "200440742", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Software Quality Engineer - System Stability", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440742/software-quality-engineer-system-stability?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BS EE/CS/CE required; MSc and above desired"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum 5+ years of experience in HW/SW test engineeringIn-depth knowledge of processor instruction set architecture and microarchitectureExperience working with pre or post-silicon hardwareExperience presenting data to executivesStrong communication, written skills, and interpersonal skills (required to establish and maintain inter-departmental relationships)Ability to solve hardware systems to component level and perform root-cause analysisExperience executing and monitoring and troubleshooting low-level and user-level UI automation in scripting languages such as Python, Ruby, Swift or JavascriptStrong knowledge of Unix and Unix shell scripting-  BS EE/CS/CE required; MSc and above desiredNice to have:-  Experience working in factory processes such as burn-in qualification-  Experience developing, and maintaining Python scripts-  Previously built advanced reporting tools like TableauApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "We're seeking a creative and motivated Stability Quality Engineer to join a Systems Quality team working to ensure world-changing products are delivered at a high-quality to all our customers. You will be involved from the early stages of a project and will play a critical role in the way we make decisions of releasing those Macs to customers. You will be responsible for planning, writing/developing, and executing system stability tests with an emphasis on hardware-centric software risks and writing and running automation simultaneously on a large number of systems. You will be at the nexus of hardware and software where you work cross-functionally with several engineering and QA teams to identify risk areas and testing responses, and to support engineering investigations. You should have a good instinct for discovering low-level defects in software and hardware.\n\nCome join our team!"}, "200444446": {"jobID": "200444446", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Mixed-Signal Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444446/analog-mixed-signal-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE\n10+ years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expert level in Python and/or C++Expert in Object-oriented Software (OOP)Knowledge of Database frontend and backendFamiliarity with simulation tools for analog, digital, and/ or mixed-signal circuitsFamiliarity with popular digital design HDLs (Verilog and/or VHDL)Understanding of specs and requirements for AMS circuits is a plusBSEE\n10+ years of industry experience", "jobDescription": "Apple Silicon Engineering is seeking Hardware-minded Software engineers to build innovative tools to design the next generation of Apple’s world-leading systems-on-chip (SOCs)\n\nApple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad. The Analog Mixed-Signal (AMS) circuits connect them to the physical world via complex IPs such as SERDES for data communication, PLLs for clock generation, and sensors for measuring physical quantities.\n\nModeling Software Engineers bring a unique and versatile combination of software and hardware expertise. On their way from the designer's mind to becoming a piece of silicon, circuits take form in software. You will develop those software-representations of future hardware, and then make them real. This includes both the circuits themselves, and the underlying tools to enable hundreds more designers. We use modern software design methodology and apply it to AMS Hardware design.\n\nIf you've written software in modern, designer-centric languages then you understand how powerful and freeing it can be. And If you've designed circuits, you know how hard it can be. Think of the IC-design tool-stack by analogy: RTL is C code, Schematics and gates are assembly, and Layout is machine language. \n\nMost IC design happens at one of those three layers, and most modern software design happens at a higher, more productive level. Tools handle the boring stuff and free designers to express their ideas. This is an opportunity to build that layer for IC hardware, and then use it to make the world's best mobile silicon.\n\nCore responsibilities: Architect, develop and test software to capture the behavior and performance of AMS circuits.\n\nSOME INDICATORS THAT YOU'D LOVE THIS JOB: \n\n-  You wish that designing circuits felt more like writing Python code\n-  Passion for building software to represent complex physical systems\n-  Avid usage of - or contributions to - open-source scientific computing software - especially packages for hardware design, signal processing, and/or data analysis\n-  An open mind about trying new things. Especially new tools"}, "200462288": {"jobID": "200462288", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Senior Software Engineer, OS Security", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462288/senior-software-engineer-os-security?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience/skills in system programming"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Significant prior kernel or systems programming experience on shipped/production productsA genuine passion for creating effective and pragmatic security technologiesUnderstanding of past, current, and emerging security exploitsStrong C and systems programming skillsReady to balance concurrent priorities on tight schedulesExcitement to work with other software, hardware, marketing, and support teams to provide the best security solutions for Apple’s productsExcellent partnership and interpersonal skills. We collaborate with a broad range of engineering teams involved in these products, and on all of their codeBS in Computer Science or equivalent experience/skills in system programmingPREFERRED EXPERIENCE:-  iPhone OS and Mac OS X exposure (end user, administrator and/or developer)-  Involvement in open source technologies and development communities such as FreeBSD and LinuxGREAT TO HAVE:-  Hypervisor design and architecture-  Swift experience", "jobDescription": "Apple’s OS Security team is looking for a motivated software engineer to join us to maintain, design and deploy world-class containment mechanisms throughout our operating systems. These mechanisms ensure our technologies are resilient and never just one mistake away from compromise. Here you’ll join and have a chance to learn from a group of people dedicated to building the most secure operating systems in the world. And you’ll have the opportunity to do it not just for a small subset of technology enthusiasts or experts, but for millions to use in their daily lives.\n\nAs part of the Security Engineering and Architecture group, our goal is for our users to feel confident that our devices have their back every time they interact with an Apple product. We work across the company, from designers in our Human Interface group, to engineers in our Silicon Engineering group. Along with our colleagues, we make technology deep within the Operating System and lift it all the way up through the software stack to build features that connect world class security engineering technology directly to users, right at the time they need it. As an engineer on the team, we’ll help you grow your autonomy here and invest your time into the most promising areas to make a difference. You will be able to see your impact on every product Apple makes, and watch your impact grow with your career here.\n\nHere, you’ll work with and influence teams across Apple, and the world, to make technology that does right by its users in every life it touches. This isn’t just something we write in our job descriptions, it’s why our group exists. Come help us push further."}, "200441246": {"jobID": "200441246", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "iPad System Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441246/ipad-system-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Engineering required, Mechanical or Electrical Engineering preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years experience hardware Program Management or Engineering Management work - managing cross-functional teams on HW/SW integration in development phaseDirectly manage 2+ product development cycles for a System with HW and SW integration involved.Leadership skills and ability to inspire team membersExcellent communication, organizational and leadership skillsSelf motivated and proactive with demonstrated creative and critical thinking capabilitiesUnderstands and deals well with rapid development cycles; remains flexible and calm in the face of uncertaintyBS degree in Engineering required, Mechanical or Electrical Engineering preferred.", "jobDescription": "Our team is looking for a System EPM to own and drive new product development in the iPad System team! Be responsible for managing product development from initial product definition through product launch. This is a great opportunity for cross functional leadership and visibility."}, "200450175": {"jobID": "200450175", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Assembly Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450175/assembly-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and 3+years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in Semiconductor Packaging field.Working knowledge in materials characterization and analysisSolid understanding of large FCBGA package, MCM package, 2.5D packaging and 3D packaging technology.General understanding of packaging technologies, assembly processes, IC packaging materials, reliability standards, FA techniques, etc.Good communication skills that can enable you to work well with internal multi-functional teams and overseas suppliers.Ability to work independently and solve projects with minimum supervision.Good engineering problem solving skills with strong engineering physics and fundamentals.Can use package design softwares, APD, Virtuoso, etc.Working knowledge in memory packaging.Good program management skillBS and 3+years of relevant industry experience-  BS and 3+years of relevant industry experience", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? We are looking for a hardworking and passionate IC Packaging Engineer to join our team!\n\nIn this highly visible role, you will develop advanced packaging technologies, define assembly baseline processes, decide package BOM, establish package design rules that are optimized for performance, reliability, yield and cost for a variety of projects including SoC!"}, "200438932": {"jobID": "200438932", "origin_search": null, "posted": "Nov 15, 2022", "jobTitle": "Modem System Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438932/modem-system-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors/Master Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands on experience in Wireless System Testing, Certification, IOT and/or Cellular System Performance.Solid experience of 5G NR PHY/MAC and higher layer control and user planesExperience in defining, developing and validating cellular modem system test cases for mobile devices using popular test development platforms.Good understanding of mmWave challenges and 5G Standalone protocolStrong understanding of 3GPP specifications (LTE & NR Air Interface, PHY, MAC, RLC, RRC, PDCP and NAS layer).Broad spectrum of knowledge and understanding of the end-to-end wireless system architecture from wireless physical layer all the way to application layer.Consistent track record to independently lead a complete area of technology and drive product quality.Attention to the smallest details that are significant to customersKnowledge in Test Automation and Scripting skills using PythonBachelors/Master Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. Join the Wireless Technologies and Ecosystems team and be part of an outstanding group of engineers, working to drive innovation and develop products used by millions worldwide We build and seamlessly integrate technologies that enriches peoples' lives and deliver the best user-experience. Our team is looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Multifaceted, encouraging and innovative people who build industry-defining technologies are the norm at Apple. If you're passionate about building technology that will make a difference, we may have the job for you!"}, "200460689": {"jobID": "200460689", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Modem System Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460689/modem-system-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors/Master Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Hands on experience in Wireless System Testing, Certification, IOT and/or Cellular System Performance.Solid experience of 5G NR PHY/MAC and higher layer control and user planesExperience in defining, developing and validating cellular modem system test cases for mobile devices using popular test development platforms.Good understanding of mmWave challenges and 5G Standalone protocolStrong understanding of 3GPP specifications (LTE & NR Air Interface, PHY, MAC, RLC, RRC, PDCP and NAS layer).Broad spectrum of knowledge and understanding of the end-to-end wireless system architecture from wireless physical layer all the way to application layer.Consistent track record to independently lead a complete area of technology and drive product quality.Attention to the smallest details that are significant to customersKnowledge in Test Automation and Scripting skills using PythonBachelors/Master Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems team and be part of an outstanding group of engineers, working to drive innovation and develop products used by millions worldwide We build and seamlessly integrate technologies that enriches peoples' lives and deliver the best user-experience. \n\nOur team is looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Multifaceted, encouraging and innovative people who build industry-defining technologies are the norm at Apple. \n\nIf you're passionate about building technology that will make a difference, we may have the job for you!"}, "200377391": {"jobID": "200377391", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Emerging Display Technologist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200377391/emerging-display-technologist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "▪ PhD in Physics, Optics, Electrical Engineering or Material Science Engineering, or MS with validated experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Prior hands-on experience in designing OLED devices and displaysConsistent track record in product development from an idea to commercialization in the display industry.A background which demonstrates hands on skill in design, fabrication, and characterization of optoelectronic materials and devices.Robust engineering skills including use of software such as Matlab, Python, JMP, Excel or similar software is required.Expertise in the electrical and optical performance validation of optoelectronic devices preferred.Knowledge and experience in active matrix flat panel displays strongly preferred, particularly in display optics and electronics, fabrication processes, and system design.Excellent written and verbal communication skills, with a high ability to collaborate with team members from multiple engineering fields.Willingness to travel internationally.▪ PhD in Physics, Optics, Electrical Engineering or Material Science Engineering, or MS with validated experience.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Display Technologies group, you’ll help ensure our products’ displays work beautifully through the successful design, fabrication, and implementation of components in Apple devices. From initial concept to mass production, you’ll develop highly innovative displays for the full line of Apple products, including Apple Watch, iPhone, iPad, and Mac. Through touch and sight, these displays are how millions of Apple customers connect with our products every single day. Together, you’ll collaborate with multifunctional teams across Apple to make each interaction a magical experience to see and touch. \n\nApple is looking for a creative, hands-on, motivated Technologist who will play a meaningful role in the design and performance of future displays used in Apple products! We are seeking the right person to interact cross-functionally with key collaborators in product design and development as well as with product suppliers. You will be the point person for the design of OLED display components, and will have opportunity to add to Apple's intellectual property."}, "200441413": {"jobID": "200441413", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "Software Engineer - Darwin Runtime", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441413/software-engineer-darwin-runtime?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent knowledge and experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Passion for low-level system technologiesFluency in the C programming languageExperience with UNIX-like systemsSystem design and architecture skillsStrong understanding of operating system fundamentals like threading, synchronization primitives, inter-process communication, scheduling, and virtual memoryExcellent collaborative skills, with the ability to work with a team to design system architectureBS/MS in Computer Science or equivalent knowledge and experience-  Knowledge of operating system implementation, hardware architecture and assembly programming-  Knowledge of Swift or Objective-C-  Skilled at interface and/or API design-  Experience with lldb or gdb-  Involvement in open source technologies and development communities such as Darwin, FreeBSD, Linux, etc.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "The Darwin Runtime team in Core OS is looking for enthusiastic engineers interested in developing low-level system technologies for Apple’s operating systems. Darwin is the UNIX-like foundation at the heart of all Apple’s operating systems, stretching from the kernel up through low-level user components. The Darwin Runtime team is responsible for building the low-level user space runtime technologies like Grand Central Dispatch (GCD), inter-process communication (XPC), memory allocator, threading library, and concurrency and synchronization primitives. These technologies provide a high quality, robust, and performant foundation on which iOS and macOS frameworks and applications are developed.\n\nThe ideal candidate should be self-motivated and effective in operating independently, with a desire to learn and develop technical leadership. Team members are welcome and encouraged to participate in design discussions, code reviews, and development across multiple technologies. The team is actively involved in defining OS architecture and design of cross-functional features that capitalize on Darwin technologies. Our environment fosters technical innovation, meaningful technology ownership, and a liberating amount of autonomy!"}, "200452740": {"jobID": "200452740", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "RF Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452740/rf-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceSolid Software Engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingKnowledge of Embedded RTOS crucialExperience in wireless systems or RF systemGood debugging skillsHands on experience developing test specification, test case implementation and analysis.In-depth knowledge of mobile communications in 2G/3G/4G and preferably 5G mmW and sub-6Collaborative and creative attitude to take up challengesGood verbal and written communication skills.Extensive knowledge and hands on experiences with RF HW and Baseband Modem technology would be a bonusExperience on mobile device factory build and support would be a bonusMinimum BS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200380432": {"jobID": "200380432", "origin_search": null, "posted": "Jun 3, 2022", "jobTitle": "Computer Vision Researcher & Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380432/computer-vision-researcher-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS in Computer Science or Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Algorithm development in the areas reflectance capture, material estimation and photogrammetryFluent in C/C++, Python (programming and debugging)Experience HLSL, GLSL, MetalKnowledge of parallel computing, CUDA, OpenCL, GPGPUKnowledge of software optimization and embedded programming5-8 years of professional practiceMS in Computer Science or Electrical Engineering", "jobDescription": "The Computer Vision Researcher responsibility is to develop innovative solutions for capturing and reconstructing of 3D and 4D representations of detailed and deforming surface geometry and materials. They will develop and deploy research prototypes into production. We value researchers who are self- motivated and enjoy a highly collaborative environment with minimal supervision. There is a substantial R+D component to our development and production. We want an Engineer that is excited about defining new workflows, clear-headed about risks inherent with invention, but passionate about pushing the designs to their maximum potential."}, "200451986": {"jobID": "200451986", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RF SoC Automation Tool Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451986/rf-soc-automation-tool-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 3+ years relevant experience required. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong software/scripting skills with background in Wireless RF systems fundamentals.Solid experience of building software tools and scripting to perform RF parametric testing such as EVM, RX sensitivity, ACPR, blocker testing, etc.Unix/Linux scripting knowledge with objected oriented programming experience such as Python is a requirement.Strong working knowledge of test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Proficiency with basic metrics for determining quality of digital communication signals measured.BS with 3+ years relevant experience required. MS preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nWe invite you to join us if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position! Individuals will work with PHY, MAC, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200451988": {"jobID": "200451988", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RF SoC Automation Tool Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451988/rf-soc-automation-tool-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong software/scripting skills with background in Wireless RF systems fundamentals.Solid experience of building software tools and scripting to perform RF parametric testing such as EVM, RX sensitivity, ACPR, blocker testing, etc.Unix/Linux scripting knowledge with objected oriented programming experience such as Python is a requirement.Strong working knowledge of test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Proficiency with basic metrics for determining quality of digital communication signals measured.BS + 10 years of relevant experience. MS preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nWe invite you to join us if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position! Individuals will work with PHY, MAC, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200451990": {"jobID": "200451990", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RF SoC Automation Tool Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451990/rf-soc-automation-tool-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 3+ years relevant experience required. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong software/scripting skills with background in Wireless RF systems fundamentals.Solid experience of building software tools and scripting to perform RF parametric testing such as EVM, RX sensitivity, ACPR, blocker testing, etc.Unix/Linux scripting knowledge with objected oriented programming experience such as Python is a requirement.Strong working knowledge of test equipment, such as; network analyzer, spectrum analyzer, vector signal analyzer, vector signal generator, etc.Proficiency with basic metrics for determining quality of digital communication signals measured.BS with 3+ years relevant experience required. MS preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nWe invite you to join us if you are looking for a challenging RF/Wireless Design Validation Test (DVT) Engineering position! Individuals will work with PHY, MAC, RFIC circuit designers and system integration engineers to do: RF bench testing, debugging, and characterizing RF Wireless SoC performance. Individuals will either automate mentioned tasks and/or help specify test procedures especially for tasks that are done repeatedly or require extensive setup."}, "200464560": {"jobID": "200464560", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Sr. RFIC Layout Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464560/sr-rfic-layout-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Experience in custom RF/analog layout for radio transceivers with extensive knowledge of deep sub-micron CMOS (FinFet experience is a must)Knowledgeable in layout techniques for device matching, minimizing parasitics, RF shielding, and high frequency routing.Solid understanding of RC delay, electromigration, and coupling.Understanding of guard rings, DNW, PN junctions, and advanced process effects such as LOD, WPE, etc.High level proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc. in FinFet Technology.Knowledge of CADENCE layout tools.Excellent communication skills and able to work with cross-functional teams.Capability to lead other layout engineers for top-level integration.Ability to recognize failure prone circuit and layout structures and proactively work with circuit designers for the best approach to resolve problems.Scripting skills in PERL or SKILL are a plus, but not required.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Wireless SoC Radio Team designs state-of-art highly energy efficient CMOS radios, from RF to bits. To deliver these radios, our team is responsible for the design of a wide range of RF, analog, and mixed-signal blocks from RF front-end amplifiers to data converters, including baseband filters, baseband and RF phase-locked loops, crystal oscillators, and bandgap references. We are working on new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this role, you will work closely with the RFIC design team to layout and verify custom RF and analog IP for complex SoC products. You will have a critical impact on developing Apple’s state-of-the-art radios and getting them into hundreds of millions of products."}, "200458036": {"jobID": "200458036", "origin_search": null, "posted": "Jan 28, 2023", "jobTitle": "Wireless Systems Validation Engineer – Modem Demodulation, RRM and Performance – RF Systems Cellular", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458036/wireless-systems-validation-engineer-modem-demodulation-rrm-and-performance-rf-systems-cellular?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 3+ years relevant experience required. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Practical knowledge of at least one Cellular Wireless technology including 2G, 3G, 4G or 5GPractical knowledge of cellular industry standards including 3GPP, Carrier specifications including performance requirements, compliance requirements and required testing methodologies.Experience and a deep understanding of Cellular Modem System performance parameters and their impact to RRM and Demodulation performance.Hands on experience with using Conformance lab test equipment for wireless testing.Use of log analysis and debug at the system SW level experience on cellular radio systems.Familiarity with radiated test setups, radiated chamber calibration and use is a plus.Ability to travel domestically and internationally.Strong written and verbal communication skills.BS with 3+ years relevant experience required. MS preferred.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work towards ensuring Apple products conform and go beyond all applicable cellular industry standards and regulatory requirements."}, "200420870": {"jobID": "200420870", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Media Applications Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420870/media-applications-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Programming skills preferably with JavaScript or C or C++Strong coding, unit testing and debugging skills.Creative problem solving and critical thinking skills.BS/MS in Computer Science or equivalentDesired, but not required:A deep understanding of modern JavaScript concepts and practicesExperience implementing a JS library or a framework.Familiarity or Experience with OpenGL or Other Graphics API.Knowledge of adaptive streaming technologies such as HTTP Live Streaming (HLS), DASH etc.Experience using HTML5 based video playback technologies such as MSE and EMEExperience with mobile devices, media players, smart TVs or set top boxes.Working knowledge of modern development tools like Babel, Webpack, NPM and Git.Experience with JavaScript performance optimization and familiarity with JavaScript memory and CPU profiling tools.Working knowledge of JavaScript Test Frameworks, Chai and Sinon.Working knowledge of media codecs, container formats and transport protocols.", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. \n\nThe Connected Media team is seeking a self-motivated Software Engineer to ensure a stellar Airplay Experience across the Apple Ecosystem. This team is a part of the Interactive Media Group (IMG) that provides the media and graphics foundation across all of Apple's innovative products including iPhone, iPad, Mac, tv, HomePod and the AirPod/Beats line of Products. \n\nWe are seeking an experienced Javascript App developer to join us to help develop the future of our products. We are the team that develops AirPlay and its related technologies for use in all of Apple’s products. We are building next generation of application software and services for delivering extraordinary media experiences to our customers. Perhaps you too can be a part of crafting, coding and delivering it!"}, "200451077": {"jobID": "200451077", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Touch HW EE Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451077/touch-hw-ee-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS in Computer Engineering, Electrical Engineering, or related technical discipline with relevant experience. MS/PhD preferred.\nPrior work or internship experience in analog/mixed-signal verification/validation/ product/application engineering is a major advantage."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.19", "max": "$67.78/hr,"}, "benefits": null, "requirements": "Strong fundamentals in analog/mixed-signal circuit conceptsHands-on experience with measurement instrumentation such as oscilloscopes, spectrum analyzers, source meters, soldering station etc. Experience with thermal chambers or thermo streams is a plusExperience with high-level programming languages. Data analysis or automation experience using Python/Matlab/Bash is a plus. Experience with data visualization or statistical analysis tools such as Tableau/SpotFire/JMP/Matlab or similar is a plusExperience with basic statistical measures. Exposure to statistical process control methodologies and product manufacturing is a major advantageExperience in debug, FA/CA (Failure Analysis/Corrective Action) is a major advantage. Creative problem solver with the ability to to use data to inform decisionsExcellent project management skills, written/verbal communication skills and solid people skillsExperience with Touch technology is a plusBS in Computer Engineering, Electrical Engineering, or related technical discipline with relevant experience. MS/PhD preferred.\nPrior work or internship experience in analog/mixed-signal verification/validation/ product/application engineering is a major advantage.", "jobDescription": "Work on launching next-generation touch technologies in Apple products. Bring devices to life and enable them to interact with users and the environment in ways never imagined before. The key goal of the touch technology team is to design the world’s best multi-touch user-experience. The touch technology team develops cutting-edge touch solutions and technologies that are central to Apple’s products, including iPhones, iPads, AppleWatch, and more. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. An engineer in this role ensures that Apple products meet the exacting touch performance standards in terms of hardware and user experience."}, "200339885": {"jobID": "200339885", "origin_search": null, "posted": "Sep 27, 2022", "jobTitle": "Touch HW EE Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200339885/touch-hw-ee-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS in Computer Engineering, Electrical Engineering, or related technical discipline with relevant experience. MS/PhD preferred.\nPrior work or internship experience in analog/mixed-signal verification/validation/ product/application engineering is a major advantage."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong fundamentals in analog/mixed-signal circuit conceptsHands-on experience with measurement instrumentation such as oscilloscopes, spectrum analyzers, source meters, soldering station etc. Experience with thermal chambers or thermo streams is a plusExperience with high-level programming languages. Data analysis or automation experience using Python/Matlab/Bash is a plus. Experience with data visualization or statistical analysis tools such as Tableau/SpotFire/JMP/Matlab or similar is a plusExperience with basic statistical measures. Exposure to statistical process control methodologies and product manufacturing is a major advantageExperience in debug, FA/CA (Failure Analysis/Corrective Action) is a major advantage. Creative problem solver with the ability to to use data to inform decisionsExcellent project management skills, written/verbal communication skills and solid people skillsExperience with Touch technology is a plusBS in Computer Engineering, Electrical Engineering, or related technical discipline with relevant experience. MS/PhD preferred.\nPrior work or internship experience in analog/mixed-signal verification/validation/ product/application engineering is a major advantage.", "jobDescription": "Work on launching next-generation touch technologies in Apple products. Bring devices to life and enable them to interact with users and the environment in ways never imagined before. The key goal of the touch technology team is to design the world’s best multi-touch user-experience. The touch technology team develops cutting-edge touch solutions and technologies that are central to Apple’s products, including iPhones, iPads, AppleWatch, and more. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. An engineer in this role ensures that Apple products meet the exacting touch performance standards in terms of hardware & user experience."}, "200460713": {"jobID": "200460713", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Systems Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460713/systems-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong understanding of CPU/GPU/storage and systems architecture fundamentalsExperience with power and/or thermal management for CPU/GPU/systemsExperience in performance measurement and analysisExpertise in hardware and/or software development and knowledge of operating systems fundamentals is desirableExperience with macOS and scripting skills (python, shell, perl, etc.) are a plusMost of our engineers have advanced degrees in Electrical Engineering (EE), Computer Engineering (CE), or Computer Science (CS). However, if you’ve followed a different path to expertise in hardware engineering, we still want to hear from you.", "jobDescription": "At Apple, our products touch millions of lives each day with consistency and dependability. Ever wonder how we achieve this? \n\nOur System Architecture & Design team is a group of interdisciplinary performance architects and expert content creation professionals who explore real production workflows and discover opportunities to enhance and improve customer experiences on current hardware and software. \n\nThe System Performance Engineer role requires a broad knowledge of system architecture from a hardware and software perspective. You must be skilled in solving complex problems and work on evaluating and improving the performance of Mac systems under development. Responsibilities in this role will include but are not limited to, the evaluation of system and device-level characteristics from low level device metrics. This is done through device and system-level power management, driver optimizations, OS interactions, and application workflows. In addition, the architect will identify performance bottlenecks, inefficiencies, and architectural improvement areas and work with internal teams and external vendors to address them. Strong teamwork, communication, and interpersonal skills are a must!"}, "200304093": {"jobID": "200304093", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Hardware Systems Architect - Apple Watch", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200304093/hardware-systems-architect-apple-watch?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE required; MSEE is a strong plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Review & influence module roadmaps; keep current with technology trends; Multi-functional collaboration with other module and SW teamsWork with x-functional engineering managers and architects on HW/SW enabling technologiesCreate internal and external system specificationsReview & influence system performance decisionsDefine, simulate, and model product performance vs. power, area, cost and schedule.Specify, negotiate, and document system power management & user level behaviorsDefine, develop, and utilize tools, scripts for system modeling and analysis; tool and model development and maintenanceAssess and track product system integration risks & implementation trade-offs with early fit studiesUse schematic and layout tools such as Cadence Concept & Allegro; develop new and novel methods of pre-route guidanceAssess hi-speed interface needsPredict & prepare for future product system integration & interconnect needsMentor junior engineer for standard methodologies in systems developmentPrototyping, bring-up and debuggingPeak power and battery life modeling/characterization of new features and definition of mitigation strategies to minimize impacts.Basic RF link budget analysis, analog and sensor or audio signal chain analysis.BSEE required; MSEE is a strong plus.", "jobDescription": "Watch is the most personal device we have. It has become part of our outfit and being worn on the wrist it can do things our other devices can’t. It is a fitness partner that’s always there. It keeps us connected to the people and things we care about most and it’s always looking out for us.\n\nThe Watch Architecture team is responsible for architecting every new Watch product from early concept phase to detailed block diagrams that can be executed on. This work includes close collaboration with both internal and external technology, silicon and module development teams on new feature exploration and improvements, definition of key silicon and/or chipset selection and nailing down system interactions and trade offs.\n\nYou ideally have strengths in several functional areas to lead, drive or influence system module roadmaps and feature definitions. You should have experience analyzing systems, making architectural and implementation trade-offs; design of high performance, low power, high quality products; scope component area requirements, interconnect requirements, integration challenges, Signal & Power integrity, Electromagnetic coexistence and power budgeting and analysis. This position requires strong written and verbal communication skills."}}