{"200456363": {"jobID": "200456363", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "RAN1/RAN4 Standards Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456363/ran1-ran4-standards-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10 + years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for candidates with in-depth knowledge on wireless communication system (OFDM/MIMO, etc.)A background in 3GPP standardization in RAN1 or RAN4 is a significant plus.Deep understanding of communication theory & signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, coding theory, etc.)Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.BS and 10 + years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our 5G standards team, you will demonstrate your physical layer system design expertise or your experience in standardization activities to chip in to groundbreaking wireless systems and algorithms that deliver more performance in our products than ever before. You’ll be part of an outstanding system engineering organization making technical contributions towards 4G and 5G specifications and providing support to modem system design. You will actively attend and participate in 3GPP (LTE and 5G-NR) meetings, conduct system simulations of PHY algorithms for a 5G multimode modem."}, "200461296": {"jobID": "200461296", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "ASIC Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461296/asic-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Power architecture, including supply scheme experienceVery early-stage power estimationPower team lead and XF team communication experiencePre-silicon power modeling, analysis and power reduction experience. Proficient in PTPX, Power Artist or other power analysis tools. Full chip experience is a plusPost-silicon power correlation experience. Full chip experience is a plusGood understanding of Low Power ASIC logic design and UPF; Actual design experience is a plusGood understanding of ASIC physical design, timing closure; Actual implementation experience is a plusProficiency in scripting languages (Shell, Perl or Python)System architecture knowledge is a bonus.Basic knowledge on wireless protocols, e.g., WiFi, BTBasic knowledge on common SOC components, e.g., CPU, fabric, peripherals and PCIeStrong problem solving and analytical skillsBS + 10 years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient / low power design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC/Power architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, Power modeling / correlation and FW/SW engineering. \nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. \nWill you join us and do the work of your life here?"}, "200461966": {"jobID": "200461966", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "iPhone/iPad Hardware Validation Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461966/iphone-ipad-hardware-validation-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor Degree in Engineering, EE/CE degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong electrical engineering fundamentals and experience working on high-volume consumer electronics.Highly organized with willingness for project management and issue trackingExperience with high-speed and low-speed interfaces (e.g. I2C, SPI, USB, PCIe, MIPI) including protocol and electrical complianceHands-on experience with hardware bring-up and bench measurements for signal and power integrity.Expertise with lab test set-up and equipment (e.g. high-speed oscilloscope, logic analyzer, power supplies, spectrum analyzers)Ability to root-cause issues and recommend design improvements.Familiarity with scripting languages and instrument automation (e.g. Python, LabView)Knowledge of power electronics, including DC-DC converters.Excellent verbal and written communication skills.Desire for a fast-paced environment; calm under pressure.Bachelor Degree in Engineering, EE/CE degree preferredPosition will require some international travel.", "jobDescription": "products.\n\nAs an iPhone/iPad Hardware Validation Lead, you will be an authority who is responsible for delivering electrical validation breakthroughs from first prototype through launch in a fast-paced environment. Using interpersonal and technical skills, you will operate seamlessly with the iPhone/iPad System Integration Team to yield the highest quality results.\n\nYou are someone with strong electrical engineering fundamentals, hard-working, willing to be hands-on with debugging efforts, and able to work expertly with multiple engineering teams to close a list of critical tasks and improve our designs. In this role, you will have the opportunity to deep-dive into technical issues, develop and maintain validation automation code, and help mitigate project risks."}, "200441505": {"jobID": "200441505", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Static Timing Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441505/static-timing-analysis-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The position requires detailed knowledge of the ASIC design timing closure flow and methodology. The ideal candidate will have the following background:Hands-on experience in ASIC timing constraints generation and timing closure.Expertise in STA tools (such as Primetime) and methodologies for timing closure with a good understanding of OCV, noise and crosstalk effects on timing.Deep understanding and experience in timing closure of various test modes such as scan shift, scan capture, atspeed and BIST testing.Understand and implement improving existing methodologies and flows. Experience in reducing the number of timing signoff corners by merging different timing modes is helpful.Strong background in Constraint analysis and debug, using industry standard tools such as Synopsys CA (Constraint Analyzer).Knowledge of timing corners/modes, process variations and signal integrity related issues.Hands on experience in timing/SDC constraints generation and management.Knowledge of low-power techniques including clock gating, power gating and multi-voltage designs.Proficient in scripting languages (Tcl and Perl/Python).Strong interpersonal skills are a pre-requisite as the candidate will collaborate with a lot of diverse groups (e.g. digital design, DFT, physical design, etc.).Familiarity with synthesis, logic equivalence, DFT and backend related methodology and tools.Self-starter and highly motivated.BS and 3+ years of relevant industry experience required", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? Do you intrinsically see the importance in every detail? As a member of our dynamic Cellular group, you'll be at the heart of chip design! You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions.\nAs an ASIC STA engineer, you will be responsible for all aspects of timing including, working with designers for timing constraints generation, helping construct/modify flows, timing analysis and timing closure."}, "200458033": {"jobID": "200458033", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "PHY Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458033/phy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 0+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "BS and 0+ years of relevant industry experience.Work closely with system/design team to review and understand PHY subsystem microarchitecture, create verification plans from specifications.Build block/subsystem level test benches with reference model, using best in class DV methodology. Architect test benches with maximum reusability in mind.Develop and execute both directed and constrained random tests, debug failures, manage bug tracking, and work with designers to drive closure of issues found.Create and analyze block/subsystem level coverage model, and add test cases to increase coverage.Support PHY subsystem validation using Palladium and/or FPGA.BS and 0+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly."}, "200456683": {"jobID": "200456683", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "ASIC Design Engineer - Pixel IP", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456683/asic-design-engineer-pixel-ip?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree +0 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Knowledge of front-end ASIC RTL digital logic design using Verilog or System Verilog.Strong problems-solving skills using finite state machines, pipelining, parallelism, and similar computer-architecture fundamentals.Good collaboration skills with excellent written and verbal communication skills.Prefer familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB).Knowledge of front-end implementation tasks such as synthesis and timing/area/power analysis.Prefer familiarity with relevant scripting languages (Python, Perl, TCL).Bachelor's Degree +0 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly transparent role, you will be at the center of the Pixel IP design effort to capture and display alluring images and video. You will collaborate with all fields, making a critical impact getting functional products to millions of customers quickly."}, "200451529": {"jobID": "200451529", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless System Automation Development Engineer Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451529/wireless-system-automation-development-engineer-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS+10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "This is a lead role that requires industry experience in architecting and implementing test and automation systems within wireless communication systems.Experience developing test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI, database, reporting tools).Experience with Python and/or C/C++.Experience using, and a basic understanding of the theory of operation of, wireless test lab equipment (spectrum analyzer, signal generator, network analyzer, power meter).Minimum qualification is BS+10 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before."}, "200449511": {"jobID": "200449511", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Senior Wireless PHY Standards Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449511/senior-wireless-phy-standards-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven track record of participation and technical leadership in wireless standardization organization, such as IEEE 802.11, IEEE 802.15, Bluetooth, UWB, or similar technologiesStrong familiarity with PHY algorithms and architectures of wireless standards, such as IEEE 802.11, IEEE 802.15, Bluetooth SIG, or similar technologiesIn-depth knowledge on wireless communication systems, architectures, protocols and algorithmsIn-depth knowledge of wireless communication techniques, such as SU/MU-MIMO, OFDM, OFDMA, beamforming, FEC, etc.Deep understanding of communication theory and signal processingMust have strong analytical and problem-solving skillsExperience with MATLAB or C/C++ for modeling and simulationsExperience with PHY modem architecture, algorithms, and hardware design is a plusExperience with PHY/MAC cross-layer algorithm design is a plusAbility to present complex technical concepts in a clear and organized mannerHave a strong and proven leadership ability is a plusAbility to work closely with and drive cross-functional teamsSelf-motivated and passionate to solve problems in innovative waysBS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "As a Senior Wireless PHY Standards Architect, you will be responsible for driving and designing the next generation of physical layer for wireless technologies. You will get to influence the standards process by participating in the meetings, making technical contributions, and driving company strategic interests. In addition, you will be responsible for creating new PHY layer IPs and developing innovative proprietary cross-layer algorithms for new and emerging applications. You will also actively work with internal teams to keep them apprised of the development and direction of the standards; help them define features, requirements, and architectures, generate new ideas and features, and achieve best-in class and robust product performance in all environments. In addition, you will collaborate with cross-functional teams to innovate, drive wireless architectures, incubate ideas for new generations of wireless communication systems, and participate in the development of emerging applications and devices. As a member of the silicon design group, you will be responsible for developing state-of-the-art wireless SoC products that are enjoyed by millions of Apple customers."}, "200451366": {"jobID": "200451366", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451366/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master’s Degree or Bachelor’s Degree in technical subject area. Prefer minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Deep knowledge of SystemVerilog and UVMDeep knowledge in developing scalable and portable test-benchesRelevant experience with verification methodologies and tools such as simulators, waveform viewersBuild and run automation, coverage collection, gate level simulationsDeep UVM knowledge, C/C++  level knowledgeDeep experience with serial protocols such as PCIe or USB, parallel protocol such as DDRBasic knowledge of formal verification methodologySome experience with power-aware (UPF) or similar verification methodologyExcellent knowledge of one of the scripting languages such as Python, Perl, TCLMaster’s Degree or Bachelor’s Degree in technical subject area. Prefer minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an outstandingly hardworking design verification engineer. As a member of our wide-ranging group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. \n\nThis role is for a digital-focused DV engineer who will enable us to produce fully functional first silicon for IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200294300": {"jobID": "200294300", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200294300/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical subject area with minimum 10 years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Good proven understanding of System Verilog test-bench language and UVMValidated experience developing scalable and portable test-benchesShown experience with verification methodologies and tools such as simulators, waveform viewers, build/run automation, coverage collection, gate level simulationsExperience with IP verification methodologyIn lieu of UVM knowledge, C/C++ knowledgeSignificant experience with DDR PHY/Controller and/or High Speed SerDesDeep knowledge of one of the scripting languages: Python, Perl, TCLKnowledge of formal verification methodology a plusKnowledge of UPF definitely a plusBS degree in technical subject area with minimum 10 years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a transformative and unusually talented design verification engineer. \n\nAs a member of our multifaceted group, you will have the rare and exciting opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Do your life’s best work here at Apple! This role is for a DV engineer who will enable bug-free first silicon for the IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200451263": {"jobID": "200451263", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451263/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Extensive knowledge of SystemVerilog test-bench language and UVMExperience developing scalable and portable test-benchesExperience with verification methodologies and tools such as simulators, waveform viewers, build and run automation, coverage collection, gate level simulationsSome working experience with different DDR protocols including Low power versionShould have been in technical lead positionExperience with IP verification methodology for IPs such as PHYs, PLLs etc.Working knowledge of one of the scripting languages: Python, Perl, TCLBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and unusually talented Design Verification Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.  Do your life’s best work here at Apple! This role is for a design verification engineer who will enable bug-free first silicon for the IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200438203": {"jobID": "200438203", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438203/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Melbourne", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep knowledge of System Verilog test-bench language and UVMValidated experience developing scalable and portable test-benchesValidated experience with verification methodologies and tools such as simulators, waveform viewers, build/run automation, coverage collection, gate level simulationsExperience with IP verification methodologyIn lieu of UVM knowledge, C/C++ authority knowledgeSignificant experience with DDR PHY or ControllerDeep knowledge of one of the scripting languages: Python, Perl, TCLDeep knowledge of formal verification methodologyBS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a progressive and unusually versatile Design Verification Engineer. \n\nAs a member of our wide-ranging group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Do your life’s best work here at Apple! This role is for a DV engineer who will enable bug-free first silicon for the IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200446121": {"jobID": "200446121", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446121/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Good working knowledge of System Verilog test-bench language and UVMProven experience developing scalable and portable test-benchesProven experience with verification methodologies and tools such as simulators, waveform viewers, build/run automation, coverage collection, gate level simulationsExperience with IP verification methodologyIn lieu of UVM knowledge, C/C++ expert knowledgeSignificant experience with DDR PHY/Controller and/or High Speed SerDesDeep knowledge of one of the scripting languages: Python, Perl, TCLKnowledge of formal verification methodology a plusKnowledge of UPF definitely a plusBS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and unusually talented design verification engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Do your life’s best work here at Apple! This role is for a DV engineer who will enable bug-free first silicon for the IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200456353": {"jobID": "200456353", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "RAN1/RAN4 Standards Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456353/ran1-ran4-standards-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10 + years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "We are looking for candidates with in-depth knowledge on wireless communication system (OFDM/MIMO, etc.)A background in 3GPP standardization in RAN1 or RAN4 is a significant plus.Deep understanding of communication theory & signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, coding theory, etc.)Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.BS and 10 + years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our 5G standards team, you will demonstrate your physical layer system design expertise or your experience in standardization activities to chip in to groundbreaking wireless systems and algorithms that deliver more performance in our products than ever before. You’ll be part of an outstanding system engineering organization making technical contributions towards 4G and 5G specifications and providing support to modem system design. You will actively attend and participate in 3GPP (LTE and 5G-NR) meetings, conduct system simulations of PHY algorithms for a 5G multimode modem."}, "200464377": {"jobID": "200464377", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Compensation Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464377/compensation-program-manager?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in relevant field (MBA a plus)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$156,000", "max": "$234,000,"}, "benefits": null, "requirements": "Candidate will have achieved a track record of consistent success leading Compensation programs, with 7-10+ years of demonstrable experience at a multi-national company.Experience in High-Tech and/or Consulting industries preferred.Experience with crafting, developing and maintaining compensation programs, including incentive design programs and pay/ salary structures.Deep knowledge of competitive market pay practices and compensation design strategies.Proven team orientation with collaborative style. Flexible demeanor and a strong ability to get involved in details while maintaining wider view.Strong influencing skills with the ability to communicate clearly and confidently when working with others.Independent, self-starter with the ability to successfully balance multiple priorities and manage ambiguity in a sophisticated matrix structure.Excellent process management, planning and organizational skills. Resilient and determined to ensure projects and results are achieved.Robust analytical skills and business sense, with an ability to see the implications of actual and planned activities, contributing to management decisions.Proven track record to learn on the fly and maintain composure in a fast-paced environment.Pragmatic, quick-thinking, and results oriented, with a solid bias for customer service.Excellent oral and written communication skills required. Additional language skills a plus.High integrity and ethics in handling confidential information.Attention to detail and commitment to excellence.Exceptional Excel/spreadsheet skills.Experience with Workday preferred.Both domestic & international travel may be required for this role.Bachelor’s degree in relevant field (MBA a plus)", "jobDescription": "At Apple, our number one resource is our people. As a Compensation Programs Manager, you will help lead the design, development, communication and administration of global pay structures and incentive plan compensation programs. When it comes to attention to detail, leading projects, deadlines, communications, and ideas in different time zones, you’ve got it under control. This position will partner with Compensation Business Partners as well as team members from Finance, Recruiting, Systems teams and other People team functions to deliver effective and innovative compensation programs in alignment with Apple’s Global Compensation Philosophy."}, "200450078": {"jobID": "200450078", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Mixed-Signal Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450078/mixed-signal-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Industry verification experience with RF/Mixed-Signal blocks and SOCs.Expertise building Mixed-Signal testbenches, checkers and tests using System Verilog.Expertise creating and using real-numbered analog behavioral models in System Verilog/Verilog-AMS.Experience in HVL methodology (UVM/OVM/VMM) and HDL (System Verilog, Verilog) for verification.Strong verification skills in problem solving, constrained random testing, and debugging.Understanding of common analog/RF blocks.Experience with signal processing using Python or Matlab a plus.Experience with Virtuoso Composer, ADE, and HED a plus.Team spirit, excellent communication skills and the desire to take on diverse challenges.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this role, you will be verifying RF/Mixed-Signal blocks and SOCs using SystemVerilog to create testbenches, checkers, models and tests. You will build and execute test plans to meet project schedule and metric requirements, including coverage metrics."}, "200451546": {"jobID": "200451546", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless System Automation Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451546/wireless-system-automation-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS+ 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "This is an individual technical contributor role that requires industry experience in integration, bringing up and productization of wireless communication systems.Understanding of communication theory and radio calibration algorithms (such as power control and RF impairment mitigation).Experience using and understanding of the theory of operation of lab equipment (spectrum analyzer, signal generator, network analyzer, power meter).Experience developing test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Knowledge in existing wireless communication protocols: LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay, or Bluetooth/BLE.Extensive Experience with Python, Matlab, Shell scripting, and/or C/C++.Experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI, database, reporting tools).Minimum qualification is BS+ 3 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before."}, "200421549": {"jobID": "200421549", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Apple Part Time Reseller Sales Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200421549/apple-part-time-reseller-sales-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Humble", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. \n\nIt starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner, you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200443766": {"jobID": "200443766", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "Apple Part Time Reseller Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443766/apple-part-time-reseller-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Asheville", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends,  24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200463512": {"jobID": "200463512", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Apple Part Time Reseller Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463512/apple-part-time-reseller-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Miami Beach", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200457939": {"jobID": "200457939", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Apple Part Time Reseller Sales Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457939/apple-part-time-reseller-sales-specialist?team=APPST", "jobLocation": {"remote": "not specified", "city": "Webster", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills, you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a Reseller Store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. \nYou understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. \nEvery day you’ll encounter unique opportunities to change lives and make a difference."}, "200464754": {"jobID": "200464754", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "SoC Physical Design Engineer, Top Level", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464754/soc-physical-design-engineer-top-level?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Knowledgeable in partition or top level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Experience with Top Level a plus, but not required.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this highly visible role, you will be responsible for implementing complete chip design from netlist to tapeout."}, "200464520": {"jobID": "200464520", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Image Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464520/image-quality-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Image Science, Color Science, CS/CE, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Solid understanding of subjective/objective image quality evaluationKnowledge of ISP pipeline and 3A evaluationStrong image/video photography skillsExperience & proficiency in C or C++ or SwiftExperience & proficiency in MATLAB or PythonFocus on details and possess strong problem solving and analytical skillsExcellent written and verbal communication skills and ability to collaborate and work cross functionallyBS or MS in Image Science, Color Science, CS/CE, or equivalent experience", "jobDescription": "We are an Image Quality team in the Video Engineering team, responsible for video quality on iPhone/iPad, Mac products and some other future products! We are seeking an outstanding Engineer who has good understanding of lab image quality test automation and real world image quality verification to help us deliver the best camera image quality to the world!"}, "200406851": {"jobID": "200406851", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - California State University Bakersfield", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406851/apple-support-college-program-california-state-university-bakersfield?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Bakersfield", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$22.00", "max": "$22.00."}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406760": {"jobID": "200406760", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of North Carolina, Wilmington", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406760/apple-support-college-program-university-of-north-carolina-wilmington?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Wilmington", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406352": {"jobID": "200406352", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Alabama A&M University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406352/apple-support-college-program-alabama-a-m-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Huntsville", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406756": {"jobID": "200406756", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of North Carolina, Greensboro", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406756/apple-support-college-program-university-of-north-carolina-greensboro?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Greensboro", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406842": {"jobID": "200406842", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of Texas at El Paso", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406842/apple-support-college-program-university-of-texas-at-el-paso?team=STDNT", "jobLocation": {"remote": "not specified", "city": "El Paso", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406765": {"jobID": "200406765", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of California, Davis", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406765/apple-support-college-program-university-of-california-davis?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Davis", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$23.00", "max": "$23.00."}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406685": {"jobID": "200406685", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - North Carolina Central University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406685/apple-support-college-program-north-carolina-central-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Durham", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406470": {"jobID": "200406470", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Georgia State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406470/apple-support-college-program-georgia-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Atlanta", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406367": {"jobID": "200406367", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - Arizona State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406367/apple-support-college-program-arizona-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Tempe", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406779": {"jobID": "200406779", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - University of Florida", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406779/apple-support-college-program-university-of-florida?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Gainesville", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406690": {"jobID": "200406690", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Apple Support College Program - At Home Advisor", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406690/apple-support-college-program-at-home-advisor?team=STDNT", "jobLocation": {"remote": "not specified", "city": "San Jose", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$27.75", "max": "$27.75."}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200406509": {"jobID": "200406509", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program - North Carolina A&T State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406509/apple-support-college-program-north-carolina-a-t-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Greensboro", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200387602": {"jobID": "200387602", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Apple Support College Program At Home Advisor", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200387602/apple-support-college-program-at-home-advisor?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!"}, "200450749": {"jobID": "200450749", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - Columbia University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450749/campus-leader-columbia-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$25.75", "max": "$25.75."}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200420043": {"jobID": "200420043", "origin_search": null, "posted": "Sep 1, 2022", "jobTitle": "Production Manager, Digital Content Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420043/production-manager-digital-content-manager?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "KEY QUALIFICATIONS5+ years of experience in technology, operations, e-commerce and/or customer support organization.3+ years people management with a focus on building and motivating a high performing team.In-depth knowledge and experience with online content management for both web and mobile platforms.A quick, technically-minded learner that is willing to roll up their sleeves to grasp the numerous tools and systems used across DCM every day.A thoughtful and organized problem-solver that can adapt to constant change and ambiguous situations while simultaneously driving multiple complex projects.An open, communicative, and reliable leader who is able to collaborate closely with cross-functional partners, organizational leaders, as well as direct reports.Demonstrated success in business process optimization.Ability to remain calm and good-natured while experiencing ambitious deadlines.Able to accommodate flexible work schedule during critical business periods.Exhibits high degree of ownership and accountability.Strong communication skills.Foreign language proficiency is a plus.BA/BS or equivalent experience", "jobDescription": "The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries! It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nDo you love problem solving and thinking beyond an obvious solution? The Apple Online Store is seeking a dynamic, web savvy content management professional to join the Digital Content Management (DCM) Production team. A highly energetic execution group, the numerous teams within DCM work together to deliver the extraordinary online shopping experience expected from Apple. We work hard and have a good time doing it!\n\nAs a Manager on the DCM Production team, you will be responsible for leading Content Specialists and handling high profile projects that touch content across multiple platforms and apps worldwide. From leading product launches to marketing initiatives, feature changes to daily updates, you and your team’s work will directly impact the experience for millions of Apple customers across the globe. \n\nYou will be part of a tight-knit global team, driving high quality results while meeting ambitious deadlines. You are a thoughtful and effective leader, deeply detail oriented, and comfortable with change and uncertainty in a dynamic work environment."}, "200464100": {"jobID": "200464100", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464100/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Knowledgeable in partition level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this visible role, you will be directly responsible for the physical implementation of design partition(s) (from netlist to tapeout) for a highly complex SOC utilizing innovative process technology."}, "200427059": {"jobID": "200427059", "origin_search": null, "posted": "Oct 3, 2022", "jobTitle": "Car Experience Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200427059/car-experience-systems-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science, Electrical Engineering, or related degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience working in a technical position with automotive displaysProject leadership responsibilities, including executive communicationExcellent cross-disciplinary debugging and problem solving skillsExcellent communication and collaborative skillsCreativity and enthusiasm for designComfort with complex systems, fast-paced environments, and tight schedules10 years automotive industry experience and/or experience shipping high-volume consumer productsWillingness to travel up to 25%Experience with in-vehicle infotainment systems preferredBS in Computer Science, Electrical Engineering, or related degree.", "jobDescription": "The iOS Car Experience team gives customers smarter, safer ways to use iPhone in the car. We craft solutions like CarPlay and Driving Focus Mode, and we also partner with a broad multi-functional team inside Apple to deliver experiences such as digital car key. We work hand-in-hand with automakers worldwide to integrate features into nearly every new vehicle shipping today, features that drivers love and use every day.\n\nThe iOS Car Experience team is looking for an enthusiastic, highly motivated senior systems engineer with 10+ years experience to help provide technical design and development support to automotive partners from initial concept through production launch. You will join a hands-on development team that cultivates creativity and generates novel solutions to deliver fantastic automotive user experiences with iOS devices."}, "200439212": {"jobID": "200439212", "origin_search": null, "posted": "Oct 26, 2022", "jobTitle": "Display Power Silicon Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439212/display-power-silicon-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MSEE in power electronics with 10+ years experience must. PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Candidate must have direct experience of power supply design and possess deep knowledge of DC-DC power conversion topologies includingcontrols loop.Candidate must be intimately familiar with DC-DC IC architectures, magnetic design, PCB layout and state-of the art techniques for integration andefficiency optimizations.Strong analytical/problem solving skills and ability to guide critical decisionsMust possess good understanding of thermals, mechanical and packaging challenges. Must possess knowledge of high volume manufacturing technologies and production variance.Must be able to use of Spice and behavioral simulation tools, Matlab, MathCad, Cadence and Excel mathematical analysis.Must have deep knowledge of silicon physics and silicon processes including IC packaging technologies.Must be familiar with challenges of mixed-signal ICs design. Must posses knowledge and experience with both analog and digital design with an emphasis on analog. Must know the complete methodology of mixed-signal IC from a concept to a MP.Must be highly motivated, self-starter with innovation, integrity and attention to details.Ability to work well with cross-functional teams is extremely importantProven track record of working in fast paced innovative work environmentApple Confidential | Display Silicon TeamIdeal candidate is with work experience in power management semiconductor/silicon companies and computer industry.Must be willing to occasional overseas travel as needed.MSEE in power electronics with 10+ years experience must. PhD preferred.", "jobDescription": "This is an excellent opportunity to work on the forefront of new power management technologies with the exemplary company consistently bringing innovations in the industry. In this position, you will be part of a team developing innovative concepts, and key mixed-signal ICs which are implemented in display products used by many millions of people. The position primarily involves advance power architecture development and key power ICs for Apple’s next generation products spanning watch, mobile phones, notebook computers, desktop computers and other line of products. This is a unique opportunity for “out of the box thinker” who can enable innovative technologies and superior integrations for next generation power management systems in Apple display products. This is a unique opportunity to work with the best display architects and system designers in Apple and shape its innovative products."}, "200450196": {"jobID": "200450196", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450196/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Knowledgeable in partition level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Familiar with typical SOC issues such as multiple voltage and clock domains and mixed signal block integration.Familiar with various process-related design issues including Design for Yield and Manufacturability and multi-vt strategies.From a CAD perspective, experience with floorplanning tools, P&R flows, global timing verification, and physical design verification flows.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this visible role, you will be directly responsible for the physical implementation of design partition(s) (from netlist to tapeout) for a highly complex SOC utilizing innovative process technology."}, "200464127": {"jobID": "200464127", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464127/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Knowledgeable in partition level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Familiar with typical SOC issues such as multiple voltage and clock domains and mixed signal block integration.Familiar with various process-related design issues including Design for Yield and Manufacturability and multi-vt strategies.From a CAD perspective, experience with floorplanning tools, P&R flows, global timing verification, and physical design verification flows.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this visible role, you will be directly responsible for the physical implementation of design partition(s) (from netlist to tapeout) for a highly complex SOC utilizing innovative process technology."}, "200464112": {"jobID": "200464112", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464112/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Knowledgeable in partition level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Familiar with typical SOC issues such as multiple voltage and clock domains and mixed signal block integration.Familiar with various process-related design issues including Design for Yield and Manufacturability and multi-vt strategies.From a CAD perspective, experience with floorplanning tools, P&R flows, global timing verification, and physical design verification flows.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this visible role, you will be directly responsible for the physical implementation of design partition(s) (from netlist to tapeout) for a highly complex SOC utilizing innovative process technology."}, "200461294": {"jobID": "200461294", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "ASIC Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461294/asic-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Power architecture, including supply scheme experienceVery early-stage power estimationPower team lead and XF team communication experiencePre-silicon power modeling, analysis and power reduction experience. Proficient in PTPX, Power Artist or other power analysis tools. Full chip experience is a plusPost-silicon power correlation experience. Full chip experience is a plusGood understanding of Low Power ASIC logic design and UPF; Actual design experience is a plusGood understanding of ASIC physical design, timing closure; Actual implementation experience is a plusProficiency in scripting languages (Shell, Perl or Python)System architecture knowledge is a bonus.Basic knowledge on wireless protocols, e.g., WiFi, BTBasic knowledge on common SOC components, e.g., CPU, fabric, peripherals and PCIeStrong problem solving and analytical skillsBS + 10 years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient / low power design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC/Power architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, Power modeling / correlation and FW/SW engineering. \nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. \nWill you join us and do the work of your life here?"}, "200442526": {"jobID": "200442526", "origin_search": null, "posted": "Nov 8, 2022", "jobTitle": "Technical Writer (SPG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442526/technical-writer-spg?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Phoenix", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in Communications, English, Journalism, or related field. Advanced degree or certification in Technical Writing preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum of 3-5 years technical writing and copy editing experienceDemonstrated ability to write well-crafted, easy-to-consume documentationExperience writing release notes or similar documents for a fast-paced development environmentExpert Confluence userExperience with JIRA or similar project-management toolsKnack for identifying the key objectives of a document for knowledge checks or other assessmentsExcellent communication skills and writing capabilitiesExceptional attention to detailAbility to work collaborativelyStrong knowledge of the Mac/iOS platforms and Apple softwareProcess-orientedBachelors in Communications, English, Journalism, or related field. Advanced degree or certification in Technical Writing preferred.Approximately 25% travel is necessary.", "jobDescription": "At Apple, we take pride in surprising and delighting our customers with innovative products and services that enrich lives. The people here at Apple explore ideas that create new markets and revolutionize how people live. They believe better solutions exist and focus on defining and perfecting them. Bring your passion, dedication, and expertise and find out how much you can make a difference. Join Apple, and help us make the world better for our future generations.\nWithin Special Projects Group’s Learning & Development team, we are looking for an experienced technical writer who has a passion for crafting well-structured, succinct, clear, and accurate messaging. We want you to help us showcase the value of documentation, empowering each reader with mission-critical knowledge and skills that will fuel our Research and Development organization. Your technical writing expertise, vision for what great documentation looks like, and passion to boil details down to the ground truth will support this key vertical."}, "200466315": {"jobID": "200466315", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Content Development Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466315/content-development-manager?team=CUST", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in technical communication, writing/composition, or similar field. Master’s degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of related experience with a demonstrated track record of success managing a content team and working with multi-media contentAbility to build strong internal and external relationshipsPersuasive and effective at interacting with all roles and levels across organizationResults-driven with a world-class attention to detail and remarkable follow-throughSuperb organizational skills and an ability to juggle multiple projects on tight timelinesAble to rapidly understand the other party’s concerns and evaluate a range of solutions by being a great listenerStrong problem solving skillsPossess a professional and credible demeanorExcellent collaborative skillsExperience working with multiple content reviewers and incorporating feedback from marketing and engineering teamsFamiliarity with customer support content, including internal and knowledge basePassion for providing a great user experienceExcellent verbal, written, and interpersonal skills and the ability express ideas clearly and diplomaticallyExperience collaborating with cross-functional external teams in addition to writers, visual designers, SEO, and subject matter experts**Nice to Have:Experience writing, editing and programming content in a CMSExperience managing content in multiple languagesBachelor’s degree in technical communication, writing/composition, or similar field. Master’s degree preferred", "jobDescription": "The AppleCare Online Content Development team is looking for a skilled manager to lead a technical writing team that is publishing a variety of global content across various channels. The role interacts with stakeholders across the business and requires superb collaboration, communication, organization and content production abilities. You will partner closely with content strategists, marketing, engineering and localization teams to meet the needs of a global audience and help develop new streams of content."}, "200452595": {"jobID": "200452595", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless SoC Silicon Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452595/wireless-soc-silicon-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+  years of experiences in SoC integration and Low Power ASIC designHands on experience with PTPX and Power Artist power analysis toolsProficiency in ASIC logic designExperience with SoC power management design including power gating, isolation, retention and DVFS techniquesDeep understanding of ASIC low power design techniques, e.g. Power analysis, UPF, VCLPSoC level clock mesh / reset design experience desirableProficiency in scripting languages (Shell and Perl highly desirable, Python skills are a plus)SoC top-level integration experience is a plusSystem architecture knowledge is a bonusSilicon validation / power measurement experience is a plusBS and 3+ years of relevant industry ExperienceBS and 3+ years of relevant industry Experience", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply."}, "200449302": {"jobID": "200449302", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Wireless SoC Silicon Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449302/wireless-soc-silicon-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10 years of relevant industry Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "5+  years of experiences in SoC integration and Low Power ASIC designHands on experience with PTPX and Power Artist power analysis toolsProficiency in ASIC logic designExtensive experience with SoC power management design including power gating, isolation, retention and DVFS techniquesDeep understanding of ASIC low power design techniques, e.g. Power analysis, UPF, VCLPSoC level clock mesh / reset design experience desirableProficiency in scripting languages (Shell and Perl highly desirable, Python skills are a plus)SoC top-level integration experience is a plusSystem architecture knowledge is a bonusSilicon validation / power measurement experience is a plusBS and 10 years of relevant industry ExperienceBS and 10 years of relevant industry Experience", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply."}, "200456377": {"jobID": "200456377", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Wireless SoC Silicon Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456377/wireless-soc-silicon-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of experiences in SoC integration and Low Power ASIC designHands on experience with PTPX and Power Artist power analysis toolsProficiency in ASIC logic designExtensive experience with SoC power management design including power gating, isolation, retention and DVFS techniquesDeep understanding of ASIC low power design techniques, e.g. Power analysis, UPF, VCLPSoC level clock mesh / reset design experience desirableProficiency in scripting languages (Shell and Perl highly desirable, Python skills are a plus)SoC top-level integration experience is a plusSystem architecture knowledge is a bonusSilicon validation / power measurement experience is a plusBS and 3+ years of relevant industry experience.BS and 3+ years of relevant industry experience.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply."}, "200443237": {"jobID": "200443237", "origin_search": null, "posted": "Nov 11, 2022", "jobTitle": "HID - Firmware Quality Engineer - Input Devices", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443237/hid-firmware-quality-engineer-input-devices?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CPE/EE or related degrees"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.19", "max": "$67.78/hr,"}, "benefits": null, "requirements": "Understanding microcontroller based embedded systems, including algorithmsPartnering with a development team to quickly understand an architecture, break it into functional parts, come up with a plan to test/validate, and identify and target weaknessesCrafting creative ways to exercise embedded subsystems, communication protocols (SPI, I2C, etc) and high-level features of embedded devicesDevising and building test fixtures, building tools and authoring automated scriptsExecuting manual and automated test plans on early prototypes, typically at the “grey box” levelHelping to craft quality from a very early stage, ushering the product from early prototype to productionDocumentation of test cases and code used for test executionComing up with ideas for custom tools and methods to exercise firmware featuresTracking performance, reporting results to management, driving issues to closurePartnering with Human Factors / User Study Group to validate the customer experience and learn about how humans use new input devicesBS or MS in CS/CPE/EE or related degrees2+ years experience with embedded systems, microcontrollers and sensorsExcellent written and verbal communication skillsHelpful/useful experience:-  Experience writing and/or testing firmware, building embedded systems-  Knowledge of Mac systems and MacOS/iOS or UNIX variant-  Track record of shipping great consumer products-  Testing automation using Python or similar-  Use of hardware debugging tools – USB and Bluetooth CATC, protocol analyzer, logic analyzer, oscilloscope-  Familiarity with C/C++ or object-oriented programming-  Test tool development-  Continuous integration systems-  Algorithm analysis and validation", "jobDescription": "Be part of the Input Device QE team, focused on testing firmware and ensuring ultra-high quality for Apple's next generation human interface devices! This includes technologies such as Apple Pencil, Magic Keyboard, Siri Remote, and other input device technologies across a variety of Apple’s product line. Testing is focused on microcontroller based firmware that interfaces with sensors and various other system components. You will be a motivated individual who independently follows up on bugs, collaborates with developers to resolve low-level issues and can understand and discuss technical problems with other QE engineers, development partners and program managers."}, "200445650": {"jobID": "200445650", "origin_search": null, "posted": "Nov 28, 2022", "jobTitle": "HID Firmware QE - Mac & Input Touch", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445650/hid-firmware-qe-mac-input-touch?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS OR MS IN CS/CPE/EE OR RELATED DEGREES\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \n\nApple benefits programs vary by country and are subject to eligibility requirements.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$94,000", "max": "$171,000"}, "benefits": null, "requirements": "Understanding microcontroller based embedded systems, including algorithmsPartnering with a development team to quickly understand an architecture, break it into functional parts, come up with a plan to test/validate, and identify and target weaknessesCrafting creative ways to exercise embedded subsystems, communication protocols (SPI, I2C, etc) and high-level features of embedded devicesDevising and building test fixtures, building tools and authoring automated scriptsExecuting manual and automated test plans on early prototypes, typically at the “grey box” levelHelping to craft quality from a very early stage, ushering the product from early prototype to productionDocumentation of test cases and code used for test executionComing up with ideas for custom tools and methods to exercise firmware featuresTracking performance, reporting results to management, driving issues to closurePartnering with Human Factors / User Study Group to validate the customer experience and learn about how humans use new input devicesBS OR MS IN CS/CPE/EE OR RELATED DEGREES\n\nApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \n\nApple benefits programs vary by country and are subject to eligibility requirements.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Be part of the Mac & Input Touch QE team, focused on testing Multitouch firmware and ensuring ultra-high quality for Apple's next generation human interface devices! This includes technologies such as Mac Trackpad, Apple Pencil, Magic Keyboard, and other input device technologies across a variety of Apple’s product line. Testing is focused on microcontroller based firmware that interfaces with sensors and various other system components. You will be a motivated individual who independently follows up on bugs, collaborates with developers to resolve low-level issues and can understand and discuss technical problems with other QE engineers, development partners and program managers."}, "200456705": {"jobID": "200456705", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "RAN1/RAN4 Standards Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456705/ran1-ran4-standards-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3 + years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "We are looking for candidates with in-depth knowledge on wireless communication system (OFDM/MIMO, etc.)A background in 3GPP standardization in RAN1 or RAN4 is a significant plus.Deep understanding of communication theory & signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, coding theory, etc.)Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.BS and 3 + years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our 5G standards team, you will demonstrate your physical layer system design expertise or your experience in standardization activities to chip in to groundbreaking wireless systems and algorithms that deliver more performance in our products than ever before. You’ll be part of an outstanding system engineering organization making technical contributions towards 4G and 5G specifications and providing support to modem system design. You will actively attend and participate in 3GPP (LTE and 5G-NR) meetings, conduct system simulations of PHY algorithms for a 5G multimode modem."}, "200449368": {"jobID": "200449368", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "CPU Power Management RTL Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449368/cpu-power-management-rtl-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceKnowledge of Verilog and/or VHDL and experience with simulators and waveform debugging toolsKnowledge of logic design principles along with timing and power implicationsUnderstanding of low power microarchitecture techniques and high performance techniques and trade-offs in a CPU microarchitectureKnowledge and experience related to CPU power management:Dynamic voltage and frequency scalingAdvanced thermal and energy managementPower state definition and managementDynamic clocking solutionsDi/dt mitigation strategiesMicro-architecture strategies for improved power integrityDebug, error handling, and security solutionsDFT strategiesClock generation, reset control and asynchronous clock crossing strategiesMulti-voltage design strategiesExperience in C or C++ programming and using an interpretive language such as Perl or PythonMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nApple’s Silicon Engineering Group (SEG) designs high-performance, low power microprocessors that power our innovative products, including the iPhone, iPad and Mac. We are looking for an experienced technical leader to drive world-class CPU power management solutions."}, "200461278": {"jobID": "200461278", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Apple Part Time Reseller Specialist (Fixed Term)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461278/apple-part-time-reseller-specialist-fixed-term?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Williston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends,  24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference.\n\nThis is a fixed-term role ending in June 2023"}, "200466857": {"jobID": "200466857", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Apple Part Time Reseller Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466857/apple-part-time-reseller-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Modesto", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$22.00", "max": "$22.00."}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200446039": {"jobID": "200446039", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Mixed/Signal IC Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446039/analog-mixed-signal-ic-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE\nMinimum 3 years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Perform transistor-level feasibility study and modeling for various analog/mixed-signal circuit blocksDesigning blocks and documenting design simulation and verification towards formal design reviewsDrive mask design to implement layout views of designs and drive layout reviewsPost-layout and top-level simulations to validate top-level integrationRun design verification flows (e.g., electro-migration, IR drop, LEC, timing, etc) to verify design is ready for tape-outParticipating in production and bench-level test plansTaking lab measurements to validate performance compliance with the specParticipating in reviewing yield/lab test results to drive bug fixesBSEE\nMinimum 3 years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially talented Analog Mixed-Signal IC Designer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every day\n\nApple Silicon Engineering is seeking qualified circuit designers to work on the next generation analog & mixed-signal (AMS) circuits for Apple’s world-leading systems-on-chip (SOCs)! Apple’s Ax SOCs are the brain of every iPhone and iPad. Several types of AMS circuits are used to connect them to the physical world as well as enable optimizing their performance. You will be part of a growing AMS team involved in design and productization on leading-edge CMOS process technology nodes!"}, "200461332": {"jobID": "200461332", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "FaceTime QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461332/facetime-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, preferred, or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "Solid understanding of development lifecycles, testing methodologies, and QA processes.Experienced in developing test plans, building tools and test frameworks.Experienced in writing, triaging, and debugging automation scripts, as well as test harness enhancement, primarily focused on UI applications.Automation/coding experience in Python, Swift, or similar languages.Skilled at debugging, troubleshooting, and critical thinking on bug prioritization.Experience with cross-functional projects.A great teammate with the ability to act as a mentor and peer leader.Strong organizational and interpersonal skills.BS in Computer Science or related field, preferred, or equivalent work experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe FaceTime/Phone QA team is seeking a passionate and experienced QA engineer who is interested in helping us deliver quality releases to our customers on Apple’s platforms. Our core team (Comm Apps) designs and engineers the communication cornerstones of iOS and macOS: the Messages, FaceTime, and Phone applications. We need someone inspired to invent new ways to test, to find problems no one else could, and to build amazing products."}, "200458026": {"jobID": "200458026", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "PHY Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458026/phy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 0+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "BS and 0+ years of relevant industry experience.Work closely with system/design team to review and understand PHY subsystem microarchitecture, create verification plans from specifications.Build block/subsystem level test benches with reference model, using best in class DV methodology. Architect test benches with maximum reusability in mind.Develop and execute both directed and constrained random tests, debug failures, manage bug tracking, and work with designers to drive closure of issues found.Create and analyze block/subsystem level coverage model, and add test cases to increase coverage.Support PHY subsystem validation using Palladium and/or FPGA.BS and 0+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly."}, "200406820": {"jobID": "200406820", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Apple Support College Program - University of Houston, Victoria", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406820/apple-support-college-program-university-of-houston-victoria?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Victoria, TX", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Students must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Real passion for customer service and ownership of the customer experience including comprehensive issue resolutionPotential for tailoring communication style for differing audiencesAble to self-manage and work independently in a fast-paced, constantly changing environmentTeamwork mentality with aptitude for sharing expertise and appreciating feedbackEffective time management including the ability to multi-task, organize and prioritizeAbility to research and grasp technical information across multiple tools while talking with customersiOS , Smartphone, Tablet, PC or Mac experienceAptitude for acquiring skills in technical troubleshooting and an eagerness to learn while accepting new challengesStudents must be enrolled at a four-year university in the U.S. pursuing a bachelor’s degree or higher\nComputer Science, Business, Engineering and Computer Information Systems majors are preferred\n2.7 GPA preferredAvailability to attend approximately up to nine weeks of required online training on a fixed schedule that may include weekends (Training may be either 24 or 40 hours per week depending on hire date)Flexibility to work three, four hour shifts, on week days, between the hours of 4:00 p.m. and 10:30 p.m. Central and one eight hour shift on weekends, primarily Saturdays, including holidays, between the hours of 7:00 a.m. and 10:30 p.m. Central. Depending on business needs, there is the possibility to flex up or down in weekly hours worked.Successful completion of a pre-employment assessment and background checkSuccessfully complete initial trainingMinimum typing speed of 40 WPM while in conversation with customersA quiet workspace, ergonomic chair, and deskA hard-wired internet connection directly from a provider with a minimum download speed of 10 Mbps download and 3 Mbps upload at your address, with less than 150 ms latency. Internet must be hardwired to the home as well as to the equipment provided. A wireless connection to the Apple equipment is not allowed under any circumstances.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally-protected characteristics.Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.Apple will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law.Apple participates in the E-Verify program in certain locations, as required by law.Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.Apple is a drug-free workplace.", "jobDescription": "Apple has always done things differently, including customer support. We expect everything from an Advisor that our customers do, and we want Apple to be a reflection of the world around us. At Apple, you'll not only support technology, you'll support people!\n\nThis position is located at home from any city across the US that has available internet infrastructure. You do not need to live in the city this is posted in to be considered."}, "200421534": {"jobID": "200421534", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Apple Part Time Reseller Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200421534/apple-part-time-reseller-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Rockford", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends,  24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner, you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200461678": {"jobID": "200461678", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Apple Part Time Reseller Sales Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461678/apple-part-time-reseller-sales-specialist?team=APPST", "jobLocation": {"remote": "not specified", "city": "Corpus Christi", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills, you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a Reseller Store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. \nYou understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. \nEvery day you’ll encounter unique opportunities to change lives and make a difference."}, "200462004": {"jobID": "200462004", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Apple Part Time Reseller Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462004/apple-part-time-reseller-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Columbus", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200467203": {"jobID": "200467203", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Apple Part Time Reseller Sales Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467203/apple-part-time-reseller-sales-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Grand Rapids", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills, you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a Reseller Store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. \nYou understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. \nEvery day you’ll encounter unique opportunities to change lives and make a difference."}, "200451067": {"jobID": "200451067", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Cellular ASIC Design Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451067/cellular-asic-design-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.This position requires thorough knowledge of the ASIC design flow, FE and design verification, synthesis, scripting and netlist generation.Knowledge of ASIC/SoC design flow.Knowledge of FE tools (CDC, RDC, LINT, Formal, LP Checks, LEC, PTPX) and Synthesis and STA flows.Strong knowledge of RTL design and HDL languages (Verilog, System Verilog, etc.)Strong analytical skills to be able to make design tradeoffs for best performance, low area, and low power.Experience in driving power improvements based on power analysis tools/flows.UPF flow for defining power intent of chips with multiple power domains.Experience in writing efficient design synthesis and STA constraints.Work with DV team to come up with a thorough verification plan and drive coverage closure.Design interfacing to PD for floorplanning and timing closure.Experience with version control tools and handoff of design releases.Strong scripting skills to automate tasks and build scalable design flows.Self starter, highly motivated, highly organized, and schedule driven is a must.Familiarity with DFT, MBIST and backend related methodology and tools is a plus.BS and 10+ years of relevant industry experience.", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? Do you intrinsically see the importance in every detail? As a member of our dynamic Cellular group, you'll be at the heart of chip design! You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions. \n\nThis is a high visibility and mission critical role, which provides excellent exposure to multiple VLSI design technologies and flows. It also requires close working relationships with many functional teams."}, "200419371": {"jobID": "200419371", "origin_search": null, "posted": "Nov 29, 2022", "jobTitle": "Mixed-Signal IP Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200419371/mixed-signal-ip-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proven excellence in FW development using C or C++ and/or assembly language with ARM CPUs.Solid understanding of MCUs and ISR.Solid understanding of computer architecture.Solid understanding of ARM AHB/APB protocols.Deep knowledge of RTL design.Deep knowledge of Verilog and SystemVerilog.Experience with version control tools (git, Perforce) is a plus.Experience with real-time operation system is a plus.Understanding of mixed signal concepts is a plus.Strong communication and presentation skills.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and extraordinarily hardworking FW Design Engineer. As a member of our multifaceted group, you will have the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day."}, "200450721": {"jobID": "200450721", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - California State University, Channel Islands", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450721/campus-leader-california-state-university-channel-islands?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Camarillo", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$22.00", "max": "$22.00."}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450250": {"jobID": "200450250", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - California State University, Bakersfield", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450250/campus-leader-california-state-university-bakersfield?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Bakersfield", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$22.00", "max": "$22.00."}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450794": {"jobID": "200450794", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - Norwich University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450794/campus-leader-norwich-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Northfield, VT", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200458048": {"jobID": "200458048", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Sr. PHY Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458048/sr-phy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Work closely with system/design team to review and understand PHY subsystem microarchitecture, create verification plans from specifications.Build block/subsystem level test benches with reference model, using best in class DV methodology. Architect test benches with maximum reusability in mind.Develop and execute both directed and constrained random tests, debug failures, manage bug tracking, and work with designers to drive closure of issues found.Create and analyze block/subsystem level coverage model, and add test cases to increase coverage.Support PHY subsystem validation using Palladium and/or FPGA.Work with team members to improve methodology and flow.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly."}, "200455448": {"jobID": "200455448", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Apple Part Time Reseller Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455448/apple-part-time-reseller-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Newark", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200462177": {"jobID": "200462177", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Apple Part Time Reseller Sales Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462177/apple-part-time-reseller-sales-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Houston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills, you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a Reseller Store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. \nYou understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. \nEvery day you’ll encounter unique opportunities to change lives and make a difference."}, "200451521": {"jobID": "200451521", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless System Automation Development Engineer Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451521/wireless-system-automation-development-engineer-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS+10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "This is a lead role that requires industry experience in architecting and implementing test and automation systems within wireless communication systems.Experience developing test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI, database, reporting tools).Experience with Python and/or C/C++.Experience using, and a basic understanding of the theory of operation of, wireless test lab equipment (spectrum analyzer, signal generator, network analyzer, power meter).Minimum qualification is BS+10 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before."}, "200463916": {"jobID": "200463916", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Mechanical Prototyper", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463916/mechanical-prototyper?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Background in Mechanical Engineering (AS/BS preferred)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.00", "max": "$75.48/hr,"}, "benefits": null, "requirements": "3+ years of relevant prototyping experience (electro-mechanical preferred)Hands-on experience with shop tools, prototype fabrication techniques and equipment (3D printers, laser cutter, lathe, mill, etc.)Familiarity with inspection and analysis equipment (microscopes, load cells, etc.)Familiar with a wide range of materials (plastics, foams, textiles, metals, composites), their properties, and methods of processesing themAbility to understand and to develop hand sketches, CAD models, and technical drawingsExperience root causing failures and implementing corrective actionsStrong mechanical problem solving and troubleshooting skillsTeam player with excellent verbal and written communicationAbility to predict timelines and meet deadlines in a fast paced environmentBackground in Mechanical Engineering (AS/BS preferred)", "jobDescription": "We’re a diverse collection of hardware focused thinkers and doers. We continually reimagine what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch. The same passion for innovation that goes into our products also applies to our daily practices — strengthening our commitment to leave the world better than we found it!\nThe Product Design Engineering group working on new and future product concepts is looking for a Prototyper who will be responsible for assisting in the design, fabrication, and assembly/disassembly of prototype parts and assemblies."}, "200448870": {"jobID": "200448870", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "GPU Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448870/gpu-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You should have experience and knowledge of CPU or GPU architecture and micro-architecture concepts as well as deep expertise in one or more focused CPU/GPU areas. Areas could include ISA development, core/shader micro-architecture, geometry pipeline, rasterization, vertex/fragment/compute shading, texture pipeline, caching, or memory subsystem design.You will be setting direction thus you must be able to work in an environment of uncertainty and able to work through ambiguities.We believe that there is power in teams working together so you must have strong communication, influence, and negotiation skills.We are a data driven group and believe in the power of individuals proving their own ideas; therefore we prefer you have relevant hands on experience with RTL or architectural modelingProficiency in high performance, low power designsProficiency in VHDL/VerilogProficiency in C/C++Proficiency in scripting languages such as Perl, Python and RubyBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Do you love working on challenges that no one has solved yet? Join us to help deliver the next groundbreaking product containing an Apple designed GPU. As part of the GPU Micro-Architecture team, you’ll be responsible for defining a GPU that enriches the lives of millions of people every day."}, "200450084": {"jobID": "200450084", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Mixed-Signal Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450084/mixed-signal-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Industry verification experience with RF/Mixed-Signal blocks and SOCs.Expertise building Mixed-Signal testbenches, checkers and tests using System Verilog.Expertise creating and using real-numbered analog behavioral models in System Verilog/Verilog-AMS.Experience in HVL methodology (UVM/OVM/VMM) and HDL (System Verilog, Verilog) for verification.Strong verification skills in problem solving, constrained random testing, and debugging.Understanding of common analog/RF blocks.Experience with signal processing using Python or Matlab a plus.Experience with Virtuoso Composer, ADE, and HED a plus.Team spirit, excellent communication skills and the desire to take on diverse challenges.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this role, you will be verifying RF/Mixed-Signal blocks and SOCs using SystemVerilog to create testbenches, checkers, models and tests. You will build and execute test plans to meet project schedule and metric requirements, including coverage metrics."}, "200456497": {"jobID": "200456497", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "WW Channel Sales - Senior CRM UX Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456497/ww-channel-sales-senior-crm-ux-designer?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Interaction Design/HCI/Media Arts/Graphic Design/Psychology, or a related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$135,000", "max": "$242,000,"}, "benefits": null, "requirements": "Key Qualifications5+ years of UX experienceExtensive expertise in a broad range of UX skills, including interaction design, visual design, branding, UX research, and moreMastery of Sketch, Photoshop, Illustrator, and other modern design and prototyping toolsExcellent collaboration skills cross-functionally with internal and external team to deliver a quality product while advocating for the user every step of the wayExpert problem-solving skills and creativity to find clear solutions that help users achieve their goalsExperience with user research, conducting user testing, and distilling feedback into meaningful design improvementsExperience designing for web and iOS, including responsive designDetail-oriented, down to the pixelAbility to adapt to a constantly changing environment and tight timelines. Familiar with Agile development approach.High energy and a positive attitudeAble to work flexible hours (OT and weekends may be required)A strong portfolio of work that demonstrates the aboveHighly skilled in Sketch, Figma, Keynote and other design tools.Excellent communication and presentation skills; both written and verbal.A deep understanding of the Apple design aesthetic, UI, and historyFamiliarity with cloud-based CRM technology and platform is a plusBachelor’s degree in Interaction Design/HCI/Media Arts/Graphic Design/Psychology, or a related field", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Help us leave the world better than we found it.\n\nApple’s Sales organization drives revenue through a broad network of channel partners across the global, including carriers, retailers, B2B resellers, distributors, and many more. This in turn, enriches the lives of hundreds of millions of people around the world. Our sales team, is the face and voice of Apple in the partner community that we collaborate with.\n\nYou will be joining the Channel Strategy and Operation team, as CRM User Experience Designer, focusing on the largest sales transformation program in the next few years, that moves our sales activities to an external SaaS platform, provides groundbreaking experiences for Apple teams, as well as our partners globally.\n\nIn this role, you will be partnering with cross-functional Apple teams and external partners, to define the user experience of the new CRM/PRM (Parent Relationship Management) solutions. With your valuable contribution, we aim for driving the ultimate experience to boost productivity, enhance collaboration, and transform the way we work."}, "200458818": {"jobID": "200458818", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "ASIC Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458818/asic-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Pre-silicon power modeling, analysis and power reduction experience. Proficient in PTPX, Power Artist or other power analysis tools. Full chip experience is a plusPost-silicon power correlation experience. Full chip experience is a plusGood understanding of Low Power ASIC logic design and UPF; Actual design experience is a plusGood understanding of ASIC physical design, timing closure; Actual implementation experience is a plusProficiency in scripting languages (Shell, Perl or Python).System architecture knowledge is a bonusBasic knowledge on wireless protocols, e.g., WiFi, BTBasic knowledge on common SOC components, e.g., CPU, fabric, peripherals and PCIeStrong problem solving and analytical skillsBS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient / low power design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC/Power architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, Power modeling / correlation and FW/SW engineering. \nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. \nWill you join us and do the work of your life here?"}, "200451396": {"jobID": "200451396", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Analog Mixed-Signals Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451396/analog-mixed-signals-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Understanding of SPICE simulation, Cadence ADE environment, Xcelium and/or VCS CoSim are requiredProficiency in multiple programming languages (Perl, Python, SKILL, TCL/TK, Unix Shell).Experience in CAD flow development and automation in a rapid design environment.Experience in Flowtracer and Makefile development is a plus.Exposure to Cadence Virtuoso Framework, Schematic Editor and Layout tools, VXL and CDFs is a plusStrong interpersonal/communication skills and ability to work with cross functional teams.Preferred 3+ years of relevant  industry experience.BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented the entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple products. Multifaceted, smart people and inspiring, cutting-edge technologies are the norm here. \n\nAs a member of Mixed-Signal design team, you will build and support innovative design methodology, customize, and automate CAD flows for sophisticated Mixed-Signal IP designs. The design flows are used by multiple different IPs of multiple projects at multiple sites. You will collaborate with mixed signal design teams, CAD teams, and EDA vendors. Good interpersonal skill is essential. Excellent verbal and written communication in English is required."}, "200462017": {"jobID": "200462017", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Signal Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462017/signal-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "You should be familiar with signal and power integrity issues of high speed serial interfacesExperience working with the actual product package/board design and analysis, SI/PI methodology development, and lab correlation/validation of the simulation resultsExcellent academic background and experience beyond graduate school studiesFamiliarity with lab equipment, such as: VNA, TDR, real-time scope, spectrum analyzer, etcPossess strong fundamentals in 3D/2D EM simulation tools and transmission line theoryGood communication skills-  BS and +10 years of relevant industry experience", "jobDescription": "In this position, you will work with the team that develops SOCs used within Apple's mobile devices. You will be specifically responsible for high-speed serial interface signal integrity and power integrity for Apple SOCs covering the span from package to board. Prior design and modeling experience with USB, PCIe, or comparable interfaces is a must-have."}, "200457642": {"jobID": "200457642", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "SMB Optimization Manager - Retail Customer Care", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457642/smb-optimization-manager-retail-customer-care?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BA/BS degree plus extensive leadership experience\nMS/MBA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$128,000", "max": "$278,000,"}, "benefits": null, "requirements": "7-10 years experience in Business Operations, Sales Operations and/or Finance experience leading a globally distributed teamMinimum 5-7 years senior managerial experience building and leading large globally distributed teams preferredStrong history of leading sophisticated cross-functional business development strategies, including developing and implementing capital and operational plans to deliver measurable commercial and experiential results.Deep rooted experience and passion for crafting innovative Customer Experience shopping programs that surprise and delight customers across different mediums and modalities.Experience supporting an end to end Call center including experience and/or strong understanding of outsourced vendor strategy and operations preferredKnowledge of customer buying behaviors, in the SMB space preferredExperience leading in a multi-lingual/cultural environment with the ability to empower and influence in a matrix environment including at a senior levelSelf-directed, highly agile individual with outstanding organizational skills, able to work under pressure and provide outstanding leadership to the team.Strong analytical skills and demonstrated ability to work in an ambiguous environmentAbility to demonstrate capability of decision quality combing experience and intuitionExcellent communication and presentation skills with an ability to craft the narrative to influence partnersDemonstrated ability to liaise with business partners collaboratively on large operational projects from ideation to executionSkilled at resource balancing and conflict managementShown ability to assess business needs, prioritize accordingly, and call out appropriatelySkills to focus on what matters, cut through ambiguity and listen/challenge/commitDrive operational excellence by identifying and implementing operational processes that help improve operational metrics and drive efficiencyBA/BS degree plus extensive leadership experience\nMS/MBA preferred", "jobDescription": "The people here at Apple don’t just create products – we build the kind of wonder that’s revolutionized entire industries! It’s the diversity of our people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it! \n\nThe Retail Customer Care organization is a direct channel for Apple focused on driving pre and post sales customer interactions and managing order support related activities globally. \n\nThe SMB Optimization Manager reports into the WW Optimization Director. The SMB Optimization Manager is focused on driving business segment growth, enabling RCC Business support specialists, and working cross-functionally with partners to align our business models\n\nThe role is requires strategic leadership, people development skills, and operational understanding to ensure we are enabled with the vital tools, processes, technology to effectively support our customers\n\nThe candidate will work in a matrix environment, partnering closely with Retail Stores, Retail Operations, Product, BPR, Regional Customer Care Center teams, among other partner teams to drive excellence across the Retail Online business."}, "200450750": {"jobID": "200450750", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - Cornell University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450750/campus-leader-cornell-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Ithaca", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$22.00", "max": "$22.00."}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450822": {"jobID": "200450822", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - University of Wyoming", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450822/campus-leader-university-of-wyoming?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Laramie, WY", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200451398": {"jobID": "200451398", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed-Signals Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451398/analog-mixed-signals-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Typically requires extensive and relevant experience in Synthesis, PNR and timing flows development.Understand various aspects of partition level Synthesis, PNR, including floor-planning, timing/power optimization, CTS, routing the UPFUnderstanding and exposure to extraction and timing analysis flowsUnderstand hierarchical Synthesis and PNR issues is a key (UPF, power-distribution, multi-voltage design)Deep Knowledge and experience of hard IP view set creation and deliverablesStrong TCL/Perl/Python/Makefile scripting knowledge. Proven track record of managing, and regressing Synthesis, P&R and timing flows.Self-motivated, dedicated problem solver. Strong interpersonal/communication skills are a huge plus.BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple products. Multifaceted, smart people and inspiring, innovative technologies are the norm here.\n\nAs a member of Mixed-Signal design team, you will build and support innovative design methodology and customize and automate CAD flows for sophisticated Mixed-Signal IP designs. The design flows are used by multiple different IPs of multiple projects at multiple sites. Proven understanding of Synthesis, P&R, Timing, Simulation CAD flows, EDA tools, UPF, algorithm, scripting (TCL/Perl/Python) and Makefiles is a requirement. You will collaborate with RTL, PD and timing design teams, CAD team, and EDA vendors."}, "200355599": {"jobID": "200355599", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "System Performance Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200355599/system-performance-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/Ph.D. preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong knowledge and experience in computer architecture, the broader the betterPrior experience in system performance modeling is desiredPrior experience in analyzing software/OS behavior, power, thermal, and acoustics aspectsof performance is desiredGood coding skills in some subset of (C, C++, System C, Python, shell, etc.)Strong communication and mentoring skillsMS/Ph.D. preferred.", "jobDescription": "The Mac system performance and architecture team is responsible for all aspects of Mac performance spanning hardware (CPU, GPU, DRAM, storage), software (OS, drivers, applications), and other system characteristics (thermals, power, acoustics). This spans performance modeling, guiding architecture tradeoffs, performance verification, performance debug, and workload characterization."}, "200450781": {"jobID": "200450781", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - University of the District of Columbia", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450781/campus-leader-university-of-the-district-of-columbia?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Washington DC", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450818": {"jobID": "200450818", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - University of Colorado, Denver", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450818/campus-leader-university-of-colorado-denver?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Denver", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$23.00", "max": "$23.00."}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450793": {"jobID": "200450793", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - Merrimack College", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450793/campus-leader-merrimack-college?team=STDNT", "jobLocation": {"remote": "not specified", "city": "North Andover, MA", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450724": {"jobID": "200450724", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Campus Leader - Cal Poly Humboldt", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450724/campus-leader-cal-poly-humboldt?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Arcata", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$22.00", "max": "$22.00."}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200466311": {"jobID": "200466311", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Content Development Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466311/content-development-manager?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in technical communication, writing/composition, or similar field. Master’s degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of related experience with a demonstrated track record of success managing a content team and working with multi-media contentAbility to build strong internal and external relationshipsPersuasive and effective at interacting with all roles and levels across organizationResults-driven with a world-class attention to detail and remarkable follow-throughSuperb organizational skills and an ability to juggle multiple projects on tight timelinesAble to rapidly understand the other party’s concerns and evaluate a range of solutions by being a great listenerStrong problem solving skillsPossess a professional and credible demeanorExcellent collaborative skillsExperience working with multiple content reviewers and incorporating feedback from marketing and engineering teamsFamiliarity with customer support content, including internal and knowledge basePassion for providing a great user experienceExcellent verbal, written, and interpersonal skills and the ability express ideas clearly and diplomaticallyExperience collaborating with cross-functional external teams in addition to writers, visual designers, SEO, and subject matter experts**Nice to Have:Experience writing, editing and programming content in a CMSExperience managing content in multiple languagesBachelor’s degree in technical communication, writing/composition, or similar field. Master’s degree preferred", "jobDescription": "The AppleCare Online Content Development team is looking for a skilled manager to lead a technical writing team that is publishing a variety of global content across various channels. The role interacts with stakeholders across the business and requires superb collaboration, communication, organization and content production abilities. You will partner closely with content strategists, marketing, engineering and localization teams to meet the needs of a global audience and help develop new streams of content."}, "200235410": {"jobID": "200235410", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Strategic Quality Program Manager (Regulated Products), AppleCare Support", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200235410/strategic-quality-program-manager-regulated-products-applecare-support?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree required  \nMBA or a relevant post-graduate degree is a plus\nProject Management / Six Sigma / COPC / CX certifications preferred\nPMP or other project management certification preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "8+ years experience in the contact center industryRegulated product experience required; supporting financial markets (credit card and payments related products operations experience preferred)Understanding of quality management processes; calibration, joint-contact-monitoring, quality standards, quality metricsSolid understanding of contact centers requiredDeep subject matter knowledge of customer experience, risk and compliance management practices and regulations in this area (within contact center environment)Demonstrated ability to deliver large scale projects on-time with consistently successful results while working across departments and time zonesCollaborative, flexible and open working style, with an ability to establish and maintain close working relationships with key partnersBuild an effective engagement model between operational teams and product stakeholders to analyze and report on qualitative data to identify improvement opportunities and take part in process improvement projectsAbility to influence and lead multiple organizational partners and balance the needs of our customers and businessAssist the organization in establishing key risk indicators that enable effective monitoring of risks and early identification of potential issuesSynthesize results of quantitative and qualitative analyses into key trends, implications, and recommendationsDefine and implement a program roadmap, including defining project achievements, managing risk and communicating progressServe as a global expert for regulated products within Strategic Quality, supporting the design of a Quality Standard frameworkProvide guidance, oversight and support to the evolution of quality programs and deliverables throughout the customer experience lifecyclePartner closely and foster trust with the AppleCare Global Quality Operation Managers and Quality Program Managers to partner on and complete initiativesAnalyze business operations and behavioral data to identify actionable trendsBachelors degree required  \nMBA or a relevant post-graduate degree is a plus\nProject Management / Six Sigma / COPC / CX certifications preferred\nPMP or other project management certification preferredThe role requires 10-20% travel in the future.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe AppleCare Support organization is rapidly growing, entering new markets and supporting innovative new features across our products and services. This is an opportunity to join the Strategic Quality team, developing and improving our quality programs designed to support our customers and measure our impact on the experience. You will help define our future vision, build operational capabilities, and drive the launch readiness of new features.\n\nWe’re looking for an expert with experience in supporting financial regulated products to join the Strategic Quality team. This person will be responsible for partnering with external and internal teams to perform various functions in the quality space. These include defining quality standards that define a great support experience, establishing quality frameworks to govern adherence to procedures & knowledge accuracy, and driving systemic improvements.\n\nYou should have significant experience in contact center operations, and be proficient in supporting products in the highly regulated financial services industry. You should also demonstrate experience in leading change management efforts in a contact center environment."}, "114438152": {"jobID": "114438152", "origin_search": null, "posted": "Mar 6, 2023", "jobTitle": "US-Operations Expert", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/114438152/us-operations-expert?team=APPST", "jobLocation": {"remote": "not specified", "city": "Various Locations within United States", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to think quickly and perform problem-solving tasks, even within changing conditions.Leadership skills, whether guiding by example or coaching a group.Strong organizational skills, quickly evaluating every situation.•You can manage and meet multiple inventory deadlines each week.•You’re willing to observe guidelines to allow secure access to products and movement through the stockroom.•You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you love how it feels to make someone’s day?  As an Operations Expert, you know better than anyone else the satisfaction of getting the latest Apple product into your hands. So it’s up to you to make sure customers are just as satisfied. By guiding and mentoring your team, you help keep pace with changing demands and make sure every product and demo machine is where it should be. At the end of the day, it’s your organizational skills and dedication that are at the heart of what the Apple Store does — connecting people to the products they love."}, "200451089": {"jobID": "200451089", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Cellular ASIC Design Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451089/cellular-asic-design-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.This position requires thorough knowledge of the ASIC design flow, FE and design verification, synthesis, scripting and netlist generation.Knowledge of ASIC/SoC design flow.Knowledge of FE tools (CDC, RDC, LINT, Formal, LP Checks, LEC, PTPX) and Synthesis and STA flows.Strong knowledge of RTL design and HDL languages (Verilog, System Verilog, etc.)Strong analytical skills to be able to make design tradeoffs for best performance, low area, and low power.Experience in driving power improvements based on power analysis tools/flows.UPF flow for defining power intent of chips with multiple power domains.Experience in writing efficient design synthesis and STA constraints.Work with DV team to come up with a thorough verification plan and drive coverage closure.Design interfacing to PD for floorplanning and timing closure.Experience with version control tools and handoff of design releases.Strong scripting skills to automate tasks and build scalable design flows.Self starter, highly motivated, highly organized, and schedule driven is a must.Familiarity with DFT, MBIST and backend related methodology and tools is a plus.BS and 3+ years of relevant industry experience.", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? Do you intrinsically see the importance in every detail? As a member of our dynamic Cellular group, you'll be at the heart of chip design! You’ll ensure Apple products and services can seamlessly handle the tasks that make them beloved by millions. \n\nThis is a high visibility and mission critical role, which provides excellent exposure to multiple VLSI design technologies and flows. It also requires close working relationships with many functional teams."}, "200455199": {"jobID": "200455199", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Senior Project Manager, AppleCare Business Process Reengineering (BPR)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455199/senior-project-manager-applecare-business-process-reengineering-bpr?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree or equivalent experience required. Master's degree a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "8-10 years of proven experience planning, managing, and successfully delivering large cross-functional systems projects including SAP HANA related projectsExperience establishing program structure for coordinating and delegating cross-project initiativesExperience with systems implementations and software development life cyclesExperience with global projects incorporating regional and country-specific detailsAble to form cohesive project teams across disparate organizations and groupsAbility to navigate through ambiguity to clarify objectives and execution plansService, Sales, Support, warranty contract, and/or supply chain experience preferredProject management certification a plusBachelor’s degree or equivalent experience required. Master's degree a plus.", "jobDescription": "Be inspired every day.  We are idealists. Inventors. Forever tinkering with products and processes, always on the lookout for a better way.  A job at Apple is one that requires a lot of you, but it’s also one that rewards forward-thinking and dedicated work. None of us here at Apple would have it any other way!\n\nIn AppleCare BPR (Business Process Re-engineering) we view inclusion and diversity as critical for innovation. That’s because our Project Managers lead the most challenging cross-functional initiatives in AppleCare, the ones that involve multiple systems and drive complex changes across the AppleCare organization and beyond. We turn ambiguity into order, and we know how to execute big projects successfully.\n\nAs a HANA Project Manager you will plan, mobilize, and execute to a multi year roadmap of HANA transformation projects, ensuring system changes are thoroughly tested and AppleCare is ready for process changes. You will be the focal point for the project for AppleCare including coordination, communications, governance, risk mitigation, and readiness planning. You’ll connect the dots, build trust and understanding between groups inside and outside of AppleCare, and orchestrate the activities needed to make HANA deliverables successful. The ideal candidate should have experience managing large, projects in HANA that interweave multiple functional teams and enterprise systems."}, "114438201": {"jobID": "114438201", "origin_search": null, "posted": "Mar 6, 2023", "jobTitle": "US-Technical Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/114438201/us-technical-specialist?team=APPST", "jobLocation": {"remote": "not specified", "city": "Various Locations within United States", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to assess customers’ support needs when they arrive, then provide solutions or refer them to other team membersFlexibility to regularly rotate through different technical specialties and skill setsAbility to thrive on change as products evolve•You have excellent time management skills and can make decisions quickly.•You maintain composure and customer focus while troubleshooting and solving issues.•You reassure customers when delivering product diagnoses and potential solutions.•You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you love how it feels to help others?  After customers purchase our products, you’re the one who helps them get more out of their new Apple technology. Your day in the Apple Store is filled with a range of focused support and service tasks. Whether you’re helping customers get started with the Mac or finding answers to their questions about other Apple devices, you’re ready to share knowledge and provide exceptional assistance. You gain satisfaction from bringing resolution and insight to each customer, elevating his or her relationship with Apple to the next level.\n\nBoth full-time and part-time jobs are available."}, "200462024": {"jobID": "200462024", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Signal Integrity Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462024/signal-integrity-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "You should be familiar with signal and power integrity issues of high speed serial interfacesExperience working with the actual product package/board design and analysis, SI/PI methodology development, and lab correlation/validation of the simulation resultsExcellent academic background and experience beyond graduate school studiesFamiliarity with lab equipment, such as: VNA, TDR, real-time scope, spectrum analyzer, etcPossess strong fundamentals in 3D/2D EM simulation tools and transmission line theoryGood communication skills-  BS and +10 years of relevant industry experience", "jobDescription": "In this position, you will work with the team that develops SOCs used within Apple's mobile devices. You will be specifically responsible for high-speed serial interface signal integrity and power integrity for Apple SOCs covering the span from package to board. Prior design and modeling experience with USB, PCIe, or comparable interfaces is a must-have."}, "200437365": {"jobID": "200437365", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "AIML - Annotation Analyst, Canadian French Language", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437365/aiml-annotation-analyst-canadian-french-language?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent work experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Fluency in the Canadian French language with excellent comprehension, grammar and proofreading skillsExcellent English reading comprehension and writing skillsHighly organized with strong attention to detailExcellent active listening skills with the ability to understand verbal nuancesUnderstanding of the regions and cultural variations where Canadian French is spokenDemonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialectAbility to independently navigate systems and toolsDemonstrates integrity and focuses on customer privacyExperience in content review or a similar environment, prior testing experience preferredDemonstrates flexibility and adaptability to changing work-flows and responsibilitiesGrows with a team where expertise is shared and feedback is welcomedExcels at working independently to make timely decisions and take appropriate actionsExperience as an end user of Siri, similar Intelligent Personal Assistants, or other AISuccessfully meets or exceeds targets, working within tight deadlinesAbility to identify business process solutions that increase efficienciesAbility to maintain focus and aim for high results through large volumes of tasksBachelors degree or equivalent work experience preferredAbility to work Monday- Friday from 9:00am-6:00pm local time; with scheduling and work flexibility based on business needsAble to meet minimum typing speed of 40 WPMPositions with language skills require strong grammar and cultural awarenessSuccessful completion of a pre-employment assessment and background checkSuccessful completion of training and certification testing", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just craft products - they build the kind of wonder thatʼs revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.   \n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send messages, play their favorite song or even take a selfie. The AIML team is passionate about technology with a focus on enriching the customer experience. We are looking for a motivated Annotation Analyst that demonstrates active listening, integrity, acute attention to detail, and is passionate about impacting our customer's experience. \n\nBring passion and dedication to your job and there's no telling what you could accomplish."}, "200402383": {"jobID": "200402383", "origin_search": null, "posted": "Jul 18, 2022", "jobTitle": "AIML - Annotation Analyst, Spanish Language", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200402383/aiml-annotation-analyst-spanish-language?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent work experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Fluency in the Spanish language with excellent comprehension, grammar and proofreading skillsExcellent English reading comprehension and writing skillsHighly organized with strong attention to detailExcellent active listening skills with the ability to understand verbal nuancesUnderstanding of the regions and cultural variations where Spanish is spokenDemonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialectAbility to independently navigate systems and toolsDemonstrates integrity and focuses on customer privacyExperience in content review or a similar environment, prior testing experience preferredDemonstrates flexibility and adaptability to changing work-flows and responsibilitiesGrows with a team where expertise is shared and feedback is welcomedExcels at working independently to make timely decisions and take appropriate actionsExperience as an end user of Siri, similar Intelligent Personal Assistants, or other AISuccessfully meets or exceeds targets, working within tight deadlinesAbility to identify business process solutions that increase efficienciesAbility to maintain focus and aim for high results through large volumes of tasksBachelors degree or equivalent work experience preferredAbility to work Monday- Friday from 9:00am-6:00pm local time; with scheduling and work flexibility based on business needsAble to meet minimum typing speed of 40 WPMPositions with language skills require strong grammar and cultural awarenessSuccessful completion of a pre-employment assessment and background checkSuccessful completion of training and certification testing", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just craft products - they build the kind of wonder thatʼs revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.   \n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send messages, play their favorite song or even take a selfie. The AIML team is passionate about technology with a focus on enriching the customer experience. We are looking for a motivated Annotation Analyst that demonstrates active listening, integrity, acute attention to detail, and is passionate about impacting our customer's experience. \n\nBring passion and dedication to your job and there's no telling what you could accomplish."}, "200380251": {"jobID": "200380251", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "iPhone Analog Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380251/iphone-analog-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5 + years overall experience in industryStrong analog/mixed-signal fundamentals (noise, linearity, signal-integrity in mixed-signal systems).Deep understanding of mixed-signal building blocks (op-amps, filters, ADCs, DACs, output drivers)Familiarity with low-power electronics/sensors/sensor-interface circuits.Experience in prototyping, characterization and debugging of mixed-signal hardware.Excellent interpersonal skills with both verbal and written communicationsBS/MS EE or equivalent", "jobDescription": "The iPhone Division is seeking a hardworking Analog Design Engineer. You will be working in a creative and upbeat engineering team developing iPhone products with responsibilities for the design, implementation and integration of variety of function blocks and subsystems including power, audio, battery management, and sensors. This is a phenomenal opportunity to be at the focal point of many multi-functional interactions with Apple internal HW/SW teams, Contract Manufacturer teams, and IC vendor teams throughout different development stages.\nWe expect you to be familiar with the design of portable low-power products, preferably with experience in a consumer electronics environment looking after high-volume and high-quality products."}, "200466712": {"jobID": "200466712", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Motion Graphics Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466712/motion-graphics-designer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- BA degree in Graphic Design, Motion Graphics, or other related discipline"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years experience in motion graphics, broadcast, or animationExceptional creativity in concept development, storyboarding, and problem solvingMastery of After Effects and other software for creating user interface animations and rapid user experience comps, animations, and prototypesStrong production skills and the ability to work independently and collaboratively as part of a teamDeep understanding of Human Interface Guidelines for Apple platforms- BA degree in Graphic Design, Motion Graphics, or other related disciplineMust provide link to portfolio that demonstrates strong concepts and execution across mobile and desktop apps, web, or film and broadcast.", "jobDescription": "The design team within Apple’s Instructional Products group creates experiences that welcome, inform, and inspire our users to get the most out of our products. The ideal candidate must possess strong design, animation, and production skills, as well as the ability to tell compelling stories in motion. This is an opportunity to work with a small motion graphics team focused on creating engaging animated content that connects with and guides our users."}}