{"200464538": {"jobID": "200464538", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Hardware Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464538/hardware-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Prefer M.S. degree in Computer Engineer or Electrical Engineering."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BS in electrical or computer engineering required, MS preferredMinimum 3 years relevant industry experience.  High-volume consumer electronics system experience preferred.Lab skills: oscilloscopes, logic analyzers, electronic loadsExperience with schematic capture and PCB physical design using Cadence Concept and Allegro or similar CAD toolsDesign experience in digital logic, simulation, power conversion and deliveryFamiliarity with RF/wireless conceptsExperience with high-speed serial and memory interfaces including signal integrity design and measurement fundamentalsExcellent written and verbal communication skillsCommand line interface and scripting skillsSpecific deep expertise in several of the following areas is a plus: CPU or GPU microarchitecture, batteries, power management, analog design, audio, wireless, DisplayPort, PCIe, Thunderbolt, USB, SPI, I2C, UART, analog sensors, interconnectStatistical data analysis and visualization (ex. JMP) is a plusTravel to foreign contract manufacturer (estimate 5 weeks per year)Prefer M.S. degree in Computer Engineer or Electrical Engineering.Travel to foreign contract manufacturer (estimate 5 weeks per year)", "jobDescription": "Apple is seeking an EE for iMac electrical & system design integration. The candidate will design, implement, test, and debug the electrical subsystem of the world’s best professional desktop computers within a collaborative cross-functional team.\n\nOur engineers rely on skills in computer system architecture, schematic design, digital and analog circuits, power and voltage regulator integration, high speed signal integrity concepts, PCB design, bring up and system level troubleshooting to surprise and delight millions of customers."}, "200434990": {"jobID": "200434990", "origin_search": null, "posted": "Oct 12, 2022", "jobTitle": "Camera Algorithms Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434990/camera-algorithms-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in Computer Science, Electrical Engineering, or Imaging Science, Ph.D preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Self driven and passionate for image quality excellence!Deep understanding and appreciation of sensor characteristics, optics, and image signal processing of the mobile imaging system, and their influence nuance to final image and video qualityDevotion to disciplined and time sensible practice from problem identification to concept validation and engineering implementation with tools of theories and image processing techniques, including machine learningMS/PhD in Computer Science, Electrical Engineering, or Imaging Science, Ph.D preferred.", "jobDescription": "At Apple's Camera algorithm team we are looking for extraordinary algorithm engineers to work on the image capture and processing/rendering algorithms that serve all Apple product cameras. As part of the team, you will work on core camera/ISP/Machine learning technologies based on Apple crafted image signal processing pipeline and HW components, such as the Apple Neural Engine. Here you will have the chance to define the way the Apple camera captures, processes, and renders outstanding still image and video quality. Our close-knit team fosters an environment of product innovation, rapid product iteration, and collaboration, at both team and multi-functional levels, granting you a liberating amount of autonomy. We work closely with various teams, like the Silicon Design, camera HW, and QA. Our team environment is multifaceted, fast-paced and requires a self-starter attitude."}, "200405522": {"jobID": "200405522", "origin_search": null, "posted": "Jul 26, 2022", "jobTitle": "iOS Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200405522/ios-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Software Engineer with 4+ years of experienceAdvanced programming skills in C, Objective-C, Swift, or similarExperience with distributed systems and multi-threadingExceptional Analytical and Problem Solving SkillsProven ability to think critically, learn new technologies, cut through ambiguity, and deliver resultsStrong teamwork, leadership, and time management skills; passion for leading, mentoring and developing junior team membersAbility to express ideas clearly within the team and across departmentsiOS and macOS familiarity preferredBS in Computer Science or equivalent experience", "jobDescription": "Join the Screen Time team at Apple, to help us improve the software for managing individual’s and families’ relationship with their devices. Our Screen Time team works closely with fellow engineers, and a variety of cross-functional teams to build the best-in-class Parental Controls product that adheres to Apple’s highest principles of privacy and security. Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly, and making the kind of impact that changes people's lives! We are looking for a full-stack developer to join our new and growing engineering team. The ideal candidate is an energetic self-starter with strong work experience. This person will play a central role in the delivery of Screen Time applications and services that empower users to improve their digital health."}, "200462035": {"jobID": "200462035", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Virtualization Technologies Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462035/virtualization-technologies-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or higher in Computer Science/Computer Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Experience with system programming.Experience with kernel and/or device driver developmentUnderstanding of OS internals and memory management.Knowledge of CPUs and/or GPU architectures.Understanding of virtualization technologies – CPU/GPU virtualization or device emulationExperience working with assembly languagesHighly focused, with the ability to deliver solid work on tight schedulesExcellent collaborative skills, with strong written and verbal communicationExcellent C and C++ programming skillsExperience with Objective-C or Swift a plusBS or higher in Computer Science/Computer Engineering", "jobDescription": "Do you see the big picture and love setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group we ensure that the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully coordinated operating systems that combine hardware, software, and apps into a single Apple experience. \n\nYour dedication to cross-disciplinary collaboration will help develop groundbreaking technologies for macOS, iOS, watchOS, and tvOS. By crafting these distinct, multidisciplinary user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. \n\nBe a part of making the next generation of Apple products. Join an interdisciplinary team in Apple’s Core OS group working across the entire system, from the kernel up through libraries, frameworks, and applications. As an engineer you will have a major impact on the design and implementation of Apple’s embedded and desktop operating system products, collaborating closely with experts throughout Apple’s software and hardware organizations. You'll work with some of the most talented engineers in the industry. We are looking for a candidate who wants to be challenged and is passionate about working on products that affect the lives of millions of users."}, "200396450": {"jobID": "200396450", "origin_search": null, "posted": "Jul 15, 2022", "jobTitle": "Applied Biomechanics Researcher, Apple Design Team", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200396450/applied-biomechanics-researcher-apple-design-team?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Master’s Degree or PhD in related fields."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3-5 years research experience: musculoskeletal/soft tissue/locomotion/exoskeleton biomechanicsand/or 3-5 years research experience: sports biomechanicsPrior experience working in industry is highly preferred.Prior experience working with designers and engineers is highly preferred.Master’s Degree or PhD in related fields.• Wide range of biomechanics toolboxes: 3D motion capture, inertia measurement unit (IMU),instrumented force/pressure measurements, electromyography (EMG), muscle oxygenation,indirect calorimetry, musculoskeletal modeling, finite element modeling for soft tissues.• Software: Matlab, Python, LabView, OpenSim.Please send your CV and a visual portfolio that demonstrates your previous research anddevelopment experiences.", "jobDescription": "The Apple Design Team is seeking an Applied Biomechanics Researcher to support the\ndevelopment and design of future products. This is an active role where collaboration with an\nimmense number of partners across the company is necessary. An ideal candidate has fluency\nacross disciplines related to human experience, though focused expertise in biomechanics is\nnecessary. They readily move between minute details and big ideas. Comfortable in any\nenvironment, their presence reassures others and solicits unfiltered feedback. They are\ntechnical, but also extremely intuitive and empathetic, capable of expressing objective evidence\nthrough compelling storytelling, championing the holistic human experience."}, "200345852": {"jobID": "200345852", "origin_search": null, "posted": "Feb 22, 2022", "jobTitle": "Software Engineer - Image Data Analytics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200345852/software-engineer-image-data-analytics?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A bachelor's degree or higher in Computer Science, Engineering, Physics, Applied Mathematics or related fields, with 3 years industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Highly skilled in at least one scripting language such as Python / Matlab, solid background in C/C++.Extensive knowledge and experience in statistical data analysis and visualization. Proficiency in python packages for data science such as Pandas, Numpy, SciPy, etc.Knowledge of professional software engineering and best practices for the full software development life cycle, including coding standards, code reviews, source control management, and testing.Good understanding and experience in image processing, image quality characterization and specification is a plusProactive, analytical thinking, excellent problem solving and communication skillsA bachelor's degree or higher in Computer Science, Engineering, Physics, Applied Mathematics or related fields, with 3 years industry experience.", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life. We're looking for an exceptional software engineer with broad skills to join us to take part in our high- impact projects for Apple’s next generation products."}, "200458907": {"jobID": "200458907", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "Platform Architecture Security Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458907/platform-architecture-security-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven track record of delivering security-focused features while working on end-to-end solutions with SW, Systems, Business/Factory Operations, Server, and Field Repair/Customer Care (e.g. AppleCare).Ability to facilitate development/design conversations with multiple engineering partners, document decisions/opens, and drive closure in a timely manner.Ability to build both a high-level program plan, as well as a detailed micro-schedule; and to drive each accordinglyProven success in driving multi-functional alignment, and being a change agent where vitalOutstanding documentation and self-organization; driving action item follow-up to ensure program momentum is maintained.Self-motivated and upbeat to mitigate program risks, close opens, and unblock critical path issues at the program level (including escalations of resource priorities).Leadership capabilities in being able to connect team members across an organization, and experience presenting to Sr Management/Executives.Familiarity with Product Fraud, Tampering, and Repair; including a basic understanding of future legislative initiatives such as Right-to-Repair.Familiarity with security concepts and architectures (e.g. encryption vs. signing vs. attestation, knowledge of various security architectures such as HW vs. SW key protection, secure boot technologies, and/or secure cloud storage platforms).BS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norms here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nAre you a leader? Do you want to apply your engineering background to make big things happen? Can you influence, connect, get results and communicate optimally? Can you deliver results while running a complex schedule? \n\nAs a Platform Architecture Security Engineering Program Manager within the Hardware Technology team, you will lead security-focused programs and features for Apple products, silicon, services, and a wide variety of multi-functional security initiatives.\n\nWe are looking for a dedicated Engineering Program Manager or a technical leader who is passionate about getting into program management and inspiring the team to collaborate and deliver innovative designs within schedule constraints. The ideal candidate needs to be able to dig into sophisticated technical topics while balancing the strategic needs of the project and the tradeoffs involved in technology development."}, "200461722": {"jobID": "200461722", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Senior Software Engineer- Data Semantic layer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461722/senior-software-engineer-data-semantic-layer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's or Master's degree in Computer Science, Information Systems, or a related field\n\nApple is an equal opportunity employer and value diversity at our company. Apple does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proven experience in data engineering, data architecture, or a related fieldExperience in building and deploying semantic layers for analytics data is a plusStrong understanding of data modeling, data warehousing, and ETL conceptsProficiency in SQL and experience with at least one major data analytics platform, such as Hadoop, Spark, or SnowflakeExperience with data integration and data governance tools, such as Talend, Informatica, or CollibraExcellent problem-solving and analytical skills, and the ability to work well under tight deadlinesExcellent interpersonal skills and the ability to collaborate effectively with multi-functional teamsBachelor's or Master's degree in Computer Science, Information Systems, or a related field\n\nApple is an equal opportunity employer and value diversity at our company. Apple does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with dedication to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s outstanding integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep dedication to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and multi-functional, offering greater exposure to the array of opportunities here.\n\nWe are seeking a highly experienced Senior Engineer to join our team and own the development of a semantic layer for our analytics data. In this role, you will be responsible for crafting and building a comprehensive data architecture that will enable seamless data integration and enable the delivery of high-quality insights to our customers."}, "200460685": {"jobID": "200460685", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "AR/VR Audio Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460685/ar-vr-audio-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "BA, MS or PhD - Computer Science, Electrical Engineering, Music Technology, or other similar technical fields"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Excellent written and communication skillsStrong understanding of digital audio and audio software conceptsExtensive experience in C++Strong understanding in high performance multi-threaded audio software architecture and engineeringPreferred strong understanding of iOS/macOS application developmentPreferred experience in Swift, Objective-CBA, MS or PhD - Computer Science, Electrical Engineering, Music Technology, or other similar technical fields", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it.\n\nOur Technology Development Group is looking for a Senior Audio SW Engineer to develop the next generation of audio software and experiences for our platforms. We work closely with software and audio teams from across the company to direct and execute on the the future of audio features in Apple products, and are pushing the boundaries of what can be created using our first party Augmented Reality and Audio frameworks such as ARKit, RealityKit, and PHASE."}, "200335285": {"jobID": "200335285", "origin_search": null, "posted": "Feb 25, 2022", "jobTitle": "HID, Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200335285/hid-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "2+ years experience developing system software such as drivers or frameworksStrong C/C++ and object-orientated programming skillsExcellent debugging skillsExperience with profiling code in both kernel and userspace.Ability to quickly familiarize yourself with code you’ve never seen before, and understand the pertinent functionalityStrong verbal and written communications skillsSelf directed, analytical, and work well in a team environmentComfortable working at both higher and lower levels of softwareBS or MS in CS/CE-  Experience designing SW interfaces or APIs-  Experience implementing customer-facing features is a plus-  Familiarity with IOKit, Objective-C, and other iOS/OS X", "jobDescription": "The Human Interface Devices Software team is responsible for delivering high-quality drivers, frameworks and tools supporting sensing technologies across all Apple products. Primarily supporting the multitouch technology, we have deep experience developing systems software and building stacks that enable the best user-experience. We work closely with Algorithms, Firmware, Design, and UI teams to ensure sensor and software performance is optimized across all layers of the stack."}, "200300892": {"jobID": "200300892", "origin_search": null, "posted": "Oct 14, 2021", "jobTitle": "Software Hybrid Test Engineer - Computer Vision", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200300892/software-hybrid-test-engineer-computer-vision?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS CS/CE/EE (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Work with world-class computer vision engineers to understand the algorithms they develop.Build evaluations and metrics to quantify algorithm performance, and relate them to user experience.Design and implement automated systems to run your tests at scale.Investigate observed behaviors and gather diagnostic data to track issues to their source.Drive issues to closure by working with a wide range of cross-functional teams.3+ years of experience in a Software Test Engineer role.Excellent knowledge of software testing methodologies & practices.Excellent knowledge of QE automation architecture, methodologies, processes, and tools.Ability to triage problems, prioritize accordingly, and propose resolutions.Experience with Python or equivalent object-orient scripting language.BS or MS CS/CE/EE (or equivalent)", "jobDescription": "The Video Computer Vision organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video. We have contributed to the FaceID and FaceKit project in the past and more recently the new LIDAR iPad sensor. \n\nAlgorithms, infrastructure, quality assurance and reporting are all tightly integrated at Apple. You can expect to interact consistently with senior engineers and researchers as you develop the expertise necessary to expertly test state of the art computer vision algorithms. Through our close collaboration with the algorithm teams, we help deliver best-in-class products with commitment to code quality, testability and maintainability."}, "200392546": {"jobID": "200392546", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "SW Engineering Program Manager (EPM) - Embedded Software - Technology Development Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200392546/sw-engineering-program-manager-epm-embedded-software-technology-development-group?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS Engineering or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "5+ years of hands-on engineering or project management experience in embedded software, device drivers, and/or pre-silicon.Ability to understand new technologies and dive into details.Extraordinary verbal/written communication skills, ability to distill information for the right audience.Self-motivated, collaborative, curious, pro-active with demonstrated critical thinking capability.Great attention to detail.BS/MS Engineering or equivalent work experience", "jobDescription": "The Technology Development Group is a growing, high energy, results-oriented team. We are looking for an experienced technical software engineering program manager (EPM) to drive embedded SW development on new HW platforms. Are you an embedded SW project manager that thrives on working on new technologies and fast-paced product development? Do you like to lead a multidisciplinary team working on the future of consumer electronics? Then we want to hear from you!"}, "200462422": {"jobID": "200462422", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Senior Automation QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462422/senior-automation-qa-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE or equivalent experience is expected"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "Excellent knowledge of software development lifecycle, test methodologies and tools and, passion for quality processes.Experience or demonstrated ability in working in an automated testing pipeline (integration + system + functional + use case validation) driven by a Continuous Integration framework.Ability to define/design/develop/maintain test automation frameworks.Experience with Continuous Integration tools (e.g. Jenkins).Experience in C/C++/Obj-C and scripting languages (e.g. Python).Strong organizational and communication skills.5+ years of relevant experience.Experience with macOS, iOS and Xcode.BS or MS in CS/CE or equivalent experience is expectedDemonstrated ability in increasing functional test coverage (UI, API).Demonstrated ability in enhancing test frameworks (scalability, reliability).Experience in test automation frameworks that involve HW & SW subsystem.Basic Understanding of Display Technologies, Rendering Pipeline and Graphics", "jobDescription": "Apple's Technology Development Group is looking for a Senior Automation Quality Engineer to enhance our testing capabilities for new and exciting technologies. As a member of our fast-paced group, you will have the unique and rewarding opportunity to be part of and shape upcoming products that will delight and inspire millions of Apple’s customers every day."}, "200349950": {"jobID": "200349950", "origin_search": null, "posted": "Sep 12, 2022", "jobTitle": "Software Architect, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200349950/software-architect-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in Computer Science, Distributed Systems, Software Engineering, or related field; experience designing, building, maintaining, and extending production ecosystems at scale."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "15+ years of industry software engineering experience; 8+ years of industry experience as an architectArchitect distributed systems and develop technology roadmaps at global scaleImplement architectural vision with consistent, predictable and repeatable processesRich experience in business process definition, requirement definition and solution architectureContinually analyze architecture and current technology to proactively recommend improvements and new solutionsExperience with on-premise, cloud (AWS, Azure) and hybrid ecosystems across geographiesDesign with focus on security and privacyPrevious advertising experience is a strong plusBS/MS/PhD in Computer Science, Distributed Systems, Software Engineering, or related field; experience designing, building, maintaining, and extending production ecosystems at scale.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at massive scale and setting new standards for enabling effective advertising while protecting user privacy.\n\nWe are seeking a seasoned solution architect that will direct and drive critical initiatives and projects innovating and building our Advertising Platforms. Responsibilities will range from leading and or supporting our service architectures spanning core services, shared business and business services across our mission-critical pipelines. In this role, you will have an opportunity to define, refine and/or refactor strategies, solutions and architectures to achieve our business goals and help solve our engineering challenges."}, "200309691": {"jobID": "200309691", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Core Technologies Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200309691/core-technologies-quality-engineer?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS in Mechanical, Electrical, Optical, Materials, or Industrial Engineering or equivalent. MS/PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$109,000", "max": "$208,500,"}, "benefits": null, "requirements": "Strong statistical and data analytics skills - statistical process control and sampling methodsData driven and results oriented approach to problem solving, failure analysis techniquesClear and consistent communication, including executive level presentation skills and ability to drive multi-functional teamsKnowledge of Quality Systems, Design of Experiments, Reliability ModelsExperience in technical domain (Product Design, Manufacturing, Quality, Process Engineering, etc), high volume manufacturing, or development of consumer electronics or componentsBS in Mechanical, Electrical, Optical, Materials, or Industrial Engineering or equivalent. MS/PhD preferred.• Excellent written and verbal communication skills in English. Mandarin language skills are a plus but not required• Finance/business acumen (understand cost drivers and derive costs associated with managing quality)• Reliability methods and quality sampling methodologies• Third party production quality & process management experience• Experience working with customers• Project management experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nAt Apple, Quality is one of the cornerstones of what makes our products and technologies great. Leading the team responsible for ensuring our customers receive the high quality and reliability they expect in addition to enabling a design where quality is built in to scale large volumes at capable suppliers is an incredibly challenging job requiring a broad array of technical and management skills. You will engage early in development to enable new technologies that goes across Apple Products."}, "200399604": {"jobID": "200399604", "origin_search": null, "posted": "Sep 9, 2022", "jobTitle": "Sr. iOS Software Developer - Health Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200399604/sr-ios-software-developer-health-technologies?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MSCS or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "8+ years of experience in Software DevelopmentExpert in Swift or Objective-CExperience with Python is highly desiredExperience in data science (including ML algorithm implementation)Demonstrated technical leadership of SW development projectsInterest in learning new programming languages and technologiesBroad interest spanning from early prototyping to shipping finished featuresDemonstrated ability to work as part of an interdisciplinary teamStrong written and oral communication skillsBS/MSCS or equivalent-Experience with web backend programming-Experience with C++-Conversant with signal processing techniques (DSP, filtering techniques, etc.)-Interest in health applications and features", "jobDescription": "Apple Health Technologies is looking for a Sr. iOS Software Developer to work on exploratory projects - investigating new physiological sensing methods, prototyping health product concepts, or building research data collection systems."}, "200420122": {"jobID": "200420122", "origin_search": null, "posted": "Aug 31, 2022", "jobTitle": "Software Engineer, Apple Pay", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420122/software-engineer-apple-pay?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science or related technical field, equivalent work experience will be considered"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of professional development experienceSignificant experience (5+ years) in designing, implementing & supporting highly scalable systems and services in Java, Scala and/or other JVM-based languagesAt least 4 years experience with SQL, NoSQL or NewSQL technologies (see Additional Requirements below)Self-starter with strong customer and product focusAbility to communicate thoughtfully, leveraging problem-solving skills and a learning mindset to build long-term relationshipsBS or MS in Computer Science or related technical field, equivalent work experience will be consideredAny of the following is an advantage:Practical experience with CockroachDB, Cassandra, FoundationDB, DynamoDBPublic cloud platforms (AWS, GCP, etc)Deployment experience using Docker and KubernetesRelational data modeling & practical experience with RDBMS (Oracle, Postgres, MySQL etc)Practical experience with Apache KafkaFintech experiencePayments experience", "jobDescription": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. You bring passion, and dedication to your job and there's no telling what you could accomplish.\n\nWe are building the next generation systems powering Apple Pay. Working alongside a talented team of engineers our initiative is to build the strategic elements of the Apple Pay stack, enabling first to market features that differentiate our products."}, "200305193": {"jobID": "200305193", "origin_search": null, "posted": "Nov 10, 2021", "jobTitle": "iOS Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200305193/ios-engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in CS/CE (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$343,500,"}, "benefits": null, "requirements": "At least 7+ years in software development, 3+ years in leading engineering initiativesExperience developing and deploying high quality applications for iOS/iPadOS/watchOS in the App StoreExperience delivering customer facing and business critical applicationsExperience integrating with RESTful APIs and working with backend team on a full-stack solutionExperience driving end-to-end engineering architecture and design for front-end / app development as well as distributed back-end serverStrong object-oriented programming and design skillsStrong grasp of iOS Apple development tools (e.g. Xcode, LLDB, and Instruments) and iOS/watchOS SDKAbility to work well and respectfully with others by listening, communicating clearly, and actively sharing knowledgeA track record of leading projects, mentoring peers, and collaborating with technical and business partners.Excellent verbal and written communication skillsAbility to coordinate between different teams and partners, making the right trade-offs in dealing with complexity     and conflicting priorities.BS/MS in CS/CE (or equivalent)Experience in integration and deploying CoreML Models is a strong plus Experience with cloud platforms is a strong plus Experience working with sensor data is a strong plus (e.g. cameras, image sensors). Strong interest and background in image captures & related topics is a plus", "jobDescription": "At Apple we want to make phenomenal products that empower people to improve their lives. The Sensing Software team is seeking a talented iOS Engineering Manager / Tech Lead to lead an Applications development team. Our fantastic team of engineers build platforms that enable development of next generation features for our customers. Come, join us in our dedication to leave the world better than we found it."}, "200449894": {"jobID": "200449894", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Packaging Substrate Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449894/packaging-substrate-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "We are looking for an individual with experience as a process integration, manufacturing, R&D engineer in substrate industry In-depth knowledge of substrate technologyFamiliarity with PKG process & criteria is a plusOutstanding technology development & project management skillsStrong communication & collaborative skillsBS and +10 years of relevant industry experience-  BS and +10 years of relevant industry experience", "jobDescription": "Do you love working on challenges that no one has solved yet? Do you like changing the game? Envision what you could do here. At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!"}, "200441503": {"jobID": "200441503", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "Education Technologies Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441503/education-technologies-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience developing apps or building frameworks or developing UI's will be considered. Significant experience developing iOS or macOS consumer applications or equivalent applications is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong grasp of Objective-C and Swift design patternsStrong ability to write performant and correct multi-threaded codeTalent for cleanly architecting UI featuresPassion for quality and attention to detailAptitude to independently learn new technologiesSuperior ability to identify and resolve complex problemsExcellent communication skills with the ability to work cross-teamInquisitive and highly-motivated self-starterBS in Computer Science or equivalent experience developing apps or building frameworks or developing UI's will be considered. Significant experience developing iOS or macOS consumer applications or equivalent applications is required.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Would you like to help teachers around the world elevate the quality of their students’ experience using technology in the classroom? The Apple Classroom team is looking for an experienced engineer with a passion for developing the highest quality software to bring innovative new features to life in Apple’s Classroom app for iPadOS and macOS."}, "200455919": {"jobID": "200455919", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Data Science and Visualization Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455919/data-science-and-visualization-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Masters or Ph.D. degree in an analytical field such as (but not limited to) Computer Science, Engineering, Statistics, Applied Math, Physics, Biological Sciences, Robotics, Climate or Environmental Science, Computer Graphics, Data Science."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience programming in R and/or Python. You have experience using these tools to import, clean, analyze and visualize data to enable data-driven decision making.Able to process, debug, and clean large datasets from real-world human studies.Experience writing code to generate visualizations that enable deeper insight into data.Ability to quickly turn from concept/paper sketches of graphs to functional and scalable data visualizations.Ability to simplify and communicate complex information in an easily understandable manner.Collaborating with cross-functional teams to help identify trends in their data or to build tools that will enable easier analysis and visualizations in the future.Masters or Ph.D. degree in an analytical field such as (but not limited to) Computer Science, Engineering, Statistics, Applied Math, Physics, Biological Sciences, Robotics, Climate or Environmental Science, Computer Graphics, Data Science.Nice to have:-  Ability to create simple and beautiful slides that communicate complex data-  Experience applying ML solutions to data-related problems when appropriate-  Expertise in NumPy, Pandas, Matlab, or Tableau, or other data visualization tools/frameworks-  Experience with basic CV algorithms and ability to apply them to simple problems Ability to create hardware heat maps and overlay data on 3D objects", "jobDescription": "We are the Product Systems Quality (PSQ) team, and we run user studies on new hardware products. We are looking for a Data Scientist and a Visualization Specialist to play a key role at shaping up the way we collect, digest, and visualize the data we gather in user studies.\n\nWe work cooperatively with designers and engineers to understand challenging problems that arise during all stages of product design. This role requires collaborative work, proficiency using statistics and visualizations to answer specific questions about datasets, solid programming skills in R or Python, and most importantly: a passion for crafting informative visualizations and presentations to communicate results to all levels of the company. \n\nCome join our team and contribute to the research and development of some of our most magical product"}, "200400864": {"jobID": "200400864", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Instrumentation & Calibration Engineer- Sensors", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200400864/instrumentation-calibration-engineer-sensors?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in EE/CS/CE/Physics\n3+ years of professional experience with at least 1 year in the a relevant sensing industry position"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Professional experience designing, debugging and working with electromechanical systemsExperience working with magnetometers and pressure sensors is a plus!High volume consumer electronics calibration, testing and manufacturing experience preferredFamiliarity with programming in : C/C++/Objective-C and scripting languages like Python/LuaExperience in one or more source control systems like Git/SVNExperience with processing data using tools like MATLAB, JMP or PythonStrong applied mathematical skills (linear algebra, algorithms)Ability to work well in a collaborative, highly multi-functional and fast environment.Experience/interest in systems engineering in a multidisciplinary environmentStrong English written and verbal communication skillsBS/MS in EE/CS/CE/Physics\n3+ years of professional experience with at least 1 year in the a relevant sensing industry positionUp to 10% international travel", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Are you up for the challenge?\nThe Hardware Test Engineering team plays a key role in keeping up quality standards, and through work with the team, you’ll have the unique opportunity to impact products all across Apple. The team is looking for a Systems Design Engineer, who will be owning up design and deployment of calibration and performance testing equipment for Motion Sensors like IMUs and Magnetometers.\n\nCome join us!"}, "200461002": {"jobID": "200461002", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "AIML - iOS/macOS Engineer, Siri", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461002/aiml-ios-macos-engineer-siri?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "We’re looking for individuals with relevant experience in software development, performance, and architecture, regardless of educational background."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid understanding of computer science algorithms, data structures, and object-oriented programmingExperience with client/server and large-scale software architecturesExperience with profiling and improving the performance/reliability of embedded softwareEnjoys debugging or analysis workAbility to quickly learn and adapt to different technologiesExperience writing an iOS and/or macOS app is a bonusWe’re looking for individuals with relevant experience in software development, performance, and architecture, regardless of educational background.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Help make Siri on your iPhone, iPad, and Mac run smoothly and speedily release after release. Work across the stack in diverse areas including user experience, orchestration, and execution while also developing user-facing features. Do you love to optimize for maintainable, reliable, and performant code while also improving the customer experience for millions of users? Come join us!"}, "200397164": {"jobID": "200397164", "origin_search": null, "posted": "Aug 19, 2022", "jobTitle": "Senior Data Modeler - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200397164/senior-data-modeler-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "10+ years professional experience in computer science, mathematics, or similar quantitative field.4 years in data modeling required; 2 years in the advertising industry is a plusAbility to operate in a fast paced environment, quickly and efficiently shifts gears to meet changing business requirements.Metadata management platform concepts including discoverability, observability, data mesh and data catalogRelevant and significant work experience with business requirements definition and management (end to end), structured analysis, process design, use case documentation, UML process and use case definitionData Modeling tools such as GraphQL, Swagger, PlantUML, MagicDraw, Erwin, Power Designer, XML SpyData communication languages such as XMI, XML (including @Annotations), JSON, Protobuf, Avro, Parquet, etc.Rule expression languages and grammars such as Regular Expressions, Backus-Naur Form, OWL, SHACLGood programming experience in one or more of the programming languages like Java, Perl, Python, ScalaExtract Transform Load (ETL) experience using Spark, Kafka, Hadoop, or similar technologiesPresto, Hive, SparkSQL, Cassandra, Solr, Iceberg, or other big-data query and transformation experienceBachelors Degree or equivalent experience.", "jobDescription": "The Ad Platforms team is seeking a Senior Data Architect / Modeler to support our data governance and management objectives. The individual must have excellent data modeling, model management, data architecture and data governance experience. Will be responsible for architecting an enterprise level metadata repository, including information about physical and logical ERDs, data structures, data types, business rules, stewardship, data quality parameters and data lineage."}, "200441880": {"jobID": "200441880", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Display Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441880/display-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS, or PhD in Mechanical or Aerospace Engineering or similar. We are open to multiple experience levels for our positions."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "High energy personality with a real passion for learning and attention to detailExcellent prioritization, cross-functional collaboration, and written & verbal communication.Solid understanding of mechanical engineering fundamentals including properties of materials, solid mechanics, beam statics, Newtonian physics, and thermodynamics.The ability to perform mechanical design & validation, including the development of component or material evaluation tests, and failure analysis.3D/2D software expertise: 3D modeling (Pro/E, NX, CATIA, or Solidworks), engineering drawings, Geometric Dimensioning and Tolerancing (GD&T).Exposure to diverse manufacturing techniques such as injection-molding, sheet-metal stamping, 3D printing, and materials such as polymers, glass, and metals. Good understanding of DFA/DFM, & statistical tolerance analysis.Applied Design of Experiments (DOE) and scientific method to address engineering issues.Willingness and ability to travel internationally (~15%, primarily Asia).BS, MS, or PhD in Mechanical or Aerospace Engineering or similar. We are open to multiple experience levels for our positions.- Experience with simulation and analysis such as Finite Element Analysis (FEA) for structural and thermal, Computational Fluid Dynamics (CFD).- Familiarity with Six Sigma methodology, process capability, and capable of large data set analysis using JMP, MATLAB, or Minitab.- Electro-mechanical design and/or manufacturing for high-volume products with an emphasis on reliability.", "jobDescription": "At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. We want outstanding engineers to bring passion and dedication to our team. \n\nApple’s Display Technologies group is looking for Mechanical Engineers to design and develop innovative display modules for future products. Here you will create next-generation technologies, processes, and components, and own the integration of them into groundbreaking, mechanically robust display designs with amazing performance."}, "200441020": {"jobID": "200441020", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Wireless Software Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441020/wireless-software-performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Masters in Electrical Engineering or Wireless Communications"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Looking for the ideal candidate with validated experience in Cellular OR satellite communication protocols and systemsFor the cellular role it is required to have deep understanding of wireless standards: (including but not limited to 3GPP 5G-NR/5GC, LTE, IEEE 802.11ax, 802.11ad, IP, TCP/UDP) and their application to end to end product performance. Shown experience with 4G/5G network emulators and major infra vendor equipmentFor the satellite communications position it is required to have working experience with Satellite communications systems, RF, link budget, antennas, modems, Software Defined Radios (SDR)Experienced with scripting and developing performance automation tools and softwareExcellent communication and presentation skillsAbility to work in a highly multi-functional setting across SW, HW, RF, Carrier/Partner engineering and Product Design teamsAbility to quickly adapt to new technologies and out-of-the box thinking and to propose technology and product improvements in a data driven wayConsistent track record of delivering performance focussed efforts for projects that went to mass production8+ years of system performance, design or architecture experienceMasters in Electrical Engineering or Wireless Communications", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Cellular, Wi-Fi, Bluetooth, GPS, Satellite Communications and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. The Wireless system performance team is striving for innovative ways to use wireless communication technologies and enable new services and products that surprise and delight our customers. We are seeking an experienced technologist chartered to build wireless performance labs; play a major role in architecture, design and enhancement of new cellular or satellite communication technologies and products. Will work on a team that will drive new initiatives within the company and the industry, focused on end user experience."}, "200416456": {"jobID": "200416456", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Site Reliability Engineer (SRE)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200416456/site-reliability-engineer-sre?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Strong passion in building reliable, scalable, and performant cloud-based servicesProvisioning and maintaining distributed systems using Kubernetes and containersStrong understanding of distributed systems w.r.t. storage, networking, and securitySRE or Dev/Ops experience in managing customer-facing systems in 24/7 environmentExcellent judgment and integrity with ability to make timely and sound decisionsAbility to anticipate the needs of others and adapt to changing conditionsExcellent verbal and written communication skills", "jobDescription": "The Site Reliability Engineer role resides within the Software Delivery organization, which is at the core of the Apple software release process. This role is responsible for creating and maintaining services, which are used by software engineers to compile source and assemble Apple software for delivery to customers around the world. The Build Services team drives reliability and performance engineering, instruments observability of services, responds to incident alerts, and reports on SLI/SLO metrics for visibility across the organization. This SRE role is essential in maintaining cloud-based services that are responsible for delivering the state-of-the-art operating systems (macOS, iOS, watchOS, tvOS) and more to Apple customers."}, "200284646": {"jobID": "200284646", "origin_search": null, "posted": "Jun 5, 2022", "jobTitle": "Site Reliability Engineer (SRE)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200284646/site-reliability-engineer-sre?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Strong passion in building reliable, scalable, and performant cloud-based servicesProvisioning and maintaining distributed systems using Kubernetes and containersStrong understanding of distributed systems w.r.t. storage, networking, and securitySRE or Dev/Ops experience in managing customer-facing systems in 24/7 environmentExcellent judgment and integrity with ability to make timely and sound decisionsAbility to anticipate the needs of others and adapt to changing conditionsExcellent verbal and written communication skills", "jobDescription": "The Site Reliability Engineer role resides within the Software Delivery organization, which is at the core of the Apple software release process. This role is responsible for creating and maintaining services, which are used by software engineers to compile source and assemble Apple software for delivery to customers around the world. The Build Services team drives reliability and performance engineering, instruments observability of services, responds to incident alerts, and reports on SLI/SLO metrics for visibility across the organization. This SRE role is essential in maintaining cloud-based services that are responsible for delivering the state-of-the-art operating systems (macOS, iOS, watchOS, tvOS) and more to Apple customers."}, "200448091": {"jobID": "200448091", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "WebKit Media Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448091/webkit-media-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Familiarity and experience with pointer-based languages, C or C++ preferred.Understanding of data structures and algorithms.Excellent debugging, critical thinking, and interpersonal skills.Familiarity with web technologies, including HTML5 video and Web Audio.Basic knowledge of macOS and web browsers.BS or equivalent", "jobDescription": "The WebKit team seeks a software engineer excited to work on innovative technology for the world’s most popular web engine! Weʼre looking for engineers with outstanding critical thinking skills, a passion for quality, and the desire to push the web forward!\n\nWe are looking for someone who will be responsible for bringing the latest media technologies to the web.\n\nThe WebKit framework powers many system applications, including Safari, Mail, and Books."}, "200464586": {"jobID": "200464586", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Sr. RFIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464586/sr-rfic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Strong knowledge of RFIC circuit design. Direct tape-out experience with one or more of the following blocks: RF front-end circuits, PA, LNA, mixer, oscillator, PLL, LO, VGA, filter, ADC/DAC, TIA or other baseband analog blocks in deep sub-micron CMOS technology.Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability, and other analog impairments.Knowledge of CMOS device physics, RF device modeling, device noise parameters, inductor modeling, and circuit layout for optimum RF performance.Insights into packaging effects, supply isolation, and high frequency ESD strategies.Familiarity with various RF transceiver architectures and their trade-offs, as well as calibration methods used.Exposure with Cadence Virtuoso, Spectre RF, EMX and similar tools.Understanding of system specifications and ability to work with system architects to translate system requirement into circuit requirements at IC level.Experience in Si characterization and debug.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Wireless SoC Radio Team designs state-of-art highly energy efficient CMOS radios, from RF to bits. To deliver these radios, our team is responsible for the design of a wide range of RF, analog, and mixed-signal blocks from RF front-end amplifiers to data converters, including baseband filters, baseband and RF phase-locked loops, crystal oscillators, and bandgap references. We are working on new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an RFIC design engineer, you will be at the center of this wireless SoC design group. You will have a critical impact on developing Apple’s state-of-the-art radios and getting them into hundreds of millions of products."}, "200461642": {"jobID": "200461642", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "RF Systems Integration Engineer - Cellular Protocols", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461642/rf-systems-integration-engineer-cellular-protocols?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE required. MSEE preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid understanding of RF fundamentals and communication theoryExperience programming in C/C++ with good object oriented design principalsGood understanding of RF metrics and knowledge of cellular standards including LTE and 5G (PHY)Hands-on Experience with RF/Wireless lab equipment like call box testers, spectrum analyzers, oscilloscopes, vector signal generators, power sensors, switch controllers, etcEnergy and drive to thrive in a dynamic environmentBSEE required. MSEE preferred.-  Recent experience with automation, scripting and development of test plans-  Familiarity with data processing and statistical tools-  Good understanding of cellular 3GPP (2G/3G/4G/5G) RF standards-  Experience with RF-Transceiver/Baseband Physical & Layer 1 control-  Experience and understanding of Antenna/OTA measurements.-  Strong technical background in 5g-NR/LTE/UMTS physical layer", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Join us in creating the best products in the world, crafting best techniques and methodologies that enhance user experience.\n\nThe System RF group at Apple is growing rapidly and looking to onboard individuals with passion for wireless tech, eagerness to learn and who want to collaborate with the brightest minds to bring forth exciting products that enrich people's lives.\n\nYou will become part of a hands-on development team that furthers engineering finesse, creativity and innovation. You will be responsible for integration of the RF sub-system into multiple products, perform in-depth data analysis, assess design maturity and make contributions to current and future design. Interact and work closely with teams from hardware, software and systems across Apple as well as chipset and instrument vendors. You will develop techniques, algorithms, and methods to guarantee consistent and reliable wireless performance on Apple products. The scope of work spans both sub 6GHz and mmWave development. Bring passion and dedication to your job and there's no telling what you could accomplish!"}, "200467073": {"jobID": "200467073", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "AIML - Sr Software Engineer/Tech Lead, Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467073/aiml-sr-software-engineer-tech-lead-siri-and-information-intelligence?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S/M.S/Ph.D in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum 10 years of professional experience in software developmentMinimum 3 years of experience as a technical lead/architect including technical leadership and mentorship experienceExtremely strong communication and collaboration skillsPassion for building great products and data privacyExperience mentoring and coaching junior engineersB.S/M.S/Ph.D in Computer Science or equivalent experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you believe in data privacy especially when it involves voice interactions? Come join the Siri team at Apple. Contribute to defining and building the end-to-end system that provides strong privacy guarantees while allowing Siri to learn and improve!\n\nWe are looking for an experienced Sr Software Engineer/Tech Lead who wants to bring their passion for building incredible software products that would affect hundreds of millions of customers worldwide. An ideal candidate will have a proven track record of delivering high-quality products and leading collaborations with cross-functional teams. Our growing team combines strong technical skills, product vision, and an exciting mission."}, "200451031": {"jobID": "200451031", "origin_search": null, "posted": "Jan 7, 2023", "jobTitle": "Software Continous Integration and Tooling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451031/software-continous-integration-and-tooling-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS, MS or higher in Computer Science, Computer Engineering or Electrical Engineering and relevant majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Familiarity with parallel build pipelines, automated build, continuous integration (CI), and test automation systems. Experience with Jenkins, Gerrit and similar tools is a strong plus.Proficient in at least one scripting language (Bash/python/Groovy, perl) and one object-oriented programming languages (Java, C++, Swift, etc)Highly competent with Git version-control system, and agile workflows. Deep understanding of software configuration management (SCM). Experience with Xcode and/or GNU Make is a plus.Experience with automating public cloud deployments (AWS, Azure, Google Cloud) and Docker, Kubernetes, and Helm is preferredExperience in creating custom data visualizations is a plus (HTML/CSS, JavaScript, JS frameworks, ReactJS, AngularJS, NodeJS, Spring Boot, Vapor (Swift)). Familiar with relational or NoSQL databases (MySQL, Postgres, MongoDB, Redis, etc.)BS, MS or higher in Computer Science, Computer Engineering or Electrical Engineering and relevant majors", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) team and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! We build and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. We are looking for a highly disciplined and self-motivated engineer who can be succeed in a high-paced environment. The people who work here have reinvented and defined entire industries with our products and services. You will be part of a highly energetic team that has delivered amazing wireless products to improve users’ seamless experience in across all Apple’s products."}, "200458903": {"jobID": "200458903", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "Platform Security Architecture Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458903/platform-security-architecture-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Relevant experience in High Tech and/or Product SecurityProven Technical Program Management / Engineering Management experience.Consistent track record of delivering security-focused features while working on end-to-end solutions with SW, Systems, Business/Factory Operations, Server, and Field Repair/Customer Care (e.g. AppleCare).Ability to facilitate development/design conversations with multiple engineering team members, document decisions/opens, and drive closure in a timely manner.Ability to build both a high-level program plan, as well as a detailed micro-schedule; and to drive each accordinglyDemonstrated success in driving multi-functional alignment, and being a change agent where vitalOutstanding documentation and self-organization; driving action item follow-up to ensure program momentum is maintained.Self-motivated and upbeat to mitigate program risks, close opens, and unblock critical path issues at the program level (including escalations of resource priorities).Leadership capabilities in being able to connect team members across an organization, and experience speaking publicly to Sr Management/Executives.Consistent track record of handling and leading through ambiguity.Ability to influence without authority, including the ability to influence Sr Management and multi-functional leadershipShowed strength in applying breadth and depth across multiple technical fields, as well as a validated capacity to pick up sophisticated new topics quickly.Absolute clarity in communication, including the ability to craft a compelling narrative around sophisticated topicsFamiliarity with Product Fraud, Tampering, and Repair; including a basic understanding of future legislative initiatives such as Right-to-Repair.Familiarity with security concepts and architectures (e.g. encryption vs. signing vs. attestation, knowledge of various security architectures such as HW vs. SW key protection, secure boot technologies, and/or secure cloud storage platforms).BS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norms here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product!\n\nAre you a leader? Do you want to apply your engineering background to make big things happen? Can you influence, connect, get results and communicate optimally? Can you deliver results while running a complex schedule? \n\nAs a Platform Architecture Security Engineering Program Manager within the Hardware Technology team, you will lead security-focused programs and features for Apple products, silicon, services, and a wide variety of multi-functional security initiatives."}, "200443077": {"jobID": "200443077", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Clinical Health Platforms - Clinical Analyst", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443077/clinical-health-platforms-clinical-analyst?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Manhattan Beach", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Medical Training (MD / NP / RN / Pharmacist or equivalent)\nUndergraduate, graduate, or fellowship training in Clinical Informatics or equivalent experience working with clinical data such as Clinical Decision Support, EHR implementation, or other related areas"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$131,000", "max": "$218,400,"}, "benefits": null, "requirements": "2+ years of direct patient care experienceA detailed understanding of medical coding standards, such as SNOMED-CT, ICD-9, ICD-10, CPT, HCPCS, LOINC, and RxNormFamiliarity with health data interoperability standards such as HL7/FHIRExperience with large, sophisticated clinical data sets to support data analysis, transformation, modeling, and quality assuranceExperience with scripting languages, such as python, for job automation or data analysis workProgramming skills, database design, and data quality assuranceBonus: Experience developing consumer technology products or using health technology in clinical/research applicationsMedical Training (MD / NP / RN / Pharmacist or equivalent)\nUndergraduate, graduate, or fellowship training in Clinical Informatics or equivalent experience working with clinical data such as Clinical Decision Support, EHR implementation, or other related areasUS license / practice experience is a plus", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly, and making the kind of impact that changes people's lives.\n\nThe Apple Health Software team embodies the core Apple values around delighting our customers with groundbreaking user experiences, empowering users to live a better - and healthier - life, while keeping their data safe, private, and secure.\n\nWe need your help crafting the next generation of health-related experiences by working to make clinical data more understandable, insightful, and actionable. You'll have the opportunity to work with world-class medical professionals, designers, and engineers to help innovate in healthcare in ways that only Apple can."}, "200455224": {"jobID": "200455224", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Sr. iOS Software Developer - Health Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455224/sr-ios-software-developer-health-technologies?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Required:10+ years of experience in Software DevelopmentExpert in Swift or Objective-Cexperience with Python is highly desiredExperience in data science (including ML algorithm implementation)Demonstrated technical leadership of SW development projectsInterest in learning new programming languages and technologiesBroad interest spanning from early prototyping to shipping finished featuresDemonstrated ability to work as part of an interdisciplinary teamStrong written and oral communication skillsDesired Qualifications:Experience with web backend programmingExperience with C++Conversant with signal processing techniques (DSP, filtering techniques, etc.)Interest in health applications and featuresBS/MS in Computer Science", "jobDescription": "Apple Health Technologies is looking for a iOS Software Developer to work on exploratory projects - investigating new physiological sensing methods, prototyping health product concepts, or building research data collection systems.\n\nWe are a very interdisciplinary team developing new technologies for health applications across Apple’s products(Apple Watch). Much of what we do involves some aspect of physiological sensing."}, "200439960": {"jobID": "200439960", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Touch Validation Hardware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439960/touch-validation-hardware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors degree in Electrical Engineering, Mechanical Engineering, Mechatronics or similar discipline. MS/PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience with NX, SolidWorks or similar, and low-volume prototyping (laser cutter, 3D printer, drill press, hand tools)Track record of analog electronics design and validationThorough familiarity with lab measurement techniques and test equipment including spectrum analyzers, including automation with scriptingExperience with PCB schematic design and test board developmentProficient in high-level programming languages for test automation. Experience with Python is a major advantageExcellent written and verbal communication skills and solid teamwork skills are essentialBachelors degree in Electrical Engineering, Mechanical Engineering, Mechatronics or similar discipline. MS/PhD preferred.", "jobDescription": "The Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPads, AppleWatch, and more. You will play a key role in developing hardware performance measurement systems for validation, and ensuring that the Touch Technology team delivers the world’s best multi-touch user experience."}, "200439958": {"jobID": "200439958", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Touch Validation Hardware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439958/touch-validation-hardware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors degree in Electrical Engineering, Mechanical Engineering, Mechatronics or similar discipline. MS/PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience with NX, SolidWorks or similar, and low-volume prototyping (laser cutter, 3D printer, drill press, hand tools)Track record of analog electronics design and validationThorough familiarity with lab measurement techniques and test equipment including spectrum analyzers, including automation with scriptingExperience with PCB schematic design and test board developmentProficient in high-level programming languages for test automation. Experience with Python is a major advantageExcellent written and verbal communication skills and solid teamwork skills are essentialBachelors degree in Electrical Engineering, Mechanical Engineering, Mechatronics or similar discipline. MS/PhD preferred.", "jobDescription": "The Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPads, AppleWatch, and more. You will play a key role in developing hardware performance measurement systems for validation, and ensuring that the Touch Technology team delivers the world’s best multi-touch user experience."}, "200452002": {"jobID": "200452002", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Display System Architect- Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452002/display-system-architect-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 20+ years of relevant industry experience in signal processing/image processing. MS or Ph.D. preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 20+ years of relevant industry experience in signal processing/image processing. MS or Ph.D. preferred.The ideal candidate will have experience in chip architecture, display subsystem architecture, design experience with a complete understanding of the technologySoC display subsystem architecture and micro-architecture knowledgeThorough understanding of SoC display sub-system architecture, interface, performance and energy tradeoffsBroad understanding of display technologyDemonstrated expertise in memory sub-system, memory interface, and DMADemonstrated architectural modeling abilityStrong communication skills with cross-functional teamsBS and 20+ years of relevant industry experience in signal processing/image processing. MS or Ph.D. preferred.", "jobDescription": "Do you love working on state-of-the-art technologies? Are you a forward-thinking and love solving technological and architectural challenge? We at Apple, our Platform Architecture team features collaboration and hands-on environment that cultivates engineering excellence, creativity, and innovation! Join this team, and you’ll collaborate with engineers across Apple to develop algorithms and architectures that help build the flawless technology experiences we’re known for worldwide!\n\nIn this highly visible role, you will lead the architecture of SoC display subsystem, including memory fabric interface, data pipe flow controls, memory compression, display interfaces, and etc."}, "200361110": {"jobID": "200361110", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Software Engineer, Apple Watch - Frameworks and Apps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200361110/software-engineer-apple-watch-frameworks-and-apps?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS CE/CS or equivalent experience required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "You have excellent knowledge of Cocoa frameworksExcellent Cocoa and Objective-C coding abilityYou have a consistent record of completing projects on-time and to specificationYou have excellent communication and social skillsYou have an extraordinary attention to detailYou are upbeat, adaptable, and results oriented with a positive attitudeBS CE/CS or equivalent experience required", "jobDescription": "Join the team that is revolutionizing the watch! As a software engineer on the Apple Watch team, you will be responsible for building the communications apps and data syncing technology on the Watch. You’ll work closely with the UI design, iOS Frameworks, apps, and QA teams to develop experiences that will ship to millions of users."}, "200342023": {"jobID": "200342023", "origin_search": null, "posted": "May 4, 2022", "jobTitle": "Database Engineer, Infrastructure Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200342023/database-engineer-infrastructure-services?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of experience as a DBA / DRE in at least one of the database technologies cited aboveExperience with databases at TB scale, high throughput and low latencyPerformance analysis, queries optimizationExperience with monitoring and alerting systems2+ years of Experience with AWS (RDS, EC2, S3, IAM etc.) and GCP database offeringsGood software development skills in Python/Go/Shell/Perl, PL/SQL or similar languages for scripting and automationAWS Certified Solutions Architect - Associate is nice to haveExperience in Redis/MongoDB is plus.Knowledge and hands-on in AI/ML is a big plus.Strong Unix Internals experience.Excellent written and verbal communication skills, validated collaboration skills.Bachelor's degree in Computer Science or equivalent experienceExcellent written and verbal communication skills, proven collaboration skills.", "jobDescription": "Are you interested in building high-performance, highly scalable and available database systems that support Apple’s current and future growth? Are you seeking an environment where you can drive innovation? Does the prospect of working with top engineering talent get you charged up? If so, please read ahead!\n\nAt Apple, we are looking for a Database Engineer to help lead large-scale data store environments. This team is responsible for providing new architectures and scalability solutions to ever-growing business and data processing needs. If you love to tackle internet-scale challenges, then this is the right job for you!"}, "200464096": {"jobID": "200464096", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Cellular Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464096/cellular-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "Bachelors/Master/PhD degree in Computer Science, Electrical Engineering, Wireless Communications or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong Software Engineering skills including design, development (C or C++) and debuggingKnowledge of wireless/internet standards, including but not limited to 3GPP 5G-NR and LTE Data protocols (SDAP/PDCP/RLC/MAC) and their applications in end to end product designUnderstanding of protocols such as TCP/UDP/IP/QUIC/RRC/NAS is a plusExperience with silicon prototyping, emulation systems, and virtual platforms is a plusObsessively passionate and inquisitive with a focus on solving everyday problems in innovative waysExcellent communication and documentation skillsBachelors/Master/PhD degree in Computer Science, Electrical Engineering, Wireless Communications or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems team and be part of an elite team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, supporting people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200426225": {"jobID": "200426225", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "AR/VR Triage Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200426225/ar-vr-triage-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.19", "max": "$67.78/hr,"}, "benefits": null, "requirements": "Strong analytical and problem-solving skills.Ability to utilize debugging and troubleshooting techniques.Flexibility and ability to adapt in a dynamic environment.Excellent organizational skills.Excellent written and verbal communication skills.Exceptional attention to detail.Familiarity with Python, Javascript or other scripting languagesBachelor's degree or equivalent experience", "jobDescription": "The Technology Development Group (TDG) is looking for AR/VR Triage Engineers to help us build the next generation of interactive applications for our platform.  This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV).  As a member of our organization you will assist us in crafting future products that will delight, inspire and empower millions of people."}, "200394048": {"jobID": "200394048", "origin_search": null, "posted": "Jun 23, 2022", "jobTitle": "System Software Engineer – Sensing and Connectivity System Engineering Team", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200394048/system-software-engineer-sensing-and-connectivity-system-engineering-team?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent with operating system focus desired."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Implements kernel drivers for large operating systemsDemonstrates in-depth knowledge of C and C++Has a deep interest in system programming concepts, e.g. memory and process managementFamiliar with buses such as UART/USB/SPI/PCIeDelivers on time under tight schedulesHas excellent analytical, programming and debugging skillsHandles unexpected challenges under pressureThrives in a collaborative environment and can clearly communicate technical detailsLeads multiple projects across many teamsSeeks to solve everyday problems in innovative ways as a passionDrives towards the right solution not just any solutionBachelor's degree in Computer Science or equivalent with operating system focus desired.", "jobDescription": "Here in Sensing and Connectivity we work on a diverse set of fundamental technologies that are critical to making Apple Apple. We help integrate wireless technologies such as WiFi, Bluetooth and Ultra-Wideband into compelling solutions. We take data from the world around us such as acceleration, orientation and location to provide more immersive experiences. iPhone, iPad, AirPods, Apple Watch, Mac, Apple TV, HomePod, AirTag, name an Apple product and our team has made major contributions to its success!"}, "200434737": {"jobID": "200434737", "origin_search": null, "posted": "Oct 28, 2022", "jobTitle": "CV Data Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434737/cv-data-architect?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS + 15 yrs of relevant proven experience.\n\nMasters/PhD + 10yrs of relevant proven experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Deep expertise in CV/ML algorithm development process including, knowledge of common algorithms (used in battery-operated products with cameras), ground truth methodologies and standard performance evaluation metrics.Ability to work cross-functionally with stakeholders (Algorithms, Hardware, User study, etc.) to define requirements for data collection systems, understand trades, sensitivities, budgets, flows and risks in various implementations and drive convergence to final solution.Experience with the product development cycle and systems engineering methodologies. A successful candidate will lead with systems rigor by treating data as a product, starting with requirements that are grounded in use-cases and incorporating validation planning early in the process.Ability to effectively communicate and align with peers while navigating complex trade-spaces and ability to summarize learnings, take-aways and recommendations in a succinct way to executive leadership. Needs to work closely with engineering program managers on timelines and maintain clear communication on milestones and expectations.BS + 15 yrs of relevant proven experience.\n\nMasters/PhD + 10yrs of relevant proven experience.", "jobDescription": "Apple is looking for a CV Data Architect with exceptional technical and communication skills to contribute on high-impact projects that will enable game-changing future Apple products. In this highly cross-functional role, a successful candidate will collaborate with partner teams to architect various data collection systems that are used for algorithm development and product validation."}, "200450094": {"jobID": "200450094", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "DRAM Packaging Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450094/dram-packaging-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for someone with 5+ years’ experience in package design and assembly process development for memory wirebonded stacked-die packagesStrong knowledge of assembly design rules, SIPI, and layout tradeoffs to enable high performance DDR or differential signalingStrong knowledge of packaging materials, substrate technology, and their mechanical and thermal behaviorsSolid working experience in package test and reliability, system-level downstream process interaction and packaging inspection metrologyExcellent engineering problem solving skills, with strong engineering physics and data driven analysisStrong written and verbal communication skills for working with internal multi-functional teams and OSATsBS and 10+ years of relevant industry experience.BS and 10+ years of relevant industry experience.", "jobDescription": "Envision what you could do here. At Apple, we believe new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight, and inspire millions of Apple’s customers every single day.\n\nSummary:\nDo you like to work on groundbreaking technologies that enable amazing new products? Do you have the attention for details and love for perfection to work towards an extraordinary result? We are looking for a hardworking and passionate DRAM Packaging Engineer to join our team.\n\nSEG Packaging is a key part of the HW Technologies team, this team invents, designs, develops and integrates electronic packaging solutions for the Apple’s internal and customized external components of hardware for its consumer electronic products.\n\nAs a DRAM packaging engineer, you will lead the memory package development by managing the external memory vendors and steering their packaging design compatibility to Apple system components. You will partner with the internal SEG teams, defining the memory package architecture, die pad layout, package form factor, interconnect and package density, and will support the system and product teams and overall program through the development and NPI cycle."}, "200460614": {"jobID": "200460614", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "GPU Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460614/gpu-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "10+ years of experience in system-based silicon validation.Expertise in system and SoC architectures.Expertise with device physics and transistor behaviorExperience reading schematics.Expertise in C/C++ and one or more of the following scripting languages: python, TCL/expect.Strong written and verbal communication skills.Experience with lab equipment.Experience with performing electrical measurements.Experience with manufacturing test methodology.Ability to work well on a team, take responsibility, and motivate self and others.Experience leading debug of hardware and software issues in an embedded system.Leadership and/or mentoring experience in an engineering environment.Experience managing a validation project from planning through final execution.We are looking for candidates with a minimum of BS + 10 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\nThe GPU Silicon Validation Team is responsible for validating the functional operation, electrical behavior, power, and performance of Apple's embedded GPUs. Team members are involved in test planning, test execution, data analysis, failure triage, and tool development. We work hand-in-hand with the design, verification, productization, hardware and software teams to enable world-class GPUs in the embedded space. In this role, you will be responsible for a variety of silicon validation tasks such as functional testing, silicon characterization, analyzing and reporting results, and triaging complex hardware and software issues."}, "200351415": {"jobID": "200351415", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Motion Sensing Mechatronics Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200351415/motion-sensing-mechatronics-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Requires a Bachelor Degree in Electrical, Electronics, Mechanical or Mechatronics Engineering with 5+ years of hands-on experience. Good Software exposure is also required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Experience in generic troubleshooting techniques: problem isolation, parametric sweep analysis, regression testing, identification of faulty test setupStrong prototyping experience: Mechanical CAD design. Manufacturability. 3D printing. Material selection. GD&TData analysis: Correlations and trend extraction of data. Multivariate distributions. Signal conditioning.Good software skills: scripting, embedded developmentThe ability and willingness to produce work that is conforming to design standards defined by the team.High interest in learning and development of skills mentioned aboveTeam player, with demonstrable skills in time management, meeting deadlines, producing reliable test results, and working to continually improve testing methodologiesExcellent written and verbal English communication skillsRequires a Bachelor Degree in Electrical, Electronics, Mechanical or Mechatronics Engineering with 5+ years of hands-on experience. Good Software exposure is also required.", "jobDescription": "The Motion Sensing Hardware team integrates the best products in current sensing technologies into our consumer products. We oversee the entire development cycle of the technology with our partners, and together we overcome challenging integration issues in system. We invite motivated and curious designers to join our team and help us develop the modules and technologies that put our products in a class of their own.\n\nYou will be responsible for driving failure analysis and sensor characterization experiments, building test hardware and software, and providing recommendations based on data analysis of experimental results. You will utilize your training in analytics, mathematics, and engineering to design, conduct, and review experiments. We encourage you to share the unique perspectives you bring that enrich our ability to deliver the world’s best in mobile computing and user experience. At the heart of this role is your ability to support and enable a growing number of engineers, while developing your own skills and experience. This role requires intimate familiarity with mechanical CAD, rapid prototyping, and designing and fabricating PCB and flex circuits. A strong analytical and mathematical background, excellent communication skills, and a results-driven mindset with attention to quality of execution of the experiments are also required. You are expected to have an infrastructure-based mindset that strives to develop HW/SW solutions that address current and future anticipated issues. You are expected to be very comfortable working in a lab setting with mechanical, electrical, and environmental testing equipment."}, "200467328": {"jobID": "200467328", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Systems Technology Manager, Infra Vendor", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467328/systems-technology-manager-infra-vendor?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS in Electrical or Computer Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Knowledge of 3GPP technologies and signaling protocols including access & Non-access Stratum.Prior engineering experience working on consumer cellular modem or similar productsSolid understanding of wireless technologies: 5G-NR, IMS, LTE, & core network concepts like Slicing / MEC / QoEExperience in wireless system design driving research, innovation, and technology generation including but not limited to 2nd phase 5G NR capabilities like URLLC and NR V2X, Rel-16 & Rel-17 3GPP proposals.Solid understanding of cellular network features, and having prior experience with roadmap generation / product managementExperience working with vendors/partners in the areas of modem chipset development and commercialization, wireless standards development and early-stage prototyping for next generation cellularSelf-motivated with validated creative and critical thinking capabilitiesGood understanding of iOS networking stackGood understanding of software development and analytics frameworksMS in Electrical or Computer Engineering or equivalent experience", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. You will help build world-renowned wireless systems so seamless that they almost feel like magic!  The Carrier Technologies team is seeking a versatile individual with outstanding interpersonal skills and an exceptional technical knowledge of cellular technologies. Every person on our team makes a clear difference to the product. This is a great opportunity to work with our hardware and Wireless software engineering teams to help drive and deliver the most innovative Apple wireless devices and iOS software features to customers on our operators’ networks worldwide. This position entails frequent interaction with the Worldwide Carriers, Network Infrastructure Vendors, Marketing, S/W and H/W engineering and regulatory teams."}, "200465365": {"jobID": "200465365", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Quality Engineering Manager-AR/VR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465365/quality-engineering-manager-ar-vr?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science, or equivalent degree—or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$157,000", "max": "$276,000,"}, "benefits": null, "requirements": "5+ years of professional experience as a Software Engineer in Test or Software Quality Engineer2+ years as a Software Quality Engineering Manager or acting lead for the teamDeep understanding of SQA methodologies, processes, tools and CI/CD pipelinesStrong leadership skills to work with cross functional partnersStrong test experience with UI/UX testing and front end SW applicationsStrong analytical, problem-solving and presentation skillsTeam Builder: Proven track record demonstrating the ability to attract, hire, motivate and develop the best engineersTechnically Agile: Ready to deep dive into technical areas when needed but also discuss these topics to a non-technical audiencePriority Driven: At ease working in a continually changing, dynamic environment and driving top issues to resolutionExec Presence: Ability to summarize key points and tie them back to the customer experienceCustomer Focused: Passionate about user-focused design, high-quality applications, and what we can do to improve itHighly organized, creative, motivated, and passionate about achieving resultsBS/MS in Computer Science, or equivalent degree—or equivalent experience", "jobDescription": "Would you like to make an impact on the quality of Apple’s products? We’re looking for a passionate Quality Engineering Manager to head up persona-based testing and demos. The Technology Development Group (TDG) is working with some of Apple's most advanced emerging technologies, including augmented reality (AR) and virtual reality (VR). As part of TDG, you’ll lead a technical team working cross-functionally to identify and highlight key issues in a dynamic environment, facing exciting new challenges daily. You have strong communication and interpersonal skills, attention to detail, patience, and a real passion for product usability."}, "200358383": {"jobID": "200358383", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Sr. Software Engineer - Location and Spatial Awareness", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200358383/sr-software-engineer-location-and-spatial-awareness?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in computer science, electrical engineering, or related field with at least 6 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "-  Strong software generalist and experience with object oriented languages (C++, Objective-C)-  Experience shipping production software-  Deep understanding of software design paradigms, and software development best practices-  Ability to architect and implement software for technology evaluation, prototyping, and production-  Strong interest in location and/or RF-related technologies-  Excellent collaboration skills-  Ability to design and debug complex systems-  Strong creative problem solving skills-  A passion for programming and building things-  Experience with data analysis and results dashboards a plus-  iOS, OS X, application, and/or unix system development a plus-  Familiarity with basic signal processing techniques a plusBS in computer science, electrical engineering, or related field with at least 6 years of relevant experience.Takes initiative to address new problems and responsibility for the resultsINTERESTED IN CREATING NEW TECHNOLOGIES AND USER EXPERIENCESPassion for actively learning new skills, techniques, and programming languages/libraries/frameworks.Thrive in a collaborative environment and communicate effectively.Creative and inquisitive, seeking to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Desire to be exposed to all aspects of development; prototyping, planning, designing, productizing, launching, and scaling.…", "jobDescription": "Help craft the next generation of capabilities leveraging Apple location and spatial awareness technologies. Our team focuses are innovating, building, and productizing new ways for our devices to be spatially aware of each other, coupling different sensing technologies with sophisticated algorithms and AI/ML to enable new and more intuitive forms of interaction. We nurture new ideas from prototype to production, helping to establish hardware requirements and system design, conduct developmental testing, write production software, and track our results relative to physical and theoretical limits. \n\nThis role is for a strong and experienced software generalist to help architect and develop software at the daemon and framework level — someone who thinks carefully about architectural decisions, is disciplined and dedicated to doing it right the first time, and is passionate about continuing a culture of software excellence in both developmental and production software.\n\nShape the next generation of location-aware mobile experiences by working on state-of-the-art technologies to seamlessly integrate people’s digital and physical lives. If you're passionate about building technology that will make a difference, we may be the team for you."}, "200123933": {"jobID": "200123933", "origin_search": null, "posted": "Apr 21, 2021", "jobTitle": "HID, Firmware Engineer - Standalone Input Devices", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200123933/hid-firmware-engineer-standalone-input-devices?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE/EE or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid C or C++ coding ability for Embedded SystemsExperience working with microcontrollers with analog and digital sensorsExperience implementing firmware in bare-metal or RTOS environmentsProven capability in applying coding best-practices to firmware designsWorking knowledge of one or more communication protocols (e.g., UART, I2C, SPI, Bluetooth, USB, Ethernet)Proven board bring-up and debug skillsStrong communication and collaboration skillsBS or MS in CS/CE/EE or equivalent industry experienceExperience with one or more microcontrollers cores ( ARM, AVR, MSP430, PIC, 8051 )Debugging skills with JTAG, SWD, Oscilloscopes, and Logic analyzersSome assembly experience is helpfulDevelopment experience on Unix, Linux, or macOS is preferredmacOS and/or iOS programming experience is helpfulFamiliarity with input technologies is helpful", "jobDescription": "Come join a team of creative, energetic, and enthusiastic firmware engineers responsible for next-generation Human Interface Devices for iPhone, iPad, Mac, and more.  We are looking for talented individuals who enjoy creating firmware for microcontrollers, prototyping concepts, investigating new technologies, and ultimately delivering high-quality products.  This is a great opportunity to be at the focal point of many multi-functional interactions with the Hardware, Software, Quality Engineering, and Product Design teams."}, "200457090": {"jobID": "200457090", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Imaging & Sensing Incubation, Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457090/imaging-sensing-incubation-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSME required; MSME preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "At least 1 year of relevant industry experience in consumer electronics.Proven track record as a lead Engineer and ownership of multiple significant programs.Excellent team coordination, program planning, and prioritization skills.Able to anticipate potential roadblocks and seek solutions, mitigations, or escalations.Ability to coach and mentor developing Mechanical Engineers.Strong background and experience in mechanical design, prototyping, and hardware system design.3D CAD experience required, prior ownership of sophisticated mechanical system assemblies. NX preferred.Scientific method, experimental process, root cause analysis, tolerance analysis. Knowledge of common manufacturing processes, rapid prototyping tools, and DFM.Exceptional critical thinking, logic/reasoning skills, and methodical approach reflective in workflows.Excellent written and verbal communication skills and people skills; comfortable presenting major program landmark updates, ability to interact with management, team members, and external vendors.Applied knowledge in flex circuits, printed circuit boards, material science, physics and chemistry is beneficial.BSME required; MSME preferred", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?   \n\nThe Sensing Product Design team is looking for a mechanical engineer to build great experiences and bring Apple products to life. We are the team developing many of the sensors that changed the way people interact with their technology. Touch redefined the phone and tablet, TouchID seamlessly secured them, and the heart rate monitor let you keep tabs on yourself.  In this role, you will be responsible for specifying, developing, characterizing and validating touch sensing systems. You should be familiar with sensor technologies, along with related product integration and manufacturing technologies."}, "200459645": {"jobID": "200459645", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Senior Software Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459645/senior-software-systems-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent with operating system focus desired."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Implements kernel drivers for large operating systemsDemonstrates in-depth knowledge of C and C++Has a deep interest in system programming concepts, e.g. memory and process managementFamiliar with buses such as UART/USB/SPI/PCIeDelivers on time under tight schedulesHas excellent analytical, programming and debugging skillsHandles unexpected challenges under pressureThrives in a collaborative environment and can clearly communicate technical detailsLeads multiple projects across many teamsSeeks to solve everyday problems in innovative ways as a passionDrives towards the right solution not just any solutionBachelor's degree in Computer Science or equivalent with operating system focus desired.", "jobDescription": "Here in Sensing and Connectivity we work on a diverse set of fundamental technologies that are critical to making Apple Apple. We help integrate wireless technologies such as WiFi, Bluetooth and Ultra-Wideband into compelling solutions. We take data from the world around us such as acceleration, orientation and location to provide more immersive experiences. iPhone, iPad, AirPods, Apple Watch, Mac, Apple TV, HomePod, AirTag, name an Apple product and our team has made major contributions to its success!"}, "200456984": {"jobID": "200456984", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Software Systems Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456984/software-systems-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors/Masters in Computer Science, Electrical Engineering, Electronics Engineering, Wireless Communications or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5 plus year of software/firmware engineering skills including development, debugging and testing is requiredExperience in gathering requirements and detailed design documentationExperience in silicon prototyping, emulation systems and virtual platforms for identifying system gaps, optimizations ahead of silicon tape out.Good understanding of OS concepts (heap/stack/threads/mutex/memory/scheduling) is necessaryUnderstanding of protocols such as (TCP/UDP/IP/IPC/QUIC/RRC/NAS) is a plus3GPP data protocols (SDAP/PDCP/RLC/MAC) or PHY/RF SW/FW and their applications in end to end product design is a plusBachelors/Masters in Computer Science, Electrical Engineering, Electronics Engineering, Wireless Communications or equivalent.", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it."}, "200466660": {"jobID": "200466660", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Small Display Technology Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466660/small-display-technology-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "-  Proven experience working on sophisticated, multi-functional technical projects-  Proven experience in developing consumer electronics & SW features into products through prototyping-  Knowledge of image processing, algorithms, and software development-  A basic understanding of optics and optical systems including the display and optical sensorsBS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nApple is looking for an extraordinary Engineering Program Manager to join the Display team. Display EPMs must be a confident organizer and excellent leaders multi-functionally with multiple hardware and software teams throughout Apple. A successful candidate will help set strategy, complete schedule and be responsible for managing/communicating status and issues along the way. The ideal candidate would have technical strengths in many areas, including optical and algorithm. You will lead teams through the product development cycle from concept to delivery, collaborating with several teams at Apple and driving the definition, schedule, execution and communication of new features. You should have a solid track record of shipping complex new technology and experience in building algorithms. You will be working with some of the smartest and most hard-working people in the field, and will be chipping in to exciting new products that will touch lives of millions and enrich your career with invaluable experience."}, "200212745": {"jobID": "200212745", "origin_search": null, "posted": "Jan 20, 2022", "jobTitle": "Computer Vision Acceleration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200212745/computer-vision-acceleration-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD/MS (or equivalent) in the area of computer science, computer vision, imaging science, optics, is helpful."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ year experience in the area of hardware acceleration of computer vision, image processing or video5+ year experience of shipping SoC IP blocks, involved in SoC definition, SoC bring up, validation, low level programming and shippingFamiliar with hardware architecture, cache utilization, data streaming modelStrong communication skills; great work ethic and teamworkExperience with DSP programming or computer vision experience is a big plusPhD/MS (or equivalent) in the area of computer science, computer vision, imaging science, optics, is helpful.", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering team responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We focus on a balance of research and development to deliver Apple quality, state-of-the-art experiences. Our team prides itself on innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life."}, "200447741": {"jobID": "200447741", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Audio Media Technologies- Audio QA Engineer Airpods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447741/audio-media-technologies-audio-qa-engineer-airpods?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. or higher in Computer Science, Computer Engineering, Audio Engineering, Electrical Engineering, Music Technology, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "3-5+ years of experience in test engineering requiredExperience in audio testing, software testing, isolating issues, devising test plans, aiming to specificationExperience in reporting and communicating detailed quality statusA foundational understanding of electronic and audio technologyAbility to triage problems, prioritize accordingly, and propose a resolutionStrong ear for sound anomalies and the validation of sound qualityFamiliarity with real-time audio handling (sample rates, buffering, PCM, drivers, etc.)B.S. or higher in Computer Science, Computer Engineering, Audio Engineering, Electrical Engineering, Music Technology, or equivalent experience", "jobDescription": "Imagine what you could do here! \n\nAt Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. \n\nDo you bring passion and dedication to your job? If so, we are looking for individuals like you.\n\nThe Audio Media Technologies Group (AMT) provides the audio, video, and graphics foundation across all of Apple's innovative products, including AirPods, iPhone, iPad, Apple TV, Apple Watch, and macOS, as well as professional and consumer applications from Final Cut, Logic, and Listening Experience technology areas such as the Personal Sound Enhancement and Spatial Audio experiences. The Audio QA group provides audio software test support across all of these of Apple’s products and more.\n\nWe are seeking a creative, and organized test engineer to perform manual testing on the AirPods as well as Listening Experience areas, and work with automated solutions to support and enhance our quality initiatives. Audio drivers, firmware and audio subsystems will all be areas of testing you will be responsible for. As a member of this team, you will have a unique opportunity to work with some of Apple's most advanced technologies to help build empowering solutions for everyone."}, "200446215": {"jobID": "200446215", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Sr. Data Software Engineer - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446215/sr-data-software-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS, or PhD in Computer Science, Electrical Engineering, or equivalent field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "-  Strong Python experience required, additional experience with MATLAB is a bonus.-  Experience writing REST API's-  Experience with message-based architectures using Kafka or another message broker-  Understanding of containerized, scalable application deployment (Docker, Kubernetes, AWS) and monitoring (Splunk, Prometheus)-  Experience in relational and/or NoSQL database systems such as Oracle Database, MySQL, Cassandra, MongoDB, Amazon DynamoDB, etc.BS, MS, or PhD in Computer Science, Electrical Engineering, or equivalent field", "jobDescription": "Apple builds cameras at a scale that is unparalleled, with a complexity, quality, and consistency that makes them the most popular cameras in the world. Each product release provides breakthroughs in photography and stunning features customers love. The Camera and Depth Hardware team is looking for a multi-talented software engineer with experience in cloud technologies to build and maintain big data systems which enable our cross-functional team of hardware engineers and researchers to make data-driven decisions on how to make our cameras even better."}, "200464599": {"jobID": "200464599", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "5G/4G Layer1 Software Development Engineer (Instrument Engineering)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464599/5g-4g-layer1-software-development-engineer-instrument-engineering?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree is needed. We also highly value Master’s or above. Relevant fields include Computer Science, Electrical Engineering, Math, Physics and other Engineering domains.\n\nCourse study in wireless communications with a focus on cellular systems and protocols will be a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "A good understanding of cellular protocol stacks, particularly 5G and 4GSoftware development Experience and debugging skills in C and C++Experience with multi-processing and multi-threading based implementationsGood fundamentals in object-oriented SW design and test techniques and methodologiesStrong interpersonal skills and a willingness to learnOpen to international travel about 10% of the timeBachelor’s degree is needed. We also highly value Master’s or above. Relevant fields include Computer Science, Electrical Engineering, Math, Physics and other Engineering domains.\n\nCourse study in wireless communications with a focus on cellular systems and protocols will be a plus.-  3+ years of industry experience or equivalent-  Recent hands-on development Experience in Layer1 software development-  Knowledge of fundamental concepts in RF systems-  Familiarity with the use of Matlab-  Scripting and debug experience using Python.", "jobDescription": "Join this small team of extraordinary engineers that designs and produces precision protocol, RF and Analog Test Equipment for use in calibrating and testing 4G, 5G, WiFi, BT, mmWave, UWB and NFC radios in millions of iPhones, iPads, Macs and Watches. We’re looking for a highly motivated individual who enjoys developing software deployed in cellular systems. All members of the team bring their own unique expertise to collectively take internal Apple products from concept to mass production. Each internal product is designed to Apple's exacting standards resulting in breathtaking test equipment that maintains the quality, accuracy and function of commercially available offerings."}, "200433596": {"jobID": "200433596", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Technology Center Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200433596/technology-center-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "-  MS or Ph.D. in Engineering or similar technical degree required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "MS or PhD in Mechanical Engineering or similar technical degree required.Typically requires 5+ years of direct engineering management and 10+ years of hands-on experience in the mechanical, electrical, or similar engineering field.5+ years of experience in a state-of-the-art sophisticated lab setup, management, and maintenance.Curiosity and excitement for new insights and approaches will guide your creation of technology and product visions.Flexibility and comfort working in a constantly evolving dynamic environment and Meticulous organizational skills.Excellent communication (verbal, written, and presentation), collaborative and interpersonal skills and should excel at mentoring team leads, process, and design engineers.-  MS or Ph.D. in Engineering or similar technical degree required", "jobDescription": "Apple is looking for an expert lab manager with a proven technical background in mechanical engineering or a similar field to join the Panel Process and Optics (PPO) Engineering team to manage the module technology center (MTC). \n\nIn this role, you will lead highly technical, multi-disciplinary, engineering teams to enable novel product design architecture from technology incubation to technology scale-up while maintaining a safe lab environment for all lab users. Your focus will be on building, maintaining, and operating our engineering module technology center and providing mentorship, strategy, and leadership to projects that are owned by the MTC team! Our team strives to delight and inspire millions of Apple’s customers every day!"}, "200461233": {"jobID": "200461233", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Senior Software Engineer Apple Media Products.", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461233/senior-software-engineer-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or higher in Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proven experience programming in JavaKnowledge of data structures, algorithms and design patternsAbility to communicate effectively, demonstrating problem-solving skills and a learning attitudeAdvocate for test automation and software engineering best practicesClient-Server protocol & API design skillsBS or higher in Computer Science or equivalent.", "jobDescription": "What happens when the world's most innovative engineers collaborate with the world's most creative storytellers? TV gets reinvented. Meet the reinventors: The Apple Video Services teams created and manage the Apple TV app, which redefined and refined the way people watch their favorite shows, movies and so much more — including everything we love from the major subscription services.\n\nToday, these teams also manage one of the most exciting new realms at Apple: They bring viewers the critically acclaimed and award winning Apple Originals in Apple TV+. And they've engineered it so it can be enjoyed not only on Apple devices, but also directly on many new televisions and third-party streaming devices. To deliver Apple-level quality on a global scale, these engineers employ talent and tools to smoothly ingest and process a wide array of data. They work cross-functionally to handle video flow from content ingestion, store services, playback, and virtually everything else it takes to make the experience as seamless as possible.\nJoin them to see what else is there."}, "200461718": {"jobID": "200461718", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "CAD Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461718/cad-applications-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "• BS in Mechanical Engineering or significant work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You have more than 15 years of experience using CAD and an exceptional knowledge of NX with a focus in Modeling (parametric and non-parametric), Drafting (MBE/PMI is a bonus), Surfacing, and Assembly managementWorking knowledge of PDM/PLM usage, Teamcenter highly preferred, and how they integrate with CAD and other systems.Experience providing technical training in CAD, PDM and other engineering toolsYou have extraordinary interpersonal skills and are passionate about delivering world-class servicesAbility to develop clear and concise technical documents• BS in Mechanical Engineering or significant work experience• Scripting or development experience in NX to implement custom workflow solutions• Familiarity with Teamcenter capabilities such as CAD Data Management & Integration, BOMManagement, Change Management, Supplier Collaboration, Enterprise Data Integration• Familiarity with CAE tools and how they integrate into a mechanical design environment", "jobDescription": "The people here at Apple don’t just build products. They create the kind of wonder that’s revolutionized entire industries. Are you looking to push the limits of what’s considered the best design environment in the world? As part of our METS CS (Mechanical Engineering Tools and Solutions Customer Success) team, you’ll help support and strengthen our mission.\n\nOur Team’s charter includes solution production readiness & user socialization, system integrity, maintenance & support, workflow streamlining, vendor management, and developing training & knowledge articles. Phenomenal interpersonal skills, customer focus and experience with mechanical engineering CAD and PDM/PLM tools are key skills for this role.\n\nAn Ideal Candidate should be able to work independently, prioritize incoming requests, react quickly to customer demands, and can work efficiently under demanding timelines.\n\nCome Join Us!"}, "200449892": {"jobID": "200449892", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Packaging Substrate Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449892/packaging-substrate-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-  BS and +10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for an individual with experience as a process integration, manufacturing, R&D engineer in substrate industry In-depth knowledge of substrate technologyFamiliarity with PKG process & criteria is a plusOutstanding technology development & project management skillsStrong communication & collaborative skillsBS and +10 years of relevant industry experience-  BS and +10 years of relevant industry experience", "jobDescription": "Do you love working on challenges that no one has solved yet? Do you like changing the game? Envision what you could do here. At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!"}, "200449890": {"jobID": "200449890", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Packaging Substrate Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449890/packaging-substrate-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "-BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "We are looking for an individual with experience as a process integration, manufacturing, R&D engineer in substrate industry In-depth knowledge of substrate technologyFamiliarity with PKG process & criteria is a plusOutstanding technology development & project management skillsStrong communication & collaborative skillsBS and 3+years of relevant industry experience-BS and 3+ years of relevant industry experience", "jobDescription": "Do you love working on challenges that no one has solved yet? Do you like changing the game? Envision what you could do here. At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!"}, "200389042": {"jobID": "200389042", "origin_search": null, "posted": "Jun 8, 2022", "jobTitle": "Hardware Technology Internship", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200389042/hardware-technology-internship?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Pursuing an undergraduate or graduate degree in EE, CE, ECE, CS EECS or related field of study."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You may meet or have interest in any one of the following qualifications:Previous demonstrated internship or project work in computer architecture, VLSI, design, logic design, or circuit designStrong teamwork skills with the ability to collaborate with multiple functional teams across a variety of disciplinesExperience with C/C++, Verilog, VHDL, Python, Perl, Spice is beneficialCurrently enrolled in an undergraduate or graduate program in Computer Engineering, Electrical Engineering, Computer Science or related fieldsAt the end of the internship you will return to school to continue education or an internship is required for graduation from your schoolPrior internship(s), group or personal project exposure, TA and/or work experiencePursuing an undergraduate or graduate degree in EE, CE, ECE, CS EECS or related field of study.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unrivaled and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nOur Hardware Technology team is responsible for Apple’s breakthrough custom silicon and hardware technologies including battery, applications processors, storage controllers, sensors silicon, display silicon and other chipsets across Apple’s entire product line. \n\nIn this internship, you will have the opportunity to work among the best engineers in the world on our Silicon Engineering team. \n\nMajor areas of SOC design, including, but not limited to CPU, GPU, SoC and AMS. Positions are open in: \n\nCPU & GPU RTL Design & Implementation\n\nSTA & Verification\n\nLow Power Design\n\nPhysical Design\n\nValidation\n\nSignal Integrity\n\nPackaging\n\nArchitecture Performance Modeling\n\nAnalog/Mixed Signal Design\n\nRF Design"}, "200447039": {"jobID": "200447039", "origin_search": null, "posted": "Dec 3, 2022", "jobTitle": "Data Software Engineer - Camera Hardware", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447039/data-software-engineer-camera-hardware?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS, or PhD in Computer Science, Electrical Engineering, or equivalent field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "- Strong Python experience required, additional experience with MATLAB is a bonus.- Experience writing REST API's- Experience with message-based architectures using Kafka or another message broker- Understanding of containerized, scalable application deployment (Docker, Kubernetes, AWS) and monitoring (Splunk, Prometheus)- Experience in relational and/or NoSQL database systems such as Oracle Database, MySQL, Cassandra, MongoDB, Amazon DynamoDB, etc.BS, MS, or PhD in Computer Science, Electrical Engineering, or equivalent field", "jobDescription": "Apple builds cameras at a scale that is unparalleled, with a complexity, quality, and consistency that makes them the most popular cameras in the world. Each product release provides breakthroughs in photography and stunning features customers love. The Camera and Depth Hardware team is looking for a multi-talented software engineer with experience in cloud technologies to build and maintain big data systems which enable our cross-functional team of hardware engineers and researchers to make data-driven decisions on how to make our cameras even better."}, "200448226": {"jobID": "200448226", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics (GPU) Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448226/graphics-gpu-performance-analysis-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "As a GPU Performance Analysis Engineer, your responsibilities will include the following:Ability to work well in a team and be productive under aggressive schedulesExcellent communications skills, self-motivated and well organizedProficient Python programmerStrong software debug skills is viewed as necessary for this roleExperience with Tableau and/or Splunk is a plus but not requiredOpenGL/CL and/or Metal API programming experience3D graphics architecture knowledgeBS + minimum of 3 years of experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? In our Silicon Technologies group we help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this role as part of the GPU Performance Analysis team, you will be responsible for developing tools and content needed to aid performance analysis, tuning, and debug of Apple’s GPU products."}, "200448933": {"jobID": "200448933", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Data and Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448933/cellular-4g-5g-firmware-data-and-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceAbility to think creatively and identify, build, and support solutions and roadmaps focused on automation and reduction of manual processesStrong critical thinking and communication skills with the ability and desire to learn and evaluate new technologiesExperience in utilizing analytics and statistical methods to transform data into useful insights and actionable resultsProficient Python developer with 3+ years of experience in developing data processing & test automation pipeline or similar projectsGood understanding of AWS components including S3, Kinesis firehose, Kibana, Elasticsearch, RedshiftExperience in creating data processing & visualization pipeline over AWS.Proven knowledge and experience with relational database (e.g Postgres), SQL and non-relational database (e.g.Mango DB) is requiredExperience with Testrail is a plusExperience with popular data visualization tools is a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across disciplines to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. \n\nAs a Cellular 4G/5G Firmware Data and Automation Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible crafting and productizing powerful cellular SoCs."}, "200452203": {"jobID": "200452203", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Software Engineer (Full Stack), Employee Experience & Productivity", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452203/software-engineer-full-stack-employee-experience-productivity?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS degree in computer science or equivalent field plus 4+ years experience or MS/PhD degree plus 2+ years experience, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of Software development experience designing and building complex, highly available, large scale Web applications.Solid understanding of full web technology stack: RESTful services, client-side frameworks, data persistence technologiesHands on experience with Java and related technologies: Java, Web Services, Spring Framework, Spring Boot, Hibernate, JUnit/TestNGExperience in architecting and defining Application layer in SOA, Micro Services landscapeExperience building pixel-perfect, robust and, accessible user interfaces on the webProficient in one or more JavaScript framework like Angular, React, Vue or equivalent.Experience with non-relational, NoSQL databases and various data-storage systemsStrong understanding of TypeScript and the latest ECMAScript standardsFluent in CSS3 and Less/Sass (ability to write mixins, partials, functions, etc) and usage in large scale applicationsExperience in web analytics, accessibility, standards, and SEO techniquesStrong problem solving skillsPassion for building a rich and innovative user experienceExcellent communication and collaborative skillsAbility to collaborate effectively with teams located in different locationsAdditional requirementsHaving any of the following are definite pluses for this role:Ability to learn and apply new technologies quickly.Experience with reactive or functional programmingExperience with Node.jsExperience with search platforms (e.g.: Solr, Elastic)Experience with cloud technologies and integrating/deploying SAAS solutionsExperience with Build ToolsExperience with data visualization technologiesBS degree in computer science or equivalent field plus 4+ years experience or MS/PhD degree plus 2+ years experience, or equivalent.", "jobDescription": "Are you meticulously organized and highly observant? Join our Information Systems and Technology group and play a vital function on one of two Apple teams: Software and Services and Corporate Functions. From Apple ID to the Apple website to our data centers around the globe, our diverse collection of engineers, designers and creators manage the massive systems and services that so many people rely on every single day. We also build the custom tools that empower other Apple employees to solve problems on their own. Joining this group means you’ll be part of the Apple nerve center. You could play a meaningful role in helping Apple connect with over a billion customer devices around the world. Or you could help over 130,000 employees stay connected with each other and our suppliers. Together, you and your team will help everyone at Apple do what they do best: explore every possibility.\n\nIS&T Corporate Systems team is looking for a creative and motivated Software Engineer with excellent problem solving and interpersonal skills. The work we do here has a large impact on Apple, from enabling our internal businesses to do their best work, to providing rich, highly user friendly experiences to our customers and partners. Our teams foster a collaborative environment with creative, smart & fun people using state of the art technologies. Engineering excellence is expected. Come join us for this once in a lifetime opportunity in building solutions for Apple that has worldwide impact."}, "200459706": {"jobID": "200459706", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Display Modeling Software Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459706/display-modeling-software-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. or higher. in Engineering or Physics with 3+ years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Expert in Python and C++Knowledge of or direct experience with software testing practicesStrong analytical and test case creation skillsB.S. or higher. in Engineering or Physics with 3+ years of experiencePreferred Qualifications:-  Strong knowledge of testing principles, concepts, techniques, and tools-  Familiar with Git and with Git workflows-  Experience with GPU programming (CUDA or OptiCL)-  Experience in a software product team using Agile methods-  Strong written communication for maintaining technical documentation of testing tools-  Knowledge of Physics and Optics concepts is a plus", "jobDescription": "From the first Apple computer to the iPhone, Apple has a history of crafting revolutionary consumer products. Apple is looking for a hard-working software test engineer who will help continue this trend by contributing to an in-house software package that will enable our designers to discover the next generation of Apple products. The test engineer will design and implement test procedures and coordinate with technical team members, both software developers and design engineers, to review system requirements. As a new position, it offers the opportunity to influence the overall structure and direction of testing efforts along with the freedom to explore creative solutions to the team’s testing needs."}, "200460701": {"jobID": "200460701", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Sr. Systems Software Engineer (Performance)-Home Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460701/sr-systems-software-engineer-performance-home-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or a related field, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong understanding of low-level hardware-software interactionBroad understanding of OS architecture, from kernel to user interfaceUnderstanding of optimization and performance issues across OS software layersStrong C, C++, or Objective-C coding skillsExperienced in Python, Full Stack and Cloud technologies to create Performance frameworks and infrastructureAbility to learn new technologies and to prototype and propose software designs and solutionsExcellent problem solving ,critical thinking and Analytics abilitiesStrong organizational skills, Proactive, self-motivated and able to work independentlyExcellent communication and collaboration skillsExperience drawing conclusions from large amounts of data and presenting it to engineering leadershipBachelor's degree in Computer Science or a related field, or equivalent work experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe Home Platforms Software Team creates solutions for the home, from building incredible movie watching experiences to building the ecosystem to allow Apple devices to work better together. We make software for Apple TV, HomePod, and iPhone that allows our users to have a transformative listening experience anywhere in their house, to enjoy watching their favorite shows with stunning Dolby Vision quality and Atmos surround, and to play the newest hit from Apple Arcade. Our engineers employ their talent and tools to write the code that makes these experiences possible. They work cross-functionally with teams across Apple to make a seamless experience. Join the team to see what else is possible!"}, "200462565": {"jobID": "200462565", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Senior NLP Scientist, Text Understanding Platform", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462565/senior-nlp-scientist-text-understanding-platform?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "First-rate knowledge of both NLP and computer science fundamentals is essential — no matter how you acquired it!  At least 5 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expertise in applying the state of the art in NLP algorithms to practical problems.Strong object-oriented programming and design skills, ideally in an on-device context.Practical knowledge of Swift or Objective-C (useful but not required)Practical knowledge of standard methodologies for privacy-preserving ML (useful but not required).Publications in leading machine learning or NLP venues (optional but not required)First-rate knowledge of both NLP and computer science fundamentals is essential — no matter how you acquired it!  At least 5 years of experience.", "jobDescription": "Apple and its Intelligent System Experience organization are on a mission to create software that feels intimate, humane and personal, by building models that understand who you are and what you use your device for in order to adapt and personalize your experience.\n\nUsers interact with countless amounts of text through their daily interactions, and understanding what that text means to them is central to creating a truly personalized user experience. The Text Understanding Platform team provides some of the core system-level capabilities for semantic analysis of text used to benefit a range of features across Apple platforms. As a member of this organization, you’ll have the opportunity have a broad impact on millions of iOS users worldwide.\n\nWe’re looking for an ambitious applied scientist, who can combine knowledge in state-of-the-art NLP techniques with a practical knowledge of how to deliver real-world systems. We want someone who is passionate about applying NLP in ways consistent with Apple’s core values of fairness, privacy, and attention to detail, who is comfortable working collaboratively and navigating ambiguity, and who is driven to improve the user experience. Come join us!"}, "200462566": {"jobID": "200462566", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "NLP Scientist, Text Understanding Platform", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462566/nlp-scientist-text-understanding-platform?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "First-rate knowledge of both NLP and computer science fundamentals is essential — no matter how you acquired it!"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Expertise in applying the state of the art in NLP algorithms to practical problems.Strong object-oriented programming and design skills, ideally in an on-device context.Practical knowledge of Swift or Objective-C (useful but not required)Practical knowledge of standard methodologies for privacy-preserving ML (useful but not required).Publications in leading machine learning or NLP venues (optional but not required)First-rate knowledge of both NLP and computer science fundamentals is essential — no matter how you acquired it!", "jobDescription": "Apple and its Intelligent System Experience organization are on a mission to create software that feels intimate, humane and personal, by building models that understand who you are and what you use your device for in order to adapt and personalize your experience.\n\nUsers interact with countless amounts of text through their daily interactions, and understanding what that text means to them is central to creating a truly personalized user experience. The Text Understanding Platform team provides some of the core system-level capabilities for semantic analysis of text used to benefit a range of features across Apple platforms. As a member of this organization, you’ll have the opportunity have a broad impact on millions of iOS users worldwide.\n\nWe’re looking for an ambitious applied scientist, who can combine knowledge in state-of-the-art NLP techniques with a practical knowledge of how to deliver real-world systems. We want someone who is passionate about applying NLP in ways consistent with Apple’s core values of fairness, privacy, and attention to detail, who is comfortable working collaboratively and navigating ambiguity, and who is driven to improve the user experience. Come join us!"}, "200465569": {"jobID": "200465569", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Security Software Engineer, Secure Transports", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465569/security-software-engineer-secure-transports?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years of relevant experienceA genuine passion for creating effective and pragmatic transport securityStrong understanding of recent developments and concerns with standard protocols such as TLSSystems/OS development experienceExcellent Swift or Objective-C programming skillsIndustry exposure to and knowledge of OS security and applied cryptographyHighly professional, with the ability to deliver solid work on tight schedulesWorking multi-functionally with other software, hardware, marketing, and support teams to provide the best security solutions for Apple’s productsExcellent teamwork skills. We work with all engineering teams involved in these products, and on all of their code.BS in Computer Science or equivalent experience/skillsPreferred Experience:-  iOS and macOS exposure-  Experience with TLS, X.509 certificate evaluation, or other secure protocols", "jobDescription": "Embedded within Apple’s Security Engineering & Architecture organization, the Secure Transports team’s mission is to deliver world-class cryptographic and secure protocols engineering. At the heart of an organization dedicated to building the most secure operating system in the world and putting it in the hands of millions of customers, the team is looking for a motivated software engineer to help push its technologies to the next level.\n\nYou will join a team that provides the security foundations for data in motion across all of Apple’s innovative products, including Mac, iPhone, iPad, Apple Watch, and Apple TV. You will contribute to the entire system, from the kernel up through libraries, frameworks, and applications. As an engineer, you will have the opportunity to majorly impact the design and implementation of Apple’s embedded and desktop operating system products, collaborating closely with all other security partners, ranging from our Silicon Engineering group to our Cloud Services group. Designing and developing software for hundreds of millions of users. People who LOVE the products you make. Working for a company whose dedication to user privacy is at the heart of everything it does. Being surrounded by the most creative, passionate, talented engineers in the industry. Constantly being challenged to go beyond the norm to find new, innovative ways of solving problems and to make software safer, easier, and more fun to use. Not many jobs can offer all of these things. Software Engineering jobs at Apple do, and much more."}, "200443550": {"jobID": "200443550", "origin_search": null, "posted": "Nov 14, 2022", "jobTitle": "Health Studies Operations Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443550/health-studies-operations-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA/BS or higher in biomedical engineering, life sciences, or research-related discipline.\n\nMinimum 3+ years of experience in health research management, engineering operations, or relevant medical / clinical experience.\n\nMust have 2+ years of experience directly supporting technical operations in a research setting.\n\nAdvanced degree or experience analyzing engineering data is a plus, but not required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "R&D experience with prototype hardwareDemonstrated ability to design + execute engineering research projects of varying sizesTroubleshoots hardware and software challenges, analyzes engineering data to make study-level recommendationsThrives by managing fast paced projects with minimal directionExcellent written and verbal communication skillsTrack record of managing vendors or contractors to deliver timely resultsBA/BS or higher in biomedical engineering, life sciences, or research-related discipline.\n\nMinimum 3+ years of experience in health research management, engineering operations, or relevant medical / clinical experience.\n\nMust have 2+ years of experience directly supporting technical operations in a research setting.\n\nAdvanced degree or experience analyzing engineering data is a plus, but not required.", "jobDescription": "Apple is seeking a Health Studies Operations Engineer to support the design, coordination, execution and monitoring of health studies. This highly dynamic role drives both early stage investigations and large-scale research projects to develop new health technologies.\n\nThe ideal candidate can balance big pictures with attention to detail, has clinical expertise, and autonomously manages projects to deliver fast paced engineering data collection. Are you passionate about working at the intersection of wearable technology and research? Drive the future health technologies with our team!"}, "200451033": {"jobID": "200451033", "origin_search": null, "posted": "Dec 18, 2022", "jobTitle": "Control Systems Simulation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451033/control-systems-simulation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in Engineering, Robotics or CS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "8+ years of related experience in dynamic simulation, complex system modeling, physical motion analysis, and model validation on real hardwareExperience with one more or more of the following simulation packages: Altair MotionView/MotionSolve, Altair Activate, Matlab Simulink/Simscape, Solidworks MotionStudy (ADAMS solver), and/or Gazebo 3D simulators.Experience with dynamic and kinematic analysisStrength in control systems ID, mechanism parameterization, friction modelingStrong in data analytics and optimization related model fittingConfident with source control (eg. GIT) on multi developer projectsFamiliarity with current CAD packages (ProE, Solidworks, NX)Deep passion for controls and mechatronic systemsMS or PhD in Engineering, Robotics or CSNice to haves:-  Experience with sensor and BLDC motor modeling and simulation-  Transitioning R&D technologies into production/products", "jobDescription": "One of Apple’s R&D groups is currently seeking a kinematic and dyanamics simulation and modeling engineer. This engineer will architect, design and maintain both high fidelity multi-body dynamic simulations as well as faster parametric models used for rapid concept development. This highly cross-functional team is working hands on to prototype and develop unique dynamic systems. We are looking for passionate and creative individuals to drive a ‘sim-first’ approach to control system design!"}, "200463381": {"jobID": "200463381", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Sr. Cloud Infrastructure Engineer- SDG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463381/sr-cloud-infrastructure-engineer-sdg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS or PhD in Computer Science or equivalent years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years industry experienceExperienced with S3, EC2, APIGateway, SQS, Postgres, Kafka, Spark and Airflow, and PrefectExperience architecting highly available systems that utilize load balancing, horizontal scalability and high availabilityLeverage new technology paradigms (e.g., serverless, containers, microservices)Familiarity developing distributed services deployed on local, on premise and cloud based platformsHands on programming skills for full stack services development (e.g. Java, Python, Node.js, NoSql DB’s)Uses a quantitative approach (modeling, iterative prototyping, analysis, tools) to architect and develop robust secure high performance cloud services that meet demanding experience goalsTrack record of influencing cross-functional architects and high performance teams to define architectureExcellent communication and collaboration skillsExposure to Agile development methodologiesBS, MS or PhD in Computer Science or equivalent years of industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! \n\nJoin us to help deliver the next groundbreaking Apple product. In this highly-versatile, extremely rewarding role, you will be part of an exciting, talent-overflowing team working on developing software that will be widely adopted. You will be part of Apple's Video Engineering team focusing on building our next generation data processing pipeline that accelerates overall productivity in countless areas. Your work will bring tremendous impact to the overall data design and in getting functional products to millions of customers.\n\nTo succeed within this role, you should have shown experience in several of the following areas:"}, "200374442": {"jobID": "200374442", "origin_search": null, "posted": "Oct 11, 2022", "jobTitle": "Senior Engineering Program Manager - App Store", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200374442/senior-engineering-program-manager-app-store?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Prefer a BS/MS in Computer Science, Engineering, or similar technical field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "5+ years of program, project, or product management in software developmentExperience with frameworks or developer focused products from kick-off to shipExperience working on Trust and Safety or legal and regulatory initiativesBuilt products by collaborating across engineering, analytics, marketing, design and other key stakeholdersStrong strategic thinking, problem solving, and logical structuring abilitiesThe ability to turn incomplete, conflicting, or ambiguous inputs into solid action plansA hunger to tackle complicated and impactful product & business problemsStrong communication and presentation skills (written and verbal) to all levels of an organizationStrong facilitation skills (requirements sessions, design meetings, progress and status meetings)You are upbeat, adaptable, and results oriented with a positive demeanorPrefer a BS/MS in Computer Science, Engineering, or similar technical field.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "When this team introduced the App Store, it launched a cultural and economic phenomenon that changed the way people live, work, and play. These engineers and dedicated Program Managers continue to innovate the platform, now home to over 1.5 million apps — each created using the team’s own software development kit and related services. All those apps mean the store takes billions of requests from more than 500 million visitors every week, across iOS, macOS, tvOS, iPadOS, and watchOS. To deliver such a rich experience at this scale, Program Managers partner with the engineers to build high-performance systems backed up by persistent systemwide A/B testing. And to help people discover apps they love, the team uses machine learning techniques that include natural language processing to develop new algorithms for personalization, search, and recommender systems. In a world where apps have become essential in people’s daily lives, the App Store team has become essential to Apple’s business."}, "200466641": {"jobID": "200466641", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Mac Power Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466641/mac-power-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE/CS or equivalent experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Understanding of computer architecture, operating system concepts, EE fundamentals, and concepts of power consumption and power managementAbility to dive deep technically, learn new technologies, and understand the small technical nuances of a systemExcellent written and verbal communication skills and experience presenting data to cross-functional teams and/or managementExperience in test planning, validation, uncovering issues, and driving issues to resolution with engineering teamsCoding and scripting experience to support basic automation and tool development (Python and shell preferred)BSEE/CS or equivalent experience preferred", "jobDescription": "We are the Mac Systems Quality team, and we are looking for a highly motivated and detail-oriented engineer to test and optimize power and power efficiency on all new Mac technologies. As a member of our team, your contributions will drive best in class battery life and also help the environment by improving Mac energy efficiency and reducing the carbon footprint of our products! \n\nDo you have an analytical mind and enjoy solving challenging problems in a fast paced and dynamic environment? You can help to drive and improve the quality of future Apple products that will delight and inspire millions of Apple’s customers every single day.\n\nCome join our creative team of engineers working with the latest technologies who are dedicated to keeping Mac innovation the highest in the industry!"}, "200392263": {"jobID": "200392263", "origin_search": null, "posted": "Jun 16, 2022", "jobTitle": "Jr Camera HW & SW Prototyping Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200392263/jr-camera-hw-sw-prototyping-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Newport Beach", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years experience leading or contributing to the development of the technology to support professional or high reliability AR/XR/3D or 2D capture systems.Experience working with professional camera systems (Sony, ARRI, IMAX, RED, etc.).Hands-on experience implementing HW designs and programming with FPGA devices. (Xilinx, Vivido, etc.)Experience delivering mechanical and/or industrial design CAD models from PoC to FATP using Solidworks, Inventor, NX, etc.Experience designing multilayer PCB’s employing data protocols like UART, SPI, I2C using Allegro, Altium, Eagle, etc.Experience programming in C/C++ & scripting languages like Perl/Python.Knowledge of image processing using OpenCV.Deep knowledge of low voltage DC-DC power systems and noise suppression and filtering techniques.Experience controlling and implementing high repeatability servos, geared motor and drivers.Experience working in theatrical or live production environments.-  Prior experience working with and designing for non-standard types of photography or cinematography such as underwater, aerial, extreme conditions, and virtual production.-  Familiarity with typical video and audio recording formats commonly found in the cinematic or live broadcast industry. (RAW, ProRes, EXR, BWF, etc.)-  Familiarity with video transport protocols like SMPTE-2110 or SDI.-  Familiarity with production equipment and maintenance tasks typically found in cinematic or live broadcast environments.-  Able to read and draw wiring harness and pinout schematics.-  Able to solider IC’s and other small components, by hand.-  Working knowledge of media production and workflow tools such as Adobe Premiere, BlackMagic Resolve, ColorFront (OSD), ShotGrid/ShotGun, Perforce, Unity, Unreal, etc.-  Experience using standard organization and communication tools. (Jira, Confluence, Keynote, PowerPoint, Omnigraffle, Vizio, Word, etc.)-  Experience with EMI, RF, vibration, drop and thermal evaluation test processes and tools.", "jobDescription": "Apple is looking for a Jr Camera HW & SW Prototyping Engineer to join a fast growing production tools development team. We’re looking for an enthusiastic and self starting Engineer to advance the development of cutting edge technology for use in high-end professional production environments. \n\nThe Engineer will support the Senior Camera HW & SW Prototyping Engineer to develop and execute the strategies and designs agreed on with internal teams and/or external partners & vendors. The systems this team creates will be used in high stakes production environments where there’s only one chance to capture amazing content.\n\nThis team embraces a scrappy, “fail fast & often,” and “if a solution already exists, we’ll buy it” approach to production tools R&D. The Engineer will be virtually unbound to explore any and all technologies in order to bring to life new tools for production stakeholders asking for the impossible.\n\nIf developing bleeding edge, high-availability, professional capture tools at the intersection of art and technology is your passion, this could be the opportunity you’ve been working towards."}, "200439600": {"jobID": "200439600", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Wireless Software Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439600/wireless-software-performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Masters in Electrical Engineering or Wireless Communications"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Looking for the ideal candidate with validated experience in Cellular OR satellite communication protocols and systemsFor the cellular role it is required to have deep understanding of wireless standards: (including but not limited to 3GPP 5G-NR/5GC, LTE, IEEE 802.11ax, 802.11ad, IP, TCP/UDP) and their application to end to end product performance. Shown experience with 4G/5G network emulators and major infra vendor equipmentFor the satellite communications position it is required to have working experience with Satellite communications systems, RF, link budget, antennas, modems, Software Defined Radios (SDR)Experienced with scripting and developing performance automation tools and softwareExcellent communication and presentation skillsAbility to work in a highly multi-functional setting across SW, HW, RF, Carrier/Partner engineering and Product Design teamsAbility to quickly adapt to new technologies and out-of-the box thinking and to propose technology and product improvements in a data driven wayConsistent track record of delivering performance focussed efforts for projects that went to mass production8+ years of system performance, design or architecture experienceMasters in Electrical Engineering or Wireless Communications", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Cellular, Wi-Fi, Bluetooth, GPS, Satellite Communications and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. The Wireless system performance team is striving for innovative ways to use wireless communication technologies and enable new services and products that surprise and delight our customers. We are seeking an experienced technologist chartered to build wireless performance labs; play a major role in architecture, design and enhancement of new cellular or satellite communication technologies and products. Will work on a team that will drive new initiatives within the company and the industry, focused on end user experience."}, "200430705": {"jobID": "200430705", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AIML - Release Management Engineer, Engineering Efficiency", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200430705/aiml-release-management-engineer-engineering-efficiency?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Cambridge", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS Degree in Computer Science"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "1+ years in roles DevOps, SRE, SDET or TE/QE (including internships)Demonstrate proficiency with Git as well as scripting languages (Python, Bash, Javascript)Have a deep understanding of release engineering, branching and software configuration managementExperience setting up Continuous Integration systems that support multiple projects with a high volume of code changesExperience working with engineering and project management teams, which requires very good communication and coordination skillsAbility to propose changes and improvements and communicate system status automatically and efficiently in ways that incentivize stronger coding and testing practicesExperience working with software experimentation and A/B testing procedures/systemsNice to have: Familiarity with highly-scalable distributed systems, parallel workflows and micro servicesBS or MS Degree in Computer ScienceApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Play a part in the next revolution in human-computer interaction. Transform the way people find their favorite movies and TV shows, watch sports, listen to music, interact with their smart home and much more! Work with the people who created the intelligent assistant that helps millions of people get things done.\nEngineering Efficiency - Release Management Team in MLPT is looking for exceptional engineers who are excited about build and integration, automation and improving engineering productivity. We are working to take the build, integration and test process of the AI/ML components of iOS, macOS, watchOS and tvOS to the next level (think Spotlight, Siri and others!). We don't have all of the answers on how to do that yet, perhaps you do? We are exploring, measuring and trying new things. We are responsible for integrating nearly a quarter of all changes that go into our OS releases and affect 1 billion+ customers, so this isn't just a theoretical exercise. We won't be satisfied with anything less than outstanding. If you are excited about the challenges of making development and release more efficient while every part of the system is advancing, come help us solve these problems and be part of improving engineering efficiency across the AIML organization!"}, "200460068": {"jobID": "200460068", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Software Engineer, Core Services - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460068/software-engineer-core-services-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science. At least 5 years of professional software engineering experience preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expert knowledge of developing scalable Java web applications with very stringent latency requirements.Knowledge of JVM or functional languages like Clojure.Self-driven; ability to work in a fast-paced environment, and agility to build features that span cross-functional teams.Strong object oriented design and analysis skills coupled with a deep understanding of data structures and algorithms.Experience in designing and implementing RESTful APIs.Exceptional debugging, critical thinking, and interpersonal skills.Experience writing effective unit and integration tests.Experience with Solr / Lucene or other NoSQL solutions (Redis / Memcached / Cassandra / Voldemort / MongoDB etc.) is a plus.BS or MS in Computer Science. At least 5 years of professional software engineering experience preferred.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here. The Core Services team at Apple Media Products is looking for a software engineer to help build scalable and creative features that delight hundreds of millions of customers around the world on App Store, Apple Arcade, Apple Music, Apple TV+, Apple Books, Podcasts, MusicKit, iTunes etc. across multiple platforms on iOS, macOS, tvOS, and watchOS."}, "200451070": {"jobID": "200451070", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Debug Tools Software QA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451070/debug-tools-software-qa?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience building enterprise level solutions with Python and JavaScriptExperience with the Unix/Linux command line interface and shell scripting (Bash,Bourne, etc.)Experience testing APIs such as GraphQL, RESTExperience using browser test automation software such as Selenium, Cypress, etc.Experience writing unit tests and integration testsExperience working with databases such as MySQL and MongoDBExperience with distributed source control systems such as Git.Bachelors degree and a minimum of 3 years relevant industry experience• A passion for QA automation• Knowledge of current and up-coming QA technologies/frameworks• Understanding of performance and scalability testing• Understanding of continuous integration and build concepts• Prior experience architecting a software QA infrastructure is a plus", "jobDescription": "Apple’s Silicon Validation Team drives validation, characterization and debug of Apple\nproducts. We are searching for an engineer to plan and execute software QA testing\nand development in the context of our silicon debug tool ecosystem. You will be\nresponsible for architecting the QA environment from ground-up using industry-standard\ntools and methodologies. You will be working with a dynamic team utilizing your\nknowledge and skills to help ensure the success of Apple products."}, "200451101": {"jobID": "200451101", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Debug Tools Software QA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451101/debug-tools-software-qa?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience building enterprise level solutions with Python and JavaScriptExperience with the Unix/Linux command line interface and shell scripting (Bash,Bourne, etc.)Experience testing APIs such as GraphQL, RESTExperience using browser test automation software such as Selenium, Cypress, etc.Experience writing unit tests and integration testsExperience working with databases such as MySQL and MongoDBExperience with distributed source control systems such as Git.BS and a minimum of 3 years relevant industry experience• A passion for QA automation• Knowledge of current and up-coming QA technologies/frameworks• Understanding of performance and scalability testing• Understanding of continuous integration and build concepts• Prior experience architecting a software QA infrastructure is a plus", "jobDescription": "Apple’s Silicon Validation Team drives validation, characterization and debug of Apple\nproducts. We are searching for an engineer to plan and execute software QA testing\nand development in the context of our silicon debug tool ecosystem. You will be\nresponsible for architecting the QA environment from ground-up using industry-standard\ntools and methodologies. You will be working with a dynamic team utilizing your\nknowledge and skills to help ensure the success of Apple products."}, "200459332": {"jobID": "200459332", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Debug Tools Software QA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459332/debug-tools-software-qa?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Experience building enterprise level solutions with Python and JavaScriptExperience with the Unix/Linux command line interface and shell scripting (Bash,Bourne, etc.)Experience testing APIs such as GraphQL, RESTExperience using browser test automation software such as Selenium, Cypress, etc.Experience writing unit tests and integration testsExperience working with databases such as MySQL and MongoDBExperience with distributed source control systems such as Git.BS and a minimum of 10 years relevant industry experience• A passion for QA automation• Knowledge of current and up-coming QA technologies/frameworks• Understanding of performance and scalability testing• Understanding of continuous integration and build concepts• Prior experience architecting a software QA infrastructure is a plus", "jobDescription": "Apple’s Silicon Validation Team drives validation, characterization and debug of Apple products. We are searching for an engineer with relevant experience in the industry to plan and execute software QA testing and development in the context of our silicon debug tool ecosystem. You will be responsible for architecting the QA environment from ground-up using industry-standard tools and methodologies. You will be working with a dynamic team of experienced engineers utilizing your knowledge and skills to help ensure the success of Apple products."}, "200304551": {"jobID": "200304551", "origin_search": null, "posted": "Sep 14, 2022", "jobTitle": "Senior Software Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200304551/senior-software-systems-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent with operating system focus desired."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Implements kernel drivers for large operating systemsDemonstrates in-depth knowledge of C and C++Has a deep interest in system programming concepts, e.g. memory and process managementFamiliar with buses such as UART/USB/SPI/PCIeDelivers on time under tight schedulesHas excellent analytical, programming and debugging skillsHandles unexpected challenges under pressureThrives in a collaborative environment and can clearly communicate technical detailsLeads multiple projects across many teamsSeeks to solve everyday problems in innovative ways as a passionDrives towards the right solution not just any solutionBachelor's degree in Computer Science or equivalent with operating system focus desired.", "jobDescription": "Here in Sensing and Connectivity we work on a diverse set of fundamental technologies that are critical to making Apple Apple. We help integrate wireless technologies such as WiFi, Bluetooth and Ultra-Wideband into compelling solutions. We take data from the world around us such as acceleration, orientation and location to provide more immersive experiences. iPhone, iPad, AirPods, Apple Watch, Mac, Apple TV, HomePod, AirTag, name an Apple product and our team has made major contributions to its success!"}, "200458906": {"jobID": "200458906", "origin_search": null, "posted": "Jan 21, 2023", "jobTitle": "Platform Architecture Security Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458906/platform-architecture-security-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proven track record of delivering security-focused features while working on end-to-end solutions with SW, Systems, Business/Factory Operations, Server, and Field Repair/Customer Care (e.g. AppleCare).Ability to facilitate development/design conversations with multiple engineering partners, document decisions/opens, and drive closure in a timely manner.Ability to build both a high-level program plan, as well as a detailed micro-schedule; and to drive each accordinglyProven success in driving multi-functional alignment, and being a change agent where vitalOutstanding documentation and self-organization; driving action item follow-up to ensure program momentum is maintained.Self-motivated and upbeat to mitigate program risks, close opens, and unblock critical path issues at the program level (including escalations of resource priorities).Leadership capabilities in being able to connect team members across an organization, and experience presenting to Sr Management/Executives.Familiarity with Product Fraud, Tampering, and Repair; including a basic understanding of future legislative initiatives such as Right-to-Repair.Familiarity with security concepts and architectures (e.g. encryption vs. signing vs. attestation, knowledge of various security architectures such as HW vs. SW key protection, secure boot technologies, and/or secure cloud storage platforms).BS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norms here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nAre you a leader? Do you want to apply your engineering background to make big things happen? Can you influence, connect, get results and communicate optimally? Can you deliver results while running a complex schedule? \n\nAs a Platform Architecture Security Engineering Program Manager within the Hardware Technology team, you will lead security-focused programs and features for Apple products, silicon, services, and a wide variety of multi-functional security initiatives.\n\nWe are looking for a dedicated Engineering Program Manager or a technical leader who is passionate about getting into program management and inspiring the team to collaborate and deliver innovative designs within schedule constraints. The ideal candidate needs to be able to dig into sophisticated technical topics while balancing the strategic needs of the project and the tradeoffs involved in technology development."}, "200342579": {"jobID": "200342579", "origin_search": null, "posted": "Sep 22, 2022", "jobTitle": "iPad Touch HW - Touch EE Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200342579/ipad-touch-hw-touch-ee-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. in EE or Physics related fields (PhD preferred) + 3 yrs related industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong logical thought process and analytical skill set. Ability to break-down complex problems fundamental blocks that can be analyzed via understanding of electro-magnetic interactionsElectrical engineering background in analog and mixed-signal design, especially board-level circuitsHands-on experience in system-level designExcellent written and verbal communication skills and solid teamwork and leadership skillsProficiency in FEA (Comsol, ANSYS, Maxwell) MATLAB, SPICE, or similar simulation and modeling toolsM.S. in EE or Physics related fields (PhD preferred) + 3 yrs related industry experience", "jobDescription": "The Sensor Technology team develops cutting-edge sensor solutions and technologies that are central to Apple’s products. The key goal of the team is to enable the world’s best user-experience through state- of-the-art sensor solutions, such as the high-precision, low-latency multi-touch and stylus sensors in our products. New challenges arise everyday that require the sharp problem-solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation."}, "200342600": {"jobID": "200342600", "origin_search": null, "posted": "Feb 8, 2022", "jobTitle": "iPad Touch HW - Touch EE Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200342600/ipad-touch-hw-touch-ee-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. in EE or Physics related fields (PhD preferred) + 3 yrs related industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong logical thought process and analytical skill set. Ability to break-down complex problems fundamental blocks that can be analyzed via understanding of electro-magnetic interactionsElectrical engineering background in analog and mixed-signal design, especially board-level circuitsHands-on experience in system-level designExcellent written and verbal communication skills and solid teamwork and leadership skillsProficiency in FEA (Comsol, ANSYS, Maxwell) MATLAB, SPICE, or similar simulation and modeling toolsM.S. in EE or Physics related fields (PhD preferred) + 3 yrs related industry experience", "jobDescription": "The Sensor Technology team develops cutting-edge sensor solutions and technologies that are central to Apple’s products. The key goal of the team is to enable the world’s best user-experience through state- of-the-art sensor solutions, such as the high-precision, low-latency multi-touch and stylus sensors in our products. New challenges arise everyday that require the sharp problem-solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation."}, "200373474": {"jobID": "200373474", "origin_search": null, "posted": "Nov 14, 2022", "jobTitle": "Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200373474/software-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science, Computer Engineering, Software Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience using Swift (preferred) or Objective-C, C, C++Solid computer architecture fundamentals (hardware and software)Self driven and highly adaptiveExcellent written and verbal communication skillsExperience developing apps for iOS, macOS, or iPadOS using Apple’s native toolset is a plusExperience leveraging XCTest is a plusBS in Computer Science, Computer Engineering, Software Engineering", "jobDescription": "The Mac Systems Quality team is looking for a highly motivated and detail-oriented software engineer to grow the macOS application used to measure power and identify power optimizations on all future Macs. You’ll be part of a small, highly collaborative team of software engineers with big ambitions.\n\nDue to its success, our power application is being used by teams across Apple, across continents. You will be interacting with various teams in understanding and implementing their needs and in parallel implementing your own futuristic ideas.\n\nCome join our creative team of engineers working with the latest technologies and dedicated to keeping Mac innovation the highest in the industry!"}, "200446642": {"jobID": "200446642", "origin_search": null, "posted": "Dec 10, 2022", "jobTitle": "WebKit Media Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446642/webkit-media-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Familiarity and experience with pointer-based languages, C or C++ preferred.Understanding of data structures and algorithms.Excellent debugging, critical thinking, and interpersonal skills.Familiarity with web technologies, including HTML5 video and Web Audio.Basic knowledge of macOS and web browsers.BS or equivalent", "jobDescription": "The WebKit team seeks a software engineer excited to work on innovative technology for the world’s most popular web engine! Weʼre looking for engineers with outstanding critical thinking skills, a passion for quality, and the desire to push the web forward!\n\nWe are looking for someone who will be responsible for bringing the latest media technologies to the web.\n\nThe WebKit framework powers many system applications, including Safari, Mail, and Books."}, "200449827": {"jobID": "200449827", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Software Engineer (Java)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449827/software-engineer-java?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS degree in computer science or information management plus 7-10 years of experience, or MS degree plus 5-7 years, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expertise in Java and Java Enterprise technology applications architecture, design, development and support6+ years experience in designing and developing scalable enterprise level back end solutionsProven skills and Hands-on programming experience in Java, Spring, multi-threading, REST, Data Caching Services, DB schema design and data access technologiesHands-on with architecture, design, development and deployment of enterprise systemsExperience rolling out distributed, large-scale, low latency web applicationsPrevious experience designing ecosystems for Web applications & API PlatformsExperience in architecting and defining Application layer in SOA/Micro Services landscapeExperience in building, orchestrating, and deploying highly scalable REST based stateless APIs/web services for web applications / mobile clientsUnderstand security concepts and build reliable and safe distributed applicationsExperience with leading and mentoring EngineersSolid knowledge of applications performance improvement techniques and caching solutionsAbility to successfully multi-task and support multiple, concurrent projectsExperience with Reactive Java applications is a plusBS degree in computer science or information management plus 7-10 years of experience, or MS degree plus 5-7 years, or equivalent.- Excellent analytical and quantitative skills- Experience in working in a large enterprise, with a global environment, across multiple timezones and geographies- Excellent communication and collaboration skills and ability to multi-task- To be successful you are self-motivated; driven to achieve and exceed expectations- Attention to detail- Comfortable working in a loosely structured organization", "jobDescription": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job.\n\nThe Engineering Solutions team is looking for an experienced Java Software Engineer. In this role you will be partnering with cross functional teams across Apple. You will work closely with our business leaders and other partners to implement these new solutions. The candidate must be able to work independently, understand the needs and build the solutions for sophisticated architecture and comfortable working under pressure at times during unsociable hours."}, "200464882": {"jobID": "200464882", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Battery Cell Technology Development Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464882/battery-cell-technology-development-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "10+ years of relevant industry experience (preferably Battery or Consumer Electronics) taking technologies from concept definition to mass production. Experience with emphasis on lithium ion or lithium polymer battery cells a plus.Technical project management experience in material development, mechanical design, simulation, and manufacturing process development.Technical Degree in Chemical Engineering, Material Science or Mechanical Engineering preferred, experience in lithium-based battery is an advantage.Extensive experience in setting up technology development project plans, anticipating potential roadblocks and reacting proactively to mitigate against risks or impacts.Knowledge of current state of the art production process applicable to lithium rechargeable cells highly desired.Understands and deals well with rapid development cycles; remains flexible and calm in the face of ambiguity. Highly adept in multi-tasking of both short-term and long-term activities.Proven record of delivering and working in a fast-paced multi-functional environment; engaged and eager to learn.Proficiency in working with suppliers to develop and qualify battery.Excellent communication, interpersonal and leadership skills, as well as the ability to filter and distill relevant information for the right audience.Ability to comprehend, communicate and manage complex design tradeoffs.Experience with modeling and simulation work a plus.BS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, dedicated people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product!\n\nAs an Engineering Project Manager (EPM) within Apple's HW Technology organization, you will be responsible for development of battery solutions for a wide range of Apple products. We are lookinan upbeat EPM to support technical complicated projects where you are encouraged to bring to bear your engineering background to enable multi-functional teams delivering sophisticated solutions. The ideal candidate will understand lithium based rechargeable cells, and have a passion for upending conventional wisdom of material, packaging, and analytics development to push industry boundaries and deliver better Batteries. The candidate has a working understanding of battery cell design and manufacturing to drive and implement a plan from concept development to build management to product integration. Successful candidates will have a consistent track record of enabling larger multi-functional teams to deliver complex systems efficiently and with high quality, with ability to bridge gaps between different engineering teams, while driving and qualifying suppliers to Apple Battery specifications."}, "200451756": {"jobID": "200451756", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "Custom Silicon Management Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451756/custom-silicon-management-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience leading a full SOC design flow, from concept to mass productionTechnical Program/Project Management or related technical leadership experienceExperience with vendor relationships, influencing external decision-making and prioritizationPassion for driving continuous improvements in flows, communication, and organizationUnderstanding of hardware and software integration challenges.Familiarity with both analog and digital design and development flows.Experience working in a multifaceted fast-paced & multi-functional engineering environment and real-time crisis leadership skills.Strong desire to own/drive project development using well-defined metrics & methodologiesExcellent interpersonal, leadership, and communication skills.BS + 10 years of relevant experience.", "jobDescription": "Apple is looking for design engineering professionals with strong leadership, managerial courage and communication abilities to ensure that our 3rd party developed analog/mixed-signal Custom Silicon designs meet the technical, quality and schedule requirements for all of our hardware products. In this position, you will represent Apple in front of our custom silicon vendors all over the world. You will be responsible for driving the full Silicon development cycle from initial concept, vendor selection, implementation, validation, and qualification through ramp for mass production. You will use your deep technical knowledge including effective program/project management skills to drive silicon program schedules and resolve technical issues that enable timely silicon delivery to Apple products. Additionally, you will forge strategic relationships with internal and external leadership to influence prioritization, lead issue resolution, communicate status/issues/next steps and drive continuous improvement initiatives."}, "200443068": {"jobID": "200443068", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "SW Engineering Program Manager (EPM) - AR/VR Audio - Technology Development Group", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443068/sw-engineering-program-manager-epm-ar-vr-audio-technology-development-group?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS Engineering or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Familiarity with audio software.5+ years of experience managing complex, cross-functional software projects.Solid knowledge of software development processes.Ability to dive into technical details.Exceptional verbal/written communication skills, ability to distill information for the right audienceSelf-motivated, collaborative, curious, pro-active with demonstrated critical thinking capabilityGreat attention to detail.BS/MS Engineering or equivalent work experience.", "jobDescription": "The Technology Development Group is a growing, high energy, results-oriented team. We are looking for an experienced technical software engineering program manager (EPM) with a passion to succeed. As a member of our organization you will partner with engineering teams in implementing audio software for AR/VR experience. You will be part of crafting future products that will delight, inspire and empower millions of people.  \n\nWe are looking for a self-motivated teammate with a track record of shipping complex new technologies and experiences in system software; someone who thrives in a dynamic, constantly changing environment. You will lead teams through the software development cycle from concept to delivery, collaborating with several teams at Apple, driving the definition, schedule, execution and communication of new features. If you are up to the challenge of leading an amazing team in building ground breaking technologies through a fast paced development cycle with frequent changes, we want to hear from you!"}, "200451380": {"jobID": "200451380", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "SerDes Micro Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451380/serdes-micro-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical subject area with minimum 10 years of meaningful experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience leading the definition of high-speed SERDES receiver, transmitter, and clocking blocksDeep understanding of adaptation and optimization algorithmsDeep understanding of communications and information theoryProficiency in equalizers, timing recovery and system identificationProficiency in DSP concepts and applicationsFamiliarity with mixed-signal modeling in Python/MATLAB/C/C++Experience in system design and performance tradeoffFamiliarity with simulation tools for analog, digital, and/ or mixed-signal circuitsFamiliarity with Machine Learning conceptsExperience in firmware or embedded software development is a plusBS degree in technical subject area with minimum 10 years of meaningful experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Mixed Signal Design team is seeking a very creative software architect to help change the way we design our Analog Mixed-Signal IPs. These IPs will power our next-generation mobile silicon, including future versions of our iPhone, iPad, and Apple Watch devices. \n\nAnalog Mixed-Signal (AMS) Team is seeking a self-motivated SERDES Micro Architect to drive the definition of our next generation IPs. The SERDES IPs will be used in Apple silicon offering breakthrough power and performance for iPhone, iPad, Mac, and Apple Watch."}}