{"200462239": {"jobID": "200462239", "origin_search": null, "posted": "Feb 9, 2023", "jobTitle": "Software Quality Engineer - Safari/WebKit", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462239/software-quality-engineer-safari-webkit?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science, or related field, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$84,300", "max": "$162,800"}, "benefits": null, "requirements": "Experience with QA methodologies.Ability to think creatively.Strong attention to detail.Comfortable and adaptable in a sophisticated software development environment.Knowledge of Python or other scripting languages.Familiarity in test automation environments.BS in Computer Science, or related field, or equivalent.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Safari and WebKit team is looking for a QA Engineer to help deliver the next generation Safari browser to customers on both iOS and macOS. We're looking for critical problem solvers to play a key role qualifying Safari software releases and ensuring a high-quality customer experience. We need someone who will enjoy working in an exciting environment with rapidly changing priorities, and someone creative and inspired to invent new ways to help build better products."}, "200451989": {"jobID": "200451989", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Cellular/Wireless RF Silicon & System Validation Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451989/cellular-wireless-rf-silicon-system-validation-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proven experience in Cellular/Wireless RF silicon and system validationExcellent communication, presentation, social, and leadership skillsAbility to tailor information to the right audience, including executive managementExperience working in a wide-ranging multi-functional engineering environment, strong at multi-tasking, and real-time crisis managementExpertise in owning and driving project development/technical program managementExperience working with RF systems & design flows and leading cellular/wireless projects from concept to productionBS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norms here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nAre you a leader? Do you want to use your engineering background to make big things happen? Can you influence, connect, get results and communicate effectively? Can you deliver on a predictable yet multidimensional schedule? \n\nAs a Cellular/Wireless RF Silicon & System Validation Program Manager within the Hardware Technology Engineering organization, you will be working on a senior program management team driving RF silicon and system validation program schedules and resolving technical issues to drive timely silicon delivery. This is an individual contributor role, helping lead the development process for Cellular/Wireless SoC silicon used in groundbreaking Apple products. This role spans across the full SoC development cycle, from concept to productization. Validated experience working in a multi-layered engineering environment, sophisticated multi-tasking skills, and real-time crisis management are all desired strengths for this position."}, "200387073": {"jobID": "200387073", "origin_search": null, "posted": "Jan 3, 2023", "jobTitle": "Cellular Platform Software Engineer- CoreBSP Enablement Team", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200387073/cellular-platform-software-engineer-corebsp-enablement-team?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor, Master degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Deep understanding of (or the abilities to deeply understand) CPU processors, SoC architectures and RTOS kernelsExtensive development experience with strong assembly/C/C++ coding skillsIn-depth debug skills with gdb/lldb, JTAG/ETM, ram dump on both FPGAs and hardware platformsExperience with Pre-Silicon & Post-silicon SW bring-up, SW validation, as well as debugging and development of Hardware Dependent Software (Board Support Package: BSP)Proven track record to work in a dynamic, multi-tasked environment;Excellent written and verbal communication skills with an ability to collaboratively work with many varied teamsStrong communication skills, strong social skills, self-starter and strong initiative skills.Bachelor, Master degree in Electrical Engineering, Computer Engineering, Computer Science or equivalentFamiliar with cellular protocol stack will be a plus.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Smart people and inspiring, innovative technologies are the norms here. Do you love working on challenges that no one has solved yet? Are you ready to be part of a team transforming wireless technology? Join us to help deliver the next groundbreaking Apple product. \n\nWireless Technologies team is looking for a highly motivated and strong technical lead to work on our next-generation products. The duties of this position will lead a team to design, develop, debug baseband platform software, and work with HW & SW multi-functional teams to deliver the features into next-generation products. CoreBSP Enablement team mainly responsible for CoreBSP SW enablement and handling of CoreBSP system-level issues that can bridge the gap between HW & SW Teams. This group deals with common HW&SW platform infra enablement for Pre-silicon and Post-Silicon SW enablement across all platforms and unblocking SW teams."}, "200451426": {"jobID": "200451426", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451426/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Solid understanding of mixed signal concepts, RTL design, Verilog and SystemVerilogDeep knowledge of front-end tools (Verilog simulators, linters, clock-domain crossing checkers)Validated knowledge of synthesis, static timing, DFT, is a plusSome working knowledge of SystemVerilog assertions, checkers, and other design verification techniques are a plusKnowledge of scripting languages. Perl and Python are plussesStrong communication and presentation skillsBS degree in technical discipline with minimum 3 years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and outstandingly hardworking RTL Design Engineer. \n\nAre early in your journey towards a chip design career and wish to challenge yourself in a technical and multi-disciplinary effort, we have an exciting position for you in the world class Apple mixed-signal silicon design team. This position will encourage building of a solid foundation in logic circuits and gentle entry into understanding analog circuits. You will gain transparency into a variety of flows fundamental to modern silicon engineering: insight into full custom schematics for analog as well as high-speed digital circuits, translating functionality of such circuits into an efficient software behavioral representation, simulation of such code and ensuring formal equivalence between custom designs and their abstract representation. You will gain experience and knowledge into software methods and analysis that is increasingly important for a variety of disciplines.\n\nAs a member of our wide-ranging group, you will have the outstanding and phenomenal opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Your role is will equip you with learning to specify, design, and help in the verification and lab bring-up of sophisticated mixed-signal circuits (digital side)."}, "200452032": {"jobID": "200452032", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "PHY Systems Engineer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452032/phy-systems-engineer-simulation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep knowledge of communication system theory and PHY signal processingValidated track-record in SW and link/system level simulator design in C/C++, including experience with simulator frameworks and configuration management.In-depth knowledge of wireless communication systems with hands-on experience in 4G/5G PHY design, pre-silicon verification and critical metric testing.Experience with Matlab, C/C++ and/or Python including significant knowledge of algorithms and data structures, memory and runtime profiling as well as code optimization techniques.Solid knowledge of current cellular communication standards: 5G (NR) and 4G (LTE).Work experience related to RAN1/RAN4 submissions is a good plusStrong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, debugging and fixing of defects, …).BS and 3+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200462377": {"jobID": "200462377", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Embedded Hardware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462377/embedded-hardware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS in EE or CS with + 3 years experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "A detailed understanding of SoC/FPGA/Embedded System architecture.Expertise in high-speed memory systems and communication interfaces such as DDR, PCIe, SPMI, MIPI, SPI, I2C, etc.Strong digital logic skills, including proficiency in timing analysis, state-machine debugging, and RTL/test-bench development.A shown understanding of MAC and protocol specifications for digital interfaces.Develop automate scripts (test cases) targeting specific aspects of silicon designs and digital interconnects.Hands-on debugging skills and experience with modern lab equipment like DSOs, logic analyzers, and protocol analyzers.Familiarity with modern operating systems, multi-threaded systems, firmware, and device drivers.Proficiency in writing basic software routines and test scripts.Ability to interpret and navigate schematics and layouts.Strive to address system-level issues as part of a team.Minimum BS in EE or CS with + 3 years experience is required.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, we help improve the performance of our products through innovative system-on-chip designs. Our team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. \n\nJoin us and help build world-renowned wireless systems that connect customers to their world like never before. Join a team of amazing software and hardware engineers with a diverse set of backgrounds (Cellular Modems, Connectivity solutions, Device Drivers, CPUs and caching, kernel programming, embedded systems) to test Apple's next-generation mobile products! Product lines include iPhones, iPads, Apple Watch, Apple-TVs, and Macs."}, "200448037": {"jobID": "200448037", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Firmware Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448037/firmware-engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$269,000,"}, "benefits": null, "requirements": "5+ years of proven excellence in firmware, device driver, or equivalent experience3+ years leading an embedded software or firmware development teamExpertise and proficiency in CExperience with MCUs, peripherals, features, and development environments is also valuableExperience with RTOS embedded development and multithreaded programmingKnowledge of Bluetooth and Wi-Fi Technologies is desiredPassion for product ownership and track record of product developmentAble to coordinate the efforts of multiple teamsExcellent written and verbal communication skillsHighly organized, creative, motivated, and passionate about achieving resultsBS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "We are looking for an energetic manager to join our team. In this role you will have the opportunity to drive the technology and product development for Apple's consumer products."}, "200459106": {"jobID": "200459106", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Sr. Power Technology Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459106/sr-power-technology-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE in power electronics with 10+ years experience in power electronics research or design engineering including 3+ years experience in technical lead role"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience of working on various high frequency power conversion technologies used in consumer electronics, computing, Telecom, Industrial/Medical applications such as, off-line switched mode power supplies and on-board DC/DC Converters. Any exposure to adjacent power electronics fields such as Automotive, Solar Inverters, Motor drives is helpful, although not vital.Must have worked in the capacity of technical lead in several projectsStrong expertise in various power conversion topologies and architectureAnalytical capabilities to understand and tackle architectural issuesHigh level of expertise in control loop design, Spice simulations and mathematical modelingHands on experience in digital control and embedded firmware development for power conversion products is a mustCan work independentlyGood understanding of safety, reliability and manufacturability aspectsFamiliar with working on novel concepts with passion for research & developmentAbility to communicate and collaborate with multi-functional teamsEvidence of innovations in enabling technical solutions will be an added benefitBSEE in power electronics with 10+ years experience in power electronics research or design engineering including 3+ years experience in technical lead role", "jobDescription": "An excellent opportunity to work on the forefront technology with the outstanding company consistently bringing innovations to the world. In this position, you will be part of the sophisticated power technology team developing innovative power architectures for Apple’s next generation products. Are you ready for a new challenge? Come join the team!"}, "200406876": {"jobID": "200406876", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "Software Engineer - Embedded Debug Tools", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200406876/software-engineer-embedded-debug-tools?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in CS, CE, EE or equivalent industry experience required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proficient in C/C++ and PythonWorking with low level SW and HW interaction.Experience working with low level SW protocols for HW interaction.Knowledge of hardware architecture - SoCs, CPU, GPUDemonstrated creative, critical thinking and troubleshooting skillsHighly professional, with the ability to deliver solid work on tight schedulesExcellent collaboration skillsOutstanding written and verbal communicationBS in CS, CE, EE or equivalent industry experience requiredExperience with SWD/JTAG and other debuggersARMv8 architecture knowledgeUnderstanding of operating system fundamentalsKnowledge of ARM's DAP architecture and JTAGExperience developing tools for othersExperience developing debug toolsExperience with HW debuggingExperience with LLDB and/or GDB", "jobDescription": "Are you a big-picture problem solver who loves setting bold goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, multidisciplinary user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices.\n\nThe Core OS software team is looking for an especially talented SW engineer for the Embedded Debug Tools team. Apple uses its own internally developed SWD/JTAG solution and SW tools for all Apple Silicon product debugging. Working on this core technology will give you the opportunity to have a major impact on the success of Apple's iOS, watchOS, macOS based products. Your contributions will help turn this toolset into a world-class debugging solution."}, "200450900": {"jobID": "200450900", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded Real Time Critical Control Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450900/embedded-real-time-critical-control-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience with design and implementation of bare metal control firmware which is highly optimized for cycles and memoryDeep understanding of the difference between design for a software platform and a highly constrained firmware environmentUnderstanding of the use of data structures for deterministic and efficient reads and writesUnderstanding of design for asymmetric multiprocessing solutionsFundamental facility with C and C++, compilers, build and source code control toolsSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceUnderstanding of 5G and 4G 3GPP protocols a plusSome familiarity with wireless communications a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As an Embedded Firmware Engineer passionate about real time critical control on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded firm development, that thrives in a wide-ranging multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200450904": {"jobID": "200450904", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded Real Time Critical Control Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450904/embedded-real-time-critical-control-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceExperience with design and implementation of bare metal control firmware which is highly optimized for cycles and memoryDeep understanding of the difference between design for a software platform and a highly constrained firmware environmentUnderstanding of the use of data structures for deterministic and efficient reads and writesUnderstanding of design for asymmetric multiprocessing solutionsFundamental facility with C and C++, compilers, build and source code control toolsProven understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceUnderstanding of 5G and 4G 3GPP protocols a plusSome familiarity with wireless communications a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you’ll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We’ll work across teams to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As an Embedded Firmware Engineer passionate about real time critical control on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded firm development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200461521": {"jobID": "200461521", "origin_search": null, "posted": "Feb 4, 2023", "jobTitle": "Emulation Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461521/emulation-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Proven experience with bring up, debugging and verification in EmulationUnderstanding of the tool flow from RTL to Emulation is a big plusGood understanding of any Standard Emulator (Palladium, Veloce, Zebu) OR FPGA (Xilinx, Altera) flowProven design verification skillsExperience in writing Synthesize-able SystemVerilog/Verilog code and SystemVerilog assertionsExperience with System Verilog verification environments including C/C++ DPI, UVMExperience on any Scripting (Perl/Python/TCL)Excellent analytical and debug skillsExperience in UVM Acceleration is plusBS and 3+ years of relevant experience required.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. \n\nAre you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly. We are looking for you to join our emulation verification team focusing on the creation, deployment, and support of sophisticated emulation environments. In this highly visible role, you will be at the center of a chip design effort collaborating with multiple fields. \n\nAre you ready to help us deliver the next groundbreaking Apple products?"}, "200465443": {"jobID": "200465443", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "NAND ATE Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465443/nand-ate-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experienceWorking on all aspects of Memory automated test equipment (ATE). (Advantest, Teradyne, etc.)Experience with memory systems, technologies, and processing - NAND a plusDemonstrated experience in coding scripts and board design necessary to enable ATE test solutionsProficiency in programming C or C++ and automation scripting (LUA, PYTHON, MATLAB, etc.).Deep understanding of Electronic Engineering Fundamentals including Signal IntegrityAble to work with test equipment (i.e., oscilloscope, logic analyzer, Protocol analyzer, etc.)Failure analysis and troubleshootingExperience with embedded system integration and development a plusCoding experience and understanding of embedded OS, SW FTL is idealExperience with PCIe, SSD controllers and firmware is a plusBS and 10+ years of relevant industry experience", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? Do you intrinsically see the importance in every detail? As part of this group, you’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAs a NAND ATE Test Engineer you will lead and support the testing and qualification of various programs using SSD (solid-state drive). A strong candidate will have experience with NAND reliability testing, and validation.  You will be part of a world class team of HW Engineers who identify and resolve potential risks for all aspects of NAND qualification and testing, including generating test programs and scripts. You will have direct impact on Apple's future products by ensuring world-class solutions to demanding test and engineering challenges."}, "200452738": {"jobID": "200452738", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "5G/4G Cellular Layer1 Control Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452738/5g-4g-cellular-layer1-control-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Minimum BSProficiency with C and/or C++, compilers, build and source code control tools.Experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programming.Good understanding of software engineering principles, and core computer science fundamentals.Brief understanding of PHY L1 software/firmware in 3G/4G and/or 5G.Understanding of computer architecture with particular emphasis on the HW/SW interfaces of high-speed communication subsystems.Brief understanding in debugging embedded software systems.Familiarity with UARTs, JTAG, and oscilloscopes is nice to have.Knowledge and experience of Matlab is a plus.Minimum BSApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible. As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. You’ll work across fields to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. \n\nAs a Cellular Physical Layer Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for designing and productizing pioneering cellular SoCs. This position requires someone willing to learn or already familiar with all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200467109": {"jobID": "200467109", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Mechanical Design Engineer - Sensing Product Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467109/mechanical-design-engineer-sensing-product-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Bachelor/MS/PhD degree in engineering\nMinimum of 2 years of relevant industry experience or PhD degree in related area"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "2+ years of hands-on experience designing mechanical components or systems for a production environment.Proficiency in 2D drafting, 3D conceptual modeling (NX preferred), tolerance analysis, and design trade-offs.Strong mechanical engineering analytical skills. Experience using FEA to drive design decisions is strongly preferredAbility to collect and use data to inform decisions and fuel debate in an open and intellectually honest manner.Clear and concise communication skills  with ability to adapt written and verbal messaging for a variety of audiences.Cross-disciplinary approach to design; collaborates with a diverse team as well as external vendors to solve complex problems and achieve project goals.Demonstrated ability to drive failure analysis to determine root cause and develop effective corrective actions.Nice-to-have Skills:Consumer electronics knowledge is preferred; familiarity with capacitive sensing technology is a strong plusKnowledge of basic engineering materials (plastics and adhesives) and manufacturing processes, specifically in high-volume mass productionDetail oriented and capable of handling multiple assignments at onceCurious, willing to learn new skills, and share knowledgeWorking experience or academic training in:Sensors, electrical circuit design, thin film technologiesProgramming and scripting (MATLAB or Python preferred)Tolerance analysis and process capability analysisStatistical and regression analysis, response surface modeling (JMP or Minitab)Finite Element Analysis (FEA) of mechanical, thermal, static/dynamic environment (Ansys, Abaqus, Comsol)Nonlinear material characterizationBachelor/MS/PhD degree in engineering\nMinimum of 2 years of relevant industry experience or PhD degree in related area", "jobDescription": "The Sensing Product Design team is looking for a talented mechanical engineer to build great\nexperiences and bring Apple products to life. We are the team developing many of the sensors\nthat changed the way people interact with their technology. Touch redefined the phone and\ntablet, TouchID seamlessly secured them, and the heart rate monitor let you keep tabs on\nyourself.\n\nIn this role, you will be responsible for specifying, developing, characterizing and validating touch sensing systems.  You should be familiar with sensor technologies, along with related product integration and manufacturing technologies."}, "200084315": {"jobID": "200084315", "origin_search": null, "posted": "Oct 14, 2020", "jobTitle": "Tools Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200084315/tools-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in CS or comparable degree or relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years of industry experience in the following areas:Developing apps and/or frameworksStrong sense for API developmentTrack record of shipping productsAdvanced knowledge of Swift, Objective-C, C++ or C (listed in order of preference)Ability to thrive in an agile working environmentPassion for delivering high quality software to end usersBS/MS in CS or comparable degree or relevant experience-  Familiarity with modern developer technologies-  Experience with iOS/macOS developmentApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple's Technology Development Group works with advanced technologies, including the augmented reality (AR) platform ARKit and Metal 2, to create ground-breaking new products. Do you want to push the limits of the best Augmented Reality platform in the world? Would you like to help craft Augmented Reality experiences for millions of people? In this position, you will have the opportunity to partner with our extraordinary team of technologists, artists and designers to build new software products that will change the way people experience their own reality!"}, "200444112": {"jobID": "200444112", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Display Technologist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444112/display-technologist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "This position generally requires a PhD degree, or a Master degree with more than 5 years of experience in relevant industrial work environment."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "In-depth understanding of semiconductor device physics and the operating mechanism of various device metrology and characterization methodsHands-on experiences with various characterization tools for device testing and failure analysisWorking knowledge and hands on experience in device fabrication of compound semiconductor optoelectronicsProficiency in data analysis tools as applied to process development and yield improvement including SPC, design of experiments and statistical analysisExcellent written and verbal communication skills combined with strong capability to explain technical issues clearly and accuratelyExperience in optical and carrier transport modeling is a plusThis position generally requires a PhD degree, or a Master degree with more than 5 years of experience in relevant industrial work environment.", "jobDescription": "At Apple, we believe that new ideas have a way of becoming outstanding products. As part of our Display Technologies group, we are charged with assessing disruptive technology for future Apple products. If you are enthusiastic about working in a highly capable team developing new technology and working on challenges that no one has solved yet, this is a great chance. We are looking for a Display Technologist to help drive an LED based display project at the technology development stage. The successful candidate must possess a strong technical background in semiconductor optoelectronics with substantial hands-on experience in semiconductor device fabrication and characterization."}, "200451492": {"jobID": "200451492", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "IC Designer - Power Management", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451492/ic-designer-power-management?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "A minimum of 3 years of experience in industry for ICs going into production.Proven experience with optimization of voltage regulator high level architecture and low-level circuits; knowing which are suitable for given applications.Familiarity with buck, boost, LDOs, bandgaps, bias, comparators, and op-amps.Versed in the electrical characteristics and physical construction of capacitors and inductors.Qualified to review and provide feedback for printed circuit board designs from a power perspective and associated I/O.Device physics knowledge in regard to analog and power such as transistor operation, optimization, parasitics, and performance.We seek engineers skilled in analog IC design CAD tools and analysis flows to complete the designs for tapeout.Experience modeling circuits in Matlab, VerilogA, Python, or C for concepts prior to implementation.Validate analog/power designs on a lab bench using spectrum analyzers, oscilloscopes, signal generators, etc.Design with detailed testability; write test plans for trim and calibration; collaborate with test engineers.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Did you know that you could design custom analog integrated circuits at Apple? Our team is looking to hire inventive analog designers for the purpose of power management ICs! You can work with a team with dynamic strengths to push the limits of DC-DC converters. Partner with us to develop bucks, boosts, buck-boosts, charge pumps, chargers, or LDOs. Additionally, this role covers IC areas closely related to power converter IPs such as mixed signal circuits, switch-cap, filters, data converters, references, input-output circuits, and clock circuits just to name a few. As a power management IC designer you can also work with system engineers and architects. Together, you will work on exciting problems and help build amazing products. If so, we are looking for you!"}, "200451493": {"jobID": "200451493", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "IC Designer - Power Management Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451493/ic-designer-power-management-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "A minimum of 10 years of experience in industry for ICs going into production.Proven experience with optimization of voltage regulator high level architecture and low-level circuits; knowing which are suitable for given applications.Familiarity with buck, boost, LDOs, bandgaps, bias, comparators, and op-amps.Versed in the electrical characteristics and physical construction of capacitors and inductors.Qualified to review and provide feedback for printed circuit board designs from a power perspective and associated I/O.Device physics knowledge in regard to analog and power such as transistor operation, optimization, parasitics, and performance.We seek engineers skilled in analog IC design CAD tools and analysis flows to complete the designs for tapeout.Experience modeling circuits in Matlab, VerilogA, Python, or C for concepts prior to implementation.Validate analog/power designs on a lab bench using spectrum analyzers, oscilloscopes, signal generators, etc.Design with detailed testability; write test plans for trim and calibration; collaborate with test engineers.BS and a minimum of 10 years of relevant industry experience", "jobDescription": "Did you know that you could design custom analog integrated circuits at Apple? Our team is looking to hire inventive analog designers for the purpose of power management ICs! You can work with a team with dynamic strengths to push the limits of DC-DC converters. Partner with us to develop bucks, boosts, buck-boosts, charge pumps, chargers, or LDOs. Additionally, this role covers IC areas closely related to power converter IPs such as mixed signal circuits, switch-cap, filters, data converters, references, input-output circuits, and clock circuits just to name a few. As a power management IC designer you can also work with system engineers and architects. Together, you will work on exciting problems and help build amazing products. If so, we are looking for you!"}, "200448737": {"jobID": "200448737", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "SoC Security Engineer, Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448737/soc-security-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experienceSolid background of applied cryptographyWorking experience in definition of secure systemsExperience in threat modeling and weaknesses analysisKnowledge of SoC architecture, microprocessor architecture a plusExposure to OS securityExcellent interpersonal skillsAbility to independently pursue new ideas and innovationsGood knowledge of Verilog/VHDLExperience in C/C++ and interpretive language such as Perl/PythonBS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. \n\nWe are looking for an experienced Security Engineer with experience spanning both hardware and software. You will work with a multi-functional engineering team to define, design, and verify security systems. Join us to help deliver the next groundbreaking Apple product!"}, "200439883": {"jobID": "200439883", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Software Developer in Test, Mobile - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439883/software-developer-in-test-mobile-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in computer science or equivalent field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5 + years Experience in Quality Engineering or Software Development in TestProficient programming skills w Python/JavaScript/Swift. Other object-oriented programming languages is a plus.Experience in Device AutomationExperience in building test automation frameworksExperience working with iOS applicationsExperience in Mobile Advertising is a plusStrong analytical, debugging and problem solving skillsExcellent written and verbal communication skills with outstanding attention to detailExpert ability to write clear and concise test documentsSolid QE technical lead ability. Very responsible, organized, driven, and obsessed with quality. Very positive attitude, with excellent work ethic.Proven ability to deliver high-quality design, code, and tests, on tight schedules. Results-oriented and deadline driven.Excellent analytical, problem-solving, and communication skills, with cross-functional teams.Excellent collaboration and interpersonal skills.Curious about new technologies and a quick learner.BS/MS in computer science or equivalent field.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.  \n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. We are looking for an engineer with skills and passion to help build out our large scale platform. \n\nThe QE team fills the mission-critical role of ensuring that our complex, large-scale systems are healthy, monitored, automated, and designed to scale with consistent performance. As an engineer, you will work alongside our team of engineers to create and monitor quality systems in the context of a micro-services architecture, identify continuous improvement opportunities and implement best practices. You will be performing design engineering analysis and development. You will contribute to ensure we provide a world-class user experience for our customers."}, "200448186": {"jobID": "200448186", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Display Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448186/display-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE / MSEE / PHD"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Exceptional Electrical Engineering background, experience in mixed signal EE design at either IC or PCB levelSelf driven and highly motivated with passion for crafting and innovating, attention to details, strong problem solving skillsNeed to be comfortable working in fast paced and highly collaborative work environmentExceptional circuit/math analytical skills, familiar with SPIC based simulation toolsHands-on experience in prototype bring-up and debugging, functional verification and manufacturing supportExperienced in EE validation/characterization tasks, and familiar with lab tools and equipmentAbility to communicate and present technology updates and project status to executives and functional teamsExperience in three or more of the following:DC-DC power converter design & analysisHigh Speed signaling, SI/PI/crosstalk analysisSchematic capture, PCB layout design, BOM creating with ECAD toolsScripting, data processing or automation skills, programming experience in Python, Shell script, Matlab or similar toolsFPGA/CPLD/MCU programming and designConsumer electronics and high-volume production experienceModern display technologies, such as LCD, TFT, OLED, LED etc.BSEE / MSEE / PHD", "jobDescription": "The Display Hardware team is looking for a talented Electrical Engineer to lead the design and development of next generation displays in Mac products. You will be working in a collaborative environment where creativity and innovation are supported and expected. Join us and be part of fast moving and exciting team that creates and integrates the next generation of display technologies into Apple’s products."}, "200353663": {"jobID": "200353663", "origin_search": null, "posted": "Mar 29, 2022", "jobTitle": "WiFi Performance Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200353663/wifi-performance-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required\n\nMasters or Ph.D degree is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Understanding of TCP/IP suite of protocolsDeep knowledge of 802.11 MAC/PHY protocol with relevant industry experiencePython scripting experience is a plusTools experience - iPerf, Ixia, WiresharkDebug and analysis of issues by examining different layers of the protocol stackUnderstand impact of interference on WiFi and BT performanceBachelor's degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required\n\nMasters or Ph.D degree is preferredThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Improve system performance to provide good end user experience.", "jobDescription": "Join our Sensing and Connectivity Engineering team and drive innovation that matters! \n\nWe create and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. Our team works on Apple eco-system of devices that delivers best quality of wireless connectivity"}, "200451524": {"jobID": "200451524", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Design Timing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451524/cpu-design-timing-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceProficiency in static timing tools and methodology including familiarity with handling multiple clock and power domains, cross talk, noise, OCV, etcPrior experience performing timing analysis in high speed digital designs such as CPUs or other similar designs is a plusFamiliarity with physical design tools and methodology including logic synthesis, PnR, parasitic extraction, logic equivalenceKnowledge about deep sub-micron technologies and scaling trendsFamiliarity with CPU microarchitecture including common fundamental timing pathsMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this role, you will be responsible for all aspects of timing including working with the implementation and RTL teams on timing changes, helping with construction/modify timing flows, timing analysis, and timing closure."}, "200460947": {"jobID": "200460947", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Materials Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460947/materials-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our Engineers have Advanced Degree in Materials Science and Engineering, Mechanical Engineering, Chemistry, Polymers Science, or an equivalent field, but if you’ve followed a different path to expertise in Polymers and Composite materials, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "The ideal individual has an in-depth knowledge of polymer and composite materials, including sample preparation, familiarity with test equipment and data analysis methods. Hands on experience is highly desirable.Experience with leading materials engineering projects for polymeric/composite structural parts.Experience with various industry specifications for testing polymer and composite materials, preferably materials used in printed circuit boards or flexible printed circuit boardsExperience in material characterization, material selection and root-cause analysis of mechanical, thermal, and electro-mechanical performance of materials.Attention to detail and a strong passion for qualityAbility to effectively communicate and collaborate with multi-functional teams about various topics such as product requirements, technology specifications, project schedulesA proven dedication to continuous self-improvement.Ability to work in a fast-paced environment.Excellent written and oral communication skillsMost of our Engineers have Advanced Degree in Materials Science and Engineering, Mechanical Engineering, Chemistry, Polymers Science, or an equivalent field, but if you’ve followed a different path to expertise in Polymers and Composite materials, we still want to hear from you.", "jobDescription": "At Apple, our Products, Services, and Customer Experiences demand extraordinary innovation. Technology and environmental breakthroughs are crucial in the materials and processes we bring into production to lead the world in terms of Carbon and Material performance. Can you imagine your talent supporting Apple’s next leap ahead? \n\nWe are expanding our new team of Materials Specialists in the Advanced Technology Group with a key focus on bringing deep materials knowledge and characterization of printed circuit boards (PCBs) and flex printed circuits (FPCs) into the core product design process. We need you!\n\nAre you passionate about materials and being part of an extraordinary engineering team? Do you want to be part of a multi-functional initiative with outstanding suppliers and institutes delivering first of a kind material development? Do you adopt ownership and accountability? Do you want to work hand-in-hand with phenomenal people across Product Design, Electrical Engineering, Reliability Engineering, Design for Manufacturing in Apple’s key Product teams? If yes, we want you to join our diverse and impactful team.\n\nCome Join us!"}, "200453463": {"jobID": "200453463", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "Bluetooth Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453463/bluetooth-performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master’s degree or foreign equivalent in Computer Science, Computer Engineering, Electrical Engineering or related field. Experienced and fresh graduates are encouraged to apply equally."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent Wireless Communications and signal processing skillsExcellent programming skills in C++, C, Objective-C, or SwiftStrong experience in building and maintaining wireless evaluation setupsSelf-motivated and driven with creative and critical thinking capabilitiesThrive in a collaborative environment and can clearly communicate while driving multiple projects across many teamsObsessively passionate and inquisitive, pursue problems in innovative waysLaser-focused on the smallest details that are meaningful impact to our customersBluetooth experience preferred, not requiredKnowledge about other wireless protocols like, WLAN, Cellular, Thread and Zigbee is a plusMaster’s degree or foreign equivalent in Computer Science, Computer Engineering, Electrical Engineering or related field. Experienced and fresh graduates are encouraged to apply equally.", "jobDescription": "Join our Bluetooth Wireless Performance Engineering team and be part of our innovation engine that drives the future! You will be part of the team where the focus is on enriching people’s lives by designing efficient and useful algorithms and driving well established technologies like Bluetooth to its maximum potential."}, "200459628": {"jobID": "200459628", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "HardIP Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459628/hardip-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "In depth knowledge of Semiconductor Manufacturing ProcessDeep understanding of High Speed Digital and Analog circuits, Design for Test and Manufacturing Concepts.Expertise in Semiconductor Test Methodology.Experience working with Digital, Mixed Signal, SOC Devices with hands on VLSI ATE experience. DFT experience is a plus.Strong Programming skills for writing and debugging test programs and HW related issues.Proficiency in programming with Scripting languages (IE., Perl/Python) and high level languages (IE., C/C++ or Visual Basic.)Able to work with test equipment (IE., oscilloscope, logic analyzer, etc)Experience High Speed Board Design & SI analysis.Travel is requiredBS and minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that moves Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!   \n\nWe are seeking a dynamic engineer to develop ATE test programs for debug, characterization, qualification and production of SoC devices specializing in HardIP tests."}, "200447636": {"jobID": "200447636", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "HardIP Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447636/hardip-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and minimum of 3+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "In depth knowledge of Semiconductor Manufacturing ProcessDeep understanding of High Speed Digital and Analog circuits, Design for Test and Manufacturing Concepts.Expertise in Semiconductor Test Methodology.Experience working with Digital, Mixed Signal, SOC Devices with hands on VLSI ATE experience. DFT experience is a plus.Strong Programming skills for writing and debugging test programs and HW related issues.Proficiency in programming with Scripting languages (IE., Perl/Python) and high level languages (IE., C/C++ or Visual Basic.)Able to work with test equipment (IE., oscilloscope, logic analyzer, etc)Experience High Speed Board Design & SI analysis.Travel is requiredBS and minimum of 3+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that moves Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nWe are seeking a dynamic engineer to develop ATE test programs for debug, characterization, qualification and production of SoC devices specializing in HardIP tests."}, "200459342": {"jobID": "200459342", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "CPU Processor Performance Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459342/cpu-processor-performance-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.The ideal candidate should have performance modeling, processor verification, or RTL design experienceIn-depth knowledge of digital logic design, CPU architecture and microarchitectureExperience in performance modeling for advanced CPU designsExperience in developing performance test plans and writing/debugging assembly tests for performance correlation and verificationGood programming skills in assembly, C/C++, Verilog, System Verilog, and scriptingProven experience in benchmarks and workload analysisExperience in CPU performance profilingGood knowledge in compiler techniques and OS for performance optimizationProven knowledge with developing instruction profiling tools on siliconAbility to work across teams to optimize silicon performanceExperience in silicon validation is a plusShould be a great teammate with excellent communication and presentation skills and able to work independently on the owned unitMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \nIn this highly visible role, you will be at the center of a chip design effort collaborating with all subject areas, with a critical impact on getting functional products to millions of customers quickly. \nYou will be responsible for silicon performance verification, correlation, characterization and tuning for CPUs. The role involves pre-silicon performance verification as well as developing tests to characterize CPU performance, analyzing and profiling software/applications, correlating and comparing performance across silicon/system software version, and working with OS and compiler teams on performance debug and tuning."}, "200456976": {"jobID": "200456976", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Camera & Depth Sensing Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456976/camera-depth-sensing-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Relevant industry experience designing Camera hardware or related optical systems OR Project Management relevant experience in a similar field.Camera/depth sensing module design and development experience.In-depth technical engineering knowledge to effectively establish and manage project and operational KPIs, assess and drive technical risks, and critically challenge engineering decisions.Proven ability to effectively manage multiple global contract manufacturers and vendorsAbility to bring focus and transparency to complex situations while monitoring the bigger picture and the needs of a rapid development cycle.Skilled at handling accountability without control, knowing how to identify and drive priorities from among the multiple issues competing for your attention.Excellent communication and conflict resolution skillsKnowledge of camera module design and/or camera key parts design and subcomponentsFamiliarity with a consumer product life cycle.BS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products! \n\n The Camera & Depth Sensing Team is looking for a Hardware Engineering Program Manager (EPM) to drive the design, development, and integration of camera and depth sensing modules. In this highly cross-functional role, the candidate has the opportunity to craft the next generation of cameras and depth sensing modules for Apple's entire product line. The candidate is required to navigate through uncertainties, be adapt to rapid changing scenarios, and lead complex decisions with the final goal to deliver the best technology into the hands of millions of people!"}, "200463695": {"jobID": "200463695", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Service Content Data Analyst", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463695/service-content-data-analyst?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s or Master’s degree (CS or quantitative emphasis preferred, some academic experience with statistics preferred). Snowpro Certification a plus. \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Demonstrable ability to tell important stories with data2+ years experience with Tableau (A portfolio of Tableau dashboards may be requested)Tableau Certified Data AnalystProven understanding of ETL processes, relational database principles, SQL, Data Optimization, and a keen eye for design.Proficiency in SQL in the MPP/No SQL databases like SnowflakeSolid grasp of Keynote, Numbers, and ExcelExcellent verbal, visual, and written communication skills, especially an ability to simplify sophisticated data into useful insightsAbility to think critically about solutions, and debate the merits of different approaches with team membersHigh attention to detail, organization, team-orientation and an ability to work under tight deadlinesDigital Media experience is a plusBachelor’s or Master’s degree (CS or quantitative emphasis preferred, some academic experience with statistics preferred). Snowpro Certification a plus. \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.-  Work with stakeholders throughout Apple to understand the way that their business operates-  Apply database design best practices and business requirements to build effective data schemata-  Sustain and improve existing Tableau dashboards to better meet business requirements-  Build presentations that summarize the most important insights from the analysis, and be able to communicate the results to stakeholders and executives-  Provide subject matter expertise to members of the organization-  Efficiently deliver ad-hoc analyses", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThe AppleCare Service Content team is seeking an expert Tableau dashboard designer to build reports that will drive action within the training team and partner organizations."}, "200398504": {"jobID": "200398504", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Optical Instrumentation Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200398504/optical-instrumentation-engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in Optics, Imaging Science, Physics, EE, ME, or equivalent\n5+ years experience in optical system design preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$309,500,"}, "benefits": null, "requirements": "We are seeking someone with experience in design of optical instrumentation and/or imaging/sensing systemsExperience in modeling and simulation of mechanical and optical systems using Zemax, Code V, etc.Experience in optical metrology, light measurement methodology, colorimetry, and traceability!Strong communication and interpersonal skills; excellent judgment; a self-directed, proactive approach to problem solving.MS/PhD in Optics, Imaging Science, Physics, EE, ME, or equivalent\n5+ years experience in optical system design preferred", "jobDescription": "Imagine what you can do here? The Hardware Test Engineering (HWTE) group is responsible for developing technologies, calibration methodologies, and instrumentation for calibration, testing, and validation of Apple products. The Optical Engineering group within HWTE is looking for an Engineering Manager to manage a team of Optical Scientists and Engineers focused on instrument design and characterization. \n\nThis team develops state-of-the-art optical instruments to enable the characterization of new imaging and sensing technologies in current and future Apple products. Come join us!"}, "200466291": {"jobID": "200466291", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Product Security Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466291/product-security-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in computer science, engineering or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "A proven track record in finding security vulnerabilities in shipping productsProgramming background in C, C++, and/or Objective-CFamiliarity with modern processor architectureBackground in secure coding best practices and code auditingHave an understanding of past, current, and emerging security exploit typesProficiency in scripting language(s) such as PythonProficiency in either macOS or other flavors of UNIXHave the ability to track and manage numerous parallel activitiesExperience building tools and automationAbility to explain complex security problemsBS/MS in computer science, engineering or equivalent industry experience", "jobDescription": "You'll be a part of the Apple Product Security Team at the forefront of Apple's security and threat intelligence capabilities, impacting the breadth of Apple's ecosystem by working on immediate risks to Apple's customers. Working with some of the best security engineers in the world, you’ll have a direct positive impact on the security of Apple’s products. We're looking for a hardworking and highly motivated engineers responsible to help investigate security issues across Apple products with the goal of better safeguarding our users.\n\nYou’ll become part of an outstanding team focusing on securing iOS, tvOS, watchOS and macOS. Rooted in the Security Engineering and Architecture organization, you’ll be working with a wide variety of teams and vendors. Your influence will be felt throughout Apple's extraordinary products, such as the iPhone, iPad, Mac, Watch and Apple TV!"}, "200451601": {"jobID": "200451601", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "SoC Power Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451601/soc-power-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "We are looking for applicants with a minimum of 10 years of relevant industry experience, phenomenal programming skills and an understanding of low-power digital design and power fundamentals, including:Expertise on C/Assembly programming and associated tool chains.Use of basic lab equipment such as multi-meter units, oscilloscopes, etc.Calculations for dynamic and static power in CMOS.Strong communication skills and ability to work as a team.BS and a minimum of 10 years of relevant industry experience", "jobDescription": "As part of our Silicon Engineering group, you will take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you will help design products that bring to our customers experiences they’ve never before envisioned!\n\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Validation Engineers. \n\nThe SoC hardware development team is looking for a motivated engineer to fill a full-time position. The primary role is to engage in power hardware validation and analysis of typical SoC workloads. The analysis of the workloads and their power dissipation will help drive the power optimization efforts to achieve best-in-class power/performance."}, "200451599": {"jobID": "200451599", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "SoC Power Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451599/soc-power-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "We are looking for applicants a minimum of 3 years of experience, phenomenal programming skills and understanding of low-power digital design and power fundamentals, including:Expertise on C/Assembly programming and associated tool chains.Use of basic lab equipment such as multi-meter units, oscilloscopes, etc.Calculations for dynamic and static power in CMOS.Strong communication skills and ability to work as a team.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "As part of our Silicon Engineering group, you will take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you will help design products that bring to our customers experiences they’ve never before envisioned!\n\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Validation Engineers. \n\nThe SoC hardware development team is looking for a motivated engineer to fill a full-time position. The primary role is to engage in power hardware validation and analysis of typical SoC workloads. The analysis of the workloads and their power dissipation will help drive the power optimization efforts to achieve best-in-class power/performance."}, "200238635": {"jobID": "200238635", "origin_search": null, "posted": "Jul 23, 2021", "jobTitle": "DRAM Failure Analysis Product Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200238635/dram-failure-analysis-product-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "PhD or MS or BS Degree in technical subject area."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Requires 3+ years in DRAM development.Excellent communication and collaboration abilities.Knowledge in DRAM cell architectures and memory organization and periphery design for low DRAM power.Experience with memory interface verification with understanding DDR-PHY and Memory Controller.Familiarity in memory test patterns.Knowledge with state of the art packaging technology (pop, Tsv, etc.) and their relationship to DRAM signal/power integrity.Previous experience in Failure Analysis of DRAM devices.Excellent hardware and software debug skill.Experience working with the major DRAM memory vendors.Strong background in computer architecture Programming experience in C/C++.PhD or MS or BS Degree in technical subject area.", "jobDescription": "Does an exciting, dynamic, fast paced and team-oriented environment catch your attention? Do you love crafting sophisticated solutions to highly complex challenges? If so, consider joining us! We are seeking a DRAM Failure Analysis Product Engineer to work on Apple's next groundbreaking SoC's.\n\nAs part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and deftly handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together we will enable our customers to do all the things they love with their devices!\n\nIn this position, you will be ensuring the successful integration of DRAM memories with SoC devices for Apple products."}, "200451422": {"jobID": "200451422", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451422/rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid understanding of mixed signal concepts, RTL design, Verilog and SystemVerilogDeep knowledge of front-end tools (Verilog simulators, linters, clock-domain crossing checkers)Validated knowledge of synthesis, static timing, DFT, is a plusValidated knowledge of SystemVerilog assertions, checkers, and other design verification techniques are a plusKnowledge of scripting languages. Perl and Python are plussesStrong communication and presentation skillsBS degree in technical discipline with minimum 3 years of proven experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and outstandingly hardworking RTL Design Engineer. \n\nAre early in your journey towards a chip design career and wish to challenge yourself in a technical and multi-disciplinary effort, we have an exciting position for you in the world class Apple mixed-signal silicon design team. This position will encourage building of a solid foundation in logic circuits and gentle entry into understanding analog circuits. You will gain transparency into a variety of flows fundamental to modern silicon engineering: insight into full custom schematics for analog as well as high-speed digital circuits, translating functionality of such circuits into an efficient software behavioral representation, simulation of such code and ensuring formal equivalence between custom designs and their abstract representation. You will gain experience and knowledge into software methods and analysis that is increasingly important for a variety of disciplines.\n\nAs a member of our wide-ranging group, you will have the outstanding and phenomenal opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Your role is will equip you with learning to specify, design, and help in the verification and lab bring-up of sophisticated mixed-signal circuits (digital side)."}, "200451995": {"jobID": "200451995", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal IP Post Silicon Validation – DDR Memory", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451995/analog-mixed-signal-ip-post-silicon-validation-ddr-memory?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in DDR Memory test development, debug, and characterizationFamiliar with JEDEC Specifications at Electrical & Protocol levelsStrong fundamental understanding of DDR PHY circuitry in DLLs, I/O, and CalibrationFamiliar with signal integrity concepts in probing memory bus signalsProficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, Logic Analyzer, etc., with good understanding of their working principlesExperienced in scripting language, Python preferred, to automate test and analyze dataDiligent & Emphasis on quality of resultsInitiative in taking ownership & responsibility to drive deliverablesStrong verbal and written communication skillsHands-on lab experience including soldering/instrumenting systems is a plusBachelors Degree\n3 years of experience", "jobDescription": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200451991": {"jobID": "200451991", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal IP Post Silicon Validation – DDR Memory", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451991/analog-mixed-signal-ip-post-silicon-validation-ddr-memory?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in DDR Memory test development, debug, and characterizationFamiliar with JEDEC Specifications at Electrical & Protocol levelsStrong fundamental understanding of DDR PHY circuitry in DLLs, I/O, and CalibrationFamiliar with signal integrity concepts in probing memory bus signalsProficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, Logic Analyzer, etc., with good understanding of their working principlesExperienced in scripting language, Python preferred, to automate test and analyze dataDiligent & Emphasis on quality of resultsInitiative in taking ownership & responsibility to drive deliverablesStrong verbal and written communication skillsHands-on lab experience including soldering/instrumenting systems is a plusBachelors Degree\n10 years of experience", "jobDescription": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200451013": {"jobID": "200451013", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "ASIC/FPGA Prototyping Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451013/asic-fpga-prototyping-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS+ 3 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Typically requires proven experience with bring up, debugging and verification on FPGAExperience in FPGA development for wireless applications strongly preferredProven understanding of wireless standards, such as IEEE 802.11, Bluetooth is a plusExperience with FPGA platforms: Dini, HAPS - including compilation, debug, performance and throughput tuningExperience writing 'make' based build systemExperience with C++ and python highly desirableMaintain common design platform for ASIC as well as FPGA, with considerations for memories, I/O Pads, gated clocks and complex generated clocks.Design and verification using Verilog/System VerilogPerform FPGA Synthesis, Place & Route, timing optimizationsPerform bring-up, debug, and validation of designs to achieve functional and performance goalsCreate and execute plans to bring-up, debug, and validate designsThoroughly document and support each of above stepsCollaborate with cross-functional teams in order to define prototype hardware to evaluate new technologies and featuresBS+ 3 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborating with people across different functional areas, and thriving during crisis times, we encourage you to apply."}, "200451022": {"jobID": "200451022", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "ASIC/FPGA Prototyping Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451022/asic-fpga-prototyping-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS+ 3 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Typically requires proven experience with bring up, debugging and verification on FPGAExperience in FPGA development for wireless applications strongly preferredProven understanding of wireless standards, such as IEEE 802.11, Bluetooth is a plusExperience with FPGA platforms: Dini, HAPS - including compilation, debug, performance and throughput tuningExperience writing 'make' based build systemExperience with C++ and python highly desirableMaintain common design platform for ASIC as well as FPGA, with considerations for memories, I/O Pads, gated clocks and complex generated clocks.Design and verification using Verilog/System VerilogPerform FPGA Synthesis, Place & Route, timing optimizationsPerform bring-up, debug, and validation of designs to achieve functional and performance goalsCreate and execute plans to bring-up, debug, and validate designsThoroughly document and support each of above stepsCollaborate with cross-functional teams in order to define prototype hardware to evaluate new technologies and featuresBS+ 3 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborating with people across different functional areas, and thriving during crisis times, we encourage you to apply."}, "200448372": {"jobID": "200448372", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "GPU Design Engineer – Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448372/gpu-design-engineer-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 minimum years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum of 3 years of proven experience and knowledge of CPU or GPU architecture as well as the below:Strong background in cache, on-chip interconnect network, data compression or shader processorExperience in debugging performance issues.Proficiency in high performance, low power designs.Proficiency in Verilog/System Verilog, HDLExperience with scripting languages such as Perl, Python and Ruby is a plus.Ability to work well in a team with strong communication skillsBS + 3 minimum years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Do you love working on challenges that no one has solved yet? Join us to help deliver the next groundbreaking product containing an Apple designed GPU. As part of the GPU Memory Hierarchy Design team, you’ll be responsible for crafting and building a GPU that enriches the lives of millions of people every day."}, "200464705": {"jobID": "200464705", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464705/engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Our Engineering Program Managers have advanced degrees in Materials Science and Engineering, Mechanical Engineering, Chemistry, Polymers Science, or an equivalent field, but if you’ve followed a different path to expertise in Materials and program management, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Degree in materials science/materials engineering or an equivalent field with a strong foundation knowledge on different types of materials (metals, polymers, composites).Experience with program management, database, and related tools.Familiarity or Basic understanding of materials testing methods and equipment preferred including but not limited to microscopy, surface characterization, mechanical and electrical testing.Experience with cross-functional collaboration, vendor management. Experience with Materials Information Organization and software tools.Excellent presentation and oral communication skillsAttention to detail and a strong passion for qualityA proven dedication to continuous self-improvement.Ability to work in a fast-paced environment.Our Engineering Program Managers have advanced degrees in Materials Science and Engineering, Mechanical Engineering, Chemistry, Polymers Science, or an equivalent field, but if you’ve followed a different path to expertise in Materials and program management, we still want to hear from you.", "jobDescription": "At Apple, our Products, Services, and Customer Experiences demand extraordinary innovation. Technology and environmental breakthroughs are crucial in the materials and processes we bring into production to lead the world in terms of Carbon and Material performance. Can you imagine your talent supporting Apple’s next leap ahead? \n\nWe are expanding our new team of Materials Specialists in the Advanced Technology Group with a key focus on bringing deep materials knowledge and characterization of printed circuit boards (PCBs) and flex printed circuits (FPCs) into the core product design process. We need your help to manage the electronic materials information programs across all products at Apple!\nAre you passionate about materials and being part of an extraordinary engineering team? Do you want to be part of a multi-functional initiative with outstanding suppliers and institutes delivering first of a kind material development? Do you want to work hand-in-hand with phenomenal people across Product Design, Electrical Engineering, Reliability Engineering, Design for Manufacturing in Apple’s key Product teams? If yes, we want you to join our diverse and impactful team. \n\nCome Join us!"}, "200449900": {"jobID": "200449900", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AIML - Sr. Software Engineer (Neural Acceleration)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449900/aiml-sr-software-engineer-neural-acceleration?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Bachelor's, Master's, or PhD in Computer Science or a related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proficient in Python, working knowledge of C++Bachelor's, Master's, or PhD in Computer Science or a related fieldPreferred Qualifications* Strong communicator with ability to analyze complex and ambiguous problems* Disciplined programming skillset with a strong attention to detail* Experience with backend compilation, HW/SW co-design, and/or performance optimization* Deep understanding of computer systems and the interactions between HW and SW* Familiarity with at least one deep learning framework (e.g., PyTorch, Keras, TensorFlow)* Familiarity with ML model compression techniques (e.g., quantization, pruning) and their mapping to microarchitecture* Debugging model conversion from a high-level framework to a target device for correctness and performance issues", "jobDescription": "The Machine Intelligence, Neural Design (MIND) team employs HW/SW co-design to achieve best-in-class performance and energy efficiency for numerous use cases that deploy neural networks. We seek a Sr. Software Engineer to help define and implement features that would be realized in next-gen neural accelerators. Our team is comprised of Efficient ML experts with skillsets in HW, SW, and ML. Our charter is to push the frontiers of perf and power for DNNs with minimal memory footprint.\n\nAs a SWE, you will be responsible for writing high-quality, well-tested code. Our ideal team member is courageous when it comes to trying new things, is adept at reasoning about systems performance, and is willing to iterate on ideas. We value team members with strong communication skills with experience working cross-functionally with HW, SW, and ML teams."}, "200446641": {"jobID": "200446641", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Senior AR/VR Graphics Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446641/senior-ar-vr-graphics-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "You have 5+ years delivering commercial quality, broadly released consumer or enterprise softwareExcellent programming skills and deep knowledge of C++, and Objective C or SwiftExtensive experience with at least one of the graphics APIs (Metal, OpenGL, Direct3D, Console, etc.)Experience with Shader Languages (HLSL/GLSL, Metal Shaders) and writing performant, power-efficient shaders3D math skills (linear algebra, vector calculus)Deep Understanding of entire graphics pipeline, from CPU instructions to emitted photonsAbility to collaborate with a content creation team to develop efficient, scalable 3D assets and effectsProficiency with new and existing rendering techniques to create efficient and stunning industry defining visualsBS / MS / PhD in Computer Science or equivalent experienceExtensive experience with application performance profiling, optimization and automated testingShipped performant AR or VR applicationsCommunicates and collaborates well across team boundariesEffectively mentors junior developers and spreads knowledge", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer who wants to meaningly impact the lives of our users through first party applications. Apple’s Technology Development Group (TDG) is building AR applications using some of Apple's most advanced technologies including the augmented reality (AR) and virtual reality (VR) support offered in ARKit and Metal. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day!"}, "200333597": {"jobID": "200333597", "origin_search": null, "posted": "Jun 22, 2022", "jobTitle": "Business Analyst / Tableau / Data Insights/ML", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200333597/business-analyst-tableau-data-insights-ml?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5 + years of Business Analytics or Data Science leadership experience.Familiarity with database modeling and data warehousing principles.Proficient in SQL, Tableau features, Data Optimization, a keen eye for design.Able to communicate insights clearly and successfully to influence decisions.Programming skills in Python are preferred.Digital Advertising experience is a plus.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple dedicated to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "jobDescription": "At Apple, we work every day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people worldwide to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in Apple News and Search Ads in the App Store. We own platforms that are highly performant, we deploying them at scale, and we are always working to set new standards for enabling effective advertising while protecting user privacy. \n\nThe Ad Platforms Data Insights team is seeking a talented Business Analyst who will innovate while developing the next generation of analytical solutions working multi-functionally with Sales, Marketing, Finance, Product, and Engineering. Analytics is a team sport, and in your role, you will be a key part of data-centric team that delivers insights that have direct and measurable impact. What makes this role exciting is the business complexity, scale, and high standards for Information Architecture, performance optimization, and chance to create dashboards."}, "200450905": {"jobID": "200450905", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded Real Time Critical Control Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450905/embedded-real-time-critical-control-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceExperience with design and implementation of bare metal control firmware which is highly optimized for cycles and memoryDeep understanding of the difference between design for a software platform and a highly constrained firmware environmentUnderstanding of the use of data structures for deterministic and efficient reads and writesUnderstanding of design for asymmetric multiprocessing solutionsFundamental facility with C and C++, compilers, build and source code control toolsProven understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceUnderstanding of 5G and 4G 3GPP protocols a plusSome familiarity with wireless communications a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you’ll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We’ll work across teams to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As an Embedded Firmware Engineer passionate about real time critical control on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded firm development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200450901": {"jobID": "200450901", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded Real Time Critical Control Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450901/embedded-real-time-critical-control-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience with design and implementation of bare metal control firmware which is highly optimized for cycles and memoryDeep understanding of the difference between design for a software platform and a highly constrained firmware environmentUnderstanding of the use of data structures for deterministic and efficient reads and writesUnderstanding of design for asymmetric multiprocessing solutionsFundamental facility with C and C++, compilers, build and source code control toolsSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceUnderstanding of 5G and 4G 3GPP protocols a plusSome familiarity with wireless communications a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As an Embedded Firmware Engineer passionate about real time critical control on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded firm development, that thrives in a wide-ranging multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200321756": {"jobID": "200321756", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Haptics PD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200321756/haptics-pd-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "• M.S. or PhD in Mechanical Engineering, Solid Mechanics or Physics \n• Minimum of 3 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience with 3D CADExperience in 2D drafting, GD&T, and tolerance analysisStrong engineering fundamentals (solid mechanics, kinematics, dynamics)Master of problem-solving including the use of the scientific method, root cause analysis, and DOE creationApplied knowledge of electrical circuits, material science, and basic chemistryExcellent written and verbal communication and leadership skillsTeam Oriented: be able to thrive in a collaborative multi-functional environments• M.S. or PhD in Mechanical Engineering, Solid Mechanics or Physics \n• Minimum of 3 years of relevant industry experience.", "jobDescription": "The Haptic Engineering team develops state of the art haptic solutions that are central to Apple’s products, including the iPhone and Apple Watch. Our key goal is to enable the world’s best user-experience and explore the possibilities using haptics. We are a highly multi-functional team working in a hands-on environment that values creativity, engineering excellence, and passion for innovation. New challenges arise every single day that require the sharp analytical skills of talented and forward-thinking individuals.\n\nWe are seeking a Product Design / Mechanical Design Engineer to lead the design, development, and validation of next-generation haptic actuators and experiences."}, "200419144": {"jobID": "200419144", "origin_search": null, "posted": "Oct 24, 2022", "jobTitle": "OS Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200419144/os-performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Degree in Computer Science or Engineering or equivalent experience/skills."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Experience in Systems Engineering, primarily across the Software stack, or other experience pointing to success as a generalistStrong understanding of hardware/software interactions, Operating Systems, Device Drivers, Kernel/Firmware AbstractionsExcellent Command of C, C++ or AssemblyExperience developing and using Performance tracing, profiling, logging tools will be a plusExcellent communication skills, both oral and written.Excellent teamwork and organizational skills.Experience with objective-C, Swift and iOS/macOS Frameworks/APIs will be a plus.Degree in Computer Science or Engineering or equivalent experience/skills.", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications and new hardware. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. The Performance team is looking to take our OS Performance to the next level. This is a terrific position for an engineer passionate in solving challenging performance problems and working on cutting edge technologies/new products."}, "200442026": {"jobID": "200442026", "origin_search": null, "posted": "Nov 17, 2022", "jobTitle": "Software Developer in Test, Backup and Migration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442026/software-developer-in-test-backup-and-migration?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S./M.S. in Computer Science or related field, or equivalent work experience/skills."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong hands on experience with QA methodologies, or prior QA experience.Strong Computer Science fundamentals.Experience with Python, Swift or equivalent system scripting languages.Strong analytical and problem solving skills with a meticulous attention to detail.Self learner, excellent interpersonal skills and ability to deliver work on tight deadline.Experience setting up Continuous Integration systems that support multiple projects.Experience reporting and tracking bugs, solving complex problems & triaging issues (both hardware and software).B.S./M.S. in Computer Science or related field, or equivalent work experience/skills.", "jobDescription": "Apple’s Core OS group ensures the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience! \n\nJoin the Storage System Quality Engineering team responsible for ensuring highest quality for storage technology at the heart of Apple products known to surprise and delight millions of customers by working on exciting new products. \n\nThe nature of the position requires the candidate to have excellent communication skills, strong technical and debugging skills, along with a drive to make a difference. You will be working in a fast paced environment, interacting directly with software development team and other QA teams cross functionally."}, "200452647": {"jobID": "200452647", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "PHY Systems Engineer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452647/phy-systems-engineer-simulation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Deep knowledge of communication system theory and PHY signal processingValidated track-record in SW and link/system level simulator design in C/C++, including experience with simulator frameworks and configuration management.In-depth knowledge of wireless communication systems with hands-on experience in 4G/5G PHY design, pre-silicon verification and critical metric testing.Experience with Matlab, C/C++ and/or Python including significant knowledge of algorithms and data structures, memory and runtime profiling as well as code optimization techniques.Solid knowledge of current cellular communication standards: 5G (NR) and 4G (LTE).Work experience related to RAN1/RAN4 submissions is a good plusStrong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, debugging and fixing of defects, …).BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200452026": {"jobID": "200452026", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "PHY Systems Engineer - Simulation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452026/phy-systems-engineer-simulation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Deep knowledge of communication system theory and PHY signal processingValidated track-record in SW and link/system level simulator design in C/C++, including experience with simulator frameworks and configuration management.In-depth knowledge of wireless communication systems with hands-on experience in 4G/5G PHY design, pre-silicon verification and critical metric testing.Experience with Matlab, C/C++ and/or Python including significant knowledge of algorithms and data structures, memory and runtime profiling as well as code optimization techniques.Solid knowledge of current cellular communication standards: 5G (NR) and 4G (LTE).Work experience related to RAN1/RAN4 submissions is a good plusStrong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, debugging and fixing of defects, …).BS and 3+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Wireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. We are looking for an expert PHY Systems Engineer who has a deep understanding of wireless technology. In this role you will be at the center of a silicon design group responsible for physical layer system and algorithm design for pioneering wireless SoC products, with a focus in wireless system design, modeling, and simulations."}, "200428498": {"jobID": "200428498", "origin_search": null, "posted": "Sep 27, 2022", "jobTitle": "Kernel Panic Triage Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200428498/kernel-panic-triage-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "GDB and other debug toolsExcellent knowledge of python. Prior experience in developing large automation tools using python is preferred.Previous experience of Kernel and/or firmware engineeringHighly professional, with ability to multitask and deliver solid work on tight schedulesKnowledge of debugging UNIX kernelsDeep and current understanding of the C programming languageGood understanding of operating system fundamentals like threading, synchronization primitives, inter-process communication, and process lifecycleBS in Computer Science or equivalent experience/skills", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Embedded Kernel & Triage team is looking for an experienced triage and development engineer to support the larger engineering organization. The position will include debugging critical software and hardware issues across the entire software stack. You will have the opportunity to have a major impact on the quality of software for Apple's consumer operating systems products."}, "200455699": {"jobID": "200455699", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Touch ID Product Design - Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455699/touch-id-product-design-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSME required; MSME, PhD preferred (or equivalent)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "At least 2+ years of hands-on experience designing for a production environment. High volume, consumer electronics or sensing experience is a plus.3D CAD experience is required.Excellent written and verbal communication skills.Able to craft clear engineering documentation.Able to effectively collaborate with diverse team members and external vendors to achieve project goals.BSME required; MSME, PhD preferred (or equivalent).", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Sensing Product Design team is looking for a talented mechanical engineer to develop great experiences and bring Apple products to life. We are the team developing many of the sensors that changed the way people interact with their technology. Touch redefined the phone and tablet, Touch ID seamlessly secured them, and the heart rate monitor let you keep tabs on yourself."}, "200467059": {"jobID": "200467059", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Touch and Sensing Product Design - Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467059/touch-and-sensing-product-design-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSME required; MSME, PhD preferred (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 2+ years of hands-on experience designing for a production environment. High volume, consumer electronics or sensing experience is a plus.3D CAD experience is requiredExcellent written and verbal communication skillsAble to craft clear engineering documentationAble to effectively collaborate with diverse team members and external vendors to achieve project goalsBSME required; MSME, PhD preferred (or equivalent)", "jobDescription": "We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? \n\nThe Sensing Product Design team is looking for a talented mechanical engineer to develop great experiences and bring Apple products to life. We are the team developing many of the sensors that changed the way people interact with their technology."}, "200459962": {"jobID": "200459962", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Softgoods Materials Researcher", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459962/softgoods-materials-researcher?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Library Science, Textile Science & Engineering, Material Science, Textile Design, Fine Arts or related field\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. Apple participates in the E-Verify program in certain locations as required by law. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong background in softgoods materials (textiles, coated fabrics, nonwovens, composites); familiar with various textile constructions and major industry players.Skilled in visually inspecting materials and identifying key attributes.Exceptional organizational skills, with experience maintaining, growing and purging an inventory preferred.Demonstrated adaptability and flexibility in a fast-paced culture; strong customer-centric mindset.Creative, resourceful personality preferred to lead educational and outreach efforts across multiple mediums (oral presentations, visual displays, written white papers, material showcases).Familiarity with technical terms and testing methods for assessing softgoods material performance preferred.BS in Library Science, Textile Science & Engineering, Material Science, Textile Design, Fine Arts or related field\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. Apple participates in the E-Verify program in certain locations as required by law. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "jobDescription": "Why Softgoods? \n\nOur mission in Softgoods Engineering team is to use incredible soft polymers and textiles to enable new product categories, and to enhance Apple’s existing product lines. Bringing Apple engineering and precision to products made of soft materials is an exciting challenge and requires a creative and open-minded approach. We value people with a desire to learn new skills and a mentality that challenging questions are opportunities for insight. To that end, we are committed to professional development across all aspects of materials and communication, with mentorship and training opportunities both within and outside Apple.\n\nWhat is the role? \nWe have an opportunity for a Materials Researcher to lead the management and growth of our materials collection and inspire the future of Apple Softgoods products. You should be an exceptionally organized, detail-oriented and creative individual and passionate about textiles, nonwovens, coatings, composites, and other soft materials. You should be comfortable operating at the intersection between art and engineering, communicating often with both technical and non-technical audiences. You should be eager to research new materials and suppliers, grow your industry network, and educate your colleagues about the unique materials you bring into the collection."}, "200459346": {"jobID": "200459346", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "CoreOS Kernel Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459346/coreos-kernel-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent knowledge and experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid understanding of Operating SystemsBasic understanding of CPU scheduling, power & performance managementBasic computer architecture and SoC DesignBS/MS in Computer Science or equivalent knowledge and experience-  iOS or macOS exposure-  UNIX-  Virtual memory & IPC-  lldb and DTrace-  UNIX scripting and shells", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Darwin Scheduler team within Apple's CoreOS organization is responsible for delivery of a high-quality and performant kernel into just about every one of Apple’s products. Our software runs on your wrist as part of watchOS; in your pocket with iOS; on your desk in macOS; in your living room with tvOS; on the devices owned by your friends and family; and hundreds of millions of devices beyond those. \n\nThe team focuses on key kernel technology areas such as CPU scheduling, power management and threading models which are key to delivering great performance and battery life across all Apple devices. This position requires a solid understanding of operating systems fundamentals, including kernel design and implementation. We deal in all of the traditional kernel subsystems, e.g. virtual memory, scheduling, IPC, etc, and also serve as expert system sleuths up and down the entire Apple stack. Our company is one of the last vertically integrated systems shops remaining, and as such our engineers have the unique opportunity to roam the system freely, from iOS silicon design all the way up to Apps and the cloud."}, "200464206": {"jobID": "200464206", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464206/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum Requirement:\n\nBSEE OR EQUIVALENT EDUCATION \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Knowledge of EM or RF hardware or antenna designKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into products.Knowledge of RF schematic and PCB layout practices and guidelinesKnowledge of electromagnetic simulation toolsHands-on experience with RF lab instrumentationAbility to debug Desense issues and characterize noise sourcesExperience with production environment and statistical analysisExcellent interpersonal skillsMinimum Requirement:\n\nBSEE OR EQUIVALENT EDUCATION \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits.", "jobDescription": "At Apple, you will have a once-in-a-lifetime opportunity to deliver outstanding performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for innovative products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products.\n\nWe’re looking for dedicated and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration, & wireless communications."}, "200443806": {"jobID": "200443806", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Layout Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443806/analog-layout-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in analog/mixed-signal layout design of deep sub micron CMOS circuits and recent experience on advance nodes including FinFet technologiesHigh level of proficiency in interpretation of CALIBRE DRC, ERC, LVS, reportsExperience with CADENCE or MENTOR GRAPHICS layout toolsProgramming knowledge in SKILL, Perl, and/or Python is a bonus• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Silicon Engineering is seeking creative Layout Leads to design the next generation of Apple’s world-leading systems-on-chip (SOCs). Apple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad. Our Analog/Mixed-Signal (AMS) circuits connect them to the physical world. Examples of our AMS IPs include SERDES for data communication, PLLs for clock generation, and sensors for measuring all sorts of physical quantities.\n\nAnalog Layout is a crucial component of the hardware design process. Analog Layout Engineers work alongside circuit designers to transform design ideas into silicon. Apple’s world-leading SOCs are crafted using robust tool-suites, the most advanced nodes, and modern layout methodologies.\n\nThis job may be right for you if:\n\nYou want to accelerate your career. Thrive in a fast-paced, multifaceted, and results oriented environment. Are passionate about working with the world’s most advanced technology. Enjoy collaborating with a very talented and experienced team. Have a good understanding of engineering fundamentals. Actively seek out opportunities to work with cross-functional teams (SOC, Tech, CAD). Drive critical floor-planning decisions. Lead a team of people to produce complex AMS blocks with high-quality layout. Are always looking for ways to introduce new ideas and workflows that improve efficiency across a global team of layout engineers. Want opportunities to challenge yourself and broaden your skillset. Want to work every single day to craft products that enrich people’s lives."}, "200438898": {"jobID": "200438898", "origin_search": null, "posted": "Nov 30, 2022", "jobTitle": "Embedded Systems Video Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438898/embedded-systems-video-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.S preferred, B.E/B.S/PhD in Computer Engineering, Computer Science or related majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Excellent software design, problem solving and debugging skillsSolid programming skills- C/C++ coding abilitiesExperience in embedded real time multitasking software systemMinimum of 1 year direct related experience in embedded software developmentGood written and oral interpersonal skillsKnowledge of image or video processing APIs is a plusM.S preferred, B.E/B.S/PhD in Computer Engineering, Computer Science or related majors", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped craft almost daily. At Apple, you will have the opportunity to work on products that are always leaders in the industry and occasionally, change the world! The Video Engineering group at Apple is responsible for creating the image/video core technologies used in almost all Apple products and services. In this role, you will develop embedded software for image and video compression/processing, implementing features for applications such as the iPhone/iPad Camera capture, Live Photo, AirPlay, FaceTime, Cinematic Mode, iMovie and many more on a vast variety of devices.  As an embedded software engineer, you will work on the video/image subsystem, including new video compression/processing feature development, performance and power optimization.  The applicant will be an extraordinary teammate and have a consistent track record of development for large volume product shipment."}, "200460730": {"jobID": "200460730", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: GPU IP Validation and Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460730/silicon-validation-software-engineer-gpu-ip-validation-and-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelor's degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experienced with Graphics, OpenGL, and CUDAExperienced with image processing, memory hierarchies, and compilersStrong C/C++ programming skillsExperience in Python and GNU MakeAn understanding of compute systems, operating systems, and computer architecture from educational studiesPassionate about writing code close to the hardware, and debuggingKnowledge and experience in SoC system level validation and debugging of SoC software and hardware issues.You enjoy the validation mentality: meticulous, curious, and persistentUnderstanding of the Display pipeline is a plusMinimum requirement of a bachelor's degree.", "jobDescription": "Join a team of software engineers with diverse backgrounds (graphics, video encoding, video processing, file systems, CPUs and caching, kernel programming, embedded systems) to help develop graphics validation software and integrate it into system level test environment."}, "200452906": {"jobID": "200452906", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452906/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong software skills in C/C++.Familiarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is a huge plusExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is ideal experience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 10 years relevant industry experience", "jobDescription": "Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200428025": {"jobID": "200428025", "origin_search": null, "posted": "Oct 13, 2022", "jobTitle": "iOS Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200428025/ios-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in CS or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "3+ years of related experienceYou’ve built projects using Swift/Objective-C, JavaScript, Design, and ThreadingYou’ve deep understanding of object oriented design, memory management, and performance optimization.You’ve had to deal with debugging performance problems, and you’re comfortable rooting out performance bottle-necks.You have experience writing multi-threaded, asynchronous code. If you haven’t used GCD, you can learn it here. If you have, we’d like to hear from you.You enjoy paying attention to details almost as much as the big technical wins. You've a consistent record of completing projects on-time and to specification.You’re used to communicating with a diverse team, with both experts and novices, in technical and non-technical roles.We appreciate any experience with popular JavaScript tools, frameworks and design principals, and a curiosity to stay up to date with the changing JavaScript ecosystem landscape.BS in CS or equivalent experienceApple is an equal opportunity employer that is committed to inclusion and diversity. Visit jobs.apple.com to learn more. If you do not consent to Apple storing your information in our system for Recruiting purposes, please reply to this email requesting deletion. For more information on Apple’s privacy policy please visit https://www.apple.com/legal/privacy/.", "jobDescription": "What happens when the world’s most innovative engineers collaborate with the world’s most creative storytellers? TV gets reinvented! The Apple TV app team created and manage the Apple TV app on iOS, macOS and tvOS platforms, which redefined and refined the way people watch their favorite shows, movies, and so much more — including everything they love from the major subscription services. Today, the team also manage one of the most exciting new realms at Apple: we bring viewers the critically acclaimed and award-winning Apple Originals in Apple TV+. The Apple TV App makes it possible for people around the world to easily access content from multiple video providers on their devices while helping those video providers promote and monetize their work. The group is responsible for delivering innovative features and managing the app on iOS, tvOS and macOS platforms. Apple TV app also integrates with platform features to enrich the experience outside the app, for example TV app Widget on iOS and iPad, Siri (queries like New Movies, Filter by Actor etc.), iOS Spotlight, tvOS Top Shelf, and many more."}, "200325071": {"jobID": "200325071", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Wireless Charging Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200325071/wireless-charging-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors in relevant EE field, Masters/PhD preferred At least four years of relevant technical work in industry"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "4+ years of hands-on experience and proven track record in system definition, integration, architecture, prototyping and validation.Solid EE fundamentals in both analog and digital design and comfortable with tackling new challenges with the critical thinking and problem solving skillsKnowledge and experience in Power electronics and direct wireless charging is a plus.Circuit level simulation experience in EE simulation platforms like Cadence/ADS/LTspice etc.Familiar with various communication protocols (USB, SPMI, SPI, I2C and UART) and low power embedded systems, e.g. ARM Core ProcessorsExperience working with cross functional FW partners. Direct coding experience and algorithm design experience is a plusProficient in modeling, data collection, data analysis, and statistical analysis tools (e.g. Python, JMPm Matlab).Experience in high volume products from concept to end, and working with contract manufacturersTeam player, great communication skills and ability to lead multiple-discipline team to make the design tradeoff based the information available in a timely mannerBachelors in relevant EE field, Masters/PhD preferred At least four years of relevant technical work in industryApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "We believe the future is powered by Wireless! The mission of the Wireless Power Technology team - Create the world’s best Wireless Charging user- experience by inventing state-of-the-art technologies. We develop effortless and safe Wireless Charging designs that are central to Apple’s products - the iPhone, Apple Watch, and AirPods! New challenges arise every day that require the sharp problem-solving skills of individuals. Are you in for the challenges? We are looking for a senior system integration engineer that leads the integration of the inductive technology into products in the partnership with multiple discipline teams including but not limited to architecture, FW, system EE, silicon, noise and vibration, safety, thermal, reliability, operations , regulatory teams and more."}, "200441698": {"jobID": "200441698", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Layout Lead Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441698/analog-layout-lead-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Melbourne", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in analog/mixed-signal layout design of deep submicron CMOS circuits and recent experience on advance nodes including FinFET technologiesHigh level of proficiency in interpretation of CALIBRE DRC, ERC, LVS, reportsExperience with CADENCE or MENTOR GRAPHICS layout toolsProgramming knowledge in SKILL, Perl, and/or Python is a bonus• B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Silicon Engineering is seeking creative Layout Leads to design the next generation of Apple’s world-leading systems-on-chip (SOCs). Apple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad. Our Analog/Mixed-Signal (AMS) circuits connect them to the physical world. Examples of our AMS IPs include SERDES for data communication, PLLs for clock generation, and sensors for measuring all sorts of physical quantities.\n\nAnalog Layout is a crucial component of the hardware design process. Analog Layout Engineers work alongside circuit designers to transform design ideas into silicon! Apple’s world-leading SOCs are crafted using robust tool-suites, the most advanced nodes, and modern layout methodologies.\n\nThis job may be right for you if:\n\nYou want to accelerate your career. Thrive in a fast-paced, multifaceted, and results oriented environment. Are passionate about working with the world’s most advanced technology. Enjoy collaborating with a very talented and experienced team. Have a good understanding of engineering fundamentals. Actively seek out opportunities to work with cross-functional teams (SOC, Tech, CAD). Drive critical floor-planning decisions. Lead a team of people to produce complex AMS blocks with high-quality layout. Are always looking for ways to introduce new ideas and workflows that improve efficiency across a global team of layout engineers. Want opportunities to challenge yourself and broaden your skillset. Want to work every single day to craft products that enrich people’s lives."}, "200452035": {"jobID": "200452035", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Software Engineer: Linux Driver developer (Thunderbolt/USB/PCIe/Displays)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452035/software-engineer-linux-driver-developer-thunderbolt-usb-pcie-displays?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experienced in embedded Linux kernel developmentExperienced in one or more of USB, PCIe, Thunderbolt, Display and Networking Linux frameworksStrong Computer architecture and Operating system fundamentalsStrong debugging skills in Kernel and user spaceYou are a skilled C programmer and good at scripting using bash/pythonFamiliarity with ARM architectureBS and a minimum of 10 years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. \n\nAre you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly."}, "200453776": {"jobID": "200453776", "origin_search": null, "posted": "Jan 7, 2023", "jobTitle": "GPU Silicon Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453776/gpu-silicon-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 0 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Understanding of system and SoC architectures.Understanding of device physics and transistor behavior.Able to read schematics.Experience in C/C++ and one or more of the following scripting languages: python, TCL/expect, Perl.Strong written and verbal communication skills.Lab skills (interested and able to work in the lab).Ability to work well on a team, take responsibility, and motivate self and others.Experience debugging hardware and software issues in an embedded system a strong plus.Experience with performance monitor features a strong plus.Experience with power measurements a strong plus.We are looking for candidates with a minimum of BS + 0 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\nThe GPU Silicon Validation Team is responsible for validating the functional operation, electrical behavior, power, and performance of Apple's embedded GPUs. Team members are involved in test planning, test execution, data analysis, failure triage, and tool development. We work together with the design, verification, productization, hardware and software teams to enable world-class GPUs in the embedded space. In this role, you will be responsible for a variety of silicon validation tasks such as functional testing, silicon characterization, analyzing and reporting results, power, and performance validation, and triaging complex hardware and software issues."}, "200392557": {"jobID": "200392557", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Component Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200392557/component-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE required. MSEE preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "A minimum of 5 years of Industry Experience is required, with ~ 3 years of Experience in Component Engineering or similar fieldCapable of coordinating multi-functionally with groups such as Industrial Design, GSM (Global Supply Chain Managers) and JDMs (Joint Development Manufacturers) to resolve issues pertaining to component selection and use.Good understanding/Working knowledge of Engineering documentation (i.e schematics, component data sheets, Gerber files, etc) and standard document control practices (Engineering Change Requests, Engineering Change Orders, deviations, etc)Seeking someone with excellent interpersonal skills, both written and oralBSEE required. MSEE preferred.", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Do you want to impact billions of users by developing an extraordinary product with a prime focus on accuracy, understandability, and performance of the product? Dynamic, Inspiring people and Innovative technologies are the norm here. \n\nThe Components Engineering Team at Apple is responsible for identifying, documenting, and releasing efficient components from a variety of commodities for some of our products. The team is a multi-functional extension of System Integration Electrical Engineering team focusing on ensuring that the right specific components are selected for every electrical component in the Product's Design. \n\nWe are seeking a Component Engineer to join our team to drive the component selection process and perform their work in a consultative manner as the Subject Matter Expert.\n\nCome Join Us!"}, "200461785": {"jobID": "200461785", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Keyboard UI Sr QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461785/keyboard-ui-sr-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree in computer science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$124,100", "max": "$206,900,"}, "benefits": null, "requirements": "6+ years of Experience with white or black-box testingProven bug detection and regression skillsSelf-motivated, critical thinking, and demonstrated creativityFundamental understanding of Apple’s platforms - macOS and iOSStrong written and verbal communication skillsAbility to multi-task well and change focus quicklyProficient in Python, Javascript or similar scripting languageBachelors degree in computer science or equivalent", "jobDescription": "With billions of messages typed everyday, the keyboard is among the most frequently used software applications on the planet. The Keyboard team is responsible for the text input experience across iPhone, iPad, Mac, Watch, and Apple TV. We are constantly exploring new innovations to make the text input experience better and also reach all our customers around the world who use many different languages. We are looking for critical thinkers with a sharp eye for detail who would like to play a key role in qualifying these features and helping ensure Apple software is of the highest quality!"}, "200447424": {"jobID": "200447424", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Analog Layout Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447424/analog-layout-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in analog/mixed-signal layout design of deep sub micron CMOS circuits and recent experience on advance nodes including FinFet technologiesHigh level of proficiency in interpretation of CALIBRE DRC, ERC, LVS, reportsExperience with CADENCE or MENTOR GRAPHICS layout toolsProgramming knowledge in SKILL, Perl, and/or Python is a bonusB.S. EE and 10+ years of relevant industry experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Apple Silicon Engineering is seeking creative Layout Leads to design the next generation of Apple’s world-leading systems-on-chip (SOCs). Apple’s multi-billion-transistor Ax SOCs are the brain of every iPhone and iPad. Our Analog/Mixed-Signal (AMS) circuits connect them to the physical world! Examples of our AMS IPs include SERDES for data communication, PLLs for clock generation, and sensors for measuring all sorts of physical quantities.  \n\nAnalog Layout is a crucial component of the hardware design process. Analog Layout Engineers work alongside circuit designers to transform design ideas into silicon. Apple’s world-leading SOCs are crafted using robust tool-suites, the most advanced nodes, and modern layout methodologies.  \n\nThis job may be right for you if:  \n\nYou want to accelerate your career. Thrive in a fast-paced, multifaceted, and results oriented environment. Are passionate about working with the world’s most advanced technology. Enjoy collaborating with a very talented and experienced team. Have a good understanding of engineering fundamentals. Actively seek out opportunities to work with cross-functional teams (SOC, Tech, CAD). Drive critical floor-planning decisions. Lead a team of people to produce complex AMS blocks with high-quality layout. Are always looking for ways to introduce new ideas and workflows that improve efficiency across a global team of layout engineers. Want opportunities to challenge yourself and broaden your skillset. Want to work every single day to craft products that enrich people’s lives."}, "200457659": {"jobID": "200457659", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "iPad Senior System Engineering Program Manager - Early Engagement", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457659/ipad-senior-system-engineering-program-manager-early-engagement?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Engineering required, Mechanical or Electrical Engineering preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience in Program Management or Hardware Engineering and leading multiple teams in new product developmentDirectly led at least 3 product development cycles for systems with hardware and software integrationLeadership skills and ability to inspire team membersExcellent communication and organizational skillsSelf-starter and proactive with demonstrated critical thinking capabilitiesUnderstands and deals well with rapid development cycles and constant change; remains flexible and calm in the face of uncertaintyBS degree in Engineering required, Mechanical or Electrical Engineering preferred.", "jobDescription": "The Early Engagement System Engineering Project Manager focuses on product definition convergence and program planning leading up to Concept Review. We are looking for a Senior System EPM to lead multiple iPad programs in this early stage of the ANPP process, working with key cross-functional partners to define and execute the best product for our customers. This is a great opportunity for cross functional leadership and visibility."}, "200434469": {"jobID": "200434469", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "TDG SW EPM - AR/VR Audio", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434469/tdg-sw-epm-ar-vr-audio?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS Engineering or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Familiarity with audio software.5+ years of experience managing complex, cross-functional software projectsSolid knowledge of software development processesAbility to dive into technical detailsExceptional verbal/written communication skills, ability to distill information for the right audienceSelf-motivated, collaborative, curious, pro-active with demonstrated critical thinking capabilityGreat attention to detailBS/MS Engineering or equivalent work experience", "jobDescription": "The Technology Development Group is a growing, high energy, results-oriented team. We are looking for an experienced technical software engineering program manager (EPM) with a passion to succeed. As a member of our organization you will partner with engineering teams in implementing audio software for AR/VR experience. You will be part of crafting future products that will delight, inspire and empower millions of people.  \n\nWe are looking for a self-motivated teammate with a track record of shipping complex new technologies and experiences in system software; someone who thrives in a dynamic, constantly changing environment. You will lead teams through the software development cycle from concept to delivery, collaborating with several teams at Apple, driving the definition, schedule, execution and communication of new features. If you are up to the challenge of leading an amazing team in building ground breaking technologies through a fast paced development cycle with frequent changes, we want to hear from you!"}, "200448788": {"jobID": "200448788", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Electronics Lab Technician", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448788/electronics-lab-technician?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Technical AS/BS preferred, or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$28.60", "max": "$62.20/hr,"}, "benefits": null, "requirements": "4+ years of related experience in small engineering labs.Basic understanding of analog/digital circuits.Ability to conduct electrical rework and mechanical assembly based upon limited instruction.Able to test/validate/debug completed reworks/assemblies using oscilloscopes, logic analyzers, impedance analyzers, and similarAbility to rework, repair and modify SMT PCB’s down to 0201/01005 package size.Excellent debugging, optimization and problem solving skills.Comfortable with working on OSX based Apple computers.Passion, diligence, integrity, and exceptional aptitude.Team player with excellent conversational, written communication, and negotiation skills.Willingness and ability to learn new skillsTechnical AS/BS preferred, or equivalent work experience", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it!\n\nWe are seeking an enthusiastic Electronics Lab Technician to join our team and work on revolutionary products. The position entails working with the system engineering team as well as other cross-functional groups."}, "200463317": {"jobID": "200463317", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463317/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE or MSEE / Higher, or equivalent education \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Knowledge of EM or RF hardware or antenna designKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into products.Knowledge of RF schematic and PCB layout practices and guidelinesKnowledge of electromagnetic simulation toolsHands-on experience with RF lab instrumentationAbility to debug Desense issues and characterize noise sourcesExperience with production environment and statistical analysisExcellent interpersonal skillsBSEE or MSEE / Higher, or equivalent education \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits.", "jobDescription": "At Apple, you will have a once-in-a-lifetime opportunity to deliver outstanding performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for innovative products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products.   \n\nWe’re looking for dedicated and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration, & wireless communications."}, "200449022": {"jobID": "200449022", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Graphics Verification Engineer - Shader Core", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449022/graphics-verification-engineer-shader-core?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We would like you to have 10 years of relevant experience including:Experience leading verification teams for sophisticated hardware at system or unit levelExperience architecting hierarchical test benches and defining high-level verification strategiesExperience guiding the development of test-bench components with high levels of vertical reuseAbility to critically analyze verification plans and share constructive feedback to ensure plans are robustAbility to manage and drive multiple lanes of team execution to meet strict schedule deadlinesDeep and comprehensive understanding of computer architecture and memory sub-systemsExpertise in software development fundamentals and object-oriented design principlesExpertise in verification tools such as SystemVerilog/UVM, HDL simulators and waveform viewersExcellent executive communication skills and ability to foster strong collaboration among teamsGraphics architecture knowledge is strongly desired but not requiredBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices. \n\nThe Graphics Verification Team is looking for talented engineers to help build complex, large-scale GPU products. In this role you will partner with our graphics architecture, µ-architecture, design, software and hardware performance teams to help define and deliver cutting-edge features for our Unified Shader Core (USC)."}, "200450896": {"jobID": "200450896", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded 5G/4G Cellular Physical Layer DSP Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450896/embedded-5g-4g-cellular-physical-layer-dsp-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience implementing digital signal processing algorithms using special purpose digital signal processing HWUnderstanding of 5G and 4G 3GPP protocolsDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with C and C++, compilers, build and source code control toolsSignificant experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programmingSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you'll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a Wireless Embedded Physical Layer DSP Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200448046": {"jobID": "200448046", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "SoC Security Architect, Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448046/soc-security-architect-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 20+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS and 20+ years of relevant industry experienceSolid background of applied cryptographyWorking experience in definition of secure systemsExperience in threat modeling and weaknesses analysisKnowledge of SoC architecture, microprocessor architecture a plusExposure to OS securityExcellent interpersonal skillsAbility to independently pursue new ideas and innovationsGood knowledge of Verilog/VHDLExperience in C/C++ and interpretive language such as Perl/PythonBS and 20+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. \n\nWe are looking for an experienced Security Architect with experience spanning both hardware and software. You will work with a multi-functional engineering team to define, design, and verify security systems. Join us to help deliver the next groundbreaking Apple product!"}, "200464569": {"jobID": "200464569", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Hardware Development Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464569/hardware-development-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSEE, MSEE, or PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BSEE with 10 years or more experience.Previous Engineering management experience.Experience in EE schematics entry and layout.You should have direct experience with consumer products system architecture and design.Candidate will need deep knowledge of analog and digital electrical circuits including silicons.Strong analytical/problem solving skills and ability to guide critical decisionsYou'll need good understanding of thermals, mechanical, and packaging challenges.Must possess knowledge of high volume manufacturing technologies and production variance.Hands-on experience in prototype bring-up and debugging, functional verification, and manufacturing support is required, as is experience creating and influencing system specification documents.Excellent documentation skills and attention to detail will be necessary in this role.Ideal candidate has working experience with computers or embedded devices using SoCs.BSEE, MSEE, or PhD preferred.Travel domestic and abroad, up to 20%, to support hands on work and factory builds", "jobDescription": "Are you ready to carry on the iconic legacy of the Mac? Come help us lead the Mac hardware team! We are a team of system electrical engineers that own Mac products from concept to ship. We sit at the center of Apple’s wider engineering team, working cross-functionally with mechanical engineering, software, silicon engineering and other module teams such as wireless, camera, sensing, display, and factory test. Our core EE responsibilities involve design of the main logic board and flex circuits in the product, along with power conditioning and distribution throughout the system. From a system perspective, we define the interfaces between tightly coupled subsystems and drive resolution of all critical issues that arise due to the coexistence of modules in the design.\n\nAs a Hardware System Design and Integration Manager, you'll lead a team of HW engineers to design next generation Mac products! You'll drive innovative system level partitioning from concept investigation, to architecture, and design, thru successful product level implementation. The position empowers you to champion technical roadmaps, where you'd be expected to analyze key systems engineering architectural and implementation trade-offs.\n\nThis role requires strong communication, persuasion, and negotiation skills. You will have the opportunity to lead other engineers for the best standards, methodologies, and practices in systems development and institutionalized processes. You will regularly interact with executives, cross-functional teams, and external partners. Critical interactions include with the program management organization to ensure goals are regularly reviewed and updated as details evolve."}, "200452881": {"jobID": "200452881", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452881/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelors degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Software skills in C/C++.Familiarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is a plusExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is ideal Experience with scripting (Python, Tcl, Perl) is a plusMinimum requirement of a bachelors degree", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200451475": {"jobID": "200451475", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451475/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of a BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.00", "max": "$75.48/hr,"}, "benefits": null, "requirements": "We are looking for entry level applicants with an interest in circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits.Strong understanding of CMOS device characteristics and design rules.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Understanding of Timing characterization & modeling of Standard cell circuits.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.Minimum requirement of a BS degree", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200458902": {"jobID": "200458902", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Embedded SW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458902/embedded-sw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Embedded SW development as well as a strong background in embedded wireless systems.Strong background in embedded software development using C and assembly languages, familiarity with ARM CPUsExperience in performing low-level drivers and HW bring-up, using test tools, and interacting with HW and SoC design teamsExperience writing scripts in languages such as Python, Perl, or TclExperience implementing diagnostics, manufacturing tests, and protocol compliance test softwareExperience with industry standards for wireless communications such as Bluetooth, WLAN, or Zigbee, is also desirableBS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly.\n\nResponsible for crafting and implementing embedded software for System on a Chip (SoC) bring up and test. You will work closely with the Software Engineering team ensuring the quality of their firmware for manufacturability."}, "200450099": {"jobID": "200450099", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Embedded SW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450099/embedded-sw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Embedded SW development as well as a strong background in embedded wireless systems.Strong background in embedded software development using C and assembly languages, familiarity with ARM CPUs.Experience in performing low-level drivers and HW bring-up, using test tools, and interacting with HW and SoC design teams.Experience writing scripts in languages such as Python, Perl, or Tcl.Experience implementing diagnostics, manufacturing tests, and protocol compliance test software.Experience with industry standards for wireless communications such as Bluetooth, WLAN, or Zigbee, is also desirable.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly.\n\nResponsible for crafting and implementing embedded software for System on a Chip (SoC) bring up and test. You will work closely with the Software Engineering team ensuring the quality of their firmware for manufacturability."}, "200432555": {"jobID": "200432555", "origin_search": null, "posted": "Oct 12, 2022", "jobTitle": "Sales Operations Data Scientist, Advertising Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432555/sales-operations-data-scientist-advertising-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in data science, statistics, economics, computer science or other quantitative field. Advanced degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of experience in data science, analytics, or consulting roles, preferably in the digital advertising industry, with a strong track record of solving complex analytical problems and positively influencing business outcomesAdvanced technical skills in SQL, Python, and TableauExperience in advanced quantitative analysis including regression, classification, clustering, and time-series analysesExperience to automate and scale analysies and dashboardsExceptional written and verbal communication skills with experience building stories and narratives out of dataExcellent research, project management, and organizational skillsBS in data science, statistics, economics, computer science or other quantitative field. Advanced degree preferred.Experience with advertising, measurement, and/or digital analytics", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. \n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. Launched in 2016, Search Ads is an easy, efficient and fast-growing platform for app discovery. With over 65% of all app downloads resulting directly from a search in the App Store, Search Ads is quickly becoming the app promotion platform of choice for iOS developers. \n\nWe are looking for a smart and passionate Data Scientist to support our growing advertising business. In this role, you will work within our Advertising Platforms Sales Operations team to support and empower the sales organization by building impactful analyses and insights. You’ll help us architect complex but practical insights, establish strategies/priorities based on empirical observations and measure success."}, "200432557": {"jobID": "200432557", "origin_search": null, "posted": "Oct 12, 2022", "jobTitle": "Sales Operations Data Scientist, Advertising Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432557/sales-operations-data-scientist-advertising-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in data science, statistics, economics, computer science or other quantitative field. Advanced degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of experience in data science, analytics, or consulting roles, preferably in the digital advertising industry, with a strong track record of solving complex analytical problems and positively influencing business outcomesAdvanced technical skills in SQL, Python, and TableauExperience in advanced quantitative analysis including regression, classification, clustering, and time-series analysesExperience to automate and scale analysies and dashboardsExceptional written and verbal communication skills with experience building stories and narratives out of dataExcellent research, project management, and organizational skillsBS in data science, statistics, economics, computer science or other quantitative field. Advanced degree preferred.Experience with advertising, measurement, and/or digital analytics", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. \n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. Launched in 2016, Search Ads is an easy, efficient and fast-growing platform for app discovery. With over 65% of all app downloads resulting directly from a search in the App Store, Search Ads is quickly becoming the app promotion platform of choice for iOS developers. \n\nWe are looking for a smart and passionate Data Scientist to support our growing advertising business. In this role, you will work within our Advertising Platforms Sales Operations team to support and empower the sales organization by building impactful analyses and insights. You’ll help us architect complex but practical insights, establish strategies/priorities based on empirical observations and measure success."}, "200452166": {"jobID": "200452166", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Validation Engineer - RF Systems Cellular", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452166/wireless-systems-validation-engineer-rf-systems-cellular?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Practical knowledge of at least one Cellular Wireless technology including 2G, 3G, 4G, 5GPractical knowledge of cellular industry standards including 3GPP, 3GPP2, Carrier specifications including performance requirements, compliance requirements and required testing methodologiesExperience and a deep understanding of System Level RF Parametric its sources in RF component characteristics and behaviorHands on experience with bench level wireless testing, debug at the module, reference board or system levelDebug level experience on cellular radio systems at the conducted or radiated level is a plusUnderstanding of Antenna characteristics impact to radiated testing. Familiarity with radiated test setups, radiated chamber calibration and useExperience using RF lab test equipmentAbility to travel domestically and internationallyStrong written and verbal communication skillsBS required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work towards ensuring Apple products conform and go beyond all applicable cellular industry standards and regulatory requirements."}, "200460187": {"jobID": "200460187", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Engineering Program Manager - Input Device Product Design", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460187/engineering-program-manager-input-device-product-design?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Prior experience (ideally 3+ years) leading program management or mechanical engineering design of product developmentExcellent communication, organizational, presentation and leadership skillsSelf motivated and proactive with demonstrated creative and critical thinking capabilitiesUnderstands and deals well with rapid development cycles; remains flexible when faced with uncertainty and changes in directionKnowledge of product development processes as well as an understanding of manufacturing processes, mechanical engineering fundamentals; prior experience with metal stamping, forging, machining (CNC), die casting, plastic injection and metal injection molding (MIM) is highly desirableStrong attention to detail and ability to effectively manage complex design strategiesParticipated in delivering products comprised of multiple materials and high esthetic qualityExperience interfacing with cross functional teams including Mechanical Engineering and Design, Systems Engineering, Reliability, Operations, and Marketing.BS degreeApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.  Apple benefits programs vary by country and are subject to eligibility requirements.  Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "As a Product Design Engineering Program Manager you will be responsible for the technical management of the development and implementation process for the mechanical components of one of our Input Devices product development teams.  In this role you will drive the day-to-day activities to meet the overall program objectives focusing on engineering, development planning and validation cycles.  This involves engaging with large cross functional teams to balance several competing objectives and meet aggressive deliverable timelines."}, "200452492": {"jobID": "200452492", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Next Generation Wireless Prototype Infrastructure Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452492/next-generation-wireless-prototype-infrastructure-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven track record in design and prototyping of at least one of: wireless systems, networking products, GPU/video processing and AI/ML hardwareExperience with prototyping or emulation using a multi-FPGA systemExperience with multi-gigabit transceivers in FPGA’s and deploying different protocolsExperience with power delivery and clock net definition for FPGA systemsExperience with resource utilization analysis and power analysisExperience with high-speed interface protocols including MIPI, PCIe, EthernetExperience with DDR3/LPDDR3, USB, Flash and other peripheralsExperience with chip-to-chip protocols like Interlaken and Aurora is a plusExperience in architecting low-latency data links is a plusBS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Smart people and inspiring, innovative technologies are the norm here. Are you ready to be part of a team transforming wireless technology? Come and work on challenges that no one has solved yet! We invite you to join us to help deliver the next groundbreaking Apple product."}, "200453779": {"jobID": "200453779", "origin_search": null, "posted": "Jan 7, 2023", "jobTitle": "Graphics Verification Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453779/graphics-verification-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for candidates with the following skills:Experience in verification of complex hardware at system or component level with ability to debug issues across hardware and softwareGood knowledge of computer architecture, SoC, and memory sub-systemsExperience in crafting verification test plans and driving them to closureExperience with scripting, preferably with system automationStrong programming skills, preferably in C/C++Excellent communication skills and ability to collaborate under tight schedulesWe are looking for candidates with a minimum of BS + 3 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s products. Together, we will enable our customers to do all the things they love with their devices! The Graphics Verification Software Engineer will be responsible top-level pre-silicon RTL verification of embedded graphics cores using pre-production graphics drivers."}, "200449307": {"jobID": "200449307", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Power Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449307/cellular-4g-5g-firmware-power-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceExperience on working with power optimization methodologies as well as hands-on experience with power measurement tools, preferably in cellular technologiesAbility to work multi-functionally with different teams implement power verification test plan that will help achieve the outstanding modem targetsKnowledge in wireless systems, 4G/5G physical layer, protocol stack and procedures, power measurement and modem architecture, in particular C-DRX, Airplane modes, different sleep idle state transitionsValidated understanding of different interfaces like PCIe, USB, MPHY based RF-BB interconnects, frequency and voltage management and clocking schemesUnderstanding of SoC architectures, Fabrics, DDRs and DMAs will be an added plusShown track-record of innovation and hands-on experience in power measurement setup and test methodologyStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong understanding multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an outstanding modem team, we'll craft powerful embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world! As a Cellular 5G/4G Firmware Power Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on requirements."}, "200459086": {"jobID": "200459086", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Hardware Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459086/hardware-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. degree in Computer Science, Electrical Engineering or equivalent years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "High-speed board design experience with 10+ layer PCBs, including PCB material selection.Schematic entry and management of design constraints for high-speed PCB layout using Cadence tools or similar.Experience with PCI Express (PCIe), 100-GbE, USB3/USB4 or similar high-speed serial protocol: electrical design, protocol fundamentals, compliance testing, and debug using protocol analyzer.Design, validation, and debug experience with common low-speed interfaces, such as: I2C, SPI, JTAG, UART, and USB1/2.Knowledge of clocking technology: crystals, oscillators, and simple PLLs.Knowledge of discrete passive components (resistors, capacitors, inductors) and their characteristics and specifications.Ability to debug jitter problems and their sources thru measurement and analysis.Working knowledge of power supply design fundamentals.Experience using test & measurement equipment, such as: high-speed oscilloscopes, protocol analyzers, and VNAs.Ability to debug problems from the system-level down to the transistor level.3-12 years of relevant experience.Excellent written and verbal communication skills. Ability to create diagrams and make concise presentations to clearly present information to cross-functional teams.B.S. degree in Computer Science, Electrical Engineering or equivalent years of experience.Ability to take 1-2 international trips per year, 1-3 domestic trips per year.", "jobDescription": "The hardware engineering team is looking for a product focused engineer to work on a variety of projects from design conception to mass production. We work with many cross-functional teams, including mechanical, power, software, firmware, silicon design, hardware validation, and reliability engineering, to quickly build products to meet our customer’s evolving needs. We build modular systems with multiple heterogeneous boards and define the interfaces that connects them together!"}, "200417977": {"jobID": "200417977", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "iOS Software Engineer (MSO)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200417977/ios-software-engineer-mso?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS CE/CS or equivalent experience required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Strong coding skills in one or more object-oriented language such as Swift, Objective-C, C++, or JavaStrong problem solving skillsExcellent performance and debugging skillsStrong system level understandingExcellent spoken and written communication skillsBS CE/CS or equivalent experience required-  Experience with Swift and Cocoa Objective-C & other similar frameworks-  Experience working on and shipping iOS applications-  Solid understanding and experience with iOS Frameworks and back-end integration-  Passion for digital health-  Background in health and healthcare a plusApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics.", "jobDescription": "AC Wellness Network LLC is a subsidiary of Apple Inc. and is the dedicated management services organization (MSO) for AC Wellness, a dedicated independent medical group that serves Apple Wellness Centers. Our mission is to deliver the world’s best healthcare experiences for Apple employees.\n\nThere is a tremendous opportunity to improve how people manage their health. Our MSO team is looking for outstanding engineers to help deliver amazing experiences that will address this need in meaningful ways."}, "200443800": {"jobID": "200443800", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Hardware Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443800/hardware-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master’s degree with 5yrs industry experience or Bachelor’s with 7yrs industry experience in a related discipline (e.g. EE, Computer Arch etc.) required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Technical background (e.g. hardware development) with solid knowledge of computer architectureElectrical engineering fundamentalsExcellent communication, presentation, organizational and leadership skills that has the ability to network well and stay connected into all the various groups and technologies that feed into TAPPSelf motivated and proactive with demonstrated creative and critical thinking capabilities with the ability to drive a team forwardUnderstands and deals well with rapid development cycles; remains flexible and calm in the face of uncertaintyAbility to effectively drive SW needs (OS, control loop maturity etc) to enable TAPP assessmentTeamwork - the candidate must be able to fit in well with a team, understand capabilities and priorities while fostering a collaborative environmentProblem solver - when an issue arises, the candidate must be able to navigate cross functionally to get it resolvedMaster’s degree with 5yrs industry experience or Bachelor’s with 7yrs industry experience in a related discipline (e.g. EE, Computer Arch etc.) required.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "In this critical role, you will be responsible for driving the TAPP process forward across Mac systems. TAPP encompasses Thermal / Acoustic / Power / Performance. Your role as an Engineering Program Manager will be to work closely with TAPP leadership and cross functional partners across Mac Hardware, Software Engineering and HW Technology teams to understand the technical stack, from System HW modules (Thermal, SoC, Fan, Display, PMICs) up through the software layers with the ability to boil down complicated trade-offs into consumable material that decisions can be made with at the leadership level. The charter of TAPP is to architect and ensure a great user experience for all Mac users."}, "200452039": {"jobID": "200452039", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Software Engineer: Linux Driver developer (Thunderbolt/USB/PCIe/Displays)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452039/software-engineer-linux-driver-developer-thunderbolt-usb-pcie-displays?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experienced in embedded Linux kernel developmentExperienced in one or more of USB, PCIe, Thunderbolt, Display and Networking Linux frameworksStrong Computer architecture and Operating system fundamentalsStrong debugging skills in Kernel and user spaceYou are a skilled C programmer and good at scripting using bash/pythonFamiliarity with ARM architectureBS and a minimum of 3 years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. \n\nAre you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly."}, "200420869": {"jobID": "200420869", "origin_search": null, "posted": "Sep 8, 2022", "jobTitle": "Identity Management Services Localization Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420869/identity-management-services-localization-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA or MA in an area related to Localization is preferred or equivalent related work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "6+ years experience in a technical localization management role, with 4+ years of people management.Knowledge of Apple ID, Family Sharing, iCloud Storage, and familiarity with the larger Apple ecosystem.Solid track record of leading the localization team in charge of customer-facing features for software, mobile apps, websites, web apps, and multimedia.Strong passion for delivering the best customer experience globally, and experience leading a team delivering on a large number of languages simultaneously.Outstanding presentation skills that are effective across all levels of the organization.Capable of influencing product, design and other cross-functional teams, voicing international concerns early in the development process.Quality and data-driven, ensuring the team adheres to high standards and contributes to the operational efficiency of our initiatives.In-depth knowledge of Localization QA processes and standard methodologies, with the ability to implement new improved standards.Strategic problem solver with excellent organizational and communication skills.Attention to detail and ability to manage conflicting priorities is important.Proficiency in a language other than English.BA or MA in an area related to Localization is preferred or equivalent related work experience.", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly! We are a passionate group dedicated to making sure Apple's excellence shines in all languages and regions. Bring the same passion and dedication and there's no telling what you could accomplish!\n\nThe Server UI Localization team is looking for an extraordinary Manager to lead a team of Localization Project Managers (LPMs) focused on Identity Management Services. This role will focus on strategic partnerships with product, engineering, and technology teams to surprise and delight our customers."}, "200446354": {"jobID": "200446354", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "SOC Firmware Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446354/soc-firmware-engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE with a minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$299,000,"}, "benefits": null, "requirements": "At least 10 years of proven experience in wireless SoC firmware engineeringExperience in engineering management, including prior leadership of wireless firmware team(s) with a strong high-volume production track recordExtensive technical background in one or more of the following:Strong embedded SW fundamentals, including a deep understanding of design and development flows, real-time constraints, concurrency, and multi-processor systems, caching and virtual memoryFamiliarity with low-level hardware interfaces, register and interrupt programming, bare-metal software development, clock and power managementExperience with configuration and release management, continuous integration, and regression testingKnowledge of design strategies for maintainability, scalability, and code reuseUnderstanding of wireless systems, MAC and PHY layer operations, digital signal processing, Tx/Rx performance metrics, regulatory constraints, and coexistence issuesExperience with WiFi, Bluetooth, or similar wireless technologiesHW/SW architecture and design partitioning, CPU selection, memory estimation, and requirements analysisLeading large and complex projects, including feature planning, prioritization, status tracking, and issue triage and reportingExcellent organizational skills, including experience leading teamsExcellent communication skills – both written and oralExperience with executive communication is a plusBSEE with a minimum of 10 years of experience", "jobDescription": "As an engineering manager in the Wireless Connectivity Silicon team, we are responsible for hands-on technical development! As well as managing a team of engineers to enable innovative wireless silicon for application in Apple’s products!"}}