{"200449314": {"jobID": "200449314", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Wireless SoC Silicon Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449314/wireless-soc-silicon-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "5+  years of experiences in SoC integration and Low Power ASIC designHands on experience with PTPX and Power Artist power analysis toolsProficiency in ASIC logic designExtensive experience with SoC power management design including power gating, isolation, retention and DVFS techniquesDeep understanding of ASIC low power design techniques, e.g. Power analysis, UPF, VCLPSoC level clock mesh / reset design experience desirableProficiency in scripting languages (Shell and Perl highly desirable, Python skills are a plus)SoC top-level integration experience is a plusSystem architecture knowledge is a bonusSilicon validation / power measurement experience is a plusBS and 10+ years of relevant industry experience.BS and 10+ years of relevant industry experience.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply."}, "200449805": {"jobID": "200449805", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "Wireless SoC Silicon Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449805/wireless-soc-silicon-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Various Locations within Los Angeles Metro Area", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "5+  years of experiences in SoC integration and Low Power ASIC designHands on experience with PTPX and Power Artist power analysis toolsProficiency in ASIC logic designExtensive experience with SoC power management design including power gating, isolation, retention and DVFS techniquesDeep understanding of ASIC low power design techniques, e.g. Power analysis, UPF, VCLPSoC level clock mesh / reset design experience desirableProficiency in scripting languages (Shell and Perl highly desirable, Python skills are a plus)SoC top-level integration experience is a plusSystem architecture knowledge is a bonusSilicon validation / power measurement experience is a plusBS and 10+ years of relevant industry experience.BS and 10+ years of relevant industry experience.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply."}, "200443925": {"jobID": "200443925", "origin_search": null, "posted": "Nov 22, 2022", "jobTitle": "Packaging Engineering Program Manager (EPM)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443925/packaging-engineering-program-manager-epm?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor or Masters degree in Engineering is preferred.\nMBA and/or PMP certification preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You should have at least 8 years of combined experience in project management and mechanical engineering delivering products comprised of multiple materials and high aesthetic qualityYou are comfortable to drive day-to-day activities to meet overall project objectivesWe look up to you to enable the development effort by creating and monitoring an efficient, streamlined process. Redirect pitfalls and develop a better course of actionIdentify and direct all resources required to execute successful projectsCollaborate and facilitate communication across engineering managers, operations manager, marketing managers and our OEM partners to meet very aggressive cost, schedule, and quality goals.Lead cross-functional communication between project teams and external vendorsProvide timely issue resolution and critical path managementOffer multiple levels of status across a wide spectrum of individual contributors to executive managementUnderstand technical issues and drive them to closure by bringing together key partners for decision-makingExcellent communication, organizational, and leadership skillsAbility to filter and distill relevant information for the right audienceSelf-motivated and dedicated with demonstrated creative and critical thinking capabilitiesAbility to work in a high-pressure dynamic environmentUnderstands and deals well with rapid development cycles; remains flexible and calm in the face of ambiguityMultinational development experiences also a plus.Understanding CAD/Mechanical design is nice to have.Bachelor or Masters degree in Engineering is preferred.\nMBA and/or PMP certification preferredMandarin fluency is a plus (but is not required)Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time- away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \u2028Apple benefits programs vary by country and are subject to eligibility requirements. \u2028Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Are you passionate about the \"unboxing\" experience when a new product arrives on your doorstep? Do you find yourself holding on to an Apple product package longer than other packages you've opened? You're not alone! Our team is responsible for the design decisions that go into making millions of Apple products' packaging. \n\nAt Apple we believe our products begin with our people. We have a diverse and smart team that drives creative thought. By giving the team the resources they need to be leaders in innovation, we are also successful at driving precision. Through our collaborative process we create memorable experiences for our customers. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of an Engineering Project Management Team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\nApple packaging is a world-class team thriving in conducting a memorable and delightful introduction to an amazing array of Apple products.\n\nAs a Packaging Engineering Project Manager you will be responsible for managing development activities, executing builds, coordinate testing and handing off to mass production a high quality first class product."}, "200447448": {"jobID": "200447448", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Analog IC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447448/analog-ic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Do you have a proven track record of taking chips to production in the following areas?Deep knowledge of ADC/DAC architectures and knowing which are suitable for given applicationsDeep knowledge of band-gaps, bias, op-amps, switched-cap circuits, LDOs, feedback and compensation techniquesProven expertise in the following areas:Significant knowledge of low noise design techniquesSignificant knowledge of high precision techniques in presence of device mismatchExperience in C / Matlab / Verilog modelingStrong device physics knowledge as it applies to analog IC designsProven working experience in using spectrum analyzers, oscilloscopes, signal generators, etc. to validate analog designsExtensive experience working with production test engineers to firm up test plans and design for testability detailsBachelors of Science in Electrical Engineering and 3+ years experience preferred", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented IC Designer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day."}, "200452277": {"jobID": "200452277", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless MAC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452277/wireless-mac-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10+ years of relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Familiarity with MAC verification experienceKnowledge of Wireless Connectivity or MAC verificationAdvanced knowledge of standard ASIC design and verification flows, simulation and testbench developmentProficiency in SystemVerilog and the UVM methodology is highly preferredSkills with constrained random testing, coverage closure, gate level simulationsExperience writing scripts in languages such as Perl or PythonGreat teammate with excellent communication skills and the desire to take on diverse challengesBS + 10+ years of relevant experience required.", "jobDescription": "The Apple ecosystem leverages multiple wireless technologies to enable a user experience like no other! The Wireless Connectivity Silicon (WCS) team leads the way in developing complex SoCs to enable this experience in current and future Apple products. By using state of art processes, tools, flows along with unique proprietary features and advanced architecture, the team aims to deliver best-in-class wireless connectivity solutions.\n\nOur WCS organization plans to grow significantly to address the multiple silicon tapeouts targeting different product lines at Apple in the coming years. There will be huge growth opportunities to build new infrastructure. If you are passionate about wireless technologies, working on next generation new infrastructure and learning new things, this is the place for you!"}, "200409293": {"jobID": "200409293", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Wireless MAC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200409293/wireless-mac-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE/BSCE or MSEE/MSCE + 5 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "At least 5 years of MAC verification experienceKnowledge of Wireless Connectivity or MAC verificationAdvanced knowledge of standard ASIC design and verification flows, simulation and testbench developmentProficiency in SystemVerilog and the UVM methodology is highly preferredSkills with constrained random testing, coverage closure, gate level simulationsExperience writing scripts in languages such as Perl or PythonGreat teammate with excellent communication skills and the desire to take on diverse challengesBSEE/BSCE or MSEE/MSCE + 5 years of relevant industry experience", "jobDescription": "The Apple ecosystem leverages multiple wireless technologies to enable a user experience like no other! The Wireless Connectivity Silicon (WCS) team leads the way in developing complex SoCs to enable this experience in current and future Apple products. By using state of art processes, tools, flows along with unique proprietary features and advanced architecture, the team aims to deliver best-in-class wireless connectivity solutions.\n\nOur WCS organization plans to grow significantly to address the multiple silicon tapeouts targeting different product lines at Apple in the coming years. There will be huge growth opportunities to build new infrastructure. If you are passionate about wireless technologies, working on next generation new infrastructure and learning new things, this is the place for you!"}, "200451237": {"jobID": "200451237", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451237/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep knowledge of SystemVerilog test-bench language and UVM Experience developing scalable and portable test-benches.Experience with verification methodologies and tools such as simulators, waveform viewers, build and run automation, coverage collection, gate level simulations.Experience with serial protocols such as PCIe or USB Experience with mixed signal verification methodology for IPs such as PHYs, PLLs etc.In lieu of UVM knowledge, C/C++ level knowledge.Deep knowledge of one of the scripting languages: Python, Perl, TCL.Deep knowledge of formal verification methodology.BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an ambitious and exceptionally talented design verification engineer. As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.  \n\nWe are looking for a Design Verification Engineer who will enable bug-free first silicon for IP designs. The responsibilities include all phases of pre-silicon verification including, establishing design verification methodology, and test-plan development. Additional responsibilities will include verification environment development, such as stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200451473": {"jobID": "200451473", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Circuits QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451473/circuits-qa-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for applicants with experience in SRAM or Standard Cell Library development, EDA automation or Quality Assurance.Proficient in scripting in Perl, Python and/or TCL.Good understanding of transistor level design, SRAM and/or Standard cell circuits, cell characterization and library validation.Experience with various EDA tools for synthesis, place-route, Verilog simulation, spice simulation, formal verification, DRC/LVS, RC extraction and/or library characterization.Familiarity of Verilog syntax, liberty models and variation format.Knowledge of timing, power, noise, and IR analysis.BS and a minimum of 3 years of relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world! Your efforts will be groundbreaking, often literally. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never-before envisioned. We have an extraordinary opportunity for digital design QA Engineers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact delivering high quality products to market quickly."}, "200455621": {"jobID": "200455621", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455621/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experience.Knowledgeable in partition level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Proficient in scripting languages (i.e. Perl, Python, TCL).Demonstrate knowledge of basic SoC architecture and HDL languages to collaborate with logic design teams to drive optimizations in power, performance, and area.Experience in IP-level planning (block tiling, feedthrough planning, pin assignment).Solid understanding of Extraction and STA methodology and tools.Minimum BS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this visible role, you will be directly responsible for the physical implementation of design partition(s) (from netlist to tapeout) for a highly complex SOC utilizing innovative process technology."}, "200450098": {"jobID": "200450098", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450098/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Knowledgeable in partition level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this visible role, you will be directly responsible for the physical implementation of design partition(s) (from netlist to tapeout) for a highly complex SOC utilizing innovative process technology."}, "200449553": {"jobID": "200449553", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449553/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Knowledgeable in partition level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this visible role, you will be directly responsible for the physical implementation of design partition(s) (from netlist to tapeout) for a highly complex SOC utilizing innovative process technology."}, "200464137": {"jobID": "200464137", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "SoC Physical Design Engineer, PnR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464137/soc-physical-design-engineer-pnr?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Knowledgeable in partition level P&R implementation, including floorplanning, clock and power distribution, timing closure, physical and electrical verification.Strong knowledge of physical design construction and analysis flows and methodology.Shown ability to adhere to stringent schedule and die size requirements.Strong communication skills.Experienced with industry standard tools, understanding their capabilities and underlying algorithms.Experience with large SOC designs (>20M gates) with frequencies in excess of 1GHZ.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nIn this visible role, you will be directly responsible for the physical implementation of design partition(s) (from netlist to tapeout) for a highly complex SOC utilizing innovative process technology."}, "200458042": {"jobID": "200458042", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Sr. PHY Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458042/sr-phy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Work closely with system/design team to review and understand PHY subsystem microarchitecture, create verification plans from specifications.Build block/subsystem level test benches with reference model, using best in class DV methodology. Architect test benches with maximum reusability in mind.Develop and execute both directed and constrained random tests, debug failures, manage bug tracking, and work with designers to drive closure of issues found.Create and analyze block/subsystem level coverage model, and add test cases to increase coverage.Support PHY subsystem validation using Palladium and/or FPGA.Work with team members to improve methodology and flow.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly."}, "200450090": {"jobID": "200450090", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "PHY Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450090/phy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Verification experience of wireless/wired communication block/subsystem.Excellent knowledge and experience of ASIC verification flows including test bench development, constrained random testing, and code/functional coverage.Advanced knowledge of Verilog, SystemVerilog, UVM, and SystemVerilog Assertion.Experience of using Matlab/C reference model and bit-accurate verification a plus.Knowledge of wireless protocols such as Bluetooth, WLAN, or Zigbee a plus.Proficiency in shell and Perl scripting, Python skills a plus.Experience of Palladium/FPGA validation a plus.Should be a team player with excellent communication skills, self-motivated and well organized.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly."}, "200457889": {"jobID": "200457889", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": " Hardware Engineering Technical Lead - Apple Home", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457889/%EF%A3%BF-hardware-engineering-technical-lead-apple-home?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in electrical engineering or computer engineering required.\n\nMinimum 5 years experience leading projects and/or teams through complex designs."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proven technical leadership of complex hardware projects, with preference to consumer electronicsDemonstrated ability to mentor and lead by exampleStrong EE fundamentals on analog circuits (DC/DC, power and signal integrity, SPICE simulations)Knowledgeable in digital communication (I2C, USB, SPI, TDM, PDM)Working experience in electrical design, including component selection, circuit design, schematic capture, component placement and PCB/flex layoutRelevant subsystem exposure in power, acoustic, sensor, display, wireless, touch and camera, integration with System-on-Chip or microcontrollersWorking knowledge of standard methodologies in PCB design, including stack up, impedance control and noise couplingStrong communication, written and verbal interpersonal skills necessary to collaborate with a variety of technical teams at AppleAbility to drive concept work independently and determine necessary figures of merit to draw conclusionsAbility to work with cross-geographic team members, using any and all forms of communication to integrate with the larger teamBS in electrical engineering or computer engineering required.\n\nMinimum 5 years experience leading projects and/or teams through complex designs.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "At Apple, we're passionate about designing products and delivering experiences that millions around the world have come to love. This is a place where extraordinary ideas have a way of quickly becoming extraordinary products and services!\n\nIn recent years, Apple Home devices and services have become a staple among Apple's elite product line. As we continue to push the boundaries of what's possible, Our Beats & Home organization has been hard at work continuously innovating new features and products. \n\nA key factor in this effort is our Hardware Integration Team. This team is a rapidly growing, diverse group of engineers developing technology integrations that help define how users interact with Apple Home products. To help drive this mission, we are seeking a proven Hardware Engineering Technical Lead who will own critical electrical designs from concept to productization while mentoring junior engineering staff. This person will be part of a hands-on team that specifies the product, collaborates to solidify architecture, and improves our overall design of HW systems. Does this sound like you?"}, "200450909": {"jobID": "200450909", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "5G/4G Physical Layer Firmware Verification and Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450909/5g-4g-physical-layer-firmware-verification-and-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP physical layer and protocol stack procedures and configurationsExperience with firmware test plan and feature release planning for the 4G/5G functional and performance scenariosStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong solid understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesStrong analysis and debugging capabilities to be able to define issues and work with firmware development and systems design teams to close these issuesFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We’ll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world! As a 5G/4G Physical Layer Firmware Verification and Integration Engineer, you will be at the center of the embedded 5G/4G/multimode cellular physical layer firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification and integration, that thrives in a wide-ranging multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200448074": {"jobID": "200448074", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448074/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Prefers Bachelor of Science degree with minimum 3 years of relevant experience or internships.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Deep knowledge of SystemVerilog and UVMDeep knowledge in developing scalable and portable test-benchesProven experience with verification methodologies and tools such as simulators, waveform viewersBuild and run automation, coverage collection, gate level simulationsSome UVM knowledge, C/C++ level knowledgeDeep experience with serial protocols such as PCIe or USB, parallel protocol such as DDRBasic knowledge of formal verification methodologySome experience with power-aware (UPF) or similar verification methodologyKnowledge of one of the scripting languages such as Python, Perl, TCLPrefers Bachelor of Science degree with minimum 3 years of relevant experience or internships.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an outstandingly hardworking design verification engineer. As a member of our wide-ranging group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.   \n\nThis role is for a digital-focused DV engineer who will enable us to produce fully functional first silicon for IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200451254": {"jobID": "200451254", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451254/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience developing scalable and portable test-benchesExperience with verification methodologies and tools such as simulators, waveform viewers, build/run automation, coverage collection, gate level simulationsExperience with serial protocols such as PCIe or USBExperience with mixed signal verification methodology for IPs such as PHYs, PLLs etc.In lieu of UVM knowledge, C/C++ experienced level knowledgeExcellent knowledge of one of the scripting languages: Python, Perl, TCLValidated knowledge of formal verification methodologyBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an unusually hardworking design verification engineer. As a member of our multifaceted group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.\n\nThis role is for a DV engineer who will enable us to produce fully functional first silicon for Analog/Digital mixed-signal designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200448044": {"jobID": "200448044", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448044/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS Degree is required.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep knowledge of SystemVerilog and UVMDeep knowledge in developing scalable and portable test-benchesProven experience with verification methodologies and tools such as simulators, waveform viewersBuild and run automation, coverage collection, gate level simulationsSome UVM knowledge, C/C++ level knowledgeDeep experience with serial protocols such as PCIe or USB, parallel protocol such as DDRBasic knowledge of formal verification methodologySome experience with power-aware (UPF) or similar verification methodologyKnowledge of one of the scripting languages such as Python, Perl, TCLBS Degree is required.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an outstandingly hardworking design verification engineer. As a member of our wide-ranging group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.   \n\nThis role is for a digital-focused DV engineer who will enable us to produce fully functional first silicon for IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200451528": {"jobID": "200451528", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless System Automation Development Engineer Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451528/wireless-system-automation-development-engineer-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine, CA", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS+10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "This is a lead role that requires industry experience in architecting and implementing test and automation systems within wireless communication systems.Experience developing test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI, database, reporting tools).Experience with Python and/or C/C++.Experience using, and a basic understanding of the theory of operation of, wireless test lab equipment (spectrum analyzer, signal generator, network analyzer, power meter).Minimum qualification is BS+10 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before."}, "200456712": {"jobID": "200456712", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "ASIC Design Engineer - Pixel IP", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456712/asic-design-engineer-pixel-ip?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree + 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in IP/SoC front-end ASIC RTL digital logic design using Verilog and System Verilog.Industry exposure to and knowledge of ASIC/FPGA design methodology, especially logic synthesis, static timing analysis, logic equivalence checking, and working with physical design teams for floorplanning and timing closure.Experience with system design methodologies that contain multiple clock domains.Experience in low-power design issues, tools, and methodologies including UPF power intent specification highly desired.Familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB).Industry exposure to and knowledge of ASIC/FPGA design methodology including familiarity with relevant scripting languages (Python, Perl, TCL).Good collaboration skills with strong written and verbal communication skills.Experience working multi-functionally with integration, design, and verification teams to specify, design, and debug digital systems.Bachelor's Degree + 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly transparent role, you will be at the center of the Pixel IP design effort to capture and display alluring images and video. You will collaborate with all fields, making a critical impact getting functional products to millions of customers quickly."}, "200446333": {"jobID": "200446333", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "PLL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446333/pll-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE Minimum 10 years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "The ideal candidate should have confirmed taking chips to production with experience in the following areas: Dual charge-pump PLL designs, Fractional-N PLLs, spread-spectrum PLLs, Digital PLL techniques, etc.High speed digital circuit design and analysisHigh frequency signal integrity experienceExperience with LC and RO VCO design. Good knowledge of band gaps, bias, op-amps, LDOs, feedback and compensation techniques as well as digitally assisted analog circuit techniquesLab and ATE test plans, measurement for characterization, and volume production.BSEE Minimum 10 years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially talented PLL Circuit Designer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every day.\n\nApple Silicon Engineering is seeking qualified PLL designers to work on the next generation PLLs for Apple’s world-leading systems-on-chip (SOCs). We are a growing analog/mixed-signal team involved in design and productization on leading-edge CMOS process technology nodes!"}, "200438783": {"jobID": "200438783", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "Product Design Engineer - AirPods & Future Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438783/product-design-engineer-airpods-future-products?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MSME"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "REQUIRED EXPERIENCE:3+ years experience in product designDemonstrated ability in plastic and metal part design.3-D CAD skillsAccurate mechanical intuitionExperience in Design for Manufacturability (DFM), and Design for Assembly (DFA), statistical tolerance analysis techniques, functional dimensioning, and geometric tolerancing.Deep analytical/problem solving skills and ability to use statistical tools and techniques.Working knowledge of finite element analysis theory and general mechanical engineering analysis.Flexibility and comfort working in a quickly changing environment.Ability to travel internationally (20%+).DESIRED EXPERIENCE:Experience working with overseas manufacturersConsumer electronics design experienceIntegration of wireless antenna (GSM, GPS, Wifi) into mechanical enclosuresExperience with component modules (Audio drivers, batteries, power supplies, camera modules, etc.)Design of audio subsystems (microphone, speaker, receiver)BS/MSME", "jobDescription": "We invent the next generation of the world's finest consumer electronics. As a member of our Audio Product Design team, you would conceive, design, test, solve problems, and bring into production products that re-define the music experience. We work closely with many different multi-functional teams including Industrial Design, Audio Engineering, Packaging, Safety, Hardware Engineering, EMC, Operations and Marketing. Expertly integrating so many different pieces into brand new products means every single day is different."}, "200451378": {"jobID": "200451378", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Timing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451378/timing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of meaningful experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Prefers extensive Physical Design experience on high PHY and/or SOC designsDeep knowledge of industry standards and practices in Timing closures, Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route Experience in developing and implementing STA constraintsDeep understanding of all aspects of Timing flow, Physical construction, Integration and Physical VerificationConfirmed knowledge of Basic SoC Architecture and HDL languages like Verilog to collaborate with our logic design team for timing fixesExperienced user of industry standard Timing, Physical Design and Synthesis toolsDeep Understanding of scripting languages such as Perl/TclBS degree in technical discipline with minimum 10 years of meaningful experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and outstandingly hardworking Timing Design Engineer. As a member of our multifaceted group, you will have the outstanding and phenomenal opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day.  In this role, you will be at the center of a PHY design effort collaborating with architecture, CAD, logic design teams, with a critical impact on delivering outstanding PHY designs. You will be directly involved in timing closure and/or physical designs of outstanding PHY design."}, "200451472": {"jobID": "200451472", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Circuits Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451472/circuits-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "We are looking for experienced applicants with strong understanding of the RTL2GDSII flow and concepts related to synthesis, place & route, CTS, timing convergence, layout closure.Familiar with development of block/partitions for silicon validation of foundation IPs.Familiar with ASIC integration flows, including power distribution, global signal planning, I/O planning and hard IP integration is highly desired.Familiar with tapeout of partitions and Verification Flows like LEQ, IR/EM, Timing and DFM closure is preferred.Hands-on experience with ECO implementation, both functional and timing closure is helpful.Familiar with DFT insertion, and multi-mode timing constraints is a strong plus.Strong scripting skills using Perl/Tcl.Strong written/verbal communication skills.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Physical Design Engineers. In this highly visible role, you will be at the heart of a processor design effort, working with foundation IP developers on silicon validation, making a critical impact delivering products to market quickly."}, "200387487": {"jobID": "200387487", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "iPhone Hardware Engineering Program Manager (HW EPM)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200387487/iphone-hardware-engineering-program-manager-hw-epm?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "• BS EE/CE/ME degree required, MS desired."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Minimum 4-5 years of industry experience.Excellent verbal and written interpersonal skills.Strong analytical and problem-solving skillsStrong technical background in either EE or ME. Mechatronics background is a plusDetail oriented, inquisitive, seek to solve everyday problems in innovative ways, focused on the smallest details that are meaningful to our customersProgram/Project management experience is a plusExperience with portable consumer electronics devices is a plusExperienced in setting up program/project schedules and work breakdown structures.Ability to travel internationally to support builds• BS EE/CE/ME degree required, MS desired.", "jobDescription": "Do you consider yourself a great organizer with good technical skills and have a passion for working across a diverse set of disciplines, building technology that will make a difference to drive innovation that matters! Our engineering program management group drives program/project development activities and discussions with an exceptionally diverse collection of personalities and ideas. As an iPhone HW EPM you will drive a cross-functional team of skilled Electrical and Mechanical engineers, and will use your solid EE/CE/ME background to recognize, assess and communicate cross-functional issues and risks. This will include planning, release and delivery of HW sub-systems like flexible printed circuit boards, development boards or printed circuit boards that are an integral part of iPhone system product development.\n\nDo you thrive as a communicator ready to work with cross-functionally hardworking engineers? Do you value exposure to diverse ideas and perspectives and look forward to intellectual debates/discussions to build great products? As a part of our group, you’ll establish relationships and participate in program related discussions across the company as you guide development activities across multiple disciplines.\n\nTogether with our team, you’ll continue to uphold and contribute to the Apple product development process and help deliver the world’s most successful portable consumer products!"}, "200460390": {"jobID": "200460390", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "iPhone Hardware Engineering Program Manager (HW EPM)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460390/iphone-hardware-engineering-program-manager-hw-epm?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS EE/CE/ME degree required, MS desired."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Minimum 4-5 years of industry experience.Excellent verbal and written interpersonal skills.Strong analytical and problem-solving skillsStrong technical background in either EE or ME. Mechatronics background is a plusDetail oriented, inquisitive, seek to solve everyday problems in innovative ways, focused on the smallest details that are meaningful to our customersProgram/Project management experience is a plusExperience with portable consumer electronics devices is a plusExperienced in setting up program/project schedules and work breakdown structures.Ability to travel internationally to support buildsBS EE/CE/ME degree required, MS desired.", "jobDescription": "Do you consider yourself a great organizer with good technical skills and have a passion for working across a diverse set of disciplines, building technology that will make a difference to drive innovation that matters! Our engineering program management group drives program/project development activities and discussions with an exceptionally diverse collection of personalities and ideas. As an iPhone HW EPM you will drive a cross-functional team of skilled Electrical and Mechanical engineers, and will use your solid EE/CE/ME background to recognize, assess and communicate cross-functional issues and risks. This will include planning, release and delivery of HW sub-systems like flexible printed circuit boards, development boards or printed circuit boards that are an integral part of iPhone system product development.\n\nDo you thrive as a communicator ready to work with cross-functionally hardworking engineers? Do you value exposure to diverse ideas and perspectives and look forward to intellectual debates/discussions to build great products? As a part of our group, you’ll establish relationships and participate in program related discussions across the company as you guide development activities across multiple disciplines.\n\nTogether with our team, you’ll continue to uphold and contribute to the Apple product development process and help deliver the world’s most successful portable consumer products!"}, "200460541": {"jobID": "200460541", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Paid Search Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460541/paid-search-specialist?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA degree required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$145,000,"}, "benefits": null, "requirements": "4+ years in a paid search marketing role, either agency or client-sideExpertise in paid search self-service platforms (i.e. Google Ads, SA360, Microsoft Ad Center)Expert level understanding of targeting/optimization levers & testing approaches across search buying platformsUnderstanding of the principles of PPC campaigns, digital marketing, web analytics, and SEO (familiarity with other digital media channels like programmatic and paid social)Strong understanding of performance-based media optimization and subscription marketingExpert understanding of marketing attribution & alternative measurement methodologiesAbility to build strategic tailored plans to reach target audiences and deliver media objectivesStrong data analysis, visualization and presentation skills; understanding of how to tailor communications to stakeholders with various levels of digital media literacyAbility to build close relationships within and across teamsA passion and curiosity for digital mediaExcellent social, oral and written communication skillsGoogle Ads Certification a plusConfirmed expertise and a dedication to continued education of the comprehensive landscape of paid search platforms and ad types.BS/BA degree required", "jobDescription": "At Apple, we know our ability to continue creating the world’s most innovative products depends on people who represent the variety of the human experience and who inspire us with great thinking. Because the broader the backgrounds and perspectives, the bigger the ideas.\n\nJoin a worldwide company that welcomes the whole wide world!\n\nImagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nThe Services Digital Advertising team at Apple drives new customer acquisition and cultivates awareness and education of Apple’s full suite of services, through a variety paid digital marketing channels.\n\nApple is in search of an experienced Paid Search Specialist to join the Apple Services Digital Marketing team."}, "200460955": {"jobID": "200460955", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Ad Trafficking Specialist - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460955/ad-trafficking-specialist-ad-platforms?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$94,000", "max": "$171,000"}, "benefits": null, "requirements": "Ad trafficking, ad scheduling & digital campaign management experience within Freewheel.Basic understanding of video ad serving technology.Proficiency in recognizing tracking issues through thoughtful and thorough QA.Incredibly detail-oriented and able to navigate grey areas effectively.Strong verbal, writing communication, organization and time management skills.Familiarity with Apple products and services, especially MacOS & iOS.Proven ability to complete repetitive tasks for extended periods.Able to navigate exposure to unusual, and sensitive content.Flexibility to work shifts that may include weekends.Bachelor's degree preferred.Join a worldwide company that welcomes the whole wide world.Our customers are all over the world, so it’s by design that Apple employees are all over the world, too. And we know our ability to continue creating the world’s most innovative products depends on people who represent the variety of the human experience and who inspire us with great thinking. Because the broader the backgrounds and perspectives, the bigger the ideas.At Apple, we’re not all the same. And that’s our greatest strength. We draw on the differences in who we are, what we’ve experienced, and how we think. Because to create products that serve everyone, we believe in including everyone.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.  \n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.  \n\nWe are looking for an experienced Ad Trafficking Quality Specialist to help us ensure the highest standards of advertising across the platform. We're looking for critical problem solvers who would like to play a key role in a fast-paced environment."}, "200457226": {"jobID": "200457226", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "AppleCare Business Intelligence Analyst", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457226/applecare-business-intelligence-analyst?team=CUST", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in Finance or a related field. MBA preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$188,000,"}, "benefits": null, "requirements": "Solid technical database knowledge (Teradata) and experience optimizing SQL queries on large dataData visualization experience in Tableau or similar toolAbility to retrieve, analyze, and manipulate large datasets; experience with Tableau, R, Alteryx, SQL, and/or Business ObjectsDeep understanding of financial principles and theoriesAdvanced Excel & modeling skillsAbility to work and make key decisions independentlyProven history of producing new tools to move the business forwardAbility to provide relevant business insights with dataExcellent presentation, communication and interpersonal skills, with solid attention to detailFinancial background preferredBachelors in Finance or a related field. MBA preferred.Domestic travel estimated to be 15% or more per year.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! \n\nDo you love thinking analytically? Are you passionate about using your knowledge to navigate complex challenges? Just as our customers love the simplicity of Apple products, you love creating elegant solutions to the thorniest problems. Join us, and you’ll have an important role in continuing Apple’s legacy of efficiency and success."}, "200465234": {"jobID": "200465234", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": " Senior Materials Engineer | Plastics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465234/%EF%A3%BF-senior-materials-engineer-plastics?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS Plastics Engineering / Chemical Engineering / Materials Science / Mechanical Engineering / Polymer Science / Chemistry"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Extensive work experience in plastics (base resins, compounds, additive packages...)Technical knowledge of injection molding, tool design, and compounding processesProficient in design for manufacturing practices for plastic partsFamiliarity with characterization techniques (DMA, tensile, rheology, TMA, DSC, etc)Strong analytical / creative problem-solving skills; ability to use statistical tools and techniquesTechnical project management experience leading a project from R&D to productionTrack record of material selection and development for products with demanding performance requirements and tight schedulesExcellent verbal, presentation, written communication and social skillsMS Plastics Engineering / Chemical Engineering / Materials Science / Mechanical Engineering / Polymer Science / ChemistryApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug- free workplace.", "jobDescription": "At Apple, extraordinary ideas have a way of quickly becoming extraordinary products, services and customer experiences. The mechanical integrity as well as the way our products look and feel to our customers is an essential aspect of what makes Apple products the best electronic devices in the world.\n\nOur Materials Engineering Product Design team is dedicated to developing new materials that influence and enable innovative enclosure designs across all Apple product lines year after year. We work with the utmost attention to detail, directly impacting the design of products that millions of people around the world love!\n\nWe are seeking a Senior Plastics Engineer to help take future iterations of Apple products to the next level. Could this be you?"}, "200456355": {"jobID": "200456355", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "RAN1/RAN4 Standards Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456355/ran1-ran4-standards-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10 + years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for candidates with in-depth knowledge on wireless communication system (OFDM/MIMO, etc.)A background in 3GPP standardization in RAN1 or RAN4 is a significant plus.Deep understanding of communication theory & signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, coding theory, etc.)Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.BS and 10 + years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our 5G standards team, you will demonstrate your physical layer system design expertise or your experience in standardization activities to chip in to groundbreaking wireless systems and algorithms that deliver more performance in our products than ever before. You’ll be part of an outstanding system engineering organization making technical contributions towards 4G and 5G specifications and providing support to modem system design. You will actively attend and participate in 3GPP (LTE and 5G-NR) meetings, conduct system simulations of PHY algorithms for a 5G multimode modem."}, "200459467": {"jobID": "200459467", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "AC/DC Design Engineer - Power Electronics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459467/ac-dc-design-engineer-power-electronics?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BSEE in power electronics with minimum 2 -3 years experience. MSEE preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Candidate must have hands-on experience of power supply design and demonstrate deep knowledge of offline conversion topologies including Flyback, PFC, resonant converters and analog/digital controls loops.Candidate must be intimately familiar with power supply safety and environmental certifications requirements, power controllers, components, magnetic design, power supply layout and state-of the art techniques for efficiency optimizations including no load/light load efficiency techniques.Strong analytical/problem solving skills and ability to guide critical decisionsMust be highly motivated, self-starter with a passion for innovation, integrity and attention to details.Ability to communicate and collaborate with multi-functional teams is very meaningfulProven record of working in fast paced innovative work environmentMust be willing to overseas travel as needed (approximately 10%)**PLUS:Must demonstrate good understanding of thermals, mechanical and packaging challenges.Must demonstrate knowledge of high volume manufacturing technologies and production varianceKnowledge of control theory and basic embedded systems is a plusPrior work experience in computer industry and/or power supply module companies is a plus-  BSEE in power electronics with minimum 2 -3 years experience. MSEE preferred.", "jobDescription": "An excellent opportunity to work on the forefront of power delivery designs and technologies with the outstanding company consistently bringing innovations in the industry. In this position, you will be part of developing innovative designs, which are implemented in products used by millions of people. The position involves innovative off-line power supply’s development for Apple’s next generation iOS, Macintosh and Home platforms spanning from, portables, desktop computers, workstation, Apple TV, HomePod and standalone displays."}, "200459378": {"jobID": "200459378", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "AC/DC Design Engineer - Power Electronics", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459378/ac-dc-design-engineer-power-electronics?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BSEE in power electronics with minimum 2 -3 years experience. MSEE preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Candidate must have hands-on experience of power supply design and demonstrate deep knowledge of offline conversion topologies including Flyback, PFC, resonant converters and  controls loops.Candidate must be intimately familiar with power supply safety and environmental certifications requirements, power controllers, components, magnetic design, power supply layout and state-of the art techniques for efficiency optimizations including no load/light load efficiency techniques.Strong analytical/problem solving skills and ability to guide critical decisionsMust be highly motivated, self-starter with a passion for innovation, integrity and attention to details.Ability to communicate and collaborate with multi-functional teamsProven record of working in fast paced work environmentMust be willing to overseas travel as needed (approximately 10%)**PLUS:Must demonstrate good understanding of thermals, mechanical and packaging challenges.Must demonstrate knowledge of high volume manufacturing technologies and production varianceKnowledge of control theory and basic embedded systems is a plusPrior work experience in consumer industry and/or power supply module companies is a plus-  BSEE in power electronics with minimum 2 -3 years experience. MSEE preferred.", "jobDescription": "An excellent opportunity to work on the forefront of power delivery designs and technologies with the outstanding company consistently bringing innovations in the industry. In this position, you will be part of developing groundbreaking designs, which are implemented in products used by millions of people. The position involves industry leading off-line power supply’s development for Apple’s next generation iOS, Macintosh and Home platforms spanning from, portables, desktop computers, workstation, Apple TV, HomePod and standalone displays."}, "200458546": {"jobID": "200458546", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Channel Sales - AppleCare, Beats, & Accessories", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458546/channel-sales-applecare-beats-accessories?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor's degree or equivalent experience required.\n- Master's Degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$103,000", "max": "$169,000,"}, "benefits": null, "requirements": "5+ years of proven experience in channel sales or business developmentExcellent communication skills with the ability to influence teams across internal and external organizations to achieve a larger objectiveOutstanding project management and organizational skillsSavvy learner with an analytical orientation, strategic vision, consensus building skills, and action-oriented styleAnalytical thinker with a can-do attitude and flexibility to accommodate to evolving business needs; Ability to thrive in a fast-paced, complex environmentIndependent and self-driven; Ability to excel with autonomy and ambiguity; Strong personal ethics, integrity, and trustAbility to partner and influence within Apple Retail cross-functional divisionsProficiency in Excel and KeynoteStrong quantitative and problem solving skills with ability to synthesize and distill large amounts of information/data into action plans- Bachelor's degree or equivalent experience required.\n- Master's Degree preferred.", "jobDescription": "The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nApple’s Sales organization generates the revenue needed to fuel our ongoing development of products and services. This, in turn, enriches the lives of hundreds of millions of people around the world. Our sales team is, in many ways, the face of Apple to our largest customers.\n\nWe are seeking a highly motivated individual to support the development and execution of Apple's direct strategy for AppleCare+ and Beats within the worldwide Channel Sales organization. In this role, you will partner with Retail Merchandising, Online, Geo Store Execution and other key retail teams to successfully build and scale best practice playbooks, grow the AppleCare+ attach rate, and elevate the customer experience. You will also partner with the Apple Online Store (AOS), Visual Merchandising and Product Merchandising teams to launch and scale Beats products, develop and implement quarterly promotional plans, and influence strategic merchandising solutions to grow the overall Direct share of business for Beats."}, "200451375": {"jobID": "200451375", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Timing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451375/timing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "The ideal candidate should have some prior experience in Physical Design on high PHY and/or SOC designs.Relevant knowledge about industry standards and practices in Timing closures, Physical Design, including Physically aware synthesis, Floor-planning, and Place & RouteRelevant experience in developing and implementing STA constraintsSolid Understanding of all aspects of Timing flow, Physical construction, Integration and Physical VerificationWorking Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixesPower user of industry standard Timing, Physical Design & Synthesis toolsSolid Understanding of scripting languages such as Perl/TclBS degree in technical discipline with minimum 3 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and outstandingly hardworking Timing Design Engineer. As a member of our multifaceted group, you will have the outstanding and phenomenal opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day.  In this role, you will be at the center of a PHY design effort collaborating with architecture, CAD, logic design teams, with a critical impact on delivering outstanding PHY designs. You will be directly involved in timing closure and/or physical designs of outstanding PHY design."}, "200451471": {"jobID": "200451471", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Circuits Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451471/circuits-physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for experienced applicants with strong understanding of the RTL2GDSII flow and concepts related to synthesis, place & route, CTS, timing convergence, layout closure.Familiar with development of block/partitions for silicon validation of foundation IPs.Familiar with ASIC integration flows, including power distribution, global signal planning, I/O planning and hard IP integration is highly desired.Familiar with tapeout of partitions and Verification Flows like LEQ, IR/EM, Timing and DFM closure is preferred.Hands-on experience with ECO implementation, both functional and timing closure is helpful.Familiar with DFT insertion, and multi-mode timing constraints is a strong plus.Strong scripting skills using Perl/Tcl.Strong written/verbal communication skills.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Physical Design Engineers. In this highly visible role, you will be at the heart of a processor design effort, working with foundation IP developers on silicon validation, making a critical impact delivering products to market quickly."}, "200458765": {"jobID": "200458765", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Timing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458765/timing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Preferred relevant experience in Physical Design experience on high PHY and/or SOC designsDeep knowledge of industry standards and practices in Timing closures, Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route Experience in developing and implementing STA constraintsDeep understanding of all aspects of Timing flow, Physical construction, Integration and Physical VerificationConfirmed knowledge of Basic SoC Architecture and HDL languages like Verilog to collaborate with our logic design team for timing fixesExperienced user of industry standard Timing, Physical Design and Synthesis toolsDeep Understanding of scripting languages such as Perl/TclBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and extraordinarily talented Timing Design Engineer. As a member of our multifaceted group, you will have the outstanding and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day.\n\nIn this role, you will be at the center of a PHY design effort collaborating with architecture, CAD, logic design teams, with a critical impact on delivering outstanding PHY designs. You will be directly involved in timing closure and/or physical designs of outstanding PHY design."}, "200451372": {"jobID": "200451372", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Timing Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451372/timing-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical subject area with minimum 10 years of meaningful experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Prefers extensive experience in Physical Design experience on high PHY and/or SOC designsDeep knowledge of industry standards and practices in Timing closures, Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route Experience in developing and implementing STA constraintsDeep understanding of all aspects of Timing flow, Physical construction, Integration and Physical VerificationConfirmed knowledge of Basic SoC Architecture and HDL languages like Verilog to collaborate with our logic design team for timing fixesShown experience in industry standard Timing, Physical Design and Synthesis toolsDeep Understanding of scripting languages such as Perl/TclBS degree in technical subject area with minimum 10 years of meaningful experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a results-oriented and outstandingly versatile Timing Design Engineer. As a member of our dynamic group, you will have the outstanding and exciting opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day.\n\nIn this role, you will be at the center of a PHY design effort collaborating with architecture, CAD, logic design teams, with a critical impact on delivering outstanding PHY designs. You will be directly involved in timing closure and/or physical designs of outstanding PHY design."}, "200453326": {"jobID": "200453326", "origin_search": null, "posted": "Jan 3, 2023", "jobTitle": "Manufacturing Design Program Manager (MDPM)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200453326/manufacturing-design-program-manager-mdpm?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree (Mechanical Engineering); MBA or equivalent (preferred)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "Extraordinary leadership abilities5+ years of professional experience (preferred)2+ years of program management experience with accomplishments in concept to market product developmentExcellent communication skills, both written and verbalExperience with consumer electronics devices (preferred)Experienced working with multi-disciplinary groups, driving schedule and tasksExperience leading team meetings/syncsAbility to lead without authority, foster trust, build credibilityAbility to travel internationallyAn understanding of high-volume manufacturing processes, operations management, and supply chain management.Self-motivated and enthusiastic with demonstrated critical thinking capabilitiesExperience presenting to executive level management on program status, recommendations, and prioritiesAbility to manage and prioritize multiple tasks and requestsBS degree (Mechanical Engineering); MBA or equivalent (preferred)", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThe Manufacturing Design Program Manager (MDPM) is responsible for managing and guiding development activities of highly skilled process development, operations, and quality teams within Apple’s Manufacturing Design group. The MDPM will lead the team to develop processes for building extraordinary products from existing and new ideas based on business needs. The MDPM should possess a blend of business and technical knowledge, allowing for big-picture vision and the ability to dive deep into specific challenges. MDPM team members operate autonomously, demonstrate strong leadership capabilities, and juggle competing priorities with ease."}, "200447416": {"jobID": "200447416", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447416/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 10+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200448170": {"jobID": "200448170", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448170/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 3+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200447413": {"jobID": "200447413", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447413/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 10+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200462322": {"jobID": "200462322", "origin_search": null, "posted": "Feb 11, 2023", "jobTitle": " Senior Coating Engineer | Materials PD", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462322/%EF%A3%BF-senior-coating-engineer-materials-pd?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS Chemical Engineering / Materials Science / Mechanical Engineering, PhD preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Extensive work experience in wet coatings (inks, photoresists…)Technical knowledge of pigments, dyes, resins, and other precursor materialsFamiliarity with chemical analysis methods (GCMS, TOF-SIMS, SEM, AFM, etc)Strong analytical / creative problem solving skills; ability to use statistical tools and techniquesTechnical project management experience leading a project from R&D to production.Excellent verbal, written communication and social skillsFlexibility and comfort working in a dynamic, fast-paced environmentMS Chemical Engineering / Materials Science / Mechanical Engineering, PhD preferredExperience working remotely with vendorsExperience working on multiple products/coatings on different development timelinesExperience with thin film coating systems for glass and plasticsExperience with high-quality cosmetic parts and finishes in high volumeTrack record of material selection and development for products with demanding performance requirementsApple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "At Apple, extraordinary ideas have a way of quickly becoming extraordinary products, services and customer experiences. The mechanical integrity and the way our products look and feel to our customers is an essential aspect of what makes Apple products the best electronic devices in the world. \n\nOur Materials Engineering Product Design team is dedicated to designing new materials that influence and enable innovative enclosure designs across all Apple product lines year after year. We work with the utmost attention to detail, directly impacting the design of products that millions of people around the world love!\n\nWe are seeking a Senior Coating Engineer to help take future iterations of Apple products to the next level. Could this be you?"}, "200450757": {"jobID": "200450757", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "Campus Leader - Ivy Tech Community College", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450757/campus-leader-ivy-tech-community-college?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Muncie", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450805": {"jobID": "200450805", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - University of Wisconsin, Madison", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450805/campus-leader-university-of-wisconsin-madison?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Madison", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450751": {"jobID": "200450751", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Campus Leader - Delaware State University", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450751/campus-leader-delaware-state-university?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Dover", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200450779": {"jobID": "200450779", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Campus Leader - Miles College", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450779/campus-leader-miles-college?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Fairfield", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Availability to work between 10 to 14 hours per week for the full term from May 2023 through May 2024Ability to work flexible hours and days, including weekends, throughout the school yearActively enrolled and taking classes at the school listed in the job title from May 2023 through May 2024Passion for how Apple technology can support multiple career pathways through coding or other creative outletsDedication to following program guidelines to protect brand integrityExcellent communication skills—written and verbal—including the ability to communicate with a virtual teamStrong formal presentation skillsAbility to inspire a team and grow engagement by influencing, motivating, and aligning with campus contacts to achieve strategic goalsAbility to self-motivate, overcome obstacles, work independently, while consistently reporting back on the programExcellent time-management, organization, planning, and implementation skillsAbility to adapt quickly and think creativelyHigh level of ethics, values, integrity, and trustKnowledge of Apple productsSales, leadership, and marketing experience is a plus", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nWhat does this mean? You have energy, dedication, passion, and the capabilities to help Apple transform education and improve the college experience. You take every experience as a learning opportunity and improve upon your technique for the next. \n\nYou’re not only passionate about representing the Apple brand but also very active in various student organizations and eager to plan events to enrich the lives of students, faculty, and staff.  You’re well-connected on campus and passionate about how technology can support student life in the classroom and beyond. As a natural leader, you pursue your passions and are inspired to fuel others to do the same."}, "200431178": {"jobID": "200431178", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Ad Trafficking Specialist - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431178/ad-trafficking-specialist-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$94,000", "max": "$171,000"}, "benefits": null, "requirements": "Ad trafficking, ad scheduling & digital campaign management experience within Freewheel.Basic understanding of video ad serving technology.Proficiency in recognizing tracking issues through thoughtful and thorough QA.Incredibly detail-oriented and able to navigate grey areas effectively.Strong verbal, writing communication, organization and time management skills.Familiarity with Apple products and services, especially MacOS & iOS.Proven ability to complete repetitive tasks for extended periods.Able to navigate exposure to unusual, and sensitive content.Flexibility to work shifts that may include weekends.Bachelor's degree preferred.Join a worldwide company that welcomes the whole wide world.Our customers are all over the world, so it’s by design that Apple employees are all over the world, too. And we know our ability to continue creating the world’s most innovative products depends on people who represent the variety of the human experience and who inspire us with great thinking. Because the broader the backgrounds and perspectives, the bigger the ideas.At Apple, we’re not all the same. And that’s our greatest strength. We draw on the differences in who we are, what we’ve experienced, and how we think. Because to create products that serve everyone, we believe in including everyone.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.\n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.\n\nWe are looking for an experienced Ad Trafficking Quality Specialist to help us ensure the highest standards of advertising across the platform. We're looking for critical problem solvers who would like to play a key role in a fast-paced environment."}, "200452466": {"jobID": "200452466", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "ASIC Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452466/asic-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Pre-silicon power modeling, analysis and power reduction experience. Proficient in PTPX, Power Artist or other power analysis tools. Full chip experience is a plusPost-silicon power correlation experience. Full chip experience is a plusGood understanding of Low Power ASIC logic design and UPF; Actual design experience is a plusGood understanding of ASIC physical design, timing closure; Actual implementation experience is a plusProficiency in scripting languages (Shell, Perl or Python).System architecture knowledge is a bonusBasic knowledge on wireless protocols, e.g., WiFi, BTBasic knowledge on common SOC components, e.g., CPU, fabric, peripherals and PCIeStrong problem solving and analytical skillsBS + 3 years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient / low power design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC/Power architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, Power modeling / correlation and FW/SW engineering. \nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. \nWill you join us and do the work of your life here?"}, "200449310": {"jobID": "200449310", "origin_search": null, "posted": "Feb 5, 2023", "jobTitle": "Cellular Lab Technician, Wireless", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449310/cellular-lab-technician-wireless?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree preferred, or five years of experience with cell sites and cellular test lab environments."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Extensive experience with RF spectrum analysis and signal modulation5 years of experience with cell sites and cellular test lab environments.Proficiency with RF test measurements and knowledge of fiber optic systemsStrong experience with radio access network equipment installations and leading cellular installation projectsExpertise with coaxial cabling, ability to terminate connectors, sweep and PIM test linesKnowledge and experience with wireless carrier networks including design, implementation, operation and maintenanceExperience in lab environments with knowledge of RF shielding enclosures and roomsAdept at using creative and innovative thinking to tackle problems and collaborating with business partnersBachelor's degree preferred, or five years of experience with cell sites and cellular test lab environments.", "jobDescription": "Come and join a global team of dedicated Wireless Technologies professionals who use our skills and expertise to ensure Apple's wireless facilities and test labs are at the forefront of new innovations. We are looking for a creative, practical and collaborative person with right skillset and experience to manage day to day activities in wireless test labs. At a high level, your role includes management of multiple concurrent cellular projects, direct management of subcontractors and the set up of test equipment labs for engineering teams. You will be an important member of a team solving technical challenges at Apple’s test labs!"}, "200459080": {"jobID": "200459080", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Power Integrity Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459080/power-integrity-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong EE fundamentals and problems solving skillsHigh level of knowledge in power integrity analysis (modeling, verification and correlation)Has experience in layout planning and routing strategies.Familiar with DC-DC regulator topologies, design principles, modeling and simulations.Ability to relate electrical performance to physical layoutHands-on experience in EM and circuit simulation tools: Ansys HFSS/Maxwell/SIWave, CST, ADS/Spice/Spectre, Cadence/Sigrity, scripting languages (Python, Perl)Hands-on experience in hardware board-level testing, validation, and with lab equipment (near field scanning, spectrum analyzers, VNAs, scopes)BS/MS EE or equivalent", "jobDescription": "The iPhone Hardware Engineering team is seeking a passionate Power Integrity Engineer. The ideal candidate will work with multi-functional teams to design, model, simulate and verify power distribution networks (PDN) for iPhones and iPads."}, "200447399": {"jobID": "200447399", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447399/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 10+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200448152": {"jobID": "200448152", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448152/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 3+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200448169": {"jobID": "200448169", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448169/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 3+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200462265": {"jobID": "200462265", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Ad Trafficking Specialist - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462265/ad-trafficking-specialist-ad-platforms?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$94,000", "max": "$171,000"}, "benefits": null, "requirements": "Ad trafficking, ad scheduling & digital campaign management experience within Freewheel.Basic understanding of video ad serving technology.Proficiency in recognizing tracking issues through thoughtful and thorough QA.Incredibly detail-oriented and able to navigate grey areas effectively.Strong verbal, writing communication, organization and time management skills.Familiarity with Apple products and services, especially MacOS & iOS.Proven ability to complete repetitive tasks for extended periods.Able to navigate exposure to unusual and sensitive content.Flexibility to work shifts that may include weekends.Bachelor's degree preferred.Join a worldwide company that welcomes the whole wide world.Our customers are all over the world, so it’s by design that Apple employees are all over the world, too. And we know our ability to continue creating the world’s most innovative products depends on people who represent the variety of the human experience and who inspire us with great thinking. Because the broader the backgrounds and perspectives, the bigger the ideas.At Apple, we’re not all the same. And that’s our greatest strength. We draw on the differences in who we are, what we’ve experienced, and how we think. Because to create products that serve everyone, we believe in including everyone.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.  \n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.  \n\nWe are looking for an experienced Ad Trafficking Quality Specialist to help us ensure the highest standards of advertising across the platform. We're looking for critical problem solvers who would like to play a key role in a fast-paced environment."}, "200447393": {"jobID": "200447393", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447393/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Melbourne", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 10+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200448182": {"jobID": "200448182", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448182/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Melbourne", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 3+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 3+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200447440": {"jobID": "200447440", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447440/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 10+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200447406": {"jobID": "200447406", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Physical Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447406/physical-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "- The ideal candidate will have deep design experience in high PHY and/or SOC designs- Deep Knowledge about industry standards and practices in Physical Design, including Physically aware synthesis, Floor-planning, and Place & Route- Experience in developing and implementing Power-grid and Clock specifications- Strong understanding of all aspects of Physical construction, Integration and Physical Verification- Shown Knowledge of Basic SoC Architecture and HDL languages like Verilog to be able with logic design team for timing fixes Power user of industry standard Physical Design & Synthesis tools- Deep Understanding of scripting languages such as Perl/Tcl, solid understanding of Extraction and STA methodology and tools- Deep Understanding of Physical Design Verification methodology to debug LVS/DRC issues at chip/block levelBachelors of Science in Electrical Engineering and 10+ years experience preferred", "jobDescription": "At Apple we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and unusually hardworking Physical Design Engineer. As a member of our wide-ranging group, you will have the rare and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day.  In this role, we will be at the center of a PHY design effort working with architecture, CAD, timing and logic design teams, with a critical impact on delivering outstanding PHY designs. You will be required to do physical designs of outstanding PHY design."}, "200447454": {"jobID": "200447454", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Analog IC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447454/analog-ic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's of Science in Electric Engineering with 10+ years of relevant experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Do you have a proven track record of taking chips to production in the following areas?Deep knowledge of ADC/DAC architectures and knowing which are suitable for given applicationsDeep knowledge of band-gaps, bias, op-amps, switched-cap circuits, LDOs, feedback and compensation techniquesProven expertise in the following areas:Significant knowledge of low noise design techniquesSignificant knowledge of high precision techniques in presence of device mismatchExperience in C / Matlab / Verilog modelingStrong device physics knowledge as it applies to analog IC designsProven working experience in using spectrum analyzers, oscilloscopes, signal generators, etc. to validate analog designsExtensive experience working with production test engineers to firm up test plans and design for testability detailsBachelor's of Science in Electric Engineering with 10+ years of relevant experience preferred", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented IC Designer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day."}, "200464621": {"jobID": "200464621", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Project Lead - Stategic Finance & Operations", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464621/project-lead-stategic-finance-operations?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA or equivalent in business or related field, MBA, CPA or CFA preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$125,000", "max": "$188,000,"}, "benefits": null, "requirements": "4+ years of client-facing finance experience required (e.g. Investment Banking, Consulting, Private Equity, Corporate Development, Restructuring, Big 4 Transaction Services);Thorough understanding of, and experience with, accounting, financial statement analysis, and financial projection modeling;Detailed knowledge of capital structure analysis, including causes of financial distress and potential restructuring solutions;Excellent verbal and written communication skills, with the ability to articulate complex financial data and concepts in a clear and effective manner;Highly motivated self-starter, with a proven ability to think strategically and drive change across a global organization;Strong project management skills, with a track record of successfully managing multiple, complex projects simultaneously; and,Bilingual Mandarin is a plus.BS/BA or equivalent in business or related field, MBA, CPA or CFA preferred", "jobDescription": "Apple’s Supplier Health team is responsible for solving strategic challenges that are critical to the success of the world’s most complex and dynamic global supply chain. On this team, you will leverage your financial expertise to address strategic situations such as (i) vendor selection and capacity investments to enable new product features and technologies, (ii) mitigation actions for vendors in severe financial distress or bankruptcy, and (iii) solutions for improving supply chain sustainability and carbon footprint. The team’s contributions make a direct impact on both enabling Apple’s product supply as well as minimizing our financial risk.\n\nWe are looking for a savvy professional with top-level finance talent to join our team as a Senior Project Lead - Strategic Finance & Operations. You will be directly responsible for end-to-end management of strategic supply chain projects, including engaging with cross-functional teams to assess strategic situations, performing due diligence with supplier executives, analyzing complex financial data, presenting recommendations to Apple executives, and executing on mitigation strategies.  \n\nThis is a highly visible role that requires not just deep financial expertise but also significant cross-functional team leadership and executive exposure. You should, therefore, have outstanding interpersonal, team building, and communication skills to drive tangible results within the organization. \n\nFinally, we seek someone who embodies what it means to be “Apple”. This person is fueled by a passion to do their life’s best work, thrives in a fast-paced, dynamic environment, and has the curiosity and drive to consistently deliver world-class results."}, "200450071": {"jobID": "200450071", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "SoC Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450071/soc-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Solid fundamentals in Verilog and System Verilog for verification.Basic knowledge of UVM methodology.Solid verification skills in problem solving and debugging.Experience with Constrained Random testing is a plus.Good understanding of overall verification flow.Knowledge of industry standard interfaces like 12C, UART, SPI.Understanding and usage of System Verilog Assertion (SVA)Programing experience in CExperience writing scripts in languages such as Perl or Python a plus.Should be great teammate with excellent communication skills and desire to take on diverse challenges.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\n\nThe SOC Verification Engineer will be responsible for pre-silicon RTL verification of block and top level SOC. With deep understanding of SOC architecture and meticulous attention to details, you will interact with all disciplines to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification."}, "200292970": {"jobID": "200292970", "origin_search": null, "posted": "Sep 28, 2021", "jobTitle": "Power Integrity Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200292970/power-integrity-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "-  BSEE/MSEE/Ph.D"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "3+years of experienceStrong EE fundamentals and problems solving skillsHigh level of knowledge in power integrity analysis (modeling, verification and correlation)Has experience in layout planning and routing strategies.Familiar with DC-DC regulator topologies, design principles, modeling and simulations.Ability to relate electrical performance to physical layoutHands-on experience in EM and circuit simulation tools: Ansys HFSS/Maxwell/SIWave, CST, ADS/Spice/Spectre, Cadence/Sigrity, scripting languages (Python, Perl)Hands-on experience in hardware board-level testing, validation, and with lab equipment (near field scanning, spectrum analyzers, VNAs, scopes)-  BSEE/MSEE/Ph.D", "jobDescription": "The iPhone Hardware Engineering team is seeking a passionate Power Integrity Engineer. The ideal candidate will work with multi-functional teams to design, model, simulate and verify power distribution networks (PDN) for iPhones and iPads."}, "200450907": {"jobID": "200450907", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "5G/4G Physical Layer Firmware Verification and Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450907/5g-4g-physical-layer-firmware-verification-and-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP physical layer and protocol stack procedures and configurationsExperience with firmware test plan and feature release planning for the 4G/5G functional and performance scenariosStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong validated understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesStrong analysis and debugging capabilities to be able to define issues and work with firmware development and systems design teams to close these issuesFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an outstanding modem team, you’ll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We’ll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a 5G/4G Physical Layer Firmware Verification and Integration Engineer, you will be at the center of the embedded 5G/4G/multimode cellular physical layer firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification and integration, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200450911": {"jobID": "200450911", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "5G/4G Physical Layer Firmware Verification and Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450911/5g-4g-physical-layer-firmware-verification-and-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP physical layer and protocol stack procedures and configurationsExperience with firmware test plan and feature release planning for the 4G/5G functional and performance scenariosStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong solid understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesStrong analysis and debugging capabilities to be able to define issues and work with firmware development and systems design teams to close these issuesFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We’ll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world! As a 5G/4G Physical Layer Firmware Verification and Integration Engineer, you will be at the center of the embedded 5G/4G/multimode cellular physical layer firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification and integration, that thrives in a wide-ranging multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200448265": {"jobID": "200448265", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "GPU Architect – Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448265/gpu-architect-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "You should have experience and knowledge of CPU or GPU architecture and micro-architecture concepts as well as deep expertise in one or more focused CPU/GPU areas. Areas could include ISA development, core/shader micro-architecture, geometry pipeline, rasterization, vertex/fragment/compute shading, texture pipeline, caching, or memory subsystem design.You will be setting direction thus you must be able to work in an environment of uncertainty and able to work through ambiguities.We believe that there is power in teams working together so you must have strong communication, influence, and negotiation skills.We are a data driven group and believe in the power of individuals proving their own ideas; therefore we prefer you have relevant hands on experience with RTL or architectural modelingProficiency in high performance, low power designsProficiency in VHDL/VerilogProficiency in C/C++Proficiency in scripting languages such as Perl, Python and RubyBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Do you love working on challenges that no one has solved yet? Join us to help deliver the next groundbreaking product containing an Apple designed GPU. As part of the GPU Micro-Architecture team, you’ll be responsible for defining a GPU that enriches the lives of millions of people every day."}, "200460391": {"jobID": "200460391", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "iPhone Product Design Engineering Project Mgr (PD EPM)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460391/iphone-product-design-engineering-project-mgr-pd-epm?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS ME degree or equivalent required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Excellent communication, organizational and leadership skillsAbility to filter and distill relevant information for the right audienceSelf motivated and proactive with demonstrated creative and critical thinking capabilitiesUnderstands and deals well with rapid development cycles; remains flexible and calm in the face of ambiguityDetailed knowledge of product development processes as well as a strong understanding of manufacturing processes.At least 2-4+ years of combined experience in project management and mechanical engineering delivering products comprised of multiple materials and high aesthetic quality.Experience collaborating with Operations, Mechanical Engineering/Design and MarketingBS ME degree or equivalent required", "jobDescription": "As an Engineering Project Manager within the Product Design organization you will be responsible for managing the development and implementation process for one of our iPhone Product Design teams.  In this role you will drive the day-to-day activities to meet the overall program objectives focusing on mechanical engineering design, development planning and validation cycles."}, "200394312": {"jobID": "200394312", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "AIML - Annotation Analyst, Hebrew Language", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200394312/aiml-annotation-analyst-hebrew-language?team=MLAI", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent work experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$23.00", "max": "$23.00."}, "benefits": null, "requirements": "Fluency in the Hebrew  language with excellent comprehension, grammar and proofreading skillsExcellent English reading comprehension and writing skillsHighly organized with strong attention to detailExcellent active listening skills with the ability to understand verbal nuancesUnderstanding of the regions and cultural variations where Hebrew is spokenDemonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialectAbility to independently navigate systems and toolsDemonstrates integrity and focuses on customer privacyExperience in content review or a similar environment, prior testing experience preferredDemonstrates flexibility and adaptability to changing work-flows and responsibilitiesGrows with a team where expertise is shared and feedback is welcomedExcels at working independently to make timely decisions and take appropriate actionsExperience as an end user of Siri, similar Intelligent Personal Assistants, or other AISuccessfully meets or exceeds targets, working within tight deadlinesAbility to identify business process solutions that increase efficienciesAbility to maintain focus and aim for high results through large volumes of tasksBachelors degree or equivalent work experience preferredAbility to work Monday- Friday from 9:00am-6:00pm local time; with scheduling and work flexibility based on business needsPositions with language skills require strong grammar and cultural awarenessSuccessful completion of a pre-employment assessment and background checkSuccessful completion of initial training and certification testing", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just craft products - they build the kind of wonder thatʼs revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send messages, play their favorite song or even take a selfie. The AIML team is passionate about technology with a focus on enriching the customer experience. We are looking for a motivated Annotation Analyst that demonstrates active listening, integrity, acute attention to detail, and is passionate about impacting our customer's experience.  \n\nBring passion and dedication to your job and there's no telling what you could accomplish."}, "200394317": {"jobID": "200394317", "origin_search": null, "posted": "Sep 12, 2022", "jobTitle": "AIML - Annotation Analyst, Arabic Language", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200394317/aiml-annotation-analyst-arabic-language?team=MLAI", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent work experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$23.00", "max": "$23.00."}, "benefits": null, "requirements": "Fluency in the Arabic language with excellent comprehension, grammar and proofreading skillsExcellent English reading comprehension and writing skillsHighly organized with strong attention to detailExcellent active listening skills with the ability to understand verbal nuances within the Gulf Region and Middle East Arabic dialects, including the variations across different provinces and territoriesDemonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialectAbility to independently navigate systems and toolsDemonstrates integrity and focuses on customer privacyExperience in content review or a similar environment, prior testing experience preferredDemonstrates flexibility and adaptability to changing work-flows and responsibilitiesGrows with a team where expertise is shared and feedback is welcomedExcels at working independently to make timely decisions and take appropriate actionsExperience as an end user of Siri, similar Intelligent Personal Assistants, or other AISuccessfully meets or exceeds targets, working within tight deadlinesAbility to identify business process solutions that increase efficienciesAbility to maintain focus and aim for high results through large volumes of tasksBachelors degree or equivalent work experience preferredAbility to work Monday- Friday from 9:00am-6:00pm local time; with scheduling and work flexibility based on business needsAble to meet minimum typing speed of 40 WPMPositions with language skills require strong grammar and cultural awarenessSuccessful completion of a pre-employment assessment and background checkSuccessful completion of training and certification testing", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just craft products - they build the kind of wonder thatʼs revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.   \n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send messages, play their favorite song or even take a selfie. The AIML team is passionate about technology with a focus on enriching the customer experience. We are looking for a motivated Annotation Analyst that demonstrates active listening, integrity, acute attention to detail, and is passionate about impacting our customer's experience. \n\nBring passion and dedication to your job and there's no telling what you could accomplish."}, "200437368": {"jobID": "200437368", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "AIML - Annotation Analyst, Brazilian Portuguese Language", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437368/aiml-annotation-analyst-brazilian-portuguese-language?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent work experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Fluency in the Brazilian Portuguese language with excellent comprehension, grammar and proofreading skillsExcellent English reading comprehension and writing skillsHighly organized with strong attention to detailExcellent active listening skills with the ability to understand verbal nuancesUnderstanding of the regions and cultural variations where Brazilian Portuguese is spokenDemonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialectAbility to independently navigate systems and toolsDemonstrates integrity and focuses on customer privacyExperience in content review or a similar environment, prior testing experience preferredDemonstrates flexibility and adaptability to changing work-flows and responsibilitiesGrows with a team where expertise is shared and feedback is welcomedExcels at working independently to make timely decisions and take appropriate actionsExperience as an end user of Siri, similar Intelligent Personal Assistants, or other AISuccessfully meets or exceeds targets, working within tight deadlinesAbility to identify business process solutions that increase efficienciesAbility to maintain focus and aim for high results through large volumes of tasksBachelors degree or equivalent work experience preferredAbility to work Monday- Friday from 9:00am-6:00pm local time; with scheduling and work flexibility based on business needsAble to meet minimum typing speed of 40 WPMPositions with language skills require strong grammar and cultural awarenessSuccessful completion of a pre-employment assessment and background checkSuccessful completion of training and certification testing", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just craft products - they build the kind of wonder thatʼs revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.   \n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send messages, play their favorite song or even take a selfie. The AIML team is passionate about technology with a focus on enriching the customer experience. We are looking for a motivated Annotation Analyst that demonstrates active listening, integrity, acute attention to detail, and is passionate about impacting our customer's experience. \n\nBring passion and dedication to your job and there's no telling what you could accomplish."}, "200394318": {"jobID": "200394318", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "AIML - Annotation Analyst, Arabic Language", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200394318/aiml-annotation-analyst-arabic-language?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent work experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Fluency in the Arabic language with excellent comprehension, grammar and proofreading skillsExcellent English reading comprehension and writing skillsHighly organized with strong attention to detailExcellent active listening skills with the ability to understand verbal nuances within the Gulf Region and Middle East Arabic dialects, including the variations across different provinces and territoriesDemonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialectAbility to independently navigate systems and toolsDemonstrates integrity and focuses on customer privacyExperience in content review or a similar environment, prior testing experience preferredDemonstrates flexibility and adaptability to changing work-flows and responsibilitiesGrows with a team where expertise is shared and feedback is welcomedExcels at working independently to make timely decisions and take appropriate actionsExperience as an end user of Siri, similar Intelligent Personal Assistants, or other AISuccessfully meets or exceeds targets, working within tight deadlinesAbility to identify business process solutions that increase efficienciesAbility to maintain focus and aim for high results through large volumes of tasksBachelors degree or equivalent work experience preferredAbility to work Monday- Friday from 9:00am-6:00pm local time; with scheduling and work flexibility based on business needsAble to meet minimum typing speed of 40 WPMPositions with language skills require strong grammar and cultural awarenessSuccessful completion of a pre-employment assessment and background checkSuccessful completion of training and certification testing", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just craft products - they build the kind of wonder thatʼs revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.   \n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send messages, play their favorite song or even take a selfie. The AIML team is passionate about technology with a focus on enriching the customer experience. We are looking for a motivated Annotation Analyst that demonstrates active listening, integrity, acute attention to detail, and is passionate about impacting our customer's experience. Bring passion and dedication to your job and there's no telling what you could accomplish."}, "200402380": {"jobID": "200402380", "origin_search": null, "posted": "Jul 18, 2022", "jobTitle": "AIML - Annotation Analyst, Spanish Language", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200402380/aiml-annotation-analyst-spanish-language?team=MLAI", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent work experience preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$23.00", "max": "$23.00."}, "benefits": null, "requirements": "Fluency in the Spanish language with excellent comprehension, grammar and proofreading skillsExcellent English reading comprehension and writing skillsHighly organized with strong attention to detailExcellent active listening skills with the ability to understand verbal nuancesUnderstanding of the regions and cultural variations where Spanish is spokenDemonstrates attention to detail and critical thinking skills in evaluation of Siri’s language usage and dialectAbility to independently navigate systems and toolsDemonstrates integrity and focuses on customer privacyExperience in content review or a similar environment, prior testing experience preferredDemonstrates flexibility and adaptability to changing work-flows and responsibilitiesGrows with a team where expertise is shared and feedback is welcomedExcels at working independently to make timely decisions and take appropriate actionsExperience as an end user of Siri, similar Intelligent Personal Assistants, or other AISuccessfully meets or exceeds targets, working within tight deadlinesAbility to identify business process solutions that increase efficienciesAbility to maintain focus and aim for high results through large volumes of tasksBachelors degree or equivalent work experience preferred.Ability to work Monday- Friday from 9:00am-6:00pm local time; with scheduling and work flexibility based on business needsPositions with language skills require strong grammar and cultural awarenessSuccessful completion of a pre-employment assessment and background checkSuccessful completion of initial training and certification testing", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. The people here at Apple don’t just craft products - they build the kind of wonder thatʼs revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nAre you interested in being part of a team that continues to innovate the way people and machines interact? The launch of Siri was a defining moment in the history of Artificial Intelligence. Siri offers a faster, easier way to get things done on your Apple devices, even before you ask. Millions of people now use Siri to send messages, play their favorite song or even take a selfie. The AIML team is passionate about technology with a focus on enriching the customer experience. We are looking for a motivated Annotation Analyst that demonstrates active listening, integrity, acute attention to detail, and is passionate about impacting our customer's experience. \n\nBring passion and dedication to your job and there's no telling what you could accomplish."}, "200450070": {"jobID": "200450070", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Sr. SoC Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450070/sr-soc-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.Expertise in HVL and HDL (SystemVerilog, Verilog).Advanced knowledge of HVL methodology (UVM/OVM/VMM).Solid verification skills in problem solving, constrained random testing, and debugging.Solid understanding of reusable verification framework.Knowledge of industry standard interfaces.Experience with System Verilog Assertion (SVA)Programing experience in CExperience writing scripts in languages such as Perl or Python a plus.Programming experience in C++ and assembly a plus.Experience defining coverage space and writing coverage model a plus.Experience with low power verification is a plusShould be a great teammate with excellent communication skills and the desire to take on diverse challenges.Knowledge of wireless protocols, such as, Bluetooth and WiFi are a plus.Experience with formal verification tool (JasperGold or others) is not required but will be a huge plus.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nThe SOC Verification Engineer will be responsible for pre-silicon RTL verification of block and top level SOC. With deep understanding of SOC architecture and meticulous attention to details, you will interact with all disciplines to develop reusable testbench and verification environment deploying the latest methodology with metric driven verification."}, "200446262": {"jobID": "200446262", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Commercial & Strategy Manager - Mechanical Enclosures", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446262/commercial-strategy-manager-mechanical-enclosures?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSME or BSIE, or equivalent. MBA a plus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$190,000,"}, "benefits": null, "requirements": "5+ years of experience in supply chain development, sourcing management and cost negotiationOutstanding analytical/negotiation skillsAbility to toggle between strategic and detail oriented thinkingTenacious problem solving & issue resolution skillsExcellent presentation and interpersonal skillsAbility to influence across multiple functional teamsFlexibility to adapt to dynamic and rapidly changing environmentsExcellent communicators, capable of working in multinational environments, driven and motivated by accomplishing extraordinary objectivesBSME or BSIE, or equivalent. MBA a plus.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nThe Commercial and Strategy Management (CSM) team is part of the Manufacturing Design Organization responsible for commercial strategy, negotiations, and cost management for mechanical enclosure components across Apple’s products. The CSM team enables new product features at lower costs, while continually driving competition in the existing and future supply chain. \n\nThe CSM team is responsible for commercial work that spans from new product supplier selection to sustaining cost management as well as total cost deals across multiple lines of business. We use our access to Apple’s entire enclosure book of business to strike creative and advantageous deals in the supply chain that help develop new supply chain partners and ensure balanced cost competition within the existing supply base. This requires developing and implementing innovative commercial strategies that can include world class auction and game theory techniques."}, "200463015": {"jobID": "200463015", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Apple Part Time Reseller Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463015/apple-part-time-reseller-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Nashua", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends,  24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200461437": {"jobID": "200461437", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Apple Part Time Reseller Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461437/apple-part-time-reseller-specialist?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Las Vegas", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills—you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.Native or fluent in a second major language preferred (Spanish).", "jobDescription": "As a Specialist in a reseller store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. You understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. Every day you’ll encounter unique opportunities to change lives and make a difference."}, "200461904": {"jobID": "200461904", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Apple Part Time Reseller Sales Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461904/apple-part-time-reseller-sales-specialist?team=APPST", "jobLocation": {"remote": "not specified", "city": "Omaha", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "High School Education is essential."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We welcome candidates from all backgrounds, with experience delivering an outstanding customer experience.You have a passion for Apple and eager to share that passion with others.Strong communication and listening skills that let you speak as freely and comfortably with small groups as with individual customers.Strong interest in connecting technology to customer needs, with a love for continuous learning about Apple products and features.You have excellent customer service skills that allow you to translate complex conversations into simple solutions.Detail oriented, self motivated, comfortable working in a fast paced environment.You are willing to embrace Apple’s unique style for service.You have strong people skills, you're empathic, a good listener, and compassionate.Able to work a schedule that includes evenings and weekends, 24 hours per week.High School Education is essential.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.", "jobDescription": "As a Specialist in a Reseller Store, you help build the energy and buzz around Apple products, suggesting the right solutions for getting products into our customers’ hands. \nYou understand that Apple is dedicated to delivering a customer experience that’s unlike any other. It starts with you discovering customers’ needs. You match those needs with the right products, and then with the support of your partner you help customers develop lifelong relationships with Apple. \nEvery day you’ll encounter unique opportunities to change lives and make a difference."}, "200450092": {"jobID": "200450092", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "PHY Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450092/phy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Verification experience of wireless/wired communication block/subsystem.Excellent knowledge and experience of ASIC verification flows including test bench development, constrained random testing, and code/functional coverage.Advanced knowledge of Verilog, SystemVerilog, UVM, and SystemVerilog Assertion.Experience of using Matlab/C reference model and bit-accurate verification a plus.Knowledge of wireless protocols such as Bluetooth, WLAN, or Zigbee a plus.Proficiency in shell and Perl scripting, Python skills a plus.Experience of Palladium/FPGA validation a plus.Should be a team player with excellent communication skills, self-motivated and well organized.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIn this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional wireless products to hundreds of millions of customers quickly."}, "200464884": {"jobID": "200464884", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Curation Editor, Social Media, Apple News", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464884/curation-editor-social-media-apple-news?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s or Master’s degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$118,500", "max": "$178,500,"}, "benefits": null, "requirements": "You have strong editorial judgment and excellent writing skills.You’ve developed and executed strategy on a variety of social-media platforms and have a keen sense of what works for each.You have experience with analyzing of breaking news and delivering clear, concise copy on deadline.You are fluent in data and analytics, and can responsibly incorporate user behavior into your editorial strategy.Bachelor’s or Master’s degree preferred-Select articles for featuring on social media and in newsletters, with an emphasis on quality, accuracy, and context.-Shape social-media strategy alongside key stakeholders.-Work with the Apple News design team on social-media deliverables and special-event coverage.-Write sharp and engaging copy in the Apple News voice. Work with editors to ensure your work meets all aspects of our house style and standards.-Work cross-functionally to support News projects and goals.", "jobDescription": "Apple News provides millions of users with trusted journalism from leading publishers around the globe. Editors at Apple News highlight the best and most engaging content across all platforms. You will make real-time decisions based on the day’s events, create content, write copy, and communicate directly with our publisher partners."}, "200446465": {"jobID": "200446465", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446465/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical subject area and minimum 3 years of meaningful experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid understanding of SystemVerilog test-bench language and UVMExperience developing scalable and portable test-benchesExperience with verification methodologies and tools such as simulators, waveform viewers, build and run automation, coverage collection, gate level simulationsExperience with serial protocols such as PCIe or USB Experience with IP verification methodology for IPs such as PHYs, PLLs etc.In lieu of UVM knowledge, C/C++ expert level knowledgeWorking knowledge with one of the scripting languages: Python, Perl, TCLProven experience in formal verification methodologyBS degree in technical subject area and minimum 3 years of meaningful experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an ambitious and outstandingly versatile design verification engineer. \n\nAs a member of our wide-ranging group, you will have the outstanding and great opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every day. We are looking for a Design Verification Engineer who will enable bug-free first silicon for IP designs. The responsibilities include all phases of pre-silicon verification including, establishing design verification methodology, and test-plan development. Additional responsibilities will include verification environment development, such as stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200440971": {"jobID": "200440971", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440971/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Melbourne", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Some working knowledge of SystemVerilog test-bench language and UVMExperience developing scalable and portable test-benchesExperience with verification methodologies and tools such as simulators, waveform viewers, build and run automation, coverage collection, gate level simulationsExperience with different DDR protocols including Low power versionShould have been in technical lead positionExperience with IP verification methodology for IPs such as PHYs, PLLs etc.Working knowledge of one of the scripting languages: Python, Perl, TCLBS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and unusually talented Design Verification Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.  Do your life’s best work here at Apple! This role is for a design verification engineer who will enable bug-free first silicon for the IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200456763": {"jobID": "200456763", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456763/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Prefers Bachelor of Science degree with meaningful experience or internships\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Deep knowledge of SystemVerilog and UVMDeep knowledge in developing scalable and portable test-benchesProven experience with verification methodologies and tools such as simulators, waveform viewersBuild and run automation, coverage collection, gate level simulationsSome UVM knowledge, C/C++ level knowledgeDeep experience with serial protocols such as PCIe or USB, parallel protocol such as DDRBasic knowledge of formal verification methodologySome experience with power-aware (UPF) or similar verification methodologyKnowledge of one of the scripting languages such as Python, Perl, TCLPrefers Bachelor of Science degree with meaningful experience or internships\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an outstandingly hardworking design verification engineer. As a member of our wide-ranging group, you will have the rare and extraordinary opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. \n\nThis role is for a digital-focused DV engineer who will enable us to produce fully functional first silicon for IP designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200460793": {"jobID": "200460793", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Simulations Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460793/simulations-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "•BSEE required, MS or Ph.D. preferred\n•Some experience with programming languages like Java, Ruby, Python, Perl or SQL"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "6-8 years of experience with EDA tools such as HFSS, Q3D, SIwave, PowerSI, PowerDC, HyperLynx and system design methodologies.A proven understanding of fundamentals of Signal and Power integrityThrives in a multifaceted work environment, independently and as part of a team with a go-getter attitude.Good knowledge of Simulation tools especially, Sigrity, HFSS and Keysight.Knowledge and understanding of training development and deliveryGood debugging ability for understanding the root cause of the issueExcellent verbal, written and interpersonal communication skillsKnowledge of Confluence is a plus•BSEE required, MS or Ph.D. preferred\n•Some experience with programming languages like Java, Ruby, Python, Perl or SQLNice to have:•Knowledge of Sprint development process•Knowledge of JIRA•Knowledge of PCB design", "jobDescription": "The ECAD Engineering Tools & Solutions Org is responsible for building best in class workflows for analysis and simulations of Apple Circuit board Designs. We develop new methods to analyze complex designs to enable the quality assessment of our products before manufacturing.\nWe are seeking a Simulations Engineer, who will be operating in a highly transparent multi-functional role and will be empowered to work with key Product team members to identify problem areas, optimization opportunities and generate requirements\n\nUsing detailed knowledge of the Systems Design process, the Engineer will specify, architect and develop solutions to improve the efficiency and productivity of the Apple system design teams. \nFinally, the individual will have the ability to set the technical direction for multi-functional teams as they strategically plan and tactically implement company-wide solutions.\n\nCome join us!"}, "200451367": {"jobID": "200451367", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451367/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep knowledge of SystemVerilog test-bench language and UVM Experience developing scalable and portable test-benches.Experience with verification methodologies and tools such as simulators, waveform viewers, build and run automation, coverage collection, gate level simulations.Experience with serial protocols such as PCIe or USB Experience with mixed signal verification methodology for IPs such as PHYs, PLLs etc.In lieu of UVM knowledge, C/C++ level knowledge.Deep knowledge of one of the scripting languages: Python, Perl, TCL.Deep knowledge of formal verification methodology.BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for an ambitious and exceptionally talented design verification engineer. As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.  \n\nWe are looking for a Design Verification Engineer who will enable bug-free first silicon for IP designs. The responsibilities include all phases of pre-silicon verification including, establishing design verification methodology, and test-plan development. Additional responsibilities will include verification environment development, such as stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200456339": {"jobID": "200456339", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "RAN1/RAN4 Standards Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456339/ran1-ran4-standards-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10 + years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "We are looking for candidates with in-depth knowledge on wireless communication system (OFDM/MIMO, etc.)A background in 3GPP standardization in RAN1 or RAN4 is a significant plus.Deep understanding of communication theory & signal processing related algorithms design (such as timing recovery, signal estimation and detection, automatic gain control, RF impairment estimation and correction, channel estimation, equalization, coding theory, etc.)Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.BS and 10 + years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, sensible people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our 5G standards team, you will demonstrate your physical layer system design expertise or your experience in standardization activities to chip in to groundbreaking wireless systems and algorithms that deliver more performance in our products than ever before. You’ll be part of an outstanding system engineering organization making technical contributions towards 4G and 5G specifications and providing support to modem system design. You will actively attend and participate in 3GPP (LTE and 5G-NR) meetings, conduct system simulations of PHY algorithms for a 5G multimode modem."}, "200458152": {"jobID": "200458152", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Graphics Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458152/graphics-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "We are looking for candidates with a minimum of BS + 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Expertise with Verilog, System Verilog, UVM/OVM.Expertise with various HDL simulators and waveform viewers like IES, VCS, DVE, Verdi.Proven experience with Perl, Shell scripting, Makefiles, TCL.Strong experience with low-level programming of complex computer systems in C, C++.Strong experience working under strict schedule deadlines with the ability to manage multiple priorities.Excellent communication skills and ability to collaborate.Strong knowledge of computer architecture; graphics architecture is a plus.Good experience with code repositories; Perforce.Extensive experience with constrained random verification process, functional and code coverage, assertion methodology.Extensive experience debugging complex design and environmental issues.We are looking for candidates with a minimum of BS + 10 years of relevant experience.", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nIn this highly visible role, you will be at the heart of the chip design effort collaborating with a variety of fields with critical impact in getting products to millions of customers quickly.\n\nThe Graphics Verification Engineer will be responsible for the pre-silicon RTL verification of blocks in low power embedded graphics cores. This includes deep understanding of the micro-architectural details of their block and how it works within the broader GPU design. A strong computer architecture background, preferably in graphics, and a solid foundation in verification methodology will be required to close testing coverage with high confidence."}, "200451545": {"jobID": "200451545", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Wireless System Automation Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451545/wireless-system-automation-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine, CA", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum qualification is BS+ 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "This is an individual technical contributor role that requires industry experience in integration, bringing up and productization of wireless communication systems.Understanding of communication theory and radio calibration algorithms (such as power control and RF impairment mitigation).Experience using and understanding of the theory of operation of lab equipment (spectrum analyzer, signal generator, network analyzer, power meter).Experience developing test automation including equipment drivers, debug tools, automation scripts, database interfaces, and reporting tools.Knowledge in existing wireless communication protocols: LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay, or Bluetooth/BLE.Extensive Experience with Python, Matlab, Shell scripting, and/or C/C++.Experience with automation infrastructure development (traceability, repeatability) and related tools (GIT, CI, database, reporting tools).Minimum qualification is BS+ 3 years of relevant experience.", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before."}, "200451388": {"jobID": "200451388", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CPU Gate Level Synthesis/Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451388/cpu-gate-level-synthesis-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceThe ideal candidate should possess CPU implementation and verification experienceDeep knowledge of RTL-to-gate formal verification tools (LEC) and debug techniques, low power structural verification tools (VCLP), and gate simulation and X-propagation debug (Xcelium)Working knowledge of synthesis tools and flows and Perl and TCL scriptingMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\t\nApple’s Silicon Engineering Group (SEG) is looking for a hardworking engineer for CPU gate level verification. In this role, the candidate would be part of Apple’s industry-leading CPU design team, working in a multi-functional role to design verification flows and ensure that our CPUs meet the highest standards for functional verification."}, "200450906": {"jobID": "200450906", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "5G/4G Physical Layer Firmware Verification and Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450906/5g-4g-physical-layer-firmware-verification-and-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceIn-depth understanding of 5G and 4G 3GPP physical layer and protocol stack procedures and configurationsExperience with firmware test plan and feature release planning for the 4G/5G functional and performance scenariosStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong validated understanding of multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesStrong analysis and debugging capabilities to be able to define issues and work with firmware development and systems design teams to close these issuesFundamental facility with build and source code control toolsVersatile to learn new architecture and frameworksExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an outstanding modem team, you’ll craft sophisticated powerful embedded firmware that deliver more performance in our products than ever before! We’ll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a 5G/4G Physical Layer Firmware Verification and Integration Engineer, you will be at the center of the embedded 5G/4G/multimode cellular physical layer firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification and integration, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200463311": {"jobID": "200463311", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "PRL - Support Operations Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463311/prl-support-operations-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "AA/AS degree or BA/BS plus 1-2 years of experience in a customer service/support environment, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Flexibility/adaptability as this position has a large range of tasks and changes with the team’s growth and organizational pivotsAbility to effectively manage remote team membersAbility to utilize tact, discretion and good judgement at all times, especially when exposed to sensitive or confidential materialDemonstrate discipline to work in rapid pace environments with many deadlines and changing requirementsExcellent verbal and written communication skills, with an ability to communicate at all levels of the organizationStrong computer skills, including proficiency in Apple products and programs such as iCal and Keynote (or MS equivalents)Skilled at relationship building and influencingAbility to analyze data and reporting to determine the root cause of quality or performance issues and make informed suggestions for improvementSelf-motivated to identify and investigate individual and organizational gaps and drive solutionsExceptional time management and prioritization skills, with great attention to detail.AA/AS degree or BA/BS plus 1-2 years of experience in a customer service/support environment, or equivalent experience.", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nWe are a dynamic group of people who specialize in manufacturing models, prototypes, and offer manufacturing / design solutions. Apple is seeking an enthusiastic leader to direct and grow support capabilities for the Product Realization Lab. They will specifically be responsible for direct management of our inventory and inspection teams, asset logistics, some day to day financial responsibilities, and general administrative support in our lab space."}, "200451233": {"jobID": "200451233", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451233/design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of confirmed experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep proven understanding of SystemVerilog test-bench language and UVMShown experience developing scalable and portable test-benchesValidated experience with verification methodologies and tools such as simulators, waveform viewers, build/run automation, coverage collection, gate level simulationsExperience with IP verification methodologySolid understanding of UVM knowledge, C/C++ knowledgeSignificant experience with DDR PHY or ControllerDeep knowledge of one of the scripting languages: Python, Perl, TCLDeep knowledge of formal verification methodologyBS degree in technical discipline with minimum 3 years of confirmed experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and unusually talented Design Verification Engineer. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Do your life’s best work here at Apple! This role is for a DV engineer who will enable bug-free first silicon for the IP Designs. The responsibilities include all phases of pre-silicon verification including but not limited to: establishing DV methodology, test-plan development, verification environment development including stimulus and checkers, test-writing, debug, coverage, sign-off for RTL freeze and tape-out."}, "200428055": {"jobID": "200428055", "origin_search": null, "posted": "Sep 21, 2022", "jobTitle": "Safety Product Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200428055/safety-product-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Bachelor of Science in Mechanical Engineering required\nMaster of Science preferred and/or PhD\nPhD/MS in Biomechanics / Biomedical Engineering is a bonus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You operate by first principles and are motivated by improving human outcomes4+ years of experience with applied biomechanics. Key experience includes prosthetics, helmets, crash, automotive safety, orthopedic implants or similar.Creative problem solver with experience in failure analysis, root cause investigation, and DOE creationThis job can only be done from inside Apple's corporate headquarters.2+ years of hands-on, detailed product design experience and have shipped a wearable deviceProficiency in 3D CAD (any modeling package)Experience integrating dynamic and/or non-linear FEM into designExperience with structural optimizationDeep knowledge of engineering materials and manufacturing processesExcellent communication habits; we value people who are inquisitive, who clearly state perspective once formed, and who are good humored.Detail orientated and capable of handling multiple assignments at onceExperience with human physiology and response to impact stimuliBachelor of Science in Mechanical Engineering required\nMaster of Science preferred and/or PhD\nPhD/MS in Biomechanics / Biomedical Engineering is a bonus", "jobDescription": "Mac… iPod… iPhone… iPad… WATCH… what’s next? We are a team of passionate engineers who are designing, prototyping, analyzing, and eventually launching the next new product category at Apple. Our goal is to ensure the highest quality product for our customers. As a Safety Product Designer on this team, you will use first principles and measurable outcomes to guide product architecture. Quantitative results will allow our team to set design specifications, de-risk novel features, and prove viability of creative solutions."}, "200420315": {"jobID": "200420315", "origin_search": null, "posted": "Sep 15, 2022", "jobTitle": "Product Designer, Tools", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420315/product-designer-tools?team=DESGN", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience designing all aspects of large-scale content management systems including content creation, editing, localizing, and publishing.A portfolio of work that showcases excellence in interaction design, visual design, and problem solving.Outstanding ability to communicate your ideas to designers, engineers, product managers, and leadership through story telling, visuals, and presentations.Able to work independently and in a team environment.5+ years of design experience with a focus on Web, iOS, and macOS interfaces.Ability to clearly communicate concepts and designs through sketches, wireframes, high fidelity comps, and prototypes, using Sketch, Figma, Photoshop, Keynote, and similar tools.Expertise documenting interaction details, visual design specifications, and QA of the implemented product.Experience in handling several complex projects simultaneously.Flexible and comfortable with ambiguity and change during a project.A passion for Apple, our products, and our customers is a must.", "jobDescription": "The media and services design team is looking for a product designer to design interfaces for internal tools. These tools are the platform that allows content experts within Apple to manage, modify, and publish services content. We are looking for an outstanding human interface designer who is passionate about user experience design and wants to shape the vast machinery behind the curtain that ultimately helps deliver content to millions."}, "200434387": {"jobID": "200434387", "origin_search": null, "posted": "Oct 18, 2022", "jobTitle": " MEMS Microphone Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434387/%EF%A3%BF-mems-microphone-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our engineers have degrees in Mechanical Engineering, Materials Science, or Acoustics, with an emphasis on sensors or volume manufacturing of micro-devices, but if you’ve followed a different path to expertise in Microphone Design, we still want to hear from you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$109,500", "max": "$207,000,"}, "benefits": null, "requirements": "2+ years of hands-on experience and proven track record in sensor hardware development or characterization. Direct experience with MEMS microphone preferred.Knowledge of mechanics, materials science, or acoustics and an interest in applying that knowledge to microphone packaging design and module assemblyCuriosity in reliability testing and failure analysis, including IPxExperience in MEMS sensor assembly and manufacturingFamiliarity with assembly techniques (solders, adhesives, etc.) and material interactions (chemical, thermal, mechanical susceptibilities)Exposure to semiconductor and MEMS backend processing is a bonusExcellent written and interpersonal skills to engage effectively with multi-disciplinary team membersMost of our engineers have degrees in Mechanical Engineering, Materials Science, or Acoustics, with an emphasis on sensors or volume manufacturing of micro-devices, but if you’ve followed a different path to expertise in Microphone Design, we still want to hear from you.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "At Apple, extraordinary ideas have a way of quickly becoming extraordinary products, services, and customer experiences. Sound is an essential and compelling facet of the customer experience. Apple has assembled an elite Acoustics team that enables our customers to experience music with delight, communicate with clarity, and enjoy elegant sound throughout our product line. In Apple Acoustics we work with the utmost attention to detail, directly impacting the design of products that millions of people around the world love!\n\nOur Microphone Engineering team helps drive microphone hardware design, validation, and problem-solving to minimize distracting audible noises and optimize sound quality across Apple product lines. We are a diverse team of acoustics, mechanics, electronics, physics, and MEMS experts; accomplished listeners, and creative problem solvers. We work closely with multi-functional teams on innovative solutions to complex engineering challenges. We are searching for a MEMS Microphone Module Engineer to support our ability to develop new microphone modules. Could this be you?"}, "200292929": {"jobID": "200292929", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Video Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200292929/video-quality-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Image Science, Color Science, CS/CE, or equivalent experience\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$104,000", "max": "$190,000"}, "benefits": null, "requirements": "Knowledge of subjective/objective image quality evaluationKnowledge of ISP pipeline and 3A evaluationStrong video photography skills and have an excellent sense of cinematographyExperience and proficiency in C or C++ or SwiftExperience and proficiency in MATLAB or PythonFocus on details and possess strong problem solving and analytical skillsExcellent written and verbal communication skills and ability to collaborate and work cross functionallyBS or MS in Image Science, Color Science, CS/CE, or equivalent experience\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "We are the Video Engineering Image Quality (VEIQ) team responsible for video quality on iPhone, iPad, and Mac products! We are seeking an outstanding Camera Video Quality Engineer who has good understanding of lab quality test automation and real world video quality verification to help us deliver the best camera video quality to the world."}}