{"200444209": {"jobID": "200444209", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Streaming Media Formats Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444209/streaming-media-formats-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Software development experience in CExcellent analytical, programming and debugging skillsExperience in working with industry standard media file formats (e.g., ISOBMFF) and implementing authoring support for such formats.BS or MS in CS/CE or equivalentNice to have but not required:Proficiency in multi-threaded developmentObject oriented programming skills in either C++, Objective-C, or SwiftKnowledge of existing audio, visual and caption format standards is a plus (MPEG-2 TS, MP4, WebM, CEA-608, WebVTT, etc)Knowledge of streaming media protocols: HTTP Live Streaming (HLS), DASH.Experience in developing AR/VR and immersive video streamingSolid understanding of media codecs, formats, transports and container protocols", "jobDescription": "Apple's Interactive Media Group (IMG) is looking for a creative and dedicated engineer with leadership skills to join our streaming media team. This technology powers the streaming media experiences on all of Apple’s platforms (iPhones/iPads, Apple TV, Apple Watch and macOS) by building on core technologies and frameworks such as Core Media, AVFoundation.   The Streaming Media engineering team is looking for a software engineer to work on designing and implementing support for next generation audio/visual media formats in our streaming stack. If you are passionate about solving complex problems with sophisticated and creative solutions, then this job maybe a flawless fit for you."}, "200449056": {"jobID": "200449056", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Performance and Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449056/graphics-performance-and-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We prefer to you have the following knowledge and skills.Strong C++ coding skillsKnowledge of computer architectureExperience in functionality modeling and/or performance modeling (event driven or cycle driven)Understanding of GPU micro-architecture is a big plusUnderstanding of Computer Graphics principles and modern Graphics APIs (e.g. DirectX, OpenGL, Vulkan, Metal) is a plusExperience in GPU Software development is a plusWe prefer that you exhibit excellent communication skills, demonstrate a sense of motivation and show a high level of organizationWe like people who are fast learners and are eager to solve technical challengesBS + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Hardware Technologies organization, you’ll help design our next-generation, high-performance, power-efficient graphics processor unit (GPU) and system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nIn this role, you are responsible for delivering high-quality functionality and performance model for GPUs under aggressive product schedule. You are also expected to provide feedbacks to the design, triage problems and recommend solutions. To achieve this, you will work closely with cross-functional teams in architecture, micro-architecture, validation and GPU software."}, "200200084": {"jobID": "200200084", "origin_search": null, "posted": "Mar 31, 2021", "jobTitle": "Senior Front End Web Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200200084/senior-front-end-web-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA in Computer Science, Computer Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "5+ years professional experience building responsive, user friendly web applicationsProficient understanding of base front end development technologies including HTML5/CSS3/JavaScriptSignificant experience with JavaScript frameworks and client side state management using React.js / ReduxStrong experience using best practices when working with REST APIsBuilding reusable components and front-end libraries for future useExperience in developing secure web applications and knowledge of application vulnerabilities such as Cross Site Scripting (XSS), Cross Site Request Forgery (CSRF) etc.Good communication and personal skills: ability to interact and work well with members of other functional groups in a project team and a strong sense of project ownershipBA in Computer Science, Computer Engineering or related field* Experience with 2D visualization libraries like D3 is a plus* Experience with 3D visualization technologies like Three.js and WebGL is a plus", "jobDescription": "The autonomous systems team is in search of a curious and innovative team player who is passionate about leveraging cutting edge web technology to deliver experiences that surpass user expectations. Our team works on many impactful web applications and services at Apple where quality and performance cannot be sacrificed."}, "200456747": {"jobID": "200456747", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Senior AR/VR Camera Driver Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456747/senior-ar-vr-camera-driver-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science or Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "10+ years low level software development experience on Mac OS X, Windows, Linux or Embedded systemConfirmed capability to proactively drive and close technical design/debug sessionsStellar multi-functional communication skillsProficient programming skills and knowledge of C/C++Excellent debugging and problem solving skillsAR/VR industrial/academic experiences is a bonusExperience in hardware/software co-simulation, and pre-silicon validation is a plusKnowledge of modern digital camera technologies, image sensors, and ISP pipelines is a plusStrong written and oral interpersonal skillsBS or MS in Computer Science or Electrical Engineering", "jobDescription": "Apple’s camera system receives rave reviews and is consistently considered the best smartphone camera out there. Imagine the impact you can make! A billion users will use the technologies you helped craft almost daily. Apple's Camera Drivers team is looking for an outstanding engineer to drive brand new next generation technologies for revolutionary Apple products. Are you passionate about working in a close knit team that collaborates multi-functionally with a liberating amount of autonomy? Apart from being an opportunity to do your life’s best work at Apple, this role will also enrich your work life experience by providing opportunities to develop strong communication and collaboration skills."}, "200404433": {"jobID": "200404433", "origin_search": null, "posted": "Jul 21, 2022", "jobTitle": "Sr. Tools and Automation Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200404433/sr-tools-and-automation-engineer-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent C/C++ and Python programming skills.Excellent software design, problem solving and debugging skills.Good understanding of macOS/Linux system development.Experience with building automation tools for hardware test/verification.Comfortable working with hardware.Objective-C/Swift application development is a plus.Javascript/Electron development is a plus.Experience with embedded systems is a plus.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmers. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmers that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. \u2028\u2028Apple benefits programmers vary by country and are subject to eligibility requirements.\u2028\u2028Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "As an engineer in the Special Projects Group, you will be part of a team building infrastructure and tools for exciting new technologies that will shape the future. We build product tools that enable control and testing of new hardware, tools for enhancing developer workflows, and automation pipelines for product development.\n\nYou will work in a startup-like environment where products are still being defined and developed, giving you the chance to influence some of the core tools used by the project. You will be part of every stage of development from concept to deployment.\n\nIf you're passionate about the user experience, want to be part of a group that works on very early stage products, have the opportunity to shape them, and enjoy crafting robust, scalable, and maintainable services, we may be the team for you!"}, "200462410": {"jobID": "200462410", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "ASIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462410/asic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree + 3 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Extensive Experience in SoC front-end ASIC RTL digital logic design using Verilog or System Verilog.Hands on experience in all aspects of the chip development process with proficiency in front end tools and methodologiesExperience writing specifications and converting them to designExperience with multiple clock domains and asynchronous interfacesExperience in low-power design techniques such as clock- and power-gating.Experience or knowledge of system architecture, CPU & IP Integration, and power and clock management designs is highly desirableExperience in front-end implementation tasks such as synthesis, timing, area/power analysis, linting, and logic equivalence checks.Ability to communicate effectively across all internal groupsFamiliarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB) a plusFamiliarity with security concepts is a plusFamiliarity with software and operating concepts a plusFamiliarity with scripting languages like Perl or Python or Tcl a plusBachelor's Degree + 3 Years of Experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Sophisticated, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next excellent Apple product. Do you enjoy working on challenges that no one has solved yet? As a member of our complex group, you will get the outstanding and rewarding opportunity to craft upcoming products that will delight and encourage millions of Apple’s customers every single day. Are you ready to join a team transforming hardware technology? We are searching for a dedicated engineer to join our exciting team of problem solvers."}, "200452902": {"jobID": "200452902", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452902/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong software skills in C/C++.Minimum requirement of 3 years relevant experienceFamiliarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is requiredExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is requiredExperience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 3 years relevant industry experience", "jobDescription": "Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200337379": {"jobID": "200337379", "origin_search": null, "posted": "Feb 25, 2022", "jobTitle": "Harness Lead - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200337379/harness-lead-spg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor of Engineering in Electrical Sciences with 3-5 years of experience.\n\nPREFERRED\nMaster of Science in Electrical Engineering.\nTest and report automation knowledge is preferred.\nExperience in various wiring techniques (twisted pair, twin-ax, coax, shielded, etc.)\nScripting experience (Python, Matlab) is a plus.\nSimulation software knowledge (HFSS, Labview etc.) is an added benefit."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proficient in connector and cable selection and implementation strategies. Knowledge of various interconnect protocols.Experience in connector design.Knowledge of SI, EMC, HV fundamentals and ability to understand and analyze data from data sheets and measurements.Define High speed, LV and HV wiring strategyCreate harness block diagrams, wiring diagrams and assembly diagramsHarness design for modules, test platform and buck needsWork with harness vendor to resolve manufacturing crisisWork with x-functional teams (SI, EMC, Power) to define harness strategyExperience in setting up electrical and mechanical tests to understand the performance of interconnects.Proficient with EE lab instruments and willingness to work in the lab for extended time.Perform various reliability inspections on connectors and cables to compare the performance against internal and industry spec.Capable of performing failure analysis to identify and rectify issues/ failures.Comfortable working independently in a fast paced environment involving multiple x-functional teams and vendors.International travel may be required.Bachelor of Engineering in Electrical Sciences with 3-5 years of experience.\n\nPREFERRED\nMaster of Science in Electrical Engineering.\nTest and report automation knowledge is preferred.\nExperience in various wiring techniques (twisted pair, twin-ax, coax, shielded, etc.)\nScripting experience (Python, Matlab) is a plus.\nSimulation software knowledge (HFSS, Labview etc.) is an added benefit.Apple's most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their loved ones in important ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programmes that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programmes vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "We are seeking an outgoing, enthusiastic EE lead for the Hardware Systems interconnects Team. This position entails owning system interconnect decisions and implementations with expertise in High voltage, Low Voltage and High Speed electrical interconnects.\n\nThe ideal candidate is someone with significant interconnect experience who is willing to work with cross-functional teams in defining interface requirements. Candidate will work with various electrical and mechanical engineers to identify solutions and keep other teams moving is crucial to success in this role. Developing strong credibility and rapport with other engineering and non-technical teams is also a must.\n\nResponsibility includes understanding the requirements (EE/ME/EMI/EMC etc) and select connector solution whether of-the-shelf or design in-house custom design. Candidate should have experience in defining and designing LV, HV and high speed harnessing - creating block diagram, wiring diagram and assembly drawings. Experience in harness manufacturing is a plus. Candidate will also characterize and make appropriate adjustments for interconnect performance under electrical, environmental & mechanical stresses.\n\nIf you're passionate and want to be part of a group that works on very early stage R&D, have the opportunity to shape them, and relish the opportunity to deliver the next amazing Apple technology, we may be the team for you!"}, "200322874": {"jobID": "200322874", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Senior Display Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200322874/senior-display-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Ph.D. in Optics, Physics, EE, ME, or M.S. with minimum 5 years of experience in related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven track record in product development or new technology bring upBuilt compelling prototypes that demonstrate the new technologiesDeep understanding of various display technologies, i.e. LCD, OLED, uLED, projectors, etc., optics fundamentals, and experience in prototyping and developing new display technologiesExperienced with optical modeling and a high-level programming languageStrong presentation and communication skillsStrong analytical, critical thinking and problem-solving skillsIndependent and highly motivated to drive resultsExperience in optical module and display system integration a plusPh.D. in Optics, Physics, EE, ME, or M.S. with minimum 5 years of experience in related field", "jobDescription": "Apple is looking for a world class senior display engineer to own the design, development and qualification activities of the next generation display technology and products. \n\nThis individual will serve as a focal point in managing new display technology development and drive the implementation of critical technology platforms to improve display performance, from design conception to hardware and experience prototyping, and to final products. You will involve in system modeling to assist in the design and validation. You will work with a diverse and multi-disciplinary group of highly hardworking colleagues. You will be a directly responsible individual and collaborate with multi-functional teams and suppliers to understand design tolerance and sensitivities, optimize system level performance base on critical metrics, and validate system designs through engineering builds and design of experiments.\n\nA successful candidate needs to be comfortable with new technology, flexible problem solver, meticulous attention to detail, highly independent & motivated to drive results. You should be able to tackle problems outside of your respective technical area, have strong presentation and communication skills, and can thrive in a highly dynamic, agile, multi-disciplinary and hands-on environment that values engineering excellence and innovation. You will be part of something big, come join us!!"}, "200458913": {"jobID": "200458913", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "CAD Engineer - PDV", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458913/cad-engineer-pdv?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 3 years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Previous industry experience in Silicon chip design flowsKnowledge in Calibre/ICV runset coding for DRC/LVS/ERC/MFILL is requiredTapeout support and chip level PDV debug experience is a plusKnowledge/scripting in programming languages such as Perl, Python, Tcl, Shell, Makefile or C.Understanding in Silicon technology and experience with flow development in advanced nodesMinimum requirement of BS + 3 years of relevant industry experience.", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAs a member of our CAD team, you will architect, develop, maintain and improve physical design verification (PDV) flows. The role requires you to work on flow and run set development for various technology nodes and tool sets. Working alongside the CAD team, you will have the opportunity to learn and collaborate with the custom digital/analog/mixed-signal design, physical design (PD) and chip integration teams. You will need to have experience with design rule checks (DRC) and layout versus schematic (LVS) runsets, writing from scratch and/or modify existing ones. Knowledge with Dummy Metal Fill generation and Design for Manufacturability (DFM) rules is a plus."}, "200451767": {"jobID": "200451767", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CPU Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451767/cpu-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceYou should have experience in CPU performance architecture, micro-architecture design, or performance analysisStrong CPU architecture knowledge, micro-architecture knowledge, and an understanding of competing architecturesExperience working in a performance modeling environmentProficient in C and C++Proficient in scripting languages such as Perl, Python, and RubyAbility to problem solve and prove your own ideasKnowledge and experience with common performance benchmarks and workloadsKnowledge of OS internals and compiler technology a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200454942": {"jobID": "200454942", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "CPU Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200454942/cpu-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceYou should have experience in CPU performance architecture, micro-architecture design, or performance analysisStrong CPU architecture knowledge, micro-architecture knowledge, and an understanding of competing architecturesExperience working in a performance modeling environmentProficient in C and C++Proficient in scripting languages such as Perl, Python, and RubyAbility to problem solve and prove your own ideasKnowledge and experience with common performance benchmarks and workloadsKnowledge of OS internals and compiler technology a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it! Join us to help deliver the next groundbreaking Apple product. \n\nIn this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting functional products to millions of customers quickly."}, "200431468": {"jobID": "200431468", "origin_search": null, "posted": "Sep 30, 2022", "jobTitle": "Modem System Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431468/modem-system-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors/Master Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands on experience in Wireless System Testing, Certification, IOT and/or Cellular System Performance.Solid experience of 5G NR PHY/MAC and higher layer control and user planesExperience in defining, developing and validating cellular modem system test cases for mobile devices using popular test development platforms.Good understanding of mmWave challenges and 5G Standalone protocolStrong understanding of 3GPP specifications (LTE & NR Air Interface, PHY, MAC, RLC, RRC, PDCP and NAS layer).Broad spectrum of knowledge and understanding of the end-to-end wireless system architecture from wireless physical layer all the way to application layer.Consistent track record to independently lead a complete area of technology and drive product quality.Attention to the smallest details that are significant to customersKnowledge in Test Automation and Scripting skills using PythonBachelors/Master Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems team and be part of an outstanding group of engineers, working to drive innovation and develop products used by millions worldwide We build and seamlessly integrate technologies that enriches peoples' lives and deliver the best user-experience. \n\nOur team is looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Multifaceted, encouraging and innovative people who build industry-defining technologies are the norm at Apple. \n\nIf you're passionate about building technology that will make a difference, we may have the job for you!"}, "200448034": {"jobID": "200448034", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "Materials Engineer - Packaging PD", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448034/materials-engineer-packaging-pd?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "- MS or PhD with 3+ years of industry experience in Material Science & Engineering, Polymer Science, Fiber Science, Chemical Engineering, Mechanical Engineering with an emphasis in Materials, Process Engineering, Packaging or related fields."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "In-depth expertise in material science, structure-property relationships, and characterization of material performance for structural and cosmetic applications, in quantitative termsExperience working with cross functional groups to drive material selection and developmentEffective in leading multiple development projects simultaneously with overseas vendors to achieve high standards and meet fast-paced schedulesEffective communication skills. Specifically, you are able to explain complex issues to a variety of audiences, are able to think about the big picture when communicating, and can summarize technical details succinctly.Experience with material processing, testing and developing materials for large-scale manufacturing is preferredExperience with paper, fiber, or bio-based materials is preferred.- MS or PhD with 3+ years of industry experience in Material Science & Engineering, Polymer Science, Fiber Science, Chemical Engineering, Mechanical Engineering with an emphasis in Materials, Process Engineering, Packaging or related fields.", "jobDescription": "When was the last time you enjoyed a box as much as the product inside? At Apple, every customer interaction is an opportunity for surprise and delight! This philosophy extends beyond the product to its packaging, where every detail is thoughtfully considered.\n\nThe Packaging PD team is a diverse group of people responsible for the design and execution of structural packaging for all Apple products - from shippers to finished goods boxes. Our packaging delivers an outstanding customer experience, while protecting products throughout the shipping environment, and advancing Apple’s sustainability goals. We collaborate with a wide range of teams including Industrial Design, Marketing, Environmental, Operations and many others during the design process.\n\nWe are seeking someone who approaches problem solving with passion, creativity, and curiosity. Apple’s approach to packaging is unique, so we value people who are eager to learn new skills and further improve their knowledge of packaging design, manufacturing processes, and sustainable materials. We welcome fresh influences from outside the standard packaging industry to promote innovation in creative ways.\n\nThe Packaging Materials team collaborates with a wide range of partners to develop the highest quality materials with careful consideration of environmental impact. The position requires you to drive strategic next generation materials, engage in hands-on project-based work, and establish key material supplier relationships with a sharp focus on material and process sustainability."}, "200336058": {"jobID": "200336058", "origin_search": null, "posted": "Feb 4, 2022", "jobTitle": "Wireless Bluetooth Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200336058/wireless-bluetooth-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Bluetooth experience preferred, not requiredVery strong C++, C, Objective-C, or SwiftSelf-motivated and dedicated with validated creative and critical thinking capabilitiesThrive in a collaborative environment and can clearly communicate while authoritatively driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to pursue everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersBachelors Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "jobDescription": "Join our Wireless Software Engineering team and drive innovation that matters! We craft and seamlessly integrate technologies that enrich people’s lives such as exposure notifications for covid-19, audio, gaming, fitness, and more; all while delivering the best user-experience. If you're a strong software engineer and are passionate about building awesome Bluetooth solutions, we may have the job for you. The Core Bluetooth team is looking for a motivated software engineer to design, implement, and maintain next generation personal connectivity solutions. You are responsible for crafting and developing world changing wireless protocols such as exposure notifications on the very latest Apple products."}, "200169799": {"jobID": "200169799", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Product Design FEA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200169799/product-design-fea-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS in Mechanical Engineering, Applied Mechanics, or similar, MS/PhD preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Thorough knowledge of Solid Mechanics and Strength of MaterialsPassion for creating innovative, high quality productsOutstanding written and verbal communication skillsDesire to work in a fast-paced environmentBS in Mechanical Engineering, Applied Mechanics, or similar, MS/PhD preferredAdditional Experience in any or all of the following areas would be preferred:- Static and dynamic finite element analysis (ideally in handheld/portable/wearable electronic products)- FEA software such as Abaqus or similar- Good modeling practices including model validation techniques- Failure modeling of different classes of materials- Testing including methods using Digital Image Correlation, Universal Testing Machines, and Dynamic Mechanical Analysis", "jobDescription": "Help Apple grow the product structural analysis team for iPad, iPhone, Mac, Watch, and many other Apple products. We are responsible for FEA modeling, engineering analysis, & material characterization, along with verification and validation of mechanical simulation models."}, "200451954": {"jobID": "200451954", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Analog IC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451954/analog-ic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's of Science in Electric Engineering with 10+ years of relevant experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  The ideal candidate should have deep understanding of analog/mixed-signal design-  Solid understanding and expertise in crafting analog/mixed-signal circuit blocks including ADCs, DACs, PLLs, DLLs, filters, bandgap, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits and oscillators-  In-depth knowledge of analog mixed-signal concepts like mismatch mitigation, linearity, stability, low-power and low-noise techniques-  Experience with high-speed digital circuits (e.g., serializer, de-serializer, counters, dividers, etc.)-  Design experience in sophisticated CMOS technologies, design with FinFet technology-  Hands-on experience with AMS IC development from definition to high-volume production including layout supervision, bench evaluation, correlation, and characterization-  Experience in lab testing of mixed-signal circuits and experience in using spectrum analyzers, oscilloscopes, signal generators, etc. to validate analog designs-  Able to build VerilogA/AMS behavioral models, analyze and lead characterization data from lab and volume testingBachelor's of Science in Electric Engineering with 10+ years of relevant experience preferred", "jobDescription": "In this role, you will actively work within the Analog/Mixed-Signal team to design and deliver hard IPs to Apple’s products. We have an opportunity for a forward-thinking analog/mixed-signal engineer with background in high-speed data converters, clocking circuitry and analog filters. As a member of our team, you will have the rare and exciting ability to work on upcoming products that will surprise and delight millions of Apple’s customers!\n\nAt Apple, we work every single day to craft products that enrich people’s lives. We love working on challenges that no one has solved yet. Do you have strong fundamentals and enjoy solving technical challenges? Are you passionate about learning new skills and improving the value of your work? This role offers all of this while offering a strong culture where you drive your own career!"}, "200425952": {"jobID": "200425952", "origin_search": null, "posted": "Sep 16, 2022", "jobTitle": "Senior Software Engineer, Autonomous Systems - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425952/senior-software-engineer-autonomous-systems-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "• A minimum of a BS in Computer Science or related fields.\n• 10+ years of experience on working on production software in scientific and numerical domains."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proficient in C++ and Python. Language-agile.Experience with building production code.Strong understanding of scientific and numerical programming in domains such as robotics, controls, computer graphics.Familiarity with code developer workflows and tooling.Strong interest in engineering problem solving.• A minimum of a BS in Computer Science or related fields.\n• 10+ years of experience on working on production software in scientific and numerical domains.", "jobDescription": "Apple SPG (Special Projects Group) is seeking an experienced software engineer to work on developing and implementing high-quality software for autonomous systems. Our organization is engaged in conducting world-changing research that requires the development of novel algorithms that need to run in real-time."}, "200434777": {"jobID": "200434777", "origin_search": null, "posted": "Dec 1, 2022", "jobTitle": "Software Engineer, System Services & Daemons", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434777/software-engineer-system-services-daemons?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Expert level C, exposure to Objective-CExperience with daemon and library developmentCreative, critical thinking and troubleshooting skillsExcellent collaborative skillsExceptional professionalism, with the ability to deliver solid work on tight schedulesExcellent written and verbal communicationA genuine passion for consumer devicesB.S. in Computer Science or equivalent experienceAdditional Success Factors:Development experience on macOS and/or iOSExperience with common embedded hardware architectures Familiar with cryptographic concepts and techniquesFamiliar with open source technologies and development communitiesFamiliar with Xcode", "jobDescription": "Are you a big-picture thinker who loves setting high-reaching goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole! That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, comprehensive user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Core OS organization is seeking an extraordinary engineer to work on state-of-the art technology for macOS, iOS, tvOS and watchOS. You should have a strong understanding of operating system fundamentals and experience working throughout the stack. As a member of the team, you would participate in all stages of software development, from new feature design and implementation, to maintenance and bug fixing of released code. You will develop and improve unit tests and performance tests, and may also work on diagnosing and resolving customer reported issues."}, "200448279": {"jobID": "200448279", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Wireless Systems Engineer - GNSS", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448279/wireless-systems-engineer-gnss?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 10+ years relevant experience required. MS/PHD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficiency in GNSS 3GPP and carrier RF requirements and implications to device and test equipment architectures, and performance tradeoffsDirect hands-on experience and proficient knowledge of underlying theory and techniques used in of GNSS technologyProficiency in GNSS transceiver, RF front-end architectures and performance tradeoffsProficiency in system-level RF parametric its sources in RF component characteristics and behaviorDirect hands-on system-level debug and optimization experience on RF conducted characteristicsDeep knowledge of test set-ups of sophisticated RF test equipment for hardware validationExperience in characterizing and validating devices towards industry RF standards using RF lab test equipment (e.g. Call box, Power meter, Network analyzer, Spectrum analyzer, signal generator, etc.)Proficiency in device certification processes on at least one of industry certification (e.g. GCF, PTCRB, etc.) and Carrier conformance (e.g. ATT, Verizon, etc.)Experience with entire product development cycle of GNSS capable mobile handsetsStrong written and verbal communication skillsBS with 10+ years relevant experience required. MS/PHD preferred.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work on integration of Global Navigation Satellite Systems (GNSS) technologies into Apple’s wireless products."}, "200378935": {"jobID": "200378935", "origin_search": null, "posted": "May 26, 2022", "jobTitle": "Senior Engineering Manager, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200378935/senior-engineering-manager-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Science or equivalent is required Master's degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$343,500,"}, "benefits": null, "requirements": "10 or more years of industry experience building scalable micro services and data driven platforms.5+ years management experience.Expertise in object oriented software development with a deep understanding of scalable distributed systems like Cassandra, Solr, Kafka, Spark and/or Hadoop.Experience building AI/ML Platforms and A/B Testing is helpful.Experience building and scaling systems both on premise and the cloud. Experience architecting for a hybrid cloud environment is helpful.Strong technical leadership skill, proven experience architecting, developing and deploying internet-scale, distributed and critical services.Experience working on complex problems and systems where scalability and performance are very meaningful (every millisecond counts).Strong problem solving and debugging skills are required. Ability to communicate effectively, both written and verbal, with technical and non-technical multi-functional teams.Results oriented and deadline driven.A desire to work in a fast-paced and challenging work environment.Prior experience in advertising industry is a huge plus.Bachelor's degree in Computer Science or equivalent is required Master's degree preferred", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy."}, "200466582": {"jobID": "200466582", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Systems Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466582/systems-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in EE or equivalent, preferably specializing in audio/acoustics"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of overall experience in advanced acoustics engineering design and finite element analysis development with hands-on testing of consumer productsDetailed understanding of audio signal processing to fuse signal processing algorithms to acoustics.Ability to manage parallel projects in all phases; conceptual, design to mass production in a rapid manner.Proficiency in analytical tools for failure / statistical analysis and finite element analysis, tools such as JMP, MiniTab, Excel, COMSOL, ANSYSExperience with debugging issues in audio systems (both hands-on and analyzing data).Skilled in acoustic test equipment setup and testing e.g. Soundcheck or Audio PrecisionFamiliarity with some form of scripting (Matlab, Python.)Solid data analysis, manipulation, summary and presentation skillsCurious with a high personal driveListening skill and passion in diagnosing problems and overall improving sound qualityBS/MS in EE or equivalent, preferably specializing in audio/acoustics", "jobDescription": "At Apple, new ideas have a quick way of becoming extraordinary products, services and customer experiences. Sound is an essential and compelling facet of the customer experience - Beats has assembled a world-class Acoustics team that enables our customers to experience music with delight, communicate with clarity and appreciate our products without disturbance from noise.\n\nThe Systems Validation Engineer is responsible for the system validation and measurement of audio technologies for key Apple audio Products from design to production. The candidate, as part of the Beats Validation team, will support designing and analysis of products. The candidate will have the right combination of Acoustics, simulation, scripting skills and personal drive to conduct and take ownership of the system level validation and at the same time develop new approaches for analysis."}, "200458882": {"jobID": "200458882", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "CAD Engineer - PDV", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458882/cad-engineer-pdv?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Previous industry experience in Silicon chip design flowsKnowledge in Calibre/ICV runset coding for DRC/LVS/ERC/MFILL is requiredTapeout support and chip level PDV debug experience is a plusKnowledge/scripting in programming languages such as Perl, Python, Tcl, Shell, Makefile or C.Understanding in Silicon technology and experience with flow development in advanced nodesMinimum requirements of BS + 3 years of relevant industry experience", "jobDescription": "Do you love building elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nAs a member of our CAD team, you will architect, develop, maintain and improve physical design verification (PDV) flows. The role requires you to work on flow and runset development for various technology nodes and tool sets. Working alongside the CAD team, you will have the opportunity to learn and collaborate with the custom digital/analog/mixed-signal design, physical design (PD) and chip integration teams. You will need to have experience with design rule checks (DRC) and layout versus schematic (LVS) runsets, writing from scratch and/or modify existing ones. Knowledge with Dummy Metal Fill generation and Design for Manufacturability (DFM) rules is a plus."}, "200416397": {"jobID": "200416397", "origin_search": null, "posted": "Aug 22, 2022", "jobTitle": "iOS and macOS SW Application Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200416397/ios-and-macos-sw-application-program-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "3 - 5+ years experience as a technical software Project or Program ManagerStrong understanding of and experience in managing complex, multi-functional software projectsStrong technical understanding of operating systems and how the various layers in the software stack fit togetherExcellent spoken and written communication with the ability to tailor communication style to multiple audiencesProven track record in defining processes and executing on themSelf-motivated and enthusiastic with demonstrated creative and critical thinking capabilitiesHas a deeply curious mindset about new ideasExcellent attention to detail and highly organizedAbility to build relationships and influence othersBS in Computer Science or related field, preferred.", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we strive to achieve will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. Do you have a passion for creating ground-breaking, impactful features that surprise and delight millions of users? Do you enjoy solving challenging problems in a fast-paced, dynamic environment where you’ll work with many different teams across Apple? If so, we are looking for a Software Engineering Project Manager to join our team and help us innovate and take the most advanced operating systems to the next level!"}, "200451974": {"jobID": "200451974", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal IP Post Silicon Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451974/analog-mixed-signal-ip-post-silicon-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n3 years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in AMS test development that includes: review specification document; draft validation plan; build test bench; and perform data collection with automationStrong fundamental understanding of analog & mixed signal circuitry in one or more of the following domains: PLL, Data Converter, DDR Memory, Temp Sensor, etc.Proficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, etc.Experienced in scripting language, Python preferred, to automate test and analyze dataDiligent & Emphasis on quality of resultsInitiative in taking ownership & responsibility to drive deliverablesStrong verbal and written communication skillsHands-on lab experience including soldering/instrumenting systems is a plusBachelors Degree\n3 years of industry experience \n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200465922": {"jobID": "200465922", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Analog Mixed Signal IP Post Silicon Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465922/analog-mixed-signal-ip-post-silicon-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE is required\nMinimum 20 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$309,500,"}, "benefits": null, "requirements": "Experience in AMS test development that includes: review specification document; draft validation plan; build test bench; and perform data collection with automationStrong fundamental understanding of analog & mixed signal circuitry in one or more of the following domains: PLL, Data Converter, DDR Memory, Temp Sensor, etc.Proficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, etc.Experienced in scripting language, Python preferred, to automate test and analyze dataDiligent & Emphasis on quality of resultsInitiative in taking ownership & responsibility to drive deliverablesStrong verbal and written communication skillsHands-on lab experience including soldering/instrumenting systems is a plusBSEE is required\nMinimum 20 years of industry experience", "jobDescription": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!"}, "200452892": {"jobID": "200452892", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452892/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong software skills in C/C++.Minimum requirement of 3 years relevant experienceFamiliarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is requiredExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is requiredExperience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 3 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world? Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200448195": {"jobID": "200448195", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Graphics Hardware Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448195/graphics-hardware-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We would like you to have 10+ years of relevant experience including:Strong background in verification of sophisticated hardware at system or component level with ability to debug issues across hardware and software.Solid understanding of Computer Architecture and Memory sub-system micro-architecture.Expertise with various HDL simulators and waveform viewersStrong experience defining coverage space, writing functional coverage, analyzing results.Deep understanding of both RTL and gate-level simulation issues.Able to lead engineering teams in navigating aggressive schedules and delivering high quality IP.Able to mentor junior engineers and transfer crucial skills.Experience in GPU architecture and OpenGL/CL is a plusExperience with Python, Perl, Shell scripting, Makefiles, TCL is a plus.Experience with Formal Verification techniques and tools such as JasperGold is a plus.BS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex problems? Do you intrinsically see importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining the Apple GPU group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this role, you will be leading block and sub-system level pre-silicon RTL verification of embedded graphics cores. You will also collaborate with members of other fields and top validation teams to ensure that system level concerns are baked into our verification flows, and that our IPs are efficiently integrated into the full system."}, "200458022": {"jobID": "200458022", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Silicon Validation Triage Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458022/silicon-validation-triage-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "System-level understanding of CPU/SoC architecture, DRAM/memory, and boards.Experience with Silicon chip bringup, validation and debug.Enjoy hands-on debug and problem-solving.Patient and disciplined problem-solving skills in the face of partial data.Good understanding of typical Silicon debug features and techniques.Clear and concise interpersonal skills.Effective collaboration across teams.Understanding of system software and kernel concepts.Moderate UNIX command line and scripting skills.ADDITIONAL DESIRABLE QUALIFICATIONSKnowledge of SoC and IP design flows.Knowledge and use of lab measurement and analytical equipment.IP block-level knowledge.Knowledge of manufacturing test flows and steps.Knowledge of SOC validation concepts.C, Assembly, UNIX system programming.Kernel and device driver programming and concepts.BS and a minimum of 3 years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work at Apple have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology?   As a member of the Apple SOC Silicon Validation Team, you will use your knowledge of SOC/IP design, debug features and related tools, validation, and problem-solving in order to drive failures to resolution. You will be debugging failures that come from validation, software checkout, or factory screening that appear to be Silicon issues or that require Silicon expertise in order to root cause. You will work at the cross-section of hardware and software and partner with engineers to quickly root cause failures. You will also drive systematic improvements in debug methods, tools and features based on your findings and expertise."}, "200357170": {"jobID": "200357170", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "DevOps Engineer, Employee Experience & Productivity", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200357170/devops-engineer-employee-experience-productivity?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s in Computer Science or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Design and work with modern Continuous integration and deployment solutions.2-5 years of experience in DevOps/SRE, systems engineering, build/release/deployment automation, etc.Experience with hosted services in a high-volume enterprise environment.Implementing applications in private/public cloud infrastructure and container technologies, like Kubernetes and Docker.Exceptional analytical and troubleshooting skills in sophisticated Unix/Linux systems environment and applications implementations.Experience designing and building CI/CD pipeline with tools such as Terraform, CloudFormation, Ansible, and Kubernetes toolset (e.g, kubectl, kustomize).Excellent understanding of microservices architecture.Develop full-fledged software tooling to deliver programmable infrastructure & environments (infrastructure as code).Demonstrated ability to write programs using a high-level programming languages or scripting, such Java, Python, Shell, Golang, etc.Experience with logging infrastructure and using tools such as Splunk, Logstash, or Kibana.Experience with networking load balancers such as Ngnix, Netscaler, HAProxy.Operational experience with public cloud (AWS, GCP, etc.) platforms through migrations, scaling operations etc.Background building distributed, server-based infrastructure supporting a high volume of transactions in a critical environment.Proven track record of working in small, focused teams to complete critical breakthroughs under pressure with tight deadlines.Experience with Kafka, MongoDB, Cassandra and Oracle is highly desirable.Passion for driving automation into how software development and delivery is done.Experience on Mac OS, iOS (mobile apps) desirable. Excellent written and verbal communication skillsPartner with global teams, development teams and infrastructure teams.In-Depth knowledge on AWS services including VPC, IAM, EC2, EKS, CloudWatch, S3, RDS, Route53. Experience in similar services for GCP is preferred.Working experience with Spinnaker or Tekton is a plus.AWS Cloud Architect and/or Certified Kubernetes Administrator (CKA) certifications are highly desiredBachelor’s in Computer Science or equivalent.", "jobDescription": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nAre you a passionate operations engineer who wants to work on solving large scale problems? Join us in building best in class solutions and in implementing sophisticated software applications across Corporate Systems Engineering at Apple. We support both open source and home-grown technologies to provide internal Apple developers with the best possible CI/CD platform! In this role you will have the unique opportunity to own and improve tooling for best of the class large-scale platform solutions to help build modern software systems.\n\nThe DevOps engineering team is part of the engineering operations team for corporate systems. This team is directly responsible to build, lead and expand on tools that enable software releases in a fast paced enterprise environment. We operate in on-premise, private, and public cloud (AWS, GCP etc.) environments. As a DevOps Engineer, you will partner closely with software development and infrastructure teams. And, be responsible for building and supporting CI/CD platforms, automating repeatable infrastructure needs, environment buildout, software build and releases, creating automated solutions, installing, and configuring application software, and upkeep of systems through patching, upgrades, monitoring, and maintenance support!"}, "200437998": {"jobID": "200437998", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Enterprise Product Support Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437998/enterprise-product-support-engineering?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors degree or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Possess a deep knowledge of foundational technologies in macOS and iOS platforms - including: Authentication and Authorization, Directory Service, Installation and Software Update, Device Management, Networking and PKIProficiency with command-line tools is a requirement.Proficiency with one or more scripting or programming languages is desirable.Ability to gather information and solve complex problems.Collaborate with other teams, including Sales, Readiness, and Software Engineering, to investigate and resolve issues impacting Apple products.Understand how products should work and be able to explain simply what isn't working.Ability to see past the question and understand the underlying need. Know when it's necessary to address the actual need instead of just answering the question.Demonstrate excellent communication skills, and adapt communication style to the audience.Lead and contribute to ongoing development for individuals and the team.Tackle challenges in unfamiliar areas and drive to a resolution.Bachelors degree or equivalent experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!"}, "200457304": {"jobID": "200457304", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Silicon Validation Software Engineer: GPU IP Validation and Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457304/silicon-validation-software-engineer-gpu-ip-validation-and-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experienced with Graphics, OpenGL, and CUDAExperienced with image processing, memory hierarchies, and compilersStrong C/C++ programming skillsProficient in Python and GNU MakeDeep understanding of compute systems, operating systems, and computer architecturePassionate about writing code close to the hardware, and debuggingIn-depth knowledge and experience in SoC system level validation and debugging of SoC software and hardware issues.You enjoy the validation mentality: meticulous, curious, and persistentUnderstanding of the Display pipeline is a plusBS and a minimum of 3 years relevant industry experience", "jobDescription": "Join a team of expert software engineers with diverse backgrounds (graphics, video encoding, video processing, file systems, CPUs and caching, kernel programming, embedded systems) to develop graphics validation software and integrate it into system level test environment."}, "200457287": {"jobID": "200457287", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Silicon Validation Software Engineer: GPU IP Validation and Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457287/silicon-validation-software-engineer-gpu-ip-validation-and-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experienced with Graphics, OpenGL, and CUDAExperienced with image processing, memory hierarchies, and compilersStrong C/C++ programming skillsProficient in Python and GNU MakeDeep understanding of compute systems, operating systems, and computer architecturePassionate about writing code close to the hardware, and debuggingIn-depth knowledge and experience in SoC system level validation and debugging of SoC software and hardware issues.You enjoy the validation mentality: meticulous, curious, and persistentUnderstanding of the Display pipeline is a plusBS and a minimum of 3 years relevant industry experience", "jobDescription": "Join a team of expert software engineers with diverse backgrounds (graphics, video encoding, video processing, file systems, CPUs and caching, kernel programming, embedded systems) to develop graphics validation software and integrate it into system level test environment."}, "200460728": {"jobID": "200460728", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: GPU IP Validation and Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460728/silicon-validation-software-engineer-gpu-ip-validation-and-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelor's degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Experienced with Graphics, OpenGL, and CUDAExperienced with image processing, memory hierarchies, and compilersStrong C/C++ programming skillsExperience in Python and GNU MakeAn understanding of compute systems, operating systems, and computer architecture from educational studiesPassionate about writing code close to the hardware, and debuggingKnowledge and experience in SoC system level validation and debugging of SoC software and hardware issues.You enjoy the validation mentality: meticulous, curious, and persistentUnderstanding of the Display pipeline is a plusMinimum requirement of a bachelor's degree.", "jobDescription": "Join a team of software engineers with diverse backgrounds (graphics, video encoding, video processing, file systems, CPUs and caching, kernel programming, embedded systems) to help develop graphics validation software and integrate it into system level test environment."}, "200457681": {"jobID": "200457681", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Software Engineer, Trusted Execution", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457681/software-engineer-trusted-execution?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent experience/skills"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "A passion for crafting effective and pragmatic security technologies in the operating systems arenaUnderstanding of past, current, and emerging security exploitsExcellent C and systems programming skillsStrong understanding of operating systems internalsIndustry exposure to and knowledge of OS security and applied cryptographyAbility to deliver proven work on tight schedulesWorking cross-functionally with other software, hardware, red teams, malware analysts and support teams to provide the best security solutions for Apple’s productsExcellent collaboration skills.BS in Computer Science or equivalent experience/skills", "jobDescription": "Apple’s Trusted Execution team builds the technology to keep our users safe and care-free while running the software that they want. Our software runs on the execution path for every program on every one of our products, for all of Apple’s users around the world. We’re often referred to as the first line of defense in Apple’s defense-in-depth strategy. Our products are infamous within the security community, and each year we push them to the next level.\n\nWe’re a small team with a huge impact.\n\nAs an engineer joining this team, you would be contributing to the entire system. Interacting with Apple’s unique CPU features directly, through the kernel, up through libraries, frameworks and applications. You will have an opportunity to define, design and implement new security technologies for Apple’s next generation operating systems. \n\nSuccessful candidates will be capable of pursuing challenging wide-ranging engineering problems anywhere in the software stack, determining the appropriate compromise between several often competing factors such as ease of use, performance and of course security. Our environment fosters product innovation, rapid product iteration, and a liberating amount of autonomy in which you will be expected to create and quickly bring to market new security methods and technologies to address the complex needs of mobile and distributed computing. The position will require you to interact with and influence many people from several organizations within and outside the company. Designing and developing software for hundreds of millions of users!\n\nUtilizing some the unique advantages we have by building our own hardware, we’re also focused on building new malware detection and remediation capabilities. If you have an interest or background in this area, we’d love to hear from you."}, "200452737": {"jobID": "200452737", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF OTA Connectivity Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452737/wireless-rf-ota-connectivity-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree with 10 or more years of relevant work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Industry experience in development/characterization of RF/Antenna system for wireless technologies. Experience in commercializing wireless products is required.In depth understanding of wireless system concepts for performance evaluation in at least one of the following technologies: 802.11ax, 802.11ac, WiFi 6E, GNSS, UWB and Bluetooth.Solid understanding of end-to-end link budget and wireless propagation. Hands on experience in modeling using at least one tool - MATLAB, HFSS, CST, ANSOFT, etc.Working experience of RF characterization, Antenna Design and tests, anechoic chambers, and RF test equipment is a plus.Hands-on experience with throughput measurement tools like ixChariot, iPerf, Octoscope, etc. is preferredFamiliarity with industry conformance requirements for WLAN/BT/GNSS technologies is a bonus.Bachelor's Degree with 10 or more years of relevant work experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nApple Wireless System Engineering team is looking for an engineer to work on radiated system characterization across different connectivity technologies (WLAN, BT, UWB, GPS) for Apple’s wireless products!"}, "200393007": {"jobID": "200393007", "origin_search": null, "posted": "Aug 9, 2022", "jobTitle": "MBA Internships - Summer 2023", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200393007/mba-internships-summer-2023?team=STDNT", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Currently pursuing MBA or Master's Degree in Supply Chain, Engineering, Operations Management, or related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to toggle between strategic and detail-orientated thinkingTenacious problem solving & issue resolution skillsAbility to influence across multiple functional teamsFlexibility to adapt to dynamic and rapidly changing environmentsPossess advanced analytical skillsCommunicate clearly and conciselyBe enthusiastic about working through ambiguityHave the capability to dive deep into complex detail and emerge with clear strategies/plansHave a passion for the customer experienceCurrently pursuing MBA or Master's Degree in Supply Chain, Engineering, Operations Management, or related field.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it."}, "200461027": {"jobID": "200461027", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "L1/PHY Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461027/l1-phy-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Bachelor's Degree in Electrical Engineering, Telecommunications or Equivalent.  Masters or PhD Degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proven understanding of wireless communication, information theory, signal processing and 3GPP Standards (Physical Layer LTE and NR specifications)Embedded cellular FW/SW programming along with good understanding of communication systems algorithmsUnderstanding of cellular communication protocols. (Low-Power, Low Latency, High Reliability)Deep understanding of software engineering principles, and core computer science fundamentalsGood experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programmingWorking knowledge of possible cellular modem L1/PHY architectures with emphasis on the HW/SW partitions of communication subsystems including inter-module interfacesExperience with 4G/5G Modem L1 Control covering PHY procedures and data path timelines, starting from RF transceiver through to higher layer protocol stacksExcellent skills in low-level programming expertise using C, C++, and assembler, embedded systems proficiency, limited and shared resourcesExperience with SW prototyping of solutions using unit test/virtual platformsProficiency debugging embedded software systems using various methods including log analysis and using test equipmentsPassionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are important to our customersBachelor's Degree in Electrical Engineering, Telecommunications or Equivalent.  Masters or PhD Degree preferred", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing wireless technologies? Are you passionate about innovation that can enrich user experience and delight customers? Do you get excited with constant challenges and thrive in a culture of debate? In the Wireless Technologies and Ecosystems Group, you will help commercialize groundbreaking Wireless Technologies in Apple products. You’ll design, develop, and patent the next generation of our state-of-the art wireless technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic.   The position demands expertise in Wireless Systems with an emphasis on Cellular systems and requires close collaboration with cross functional hardware and software teams. We are seeking a passionate, highly motivated and self-directed engineer to work across the L1/ PHY layer of groundbreaking wireless technologies."}, "200451262": {"jobID": "200451262", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Embedded Wireless Common Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451262/embedded-wireless-common-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience with bare-metal and RTOS based data communications.Understanding of communication protocols. (Cellular, Low-Power Wireless, TCP/IP)Deep understanding of software engineering principles, and core computer science fundamentals.Fundamental facility with C and C++, compilers, build and source code control tools.Significant experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programming.Solid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high-speed communication subsystems.Experience with silicon prototyping, emulation systems, and virtual platforms.Proficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopes.Some mainstream OS application level development and Python or Perl scripting experience.BS and 3+ years of relevant industry experience.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of an extraordinary modem team, you’ll craft sophisticated & pioneering embedded firmware that deliver more performance in our products than ever before. You’ll work across subject areas to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world!\n\nDo you want to have an impact on every single Apple product? As a Wireless Firmware Engineer on the physical design team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for designing and productizing state-of-the-art cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a dynamic cross-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200452855": {"jobID": "200452855", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452855/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong understanding of micro-processor architectureGood knowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerExperience with scripting languages such as Python, Perl, or TclKnowledge of software tool chains including including compilers, assemblers, and source control toolsBackground in silicon bring-up and debug experience a plusAbility to work well in a team, but to be responsible and self-driven.BS and a minimum of 10 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world?   Join our team of experienced SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200448277": {"jobID": "200448277", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Wireless Systems Engineer – WLAN, BT, UWB, Thread", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448277/wireless-systems-engineer-wlan-bt-uwb-thread?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS with 10+ years relevant experience required. MS/PHD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficiency in of 802.11, 802.15, BT SIG and worldwide regulatory emissions RF requirements and implications to device and test equipment architectures, and performance tradeoffsDirect hands-on experience and proficient knowledge of underlying theory and techniques used in WLAN, BT, UWB and Thread technologiesProficiency in connectivity transceiver, RF front-end architectures and performance tradeoffsProficiency in system-level RF parametrics and its sources in RF component characteristics and behaviorDirect hands-on system-level debug and optimization experience on RF conducted characteristicsDeep knowledge of test setups of sophisticated RF test equipment for hardware validationExperience in characterizing and validating devices towards industry and worldwide regulatory emissions RF standards using RF lab test equipment (e.g. Call box, Power meter, Network analyzer, Spectrum analyzer, signal generator, etc.)Proficiency in device certification processes on at least one of industry certification (e.g. BT SIG or FiRa) and Regulatory conformance (e.g. FCC, EU, China, etc.)Experience with entire product development cycle of connectivity handsetsStrong written and verbal communication skillsBS with 10+ years relevant experience required. MS/PHD preferred.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work on integration of WLAN, Bluetooth (BT), Ultra Wideband (UWB) and Thread technologies into Apple’s wireless products."}, "200450118": {"jobID": "200450118", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Senior RFIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450118/senior-rfic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.RF/analog and mixed-signal design experience in cutting-edge RF CMOS design.Direct experience in designing and bringing into mass production ZIF RF transceivers in deep sub-micron RFCMOS technology.Deep understanding of analog, mixed-signal and RF circuit design. This includes design of on-chip LNAs and PAs, PLL/VCO/DCO/LOGEN blocks, mixers, baseband filters and amplifiers, data converters and calibration methods associated with such high performance wireless systems and ZIF designs. Experience should also include understanding of DFT and DFM techniques for mass production environment.Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability and other analog impairments.Deep understanding of CMOS device physics, RF device modeling, device noise parameters and inductor modeling.Familiarity with various RF transceiver architectures and their trade-offs, system specifications and ability to work with system architects to translate system requirements into circuit requirements at IC level; strong understanding of impact of modulation type to radio architecture and requirements.Demonstrated capability to work with digital design group for an optimum partition between digital and analog domain.Familiarity with the integration flows and challenges of wireless SoCs.Familiarity with mixed-signal mode verification methodology (SystemVerilog, AMS, Nanotime).Strong knowledge of desense and able to work closely with board RF/HW/Antenna teams to optimize board/module layouts for desense mitigation. Also, has experience with desense mitigation with integrated PMUs/DSPs (i.e. substrate isolation, return loops, package isolation, frequency planning, etc).Familiarity with Cadence Virtuoso, Spectre RF, Matlab, EM simulation (EMX, HFSS) and similar tools.Extensive experience in Si characterization and debug.Ability to drive strong production test/QA methodologies.Extensive experience in IP sourcing and management.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this highly visible role, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200460721": {"jobID": "200460721", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "Silicon Validation Software Engineer: GPU IP Validation and Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460721/silicon-validation-software-engineer-gpu-ip-validation-and-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelor's degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experienced with Graphics, OpenGL, and CUDAExperienced with image processing, memory hierarchies, and compilersStrong C/C++ programming skillsExperience in Python and GNU MakeAn understanding of compute systems, operating systems, and computer architecture from educational studiesPassionate about writing code close to the hardware, and debuggingKnowledge and experience in SoC system level validation and debugging of SoC software and hardware issues.You enjoy the validation mentality: meticulous, curious, and persistentUnderstanding of the Display pipeline is a plusMinimum requirement of a bachelor's degree.", "jobDescription": "Join a team of software engineers with diverse backgrounds (graphics, video encoding, video processing, file systems, CPUs and caching, kernel programming, embedded systems) to help develop graphics validation software and integrate it into system level test environment."}, "200460400": {"jobID": "200460400", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Silicon Validation Triage Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460400/silicon-validation-triage-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "High-level understanding of CPU/SoC architecture, DRAM/memory, and boards.At least 10 years minimum, experience with Silicon chip bringup, validation and debug.Enjoy hands-on debug and problem-solving.Patient and disciplined problem-solving skills in the face of partial data.Strong understanding of typical Silicon debug features and techniques.Clear and concise interpersonal skills.Effective collaboration across teams.Understanding of system software and kernel concepts.Moderate UNIX command line and scripting skills.ADDITIONAL DESIRABLE QUALIFICATIONSDeep knowledge of SoC and IP design flows.Deep knowledge and use of lab measurement and analytical equipment.IP block-level knowledge.Deep knowledge of manufacturing test flows and steps.Deep knowledge of SOC validation concepts.Strong C, Assembly, UNIX system programming.Kernel and device driver programming and concepts.BS and a minimum of 10 years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work at Apple have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology?  As a member of the Apple SOC Silicon Validation Team, you will use your knowledge of SOC/IP design, debug features and related tools, validation, and problem-solving in order to drive failures to resolution. You will be debugging failures that come from validation, software checkout, or factory screening that appear to be Silicon issues or that require Silicon expertise in order to root cause. You will work at the cross-section of hardware and software and partner with engineers to quickly root cause failures. You will also drive systematic improvements in debug methods, tools and features based on your findings and expertise."}, "200451486": {"jobID": "200451486", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Circuit Design Engineer - Library", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451486/circuit-design-engineer-library?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "We are looking for an experienced Digital Circuit Design Engineer with:Strong understanding of CMOS device characteristics and design rules.Strong understanding of Digital circuits & optimization for better PPA.Good layout design knowledge & parasitic optimization in various types of layouts.Hands-on experience running SPICE simulations and high sigma variation analysis.Experience in Circuit design of high-performance flip flops, level shifters, retention flops and other complex circuits is a plus.Experience in RTL2GDSII flow and/or Static Timing Analysis (STA) is a plus.Knowledge of deep submicron process issues & Finfet Technologies is a plus.Understanding of Timing characterization & modeling of Standard cell circuits is a plus.Strong proficiency in scripting languages like Perl, Python, and Tcl.Great teammate with good communication and analytical skills.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital Design Engineering group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never before envisioned! We have an extraordinary opportunity for Standard Cell Designers. In this highly visible role, you will be at the heart of a processor design effort, working with the custom digital circuits team and library development, making a critical impact in delivering products to market quickly."}, "200463853": {"jobID": "200463853", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch EE Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463853/iphone-touch-ee-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "•Ph.D. in Electrical Engineering, Material science or equivalent experience.\n•Master’s degree in Electrical Engineering + 3 years of industry experience.\n•Bachelor’s degree in Electrical Engineering + 5 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong electrical engineering background in board-level analog and mixed-signal design.Schematic design and layout experience (SPICE or Cadence experience a plus).Circuit and FEA simulation experience (LCR extraction, signal integrity, electromagnetic coupling, etc.).Hands-on experience with module/system level integration, including architecture scoping, characterization, design down-selection, and validation.Experience with creating engineering design, requirement, and specification documents.Experience with high volume manufacturing of Flexible Printed Circuit Boards or micro fabrication process development is a plus.Experience with statistical analysis of production data (familiarity with JMP is a plus).Proficiency in MATLAB and Python scripting tools.Demonstrated ownership and ability to work with cross-functional teams in a dynamic work environment.Ability to thrive in ambiguity, independently converge technical issues, and align efforts across teams.Excellent written and verbal communication skills and solid teamwork.•Ph.D. in Electrical Engineering, Material science or equivalent experience.\n•Master’s degree in Electrical Engineering + 3 years of industry experience.\n•Bachelor’s degree in Electrical Engineering + 5 years of industry experience.", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including Electrical Engineering, Manufacturing process, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200452961": {"jobID": "200452961", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Platform Quality QA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452961/platform-quality-qa-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent QA experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "4+ years of QA experience, preferably on consumer hardware/software productsEnthusiasm for user-focused design and high-quality user experiencesCreative thinker and strong problem solver with meticulous attention to detailAt ease and adaptable in a dynamic environmentExcellent written and verbal communication skills are needed to facilitate close interaction with peers, management, development teams, and other organizations within AppleBS in Computer Science or equivalent QA experienceKnowledge of Unix and Unix shell scriptingKnowledge in one or more scripting or programming languages, including Swift, Objective-C, and PythonAbility to work a flexible schedule, including some weekends", "jobDescription": "The Technology Development Group is looking for an exceptional QA engineer to help us build the next generation of Augmented Reality (AR) interactive solutions for Apple platforms. As a member of our fast-paced team, you will have a unique and rewarding opportunity to work on groundbreaking technology and drive end-to-end quality that will result in customer experiences that surprise and delight. Quality is an important aspect of our products, and as a Platform Quality QA Engineer you will have a significant impact on helping to deliver functional and stable products to our internal development teams and millions of customers. We’re looking for someone with an upbeat personality, excellent communication and interpersonal skills, attention to detail, and passion for a positive user experience that can thrive in a constantly evolving environment."}, "200383883": {"jobID": "200383883", "origin_search": null, "posted": "Jun 18, 2022", "jobTitle": "Cellular Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200383883/cellular-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering, Computer Science, Wireless Communications or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong Software Engineering skills including design, programming (using C, C++), scripting (Python preferred), debugging and/or commercialization.Hands on experience in embedded system software development (RTOS).Knowledge of wireless/internet standards, including but not limited to 3GPP 4G / 5G Access Stratum (RRC, PDCP, RLC, MAC) and the impacts of related features in end to end product design.Broad spectrum insight to comprehensively understand network system architecture from physical layer to application/user interface end-point is a strong plus.Thrive in a collaborative environment and can clearly communicate while confidently developing software in highly cross functional projects.Highly motivated, self-directed and inquisitive personality, focussed on bringing meaningful solutions to our customers.Bachelors or Masters in Electrical Engineering, Computer Science, Wireless Communications or equivalent.", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems team and be part of an elite team of engineers, driving innovation and developing products used by millions worldwide. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. \n\nThe same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. \n\nYou should join Apple if you want to help deliver the next amazing Apple product. Be ready to make something extraordinary when you come here."}, "200437704": {"jobID": "200437704", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437704/embedded-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.S preferred, B.E/B.S/PhD in Electrical Engineering, Computer Science or related majors."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent software design, problem solving and debugging skillsSolid programming skills- C/C++ coding abilitiesExperience in real time multitasking software systemMinimum of 5 years direct related experience in software developmentGood written and oral interpersonal skillsVideo Codec-related experience is a plusM.S preferred, B.E/B.S/PhD in Electrical Engineering, Computer Science or related majors.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.  Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped deliver almost daily. The Video Engineering group at Apple is responsible for creating the image/video core technologies used in almost all Apple products and services, including iPhone, iPad, Mac, Apple Watch, Apple TV and iCloud etc. In this role, you will work on application, driver and firmware for image and video compression/processing, implementing features for applications such as the iPhone/iPad Camera capture, Live Photo, AirPlay, FaceTime, iMovie and many more on a vast variety of devices. You will also be involved in the whole productization cycles and gain valuable experiences of productization."}, "200382482": {"jobID": "200382482", "origin_search": null, "posted": "May 23, 2022", "jobTitle": "Software Engineer, System Services & Daemons", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200382482/software-engineer-system-services-daemons?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Expert-level skills in C, Objective-C, or SwiftStrong understanding of OS architecture and systems programming fundamentalsExperience with daemon or library developmentCreative, critical thinking and troubleshooting skillsExcellent collaborative skillsExceptional professionalism, with the ability to deliver solid work on tight schedulesExcellent written and verbal communicationA genuine passion for crafting compelling customer experiencesB.S. in Computer Science or equivalent experienceAdditional Success Factors:• Proficiency in Python or other scripting languages• Development experience on macOS and/or iOS• Experience with common embedded hardware architectures• Familiar with cryptographic concepts and techniques• Familiar with open source technologies and development communities• Familiar with Xcode• Familiar with OS-level packaging, distribution or build systems", "jobDescription": "Are you a big-picture problem solver who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices!   The Core OS organization is seeking an extraordinary engineer to work on state-of-the art technology for macOS, iOS, tvOS and watchOS. You should have a strong understanding of operating system fundamentals and experience working throughout the stack. As a member of the team, you would participate in all stages of software development, from new feature design and implementation, to maintenance and bug fixing of released code. You will develop and improve unit tests and performance tests, and may also work on diagnosing and resolving customer reported issues."}, "200066278": {"jobID": "200066278", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Display Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200066278/display-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BACHELORS OR MASTERS DEGREE IN ELECTRICAL ENGINEERING OR EQUIVALENT"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "5+ years significant proven experience crafting consumer electronics and/or embedded systemsMust have strong EE fundamentals (analog/digital design, signal/power integrity, etc.)Should demonstrate strong verbal and written communicationsExperience in a lab environment prototyping circuits, design bring-up,plus hands-on with oscilloscopes, spectrum analyzers, DAQ, etShould have experience leading high volume products from concept to mass productionExperience with leading PCB technology and electrical design and characterization of the following areas: Differential serial links (e.g.LPDP, MIPI) and I2C/SPI/UART buses.Experience in one or more of: MCU/CPLD, power (DC-DC converters, power management, low power design), analog circuits,display technology, and system integration.Expertise in board CAD tools including Cadence Concept & AllegroExperience in modeling power consumption for various usageExperience in predicting hardware performance by simulationExperience in capacitive multi-touch preferredExperience in micro-LED or OLED display is a plusBACHELORS OR MASTERS DEGREE IN ELECTRICAL ENGINEERING OR EQUIVALENTApple is an Equal Opportunity Employer that is committed to inclusion & diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Are you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly and we are hiring all levels from junior to senior engineers to join our display engineer team."}, "200445639": {"jobID": "200445639", "origin_search": null, "posted": "Dec 1, 2022", "jobTitle": "Diffractive Optics Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200445639/diffractive-optics-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in Physics, Optical Science/Engineering, EE, Human Perception or equivalent with 2+ years of experience in related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Engineering background in displays, optics, photonics, or physicsOptical diffractive element Modeling and characterizationPrior experience in optical component tolerance analysis and manufacturable / scalable designStatistical analysis of data for process specificationsStrong presentation, communication, analytical, critical thinkingM.S. or Ph.D. in Physics, Optical Science/Engineering, EE, Human Perception or equivalent with 2+ years of experience in related fieldPreferred Qualifications- Experience in consumer electronics and optics/process development- Experience managing domestic and international vendors", "jobDescription": "Do something different! Apple is looking for a world class engineer that can help identify and incubate new display technologies. You will work with both suppliers and internal teams at Apple to shape the display related technologies that go into Apple products. A successful candidate will not only need to identify new tech, but also educate a broad audience of people at Apple about their benefits and tradeoffs.\n\nThis position is focusing on the identification, prototyping, and communication of display technologies for future Apple products. The team features a diverse engineering roster including optical engineers, human perception experts, product design engineers, and experimental physicists. We work at a fast pace and require everyone to be highly self- motivated. A successful candidate needs to be a flexible thinker and be able to problem solve outside of their respective technical area. \n\nJoin us! It’s going to be awesome!"}, "200452829": {"jobID": "200452829", "origin_search": null, "posted": "Feb 15, 2023", "jobTitle": "Silicon Validation Software Engineer: CPU and Memory Hierarchy", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452829/silicon-validation-software-engineer-cpu-and-memory-hierarchy?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong understanding of micro-processor architectureMinimum of 3 years industry experienceKnowledge of ARM or another CPU instruction set architectureFamiliarity with memory technologies and power managementExperienced C and assembly programmerExperience with scripting languages such as Python, Perl, or TclKnowledge of software tool chains including including compilers, assemblers, and source control toolsBackground in silicon bring-up and debug experience a plusAbility to work well in a team, but to be responsible and self-driven.BS and a minimum of 3 years relevant industry experience", "jobDescription": "Would you like to work on SW that runs on every Apple phone, pad, and Mac computer in the world?   Join our team of experienced SW engineers and debuggers in validating Apple's world class silicon. In this highly visible role you will be writing functional validation SW for the CPUs, caches, and memory subsystem of our SoCs, with the aim of identifying logic design and circuit bugs. You will be a SW developer for a system validation tool used widely across Apple's Silicon Engineering group, and will collaborate with SoC design and product engineering teams to debug and drive silicon issues to root-cause."}, "200448072": {"jobID": "200448072", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Software Engineer: Validation of Crypto and Security IPs", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448072/software-engineer-validation-of-crypto-and-security-ips?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelors degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Strong Interest in low level and embeded software developmentGood understanding of RISC based computer architecture, memory management unit, coherent cacheKnowledge and skill in C/C++ programming, Experience with ARM assembly is a plus.Experience with secure boot, trusted execution environment, data encryption.Minimum requirement of a bachelors degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nWe have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles! You will develop software to validate and debug crypto and security blocks in Apple SoCs."}, "200452157": {"jobID": "200452157", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Embedded 5G/4G Cellular RF Software/Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452157/embedded-5g-4g-cellular-rf-software-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10 + years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10 + years of relevant industry experienceStrong knowledge of mobile communications in 4G/5G 3GPP protocols and PHY layer radio aspects.Knowledge of communication theory, Wireless standards, Radio architecture and Interfaces.In-depth experience with control of RF transceiver and RF front end components for 4G/5G data path processing.Understanding of RF calibrations for gain error and techniques for compensating RF impairments.Understanding of design principles to meet tight real time deadlines a plus.Deep understanding of software engineering principles, and core computer science fundamentals.Excellent command of C and C++,and working experience with compilers, build and source code control tools.Solid understanding of computer architecture with particular emphasis on the HW/SW interfaces of wireless communication systems.Experience with using RF Test equipment for RF validation and debugging.Proficiency with debugging in embedded software systems. Familiarity with JTAG and ETM Trace tools.Experience in providing technical leadership for a team size of 4-5, managing schedule and assignments for team members.Experience in delivering e2e features with some cross-functional impact and managing dependenciesMinimum BS and 10 + years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible. As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. You’ll work across fields to transform improved hardware elements into a single, integrated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations! By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. \n\nAs a Cellular RF Software/Firmware Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for designing and productizing powerful cellular SoCs! This position requires someone comfortable will all aspects of embedded software development, that thrives in a dynamic multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200440954": {"jobID": "200440954", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "Software Integration Manager (C++) for CVML Algorithm Team", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440954/software-integration-manager-c-for-cvml-algorithm-team?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A bachelor's degree or higher in Computer Science, Engineering, Physics, Applied Mathematics or related fields, with 5 years industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "In-depth knowledge of and extensive experience in programming languages such as C++ and Python.Multiple years of experience in software developing, deploying, integration and team management. Excellent ability to mentor junior software developers, as well as to collaborate with all stakeholders involved in cross-functional projects.Knowledge of professional software engineering and best practices for the full software development life cycle, including coding standards, code reviews, source control management, and testing.Solid knowledge and experience in API design. Experience in real time computer vision system and 3D geometry is a plus.Excellent proficiency in documenting processes and monitoring performance metrics.Proactive, analytical thinking, excellent problem solving, fast technical uptake and ability to quickly switch context, exceptional interpersonal and communication skills.A bachelor's degree or higher in Computer Science, Engineering, Physics, Applied Mathematics or related fields, with 5 years industry experience.", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life. We're looking for an exceptional software integration manager with broad skills to join us to lead software integration team and to take part in our high-impact projects for Apple’s next generation products."}, "200431451": {"jobID": "200431451", "origin_search": null, "posted": "Sep 30, 2022", "jobTitle": "Modem System Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200431451/modem-system-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors/Master Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience in Wireless System Testing, Certification, IOT and/or Cellular System Performance.Solid experience of 5G NR PHY/MAC and higher layer control and user planesExperience in defining, developing and validating cellular modem system test cases for mobile devices using popular test development platforms.Good understanding of mmWave challenges and 5G Standalone protocolStrong understanding of 3GPP specifications (LTE & NR Air Interface, PHY, MAC, RLC, RRC, PDCP and NAS layer).Broad spectrum of knowledge and understanding of the end-to-end wireless system architecture from wireless physical layer all the way to application layer.Consistent track record to independently lead a complete area of technology and drive product quality.Attention to the smallest details that are significant to customersKnowledge in Test Automation and Scripting skills using PythonBachelors/Master Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems team and be part of an outstanding group of engineers, working to drive innovation and develop products used by millions worldwide We build and seamlessly integrate technologies that enriches peoples' lives and deliver the best user-experience. \n\nOur team is looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Multifaceted, encouraging and innovative people who build industry-defining technologies are the norm at Apple. \n\nIf you're passionate about building technology that will make a difference, we may have the job for you!"}, "200432552": {"jobID": "200432552", "origin_search": null, "posted": "Oct 7, 2022", "jobTitle": "Sales Operations Data Scientist, Advertising Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432552/sales-operations-data-scientist-advertising-platforms?team=SLDEV", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in data science, statistics, economics, computer science or other quantitative field. Advanced degree preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5+ years of experience in data science, analytics, or consulting roles, preferably in the digital advertising industry, with a strong track record of solving complex analytical problems and positively influencing business outcomesAdvanced technical skills in SQL, Python, and TableauExperience in advanced quantitative analysis including regression, classification, clustering, and time-series analysesExperience to automate and scale analysies and dashboardsExceptional written and verbal communication skills with experience building stories and narratives out of dataExcellent research, project management, and organizational skillsBS in data science, statistics, economics, computer science or other quantitative field. Advanced degree preferred.Experience with advertising, measurement, and/or digital analytics", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. \n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. Launched in 2016, Search Ads is an easy, efficient and fast-growing platform for app discovery. With over 65% of all app downloads resulting directly from a search in the App Store, Search Ads is quickly becoming the app promotion platform of choice for iOS developers. \n\nWe are looking for a smart and passionate Data Scientist to support our growing advertising business. In this role, you will work within our Advertising Platforms Sales Operations team to support and empower the sales organization by building impactful analyses and insights. You’ll help us architect complex but practical insights, establish strategies/priorities based on empirical observations and measure success."}, "200426174": {"jobID": "200426174", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Health Security Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200426174/health-security-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science with specialization in Information Security or 4+ years of equivalent, hands-on information security experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Web Application Security and Penetration Testing of complex enterprise environmentsHands-on experience with manual and tool assisted Source Code Security Review (Java)Experience securing Cloud Environments for large enterprise applicationsBackground in web application development and/or code auditing strongly preferredProficiency with macOS and LinuxStrong verbal & written communication skills and the ability to succinctly communicate security concerns at various technical levels.Passion for discovering and researching new vulnerabilities and exploiting techniquesBS in Computer Science with specialization in Information Security or 4+ years of equivalent, hands-on information security experience.-  Experience with enterprise Java development preferred.-  Experience with cloud automation tooling and scripting preferred-  Experience with security testing and review of Medical or Health related applications and systems a plus-Experience in a large enterprise environment a plus", "jobDescription": "Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish! \n\nThe Health Software team is looking for a Security Engineer to help secure complex, large-scale application and infrastructure initiatives. You will use your talents to help secure our Health Research Platform by coordinating and architecting security controls, performing security reviews, and testing controls."}, "200452459": {"jobID": "200452459", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Small Display Silicon Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452459/small-display-silicon-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Relevant experience in IC design, system architecture, engineering, or technical program management in semiconductorKnowledge of Silicon/ASIC design and system architectureUnderstanding of hardware and software integration challengesProven experience leading sophisticated, multi-functional technical projectsAbility to travel internationallyLead technology development and silicon product cycle from initial module EE and silicon concept and architecture definition to delivery, through design implementation, validation and release for mass productionSet strategy and define project plans and program schedules, drive project executionAbility to understand and communicate complex technical and engineering issues, and drive multi-functional resolutions quickly and efficiently in multifaceted, high-paced environmentsStrong communication, presentation, and interpersonal skills are requiredKnowledge of LCD/OLED design and processExperience in consumer/portable productsExperience working with offshore suppliers and manufacturersA working understanding of high-volume manufacturing processesBS + 10 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want join us in these pursuits? Join us to help deliver the next groundbreaking Apple product! \n\nApple is looking for a world-class Engineering Program Manager to join the Display team and play a key part in driving the product development cycle from early concept to delivery, with focus on EE architecture and silicons for the next-generation display technologies."}, "200452162": {"jobID": "200452162", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Validation Engineer – GNSS", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452162/wireless-systems-validation-engineer-gnss?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Practical knowledge of GNSS Radio Frequency (RF) validationPractical knowledge of GNSS standards like 3GPP & Carrier performance requirements, compliance requirements and required testing methodologiesKnowledge of system level RF parametric and its sources in RF component characteristics and behaviorHands-on experience with bench-level GNSS testing, debug at the module, reference board or system-levelExperience using RF lab test equipment (e.g. Call box, Power meter, Network analyzer, Spectrum analyzer, signal generator, etc.)Experience in conducted-level debug of GNSS systems is a plusStrong written and verbal communication skillsBS required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work on integration of Global Navigation Satellite System (GNSS) technology into Apple’s wireless products."}, "200461269": {"jobID": "200461269", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Display Silicon Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461269/display-silicon-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE / MSEE or industry experience equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "10+ years of IC design & architecture experienceExperience leading chip design and integrationKnowledge of analog, digital & IC design fundamentals, rigorous process development and analytical methodology, which lead to high quality design, is requiredEﬀective written and verbal communication skillsFast learner with strong problem-solving skillsBSEE / MSEE or industry experience equivalentPreferred Qualiﬁcations• Experience designing high performance analog to digital converters (ADC), digital to analogconverters (DAC), Op Amps, LDOs & other analog building blocks• Experience in firmware and FPGA• Experience in developing and manufacturing high volume products• Experience in vendor technical management• Knowledge in electronic displays, image quality, or graphics subsystem• Ability to conduct experiments during silicon debug, gathering and analyzing data", "jobDescription": "In this highly visible role, you will be leading the eﬀort to develop the custom ICs for future Apple display: deﬁning display silicon architecture & requirements, working with external vendors as well as internal design teams for all phase of the silicon development, validating silicon functionality & performance in the module and system, and qualifying the ICs for mass production."}, "200385881": {"jobID": "200385881", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "System Integration Engineering Program Manager (EPM) - TDG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200385881/system-integration-engineering-program-manager-epm-tdg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE/CE/CS/ME or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years experience managing cross-functional teams across various program stages(architecture, integration, validation).Excellent team player whom is self motivated, proactive, and has a high attention to detail.Strong technical background in Electrical, Mechanical, or Software Engineering.Proven track record of driving system integration and validation in complex hardware products.Proactive and highly self-motivated; good critical thinking capabilities and strong attention to detail.Understands and works well in a rapidly evolving development program.  Remains flexible, eager to learn, and works well in times of uncertainty.Ability to travel internationally.BS/MS EE/CE/CS/ME or equivalent work experience", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for an experienced highly technical EPM to join the team driving system integration of a new product category. If you have broad experience across various key hardware technologies (e.g displays, cameras, RF, algorithms, custom silicon), a strong product/customer focus, and the ability to drive various system integration and validation approaches and methods we’d love to hear from you!"}, "200466435": {"jobID": "200466435", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Panel Process Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466435/panel-process-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Ph.D in engineering or MS degree in engineering plus a minimum 5 years experience, or Bachelor degree plus a minimum of 7 years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Required experience in flat panel display process or equipment technology and process integration for new product, i.e. Photo Lithography, Thin Film, Etch or Integration function for a-Si TFT, Metal Oxide TFT, LTPS TFT, or MOSFETExperienced in management of display and related field, i.e.TFT process, TFT equipment, Silicon process, Fab operation and R&D activitiesEnglish written and verbal communication skillsThe willingness and ability to travelSelf-motivated and willing to take challenges to new technologyBackground with TFT device engineeringPh.D in engineering or MS degree in engineering plus a minimum 5 years experience, or Bachelor degree plus a minimum of 7 years experience", "jobDescription": "Apple is looking for a Panel Process / Equipment / Integration Engineer to develop new processes and designs for the panel displays used in award-winning Apple products. This is an excellent opportunity to work on the forefront of panel development with an exemplary company consistently bringing innovations in the industry. As part of Panel Systems, you will have responsibility to successfully develop new panel products through the technical direction of highly talented cross-functional engineering teams and supplier partners specialized in the development of panels."}, "200367810": {"jobID": "200367810", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Wireless Charging Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200367810/wireless-charging-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors in relevant EE field, Masters preferred At least 1 year of relevant technical work in industry. New graduates considered for the role."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "1+ years of hands-on experience and proven track record in system definition, integration, prototyping and validation. New grad considered for the role.Solid EE fundamentals in both analog and digital design and comfortable with tackling new challenges with the critical thinking and problem solving skillsCircuit level simulation experience in EE simulation platforms like Cadence/ADS/LTspice etc is a plus.Familiar with various communication protocols (USB, SPMI, SPI, I2C and UART) and low power embedded systems, e.g. ARM Core ProcessorsDesire to develop and execute test plans, analyze test logs/results, and report statusDebugging failure cross functionally with Software/Firmware, System Hardware and Silicon teamsKnowledge and experience in Power electronics and direct wireless charging is a plus.Proficient in data collection, data analysis, and statistical analysis tools (e.g. Python, Matlab).Prior hands-on automation script development and optimization (using C, Python).Experience working with cross functional FW partners.Experience in high volume products from concept to end, and working with contract manufacturersTeam player, great communication skills and ability to lead multiple-discipline team to make the design tradeoff based the information available in a timely mannerBachelors in relevant EE field, Masters preferred At least 1 year of relevant technical work in industry. New graduates considered for the role.", "jobDescription": "We believe the future is powered by Wireless! The mission of the Wireless Power Technology team - Create the world’s best Wireless Charging user- experience by inventing state-of-the-art technologies. We develop effortless and safe Wireless Charging designs that are central to Apple’s products - the iPhone, Apple Watch, and AirPods! New challenges arise every day that require the sharp problem-solving skills of individuals. Are you in for the challenges? We are looking for a senior system integration engineer that leads the integration of the inductive technology into products in the partnership with multiple discipline teams including but not limited to architecture, FW, system EE, silicon, noise and vibration, safety, thermal, reliability, operations , regulatory teams and more."}, "200455215": {"jobID": "200455215", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC DV Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455215/soc-dv-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "-  Skilled in many aspects of digital verification such as constrained random verification process, functional coverage, code coverage, assertion methodology & philosophy-  Knowledge of SystemVerilog, digital simulation and debug-  Knowledge of computer architecture and digital design fundamentals-  SW programming skills with knowledge of data structures and algorithms-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Knowledge of verification methodologies like UVM-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to tackle diverse challengesMinimum of BS + 3 years relevant industry experience.", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology organization, and we'd love to have you join us."}, "200391189": {"jobID": "200391189", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Display Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200391189/display-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "This position typically requires MS/Ph.D degree in physics, optics, or related fields with minimum 1-3 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "1-2 expertise subsets of the following fields are required: optics, physics, EE, MEDeep understanding of display technologies, i. e. LCD, OLED, etc., optical fundamentals, display systemProficiency of using statistic tools (JMP etc) and programing languages (MATLAB, Mathematica etc) and to tackle practical engineering problemsStrong analytical, critical thinking, and problem-solving skills.Hands-on experience in high volume mass production consumer electronics, display related system strongly preferred.Experience in working closely with cross-functional teams, as well as with overseas suppliers, is desired.Concise & effective verbal and written communication and presentation skills in English.Able to travel oversea.This position typically requires MS/Ph.D degree in physics, optics, or related fields with minimum 1-3 years of experience.", "jobDescription": "Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.\n\nApple is searching for a candidate on display hardware development and validation of the next generation Apple products, as well as future display technology research and development.\n\nThis individual will serve as a focal point in managing new display technology development and drive the implementation of critical technology platforms to final products. You will involve in system modeling to assist in the design and validation. You will work with a diverse and multi-disciplinary group of highly hardworking colleagues. You will be a directly responsible individual and collaborate with multi-functional teams and suppliers to understand design tolerance and sensitivities, optimize system level performance base on critical metrics, and validate system designs through engineering builds and design of experiments.\n\nA successful candidate needs to be comfortable with new technology, flexible problem solver, meticulous attention to detail, highly independent and motivated to drive results. You should be able to tackle problems outside of your respective technical area, have strong presentation and communication skills, and can thrive in a highly dynamic, agile, multi-disciplinary and hands-on environment that values engineering excellence and innovation. You will be part of something big, come join us!"}, "200434662": {"jobID": "200434662", "origin_search": null, "posted": "Nov 17, 2022", "jobTitle": "Technical Experience Designer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200434662/technical-experience-designer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSc/MSc, Game Design / Game Programming or relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Passion for creating imaginative experiences powered by cutting-edge technology.5+ years shipping interactive entertainment experiences.Shipped at least one high profile experience in a technical, systems, or game design role.Expert in design philosophy for interactive entertainment experiences.Expert in realtime 3D game editors such as Unity, Unreal, or similar.Strong programming experience, ideally Swift, C, C++, C#.Excellent problem solving, creative thinking, communication, and presentation skills.Desire to grow interactive entertainment beyond traditional experiences.Ability to communicate precisely with multiple departments.Deep understanding of Research for Human Computer Interaction with novel Interfaces.Experience in AR/VR a plus.BSc/MSc, Game Design / Game Programming or relevant industry experience", "jobDescription": "Are you interested in joining the creative team behind an Emmy® Award-winning interactive narrative experience? \n\nAt Apple, we strive to deliver surprise and delight to our millions of customers, and our team operates at the intersection of imagination and technology. This hands-on Technical Experience Designer position entails working with a dynamic, cross-discipline team to transform visionary ideas and concepts into groundbreaking consumer content. We are looking for someone ready to jump into a world of innovation and spend time in R&D—someone with a proven track record of shipping complex projects under demanding timelines. \n\nAs Technical Experience Designer, you will be a bridge between the worlds of design and engineering. You will build interactive systems and bring complex story sequences to life. You will have one foot in design and the other in engineering as you work closely with a team of designers, artists, animators, engineers, and more to deliver innovative, genre- defining experiences. \n\nIf you are excited by the opportunity to craft experiences that delight millions of customers, we want to hear from you!"}, "200452730": {"jobID": "200452730", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF Compliance Validation Engineer - Inductive Charging", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452730/wireless-rf-compliance-validation-engineer-inductive-charging?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Practical knowledge of inductive charging hardware, architectures and system considerations as it related to emissions.Experience with performing regulatory tests including spurious emissions, occupied bandwidth, frequency accuracy, spectral mask, etc. at either conducted or radiated environments.Experience with hands-on disassembly and making of experimental modifications to intricate hardware as part of debugging issues.Experience using lab equipment including spectrum analyzers, power meters, network analyzers, vector signal generators/analyzers and oscilloscopes.Working knowledge of EM and radiated theory inside portable wireless devices including accurate grounding, shielding, and radiated emissions mitigation techniques is a plus.Experience with circuit-level and system-level simulations is a bonus.Strong technical reporting, presentation and communication skills.Bachelor's Degree required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Apple's Wireless Systems Compliance Engineering team is looking for a hardworking, proactive individual to take ownership for ensuring inductive charging products meet all worldwide Regulatory requirements!"}, "200448165": {"jobID": "200448165", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "GNSS Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448165/gnss-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant industry experience is required.\nBS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in wireless SoC or system validation.Knowledge of wireless SoC, microprocessor, memory, peripherals, I/O characterization.Experience with digital interfaces such as USB/SPMI/SPI/UART/I2C/JTAG.Familiarity with lab equipment such as logic analyzer, spectrum analyzer, signal generators, etc.Experience with version control (Git) and issue tracking tools (JIRA).Validation knowledge of wireless system, digital signal processing and statistics is preferable.Strong Python programming required, C/C++ and other scripting preferred.Experience of hardware design, verification, board design, FPGA, schematics/layout is a plus.GNSS/Cellular validation experience preferred.Strong written and verbal communication skills.BS + 10 years of relevant industry experienceBS + 10 years of relevant industry experience is required.\nBS or MS in Computer Science, Electrical/Electronics or Communication degree is preferred.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Do you like to solve problems? \n\nGlobal Navigation Satellite Systems (GNSS) space vehicles transmit the power of a lightbulb, they are 13,000 miles away, and are moving four kilometers per second. The received signals are commonly one hundred times weaker than cosmic microwave background radiation left over from the Big Bang and arrive next to interfering signals ten billion times stronger, just few MHz away. \n\nOur GNSS team is part of Apple's cellular SoC team. We are a vertically coordinated engineering team spanning RF, mixed-signal analog design, systems engineering, RTL design, DV, firmware and software engineering, test, and validation. Our focus is on highly energy efficient and robust GNSS receiver design. We develop GNSS technology that touches hundreds of millions of lives, something we are passionate about. We’d like you to consider being a part of our team. As a GNSS Validation Engineer, you will be a key member of our highly innovative GNSS design team, developing GNSS technology and SoC for novel ultra-low-power location-based applications."}, "200452912": {"jobID": "200452912", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452912/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong software skills in C/C++.Familiarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is a huge plusExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is ideal experience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 10 years relevant industry experience", "jobDescription": "Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200419550": {"jobID": "200419550", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Computer Vision Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200419550/computer-vision-architect?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "BE  + 15 yrs of relevant industry experience.\nMasters/PhD +  10yrs of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Ability to evaluate existing and emerging imaging systems against use case requirements, including, understanding of hardware engines (CPU, GPU, Neural Network Accelerator, DSP, etc.) and how to choose the right one for a given application.Understanding of difference between classes of algorithms and how to optimize their efficiency on available hardware engines (Computer Vision vs DeepLearning) as well as resource sharing and arbitration.Understanding of the impact processing flow selection will have on overall system performance, power consumption and resource sharing by various algorithms.Deep knowledge of sensors and camera technologies, including, image acquisition (sensor+lensing+ISP), rolling vs global, color vs monochrome, rectilinear vs equidistant and their impacts on algorithms, color management, performance optimization in low light conditions, etc.Understanding of system resources supporting image collection and camera calibration in multi-camera systems and ability to define common system pre-processing blocks for camera streams.Demonstrated proficiency in system architecture and performance analysis, including, input interface definition/optimization of image streams serving multiple algorithms, estimation of system compute requirements based on required performance.Ability to define system-wide policies optimizing resources in multi-sensor streaming systems with memory constraints as well as estimation of system responsiveness based on latency analysis and system margins.Ability to translate product goals to feature level architectures and the ability to derive for each feature the end-to-end requirements (with rationale) and decompose them down to module/component specific requirements.Ability to work cross-functionally (Algorithms, Embedded, ML, Mechanical, Electrical, Optical, Human Factors, Vision science etc.) with stakeholders to define CV features, understand trades, sensitivities, risks and perform budgeting across full system.Ability to effectively communicate and align with peers while navigating complex trade-spaces and the ability to summarize learnings, take-aways and recommendations in a succinct way to executive leadership.BE  + 15 yrs of relevant industry experience.\nMasters/PhD +  10yrs of relevant industry experience", "jobDescription": "Apple is looking for a computer vision architect with exceptional technical and communication skills to contribute on high-impact projects that will enable game-changing future Apple products. The role requires deep knowledge of image processing and ability to define, analyze and optimize the architecture of video pipelines. Successful candidate must possess good understanding of both hardware and software solutions used in battery operated devices, including tradeoffs in optimal performance vs. power consumption."}, "200463909": {"jobID": "200463909", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "Packaging Product Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463909/packaging-product-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree with an emphasis in Mechanical Engineering or Packaging Science, with at least 2 years of related industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience working with 3D and 2D CADInnovative thinking, high personal motivation, strong engineering fundamentalsOTHER SKILLS WE LIKE TO SEE:Flexibility and comfort working in a quickly changing environmentEffective verbal and written presentation skillsPrototyping experienceData-driven design approach to complex problemsExperience with design cycle from concept to manufacturing in mass-productionKnowledge of material science and FEAKnowledge of fiber-based materialsBS degree with an emphasis in Mechanical Engineering or Packaging Science, with at least 2 years of related industry experience", "jobDescription": "When was the last time you enjoyed a box as much as the product inside? At Apple, every customer interaction is an opportunity for surprise and delight! This philosophy extends beyond the product to its packaging, where every detail is thoughtfully considered.  \n\nThe Packaging PD team is a diverse group of people responsible for the design and execution of structural packaging for all Apple products - from shippers to finished goods boxes. Our packaging delivers an outstanding customer experience, while protecting products throughout the shipping environment, and advancing Apple’s sustainability goals. We collaborate with a wide range of teams including Industrial Design, Marketing, Environmental, Operations and many others during the design process.   \n\nWe are seeking someone who approaches problem solving with passion, creativity, and curiosity. Apple’s approach to packaging is unique, so we value people who are eager to learn new skills and further improve their knowledge of packaging design, manufacturing processes, and sustainable materials. We welcome fresh influences from outside the standard packaging industry to promote innovation in creative ways"}, "200323506": {"jobID": "200323506", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Hardware Engineering Program Manager (EPM) - Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200323506/hardware-engineering-program-manager-epm-technology-development-group-tdg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS degree in EE/CE/ME degree required, MS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proven track record of managing complex hardware product schedules and engineering builds down to the small details.Strong technical background in Electrical, Mechanical Engineering or Mechatronics.3+ years of relevant hardware engineering experience in consumer electronics.Program/Project management experience is a plus.Proactive and highly self-motivated; demonstrates critical thinking capabilities with strong attention to detail.Understands and deals well with rapid development cycles and constant change; remains flexible and calm when facing of uncertainty.Ability to travel internationally.Understanding of high-volume manufacturing processes.BS degree in EE/CE/ME degree required, MS preferred", "jobDescription": "Do you have a passion for leading new technology development? Are you a bright, self- confident, highly technical program manager? This position is offered in Apple's Technology Development Group. We are responsible for leading hardware engineering development from product concept to mass production. \n\nWe are looking for a high-energy EPM to lead the hardware product development, and guide cross-functional engineering teams to meet design and schedule goals."}, "200433420": {"jobID": "200433420", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Hardware Engineering Program Manager (EPM) - Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200433420/hardware-engineering-program-manager-epm-technology-development-group-tdg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS degree in EE/CE/ME degree required, MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Proven track record of managing complex hardware product schedules and engineering builds down to the small details.Strong technical background in Electrical, Mechanical Engineering or Mechatronics.3+ years of relevant hardware engineering experience in consumer electronics.Program/Project management experience is a plus.Proactive and highly self-motivated; demonstrates critical thinking capabilities with strong attention to detail.Understands and deals well with rapid development cycles and constant change; remains flexible and calm when facing of uncertainty.Ability to travel internationally.Understanding of high-volume manufacturing processes.BS degree in EE/CE/ME degree required, MS preferred.", "jobDescription": "Do you have a passion for leading new technology development? Are you a bright, self- confident, highly technical program manager? This position is offered in Apple's Technology Development Group. We are responsible for leading hardware engineering development from product concept to mass production. \n\nWe are looking for a high-energy EPM to lead the hardware product development, and guide cross-functional engineering teams to meet design and schedule goals."}, "200419423": {"jobID": "200419423", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Field Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200419423/field-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Electrical Engineering, Master’s preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$94,000", "max": "$171,000"}, "benefits": null, "requirements": "You have a minimum 0-3 years hands-on experience with end to end testing of cellular technologies that includes test plan preparation, field testing, log analysis & debugging issues.You have working knowledge in at least one of the wireless technology 5G NR, LTE/LTE-A, UMTS. Deep understanding of cellular protocol stack from LTE PHY/MAC to higher layers, call processing.You have experience owning a complete functional area of an application or product with clear communication across multiple levels in the organization.Excellent verbal and written communication skills, detailed oriented, analytical, able to work independently.Travel for work up to 50% (domestic and sometimes internationally)Bachelor’s degree in Electrical Engineering, Master’s preferred.- Hardworking and ambitious, able to take on obstacles in innovative ways- Knowledge of Antenna/ RF design is a plus.- Basic scripting experience (Shell/Perl/Python/Matlab)", "jobDescription": "At Apple, new ideas have a way of becoming products, services, and customer experiences very quickly!   \n\nDo you want to impact millions of users by developing an extra-ordinary product with a prime focus on accuracy, understandability and performance of the product? We are the Apple Field Design Engineering team, and we are seeking a highly motivated and technical individual to work on testing unreleased apple products. You will be responsible for evaluating the latest iPhone, iPad and Apple Watch hardware systems, in the field, from early prototype to final products, on different network and wireless technologies, including performance metrics creation/evolution, post processing and analysis of device logs from the field.   \n\nCome join our team and become part of a hands-on team that fosters engineering excellence, creativity and innovation. We are a team of multifaceted, encouraging people and innovative technologies are the norm here. Bring passion and dedication to your job and there's no telling what you could accomplish, imagine what you could do here!"}, "200460132": {"jobID": "200460132", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "UI Engineer (AirPods Audio)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460132/ui-engineer-airpods-audio?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MS/BS in Computer Science / relevant field with ~2+ years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Some background in developing UIExpertise in Swift, Objective CSoftware development experience and driven to learnMS/BS in Computer Science / relevant field with ~2+ years experience", "jobDescription": "Join our Headphone & Accessories team and drive innovation that matters! We craft and seamlessly integrate technologies that enrich people’s lives and deliver the best user-experience. If you're a strong software engineer and are passionate about building awesome Bluetooth solutions, we may have the job for you.   The team is looking for a self-driven software engineer to design, develop and build the next generation of wireless audio experience and personal device connectivity."}, "200451145": {"jobID": "200451145", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "Systems Engineer for LV Power Delivery", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451145/systems-engineer-for-lv-power-delivery?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Electrical Engineering, Software engineering, or Systems engineering\n7+ years industry experience in implementing complex, safety-critical systems"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "7+ years industry experience in implementing complex, safety-critical systemsOutstanding teamwork skills with a demonstrated ability to learn, share knowledge, and drive consensus with cross-functional teams in a fast-paced environmentSuperior written, verbal, and visual communication skillsWorking experience with requirements management tools (e.g. Polarion, Jama, DOORS)Working experience with successful verification and validation for a safety-critical workStrong knowledge and experience with AUTOSAR standards and automotive network protocols (e.g. CAN, LIN, Flexray, A2B)Strong knowledge and experience with ISO26262 processesFluency in electrical and software design considerations in battery powered systems and battery managementExperience with Model Based Systems Engineering preferredBS/MS in Electrical Engineering, Software engineering, or Systems engineering\n7+ years industry experience in implementing complex, safety-critical systems", "jobDescription": "Seeking an enthusiastic systems engineer to own and drive the development and functional integration of the low voltage power distribution and delivery systems for the Special Projects Group.  This engineer will be responsible for taking a complex power delivery architecture for a safety-critical and driving the system integration from design through validation and will be in a position to heavily influence the broader system architecture.\n\nThe LV Power team owns the design and integration of the low voltage (< 60V) power system, starting from the system architecture and carrying responsibilities through to system validation.  This role places a strong emphasis on cross-functional leadership and an ability to drive team consensus on technical decisions that best serve the end goal.  Strong communication skills and comfort with presenting technical content to a large group are a must.\n\nThe ideal candidate is someone with a background in systems engineering, functional safety processes, and power systems, and who is eager to apply those skills to the unique challenge of building high reliability systems in an agile, fast-paced environment.  Individuals who are self-motivated to develop unique tools to streamline existing processes are highly desired."}, "200319978": {"jobID": "200319978", "origin_search": null, "posted": "Nov 16, 2022", "jobTitle": "WiFi Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200319978/wifi-embedded-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in computer science, computer engineering, electrical engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of embedded software development experienceStrong coding skills, preferably in C, C++, Python, and assemblyExcellent analytical and debugging skillsExperience in the design and development of embedded software for real-time operation, especially on ARM processorsUnderstanding of wireless protocols, ideally WiFi or BluetoothPassionate, inquisitive, and seek to tackle everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersThrive in a collaborative environment and be able to communicate clearly while expertly driving projects across many teams.Bachelor’s degree in computer science, computer engineering, electrical engineering, or equivalent experience", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \nJoin the Wireless Technologies and Ecosystems organization and be part of an outstanding team of engineers driving innovation and developing products used by millions worldwide. Our team is looking for a highly motivated embedded software engineer to design and develop WiFi Firmware for Apple’s latest products, including the next generation of Apple Watch, AirPods, iPhone, and iPad."}, "200451600": {"jobID": "200451600", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "SoC Power Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451600/soc-power-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of a BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "We are looking for applicants phenomenal programming skills and an understanding of low-power digital design and power fundamentals, including:Expertise on C/Assembly programming and associated tool chains.Use of basic lab equipment such as multi-meter units, oscilloscopes, etc.Calculations for dynamic and static power in CMOS.Strong communication skills and ability to work as a team.Minimum requirement of a BS degree", "jobDescription": "As part of our Silicon Engineering group, you will take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you will help design products that bring to our customers experiences they’ve never before envisioned!\n\nYou will be part of an exciting silicon design group that is responsible for designing state-of-the-art ASICs. We have an extraordinary opportunity for Validation Engineers. \n\nThe SoC hardware development team is looking for a motivated engineer to fill a full-time position. The primary role is to engage in power hardware validation and analysis of typical SoC workloads. The analysis of the workloads and their power dissipation will help drive the power optimization efforts to achieve best-in-class power/performance."}, "200459865": {"jobID": "200459865", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "AIML - Sr Engineering Program Manager, Siri in the Car and Hearables", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459865/aiml-sr-engineering-program-manager-siri-in-the-car-and-hearables?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors or Master’s degree in Computer Science or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "8+ years of experience in project or program management shipping experiences and featuresExcellent project management skills including project structuring and managing multiple work streams interdependentlyThorough understanding of testing, build and release processes for sophisticated softwareAbility to define and prioritize long-term feature roadmap, create feature specificationsDemonstrated skill of negotiating and distilling sophisticated technical requirements from multiple partners into a coherent long term platform roadmapSolid knowledge of technical system architecture and systems design tradeoffsDemonstrated data-driven decision-making skills, including experience leading data driven projects or programs.Outstanding group facilitation, interviewing and influence skillsAbility to communicate abstract ideas clearly and independently manage complex project objectivesStrong verbal and written communication skills, including negotiation, presentation and influenceAbility to independently draft and present deliverables, recommendations and communication strategiesBachelors or Master’s degree in Computer Science or related field", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you love taking on challenges that create a positive impact? Are you passionate about empowering many ground-breaking intelligent experiences to be made? The Siri Assistant team is building groundbreaking technology... and we are looking for people like you! \n\nWe’re looking for a strong Engineering Program Manager who will lead how Siri works in the Car and on AirPods. The individual has demonstrated a consistent record of building and maintaining sophisticated software platforms, tools and processes that deliver new end-to-end experiences that delight customers."}, "200464162": {"jobID": "200464162", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Principal Software Engineer, Apple Cloud Platform", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464162/principal-software-engineer-apple-cloud-platform?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree, or above, in an engineering-related field or equivalent related experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "7+ years of experience building scalable microservicesExperience with Containerization and Serverless TechnologiesExperience collecting high-level requirements and translating them into pragmatic solutionsProficient with various programming languages such as Java/Python/Go for automation or integration with multiple APIs (RESTFul, gRPC, etc.)Experience operating and developing infrastructure and services in public cloud environments (AWS, GCP, or Azure)Enjoys learning new skills and technologiesSolid communications skills, capable of working with cross-functional technical and business teams and varying levels of management in a professional mannerBachelor's degree, or above, in an engineering-related field or equivalent related experienceExperience in the below is a plus:• Understanding of security & cryptography• Programming Languages: Go (golang) and Java", "jobDescription": "Imagine what you could do here. The people here at Apple don't just build products — we craft the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThis team is more than a group of engineers -- it's a group passionate about Apple products, services, and engineering culture. The team is seeking an experienced Software Engineer to focus on building the next generation of cloud services. Your work will power marquee Apple experiences such as FaceTime, iCloud Drive, Photos, Backup, and Push notifications services while also helping build new ones."}, "200361781": {"jobID": "200361781", "origin_search": null, "posted": "Apr 11, 2022", "jobTitle": "Senior Display Driver Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200361781/senior-display-driver-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Technical BS/MS degree or equivalent years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Highly skilled in C/C++ for embedded systems, including development of drivers/firmware for SoCsDevelopment experience on macOS, Unix, or Linux preferred.Knowledge of different display technologies, such as Pixel Pipeline, HDMI, Display Port, etc is preferredExcellent collaborative skills including written and verbal communicationThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsHard-working and inquisitive, and seek to tackle everyday problems in innovative waysTechnical BS/MS degree or equivalent years of experienceNice to have:-  SoC HW bring up and debugging is a plus-  knowledge of display stack, display drivers, video formats, power management strategies, or backlight", "jobDescription": "Do you love working on state-of-the-art technologies? Are you forward-thinking and love solving technological and architectural challenges? The Display Firmware and Driver team within the IMG/GPUSW organization delivers the software for display pixel and backlight pipelines for Apple's innovative products, including Mac, iPhone, iPad, Apple Watch, and Apple TV. We are looking for an outstanding, driven, and dedicated engineer to join the team. The successful candidate will be a high-energy problem solver with a passion for excellence and a track record for getting the job done. We are looking for people who are excellent standout colleagues and who also work well on individual assignments."}, "200452903": {"jobID": "200452903", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Silicon Validation Software Engineer: IP Integration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452903/silicon-validation-software-engineer-ip-integration?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong software skills in C/C++.Familiarity with programming in assembly languagePassionate about writing code close to the hardware, and debuggingFamiliarity with computer architecture, memory hierarchies, CPUs and cachingYou enjoy the validation mentality: detail-oriented, curious, and persistentExperience in writing code, developing tests , and coming up with strategies for SoC silicon validation is a huge plusExperience in graphics, video codec, video capture, display mechanisms, and storage technologies is ideal experience with scripting (Python, Tcl, Perl) is a plusBS and a minimum of 10 years relevant industry experience", "jobDescription": "Join a team of SME embedded software engineers with a diverse set of backgrounds to do system level validation of Apple's next generation SoCs."}, "200455495": {"jobID": "200455495", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Media Streaming Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455495/media-streaming-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS/CE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong programming skills in C/C++Excellent debugging and troubleshooting skills using network analysisGood familiarity with code versioning toolsGood written and verbal communication skillsAbility to work well with tight schedules and rapid development cyclesBS or MS in CS/CE or equivalentNICE TO HAVE BUT NOT REQUIRED:Knowledge of media streaming protocols (e.g., HTTP Live Streaming HLS, DASH), codecs (e.g., H.264, HEVC, AAC, AC3) and transports/container formats (e.g., MP4, MPEG-2 TS)Experience in developing audio/video players.Experience in working with content protection technologies for media streaming is desirableFamiliarity with CDN architectures (caches, origin servers, proxies, etc) is desirable.Proficiency in multi-threaded development", "jobDescription": "Apple's Streaming Media Team, is looking for proactive and hardworking engineers to join our streaming media playback team. Our team works on technologies that power streaming media playback experiences on Apple platforms (e.g, iPhone, iPad, ATV, Mac and Apple Watch). We build frameworks that provide client app’s the ability to stream highest-quality media available from your favorite video services (e.g. iTunes Movies, Netflix, HBO, Hulu, MLB, etc) without stalling by building on core technologies such as Core Media, AVFoundation."}, "200451979": {"jobID": "200451979", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Senior Wireless SoC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451979/senior-wireless-soc-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS + 10 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "This position requires thorough knowledge of the ASIC design flowStrong experience in complex ASIC design and IP integration, with a focus on high performance, low area, and low powerSuccessful tape-outs of multiple complex, high-volume SoCs in advanced design nodesProficient in design methodologies and EDA tools for Lint, DFT, CDC, Synthesis & STAUnderstanding of UPF and low-power design & implementation techniquesExpert knowledge of SoC Architecture and HDL languages like VerilogProficiency in one or more of the following highly desirable: PCIe, AXI/AHB bus fabric, ARM-based processor sub-systemsPrevious leadership experience is a plusBS + 10 years of relevant experience. MS preferred.", "jobDescription": "Come and join Apple’s growing wireless silicon development team. Our wireless SoC organization is responsible for all aspects of wireless silicon development, emphasizing highly energy-efficient design and new technologies that transform the user experience at the product level. All of this is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. If you enjoy a fast-paced and challenging environment, collaborate with people across different functional areas, and thrive during crisis times, we encourage you to apply."}, "200450234": {"jobID": "200450234", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Analog Custom Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450234/analog-custom-silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years of experience in test development, debug, and reporting for mixed-signal ICs and IPs.Hands-on experience with lab equipment including digital multimeter, source meter, spectrum analyzer, signal generator, oscilloscope, power supply, logic analyzer, BERT, etc.Hands-on experience in designing PCB schematics (Orcad) and layout (Allegro) for analog and mixed-signal applications including FPGA.Hands-on experience with test automation and data analysis platforms.Excellent coding / scripting skills (Python, Perl, Tcl, etc.).Experience in test lab setup and maintenance, as well as rework.Experience in testing of PLL, DLL, SERDES, memory interface, LDO, and voltage reference.ADC / DAC testing experience is a plus.Experience in SI / PI measurements is a plus.Strong communication and interpersonal skills.Leadership skills for driving cross-functional test plans and debug activities.Analog circuit design experience is a plus.BS degree in technical discipline with minimum 3 years of relevant experience.", "jobDescription": "Imagine what you could do here at Apple?\nTogether we could help craft the next generation of the world’s finest devices. New ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish.\nThe AMS team is searching for a self-motivating, engineer for the role of Hardware Characterization Engineer. As a member of the AMS team, we will be working on the leading-edge technology nodes to build best-in-class custom analog designs used to connect our world-class products to the world as well as optimizing their performance.\nYou will become part of a development team that cultivates engineering excellence, creativity and innovation. Collaboration across teams is a key component of success at Apple. The right candidate will thrive in that type of environment. It's one of the most exciting aspects of the job. Dynamic, smart people and inspiring, innovative technologies are the norm here\nWill you help us design the next generation of revolutionary Apple products?"}, "200280037": {"jobID": "200280037", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Quality Engineer, Partner Solutions and Tech", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200280037/quality-engineer-partner-solutions-and-tech?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent. 5+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Solid understanding of development lifecycles, testing methodologies, and QA processes.Experienced in developing test plans, building tools and test frameworks.Computer Science fundamentals and experience in object-oriented design, data structures, and algorithms.Proficiency in programming language (e.g. Java, Python, Ruby, C++, JavaScript, TypeScript, SQL).Experience understanding and/or testing with APIs.Programming experience with automation scripting/tools/tests harness (e.g. Selenium, Cucumber, Karate, RestAssured, Appium).Strong debugging skills to identify software issues.Additional:Familiarity with CI (Continues Integration) systems a plus.B.S. in Computer Science or equivalent. 5+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  Apple's Partner Solutions and Technology team is looking for an extraordinary Quality Engineer who is passionate about quality. You should have attention to detail and a dedication to deliver high-quality results. To be successful, you should be self-motivated; driven to achieve and exceed commitments. You also need to exude exceptional collaboration skills, including the ability to mentor and be mentored. Possess a strong passion to work in a growing, energizing environment of innovation, working with a creative team of talented developers and Quality Engineers. If you want to be a part of this amazing team, this position is for you.  Dynamic, inquisitive people and inspiring, innovative technologies are the norm here. Will you join us in crafting solutions that do not yet exist?"}, "200239815": {"jobID": "200239815", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sr. Motion Sensor Algorithm and State Estimation Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200239815/sr-motion-sensor-algorithm-and-state-estimation-engineer-spg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. in Engineering + minimum of 10 years of industry experience\nM.S. in Engineering + minimum of 5 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Skilled in the of development, theory, design, modeling, and implementation of sensor fusion algorithms based on inertial sensors + external aiding. eg. Kalman filters, batch least squares, complementary filters, etc.Experience with robotic platform dead-reckoning solutions that include kinematic modeling, odometry, and inertial propagation.Expert in calibration and signal processing of motion sensors and intrinsic parameters.B.S. in Engineering + minimum of 10 years of industry experience\nM.S. in Engineering + minimum of 5 years of industry experienceNice to have:•Experience implementing and releasing software/algorithm designs into products.•Familiarity and experience testing integrated GPS/INS products•Experience with functional safety, redundancy, and graceful degradation for navigation.•Experience with source control (Git) on multi developer projectsApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in significant ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programmes. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.", "jobDescription": "One of Apple’s R&D groups is currently seeking a Sr. Motion Sensor Algorithm and State Estimation Engineer. This engineer will develop custom algorithms for sensor fusion, calibration and processing of our motion sensing subsystem. This individual will drive algorithm design, architecture, development workflow, and system level integration. Typical work products will include reference algorithm designs or embedded implementation, performance analysis, proofs of concept, and integration plans.  \n\nDoes working on autonomous technology excite you? Innovation is in your hands! We are ready to help you help us grow."}, "200463824": {"jobID": "200463824", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Power and Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463824/power-and-performance-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor or Masters in Computer Science, Electrical engineering, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Programming skills in C, Python, etcExperience in optimizing the power and performance of cellular products2+ years experience either with Linux, macOS or command line toolsFamiliarity with lab equipment such as oscilloscopes, multimeters, etc.Embedded SW experience is a mustStrong analytical thinking and problem solving skillsSelf-motivated and able to work independentlyExcellent verbal and written communication skillsBachelor or Masters in Computer Science, Electrical engineering, or equivalent", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide We build and seamlessly integrate technologies that enriches peoples' lives and deliver the best user-experience. Our team is looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Multifaceted, encouraging and innovative people who build industry-defining technologies are the norm at Apple. If you're passionate about building technology that will make a difference, we may have the job for you! As a Cellular Power and Performance Engineer, you will be a key member of our highly innovative Cellular team, developing Cellular technology and SoC for novel ultra-low-power cellular modems. As a member of this team you are expected to optimize the power and performance of the cellular products."}, "200451964": {"jobID": "200451964", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "Analog IC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451964/analog-ic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's of Science in Electric Engineering with 3+ years of relevant experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  The ideal candidate should have deep understanding of analog/mixed-signal design-  Solid understanding and expertise in crafting analog/mixed-signal circuit blocks including ADCs, DACs, PLLs, DLLs, filters, bandgap, biasing circuits, LDO regulators, amplifiers, comparators, switched-cap circuits and oscillators-  In-depth knowledge of analog mixed-signal concepts like mismatch mitigation, linearity, stability, low-power and low-noise techniques-  Experience with high-speed digital circuits (e.g., serializer, de-serializer, counters, dividers, etc.)-  Design experience in sophisticated CMOS technologies, design with FinFet technology-  Hands-on experience with AMS IC development from definition to high-volume production including layout supervision, bench evaluation, correlation, and characterization-  Experience in lab testing of mixed-signal circuits and experience in using spectrum analyzers, oscilloscopes, signal generators, etc. to validate analog designs-  Able to build VerilogA/AMS behavioral models, analyze and lead characterization data from lab and volume testingBachelor's of Science in Electric Engineering with 3+ years of relevant experience preferred", "jobDescription": "In this role, you will actively work within the Analog/Mixed-Signal team to design and deliver hard IPs to Apple’s products. We have an opportunity for a forward-thinking analog/mixed-signal engineer with background in high-speed data converters, clocking circuitry and analog filters. As a member of our team, you will have the rare and exciting ability to work on upcoming products that will surprise and delight millions of Apple’s customers!\n\nAt Apple, we work every single day to craft products that enrich people’s lives. We love working on challenges that no one has solved yet. Do you have strong fundamentals and enjoy solving technical challenges? Are you passionate about learning new skills and improving the value of your work? This role offers all of this while offering a strong culture where you drive your own career!"}, "200451962": {"jobID": "200451962", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal IP Post Silicon Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451962/analog-mixed-signal-ip-post-silicon-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE is required\nMinimum 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in AMS test development that includes: review specification document; draft validation plan; build test bench; and perform data collection with automationStrong fundamental understanding of analog & mixed signal circuitry in one or more of the following domains: PLL, Data Converter, DDR Memory, Temp Sensor, etc.Proficient in lab instruments such as Oscilloscope, Spectrum Analyzer, Pattern Generator, etc.Experienced in scripting language, Python preferred, to automate test and analyze dataDiligent & Emphasis on quality of resultsInitiative in taking ownership & responsibility to drive deliverablesStrong verbal and written communication skillsHands-on lab experience including soldering/instrumenting systems is a plusBSEE is required\nMinimum 3 years of industry experience", "jobDescription": "In this highly visible role, you will perform lab characterization and validation of various analog & mixed signal embedded circuits; and collaborate with multi-functional teams to launch the world's most premiere mobile SoC’s.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially motivated Analog Mixed Signal IP Silicon Validation Engineer! As a member of our dynamic group, you will have the rare and great opportunity to work on upcoming products that will delight and encourage millions of Apple’s customers every day!"}}