{"200465310": {"jobID": "200465310", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Senior Distributed Systems Software Engineer - Observability", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465310/senior-distributed-systems-software-engineer-observability?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in CS or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience with one of Java, Scala, Golang or RustExperience with designing, implementing and supporting highly scalable infrastructure servicesDeep understanding and work experience in distributed systemsExperience designing and using columnar storageFamiliarity with time series database internalsExperience building Observability platforms is preferredDeep understanding of core CS concepts including data structures, algorithms and concurrent programmingStrong attention to detail and excellent analytical capabilitiesPassion for developing and testing clear, robust codeAbility to learn and apply new technologies and frameworks.Great communication skillsBS or MS in CS or equivalent15+ years of industry experience", "jobDescription": "The Apple Cloud Infrastructure (ACI) team is building the next generation of foundational tools that empower software developers at Apple to build products that our customers love. The Observability team within ACI is a fast moving, highly skilled team this is designing and building a suite of platforms and services that help Apple engineers observe and get insights into their systems. \n\nIf the thought of working with petabytes of data interests you, this is the place to be. Our systems must scale globally, stay highly available, and \"just work”, while supporting some of the largest services in world. That's a tall order, and we're looking to add more talented and passionate engineers who love challenges. If you'd love to join this amazing team, we'd love to hear from you."}, "200451095": {"jobID": "200451095", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Debug Tools Software QA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451095/debug-tools-software-qa?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Experience building enterprise level solutions with Python and JavaScriptExperience with the Unix/Linux command line interface and shell scripting (Bash,Bourne, etc.)Experience testing APIs such as GraphQL, RESTExperience using browser test automation software such as Selenium, Cypress, etc.Experience writing unit tests and integration testsExperience working with databases such as MySQL and MongoDBExperience with distributed source control systems such as Git.BS and a minimum of 3 years relevant industry experience• A passion for QA automation• Knowledge of current and up-coming QA technologies/frameworks• Understanding of performance and scalability testing• Understanding of continuous integration and build concepts• Prior experience architecting a software QA infrastructure is a plus", "jobDescription": "Apple’s Silicon Validation Team drives validation, characterization and debug of Apple\nproducts. We are searching for an engineer to plan and execute software QA testing\nand development in the context of our silicon debug tool ecosystem. You will be\nresponsible for architecting the QA environment from ground-up using industry-standard\ntools and methodologies. You will be working with a dynamic team utilizing your\nknowledge and skills to help ensure the success of Apple products."}, "200455695": {"jobID": "200455695", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Software Senior Manager, AppleCare Field Diagnostics Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455695/software-senior-manager-applecare-field-diagnostics-engineering?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in Computer Science, Software Engineering, Computer Engineering or related fields of study with 10+ years of overall experience in the industry."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$229,000", "max": "$343,500,"}, "benefits": null, "requirements": "10+ years of software development experience, with a minimum of 4 years in a SW organization management roleDevelopment experience writing Swift/Objective-C on macOS/iOS/tvOSExperience in computer / hardware architecture - a strong working knowledge of CPUs, GPUs and SOCs a plusExperience with macOS or iOS overall system architecture, and security infrastructure/modelsExperienced with git and other source version control softwareExperience with Mac diagnostics and its inter-related systemsProven track record of driving technical innovationAbility to dive deep technically and understand the small technical nuances of a Apple products and systemsAbility to effectively work with multi-functional teams to understand requirements and identify design and engineering impactsShown ability to hire, grow, and mentor strong teamsExcellent communication (ability to communicate technical concepts to a non-technical audience) and critical thinking skillsSelf motivation and collaboration - ability to build great relationships with other engineering teams and follow up on technical issues requiredExperience with manufacturing or repair operations flows a plusBS degree in Computer Science, Software Engineering, Computer Engineering or related fields of study with 10+ years of overall experience in the industry.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. \n\nAs the manager of Field Diagnostics Engineering, you will lead a team that has proven itself by delivering high-quality hardware diagnostic solutions and tools that support field repair technicians, and ultimately improve the ownership experience of Apple customers. Developing and cultivating partnerships with the multi-functional teams both inside and outside AppleCare is crucial to success in this role. The individual must be hands-on, disciplined with a desire to succeed in a challenging environment."}, "200464085": {"jobID": "200464085", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Wireless Embedded Software Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464085/wireless-embedded-software-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Master in Electrical/Computer Engineering, Wireless Communications or equivalent majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Experience in developing embedded real-time software for Wireless SoCsFundamental knowledge and understanding of embedded processors and real-time OS conceptsSolid understanding of embedded system/architecture (core, cache, memory, bus, interrupts, sleep/wake, clock, power, peripherals like UART, SPMI, I2C, PCIe, etc)Experience in developing low level driver software for embedded platformsExcellent software engineering skills, including driver software design, implementation, validation and debuggingExperience and proficiency in C/C++Experience in debugging methodologies and strategies for real-time embedded systems.Experience and familiarity with version control systems like git, Perforce, etc.Strong communication and interpersonal skills.Master in Electrical/Computer Engineering, Wireless Communications or equivalent majors", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems (WTE) organization and be part of an outstanding team of engineers driving innovation and developing products used by millions worldwide. Our team is looking for a highly motivated embedded software engineer to design and develop platform software drivers for Apple's latest and next generation of wireless products."}, "200448065": {"jobID": "200448065", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "L1/PHY Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448065/l1-phy-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Bachelor's Degree in Electrical Engineering, Telecommunications or Equivalent.\n\nMasters or PhD Degree preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven understanding of wireless communication, information theory, signal processing and 3GPP Standards (Physical Layer LTE and NR specifications)Embedded cellular FW/SW programming along with good understanding of communication systems algorithmsUnderstanding of cellular communication protocols. (Low-Power, Low Latency, High Reliability)Deep understanding of software engineering principles, and core computer science fundamentalsGood experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programmingWorking knowledge of possible cellular modem L1/PHY architectures with emphasis on the HW/SW partitions of communication subsystems including inter-module interfacesExperience with 4G/5G Modem L1 Control covering PHY procedures and data path timelines, starting from RF transceiver through to higher layer protocol stacksExcellent skills in low-level programming expertise using C, C++, and assembler, embedded systems proficiency, limited and shared resourcesExperience with SW prototyping of solutions using unit test/virtual platformsProficiency debugging embedded software systems using various methods including log analysis and using test equipmentsPassionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are important to our customersBachelor's Degree in Electrical Engineering, Telecommunications or Equivalent.\n\nMasters or PhD Degree preferred", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing wireless technologies? Are you passionate about innovation that can enrich user experience and delight customers?  Do you get excited with constant challenges and thrive in a culture of debate? In the Wireless Wireless Technologies and Ecosystems Group, you will help commercialize groundbreaking Wireless Technologies in Apple products. You’ll design, develop, and patent the next generation of our state-of-the art wireless technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nThe position demands expertise in Wireless Systems with an emphasis on Cellular systems and requires close collaboration with cross functional hardware and software teams. We are seeking a passionate, highly motivated and self-directed engineer to work across the L1/ PHY layer of groundbreaking wireless technologies."}, "200460393": {"jobID": "200460393", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "AR/VR Embedded SW and Prototyping", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460393/ar-vr-embedded-sw-and-prototyping?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills with operating systems focus."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Genuine interest in system software architectureKnowledge of hardware-software interfacesExperience in developing kernel drivers, embedded firmware, system frameworks, etcIn-depth knowledge of C/C++Experience with development in simulation and emulation environmentAbility to work under tight schedule and deliver on timeExcellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersStrong communication and collaboration skillsBS in Computer Science/Computer Engineering or equivalent experience/skills with operating systems focus.", "jobDescription": "The Technology Development Group at Apple is actively looking for a highly motivated Software Engineer to contribute and build Apple’s future technologies in Augmented Reality (AR) and Virtual Reality (VR) space. The successful candidate will demonstrate deep knowledge in kernel driver development, embedded firmware development, systems debugging and a desire to work with C and C++ System Programming for our devices. Role entails architecting, prototyping and developing real-time software stack for Apple's revolutionary AR/VR roadmap.\n\nOur team builds technology that defines industry standards, and therefore we seek people who thrive to innovate. Tenacity and the passion to learn are skills we value on our team, and if you want to impact millions of customers by working on the most advanced technology solutions, we want to talk to you."}, "200456690": {"jobID": "200456690", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "AR/VR Display Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456690/ar-vr-display-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$250,000,"}, "benefits": null, "requirements": "Hands on experience developing Display software stackComfortable working close to hardwareExperience in developing kernel drivers, embedded firmware, system frameworks, user-space daemons, etcIn-depth knowledge of C/C++Ability to work under tight schedule and deliver on timeExcellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersStrong communication and collaboration skillsBS in Computer Science/Computer Engineering or equivalent experience/skills.", "jobDescription": "The Technology Development Group at Apple is actively looking for a highly motivated Software Engineer to contribute and build Apple’s future technologies in Augmented Reality (AR) and Virtual Reality (VR) space. The successful candidate will demonstrate deep knowledge in end to end Display software stack. Candidate is expected to be proficient in operating systems concepts, software development, embedded firmware development and C/C++ programming. Role entails designing and developing real-time software stack for Apple's revolutionary AR/VR roadmap.\n\nOur team builds technology that defines industry standards, and therefore we seek people who thrive to innovate. Tenacity and the passion to learn are skills we value on our team, and if you want to impact millions of customers by working on the most advanced technology solutions, we want to talk to you."}, "200456698": {"jobID": "200456698", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "AR/VR Camera Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456698/ar-vr-camera-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science/Computer Engineering or equivalent experience/skills."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$250,000,"}, "benefits": null, "requirements": "Hands on experience developing Camera software stackComfortable working close to hardwareExperience in developing kernel drivers, embedded firmware, system frameworks, user-space daemons, etcIn-depth knowledge of C/C++Ability to work under tight schedule and deliver on timeExcellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teamsObsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersStrong communication and collaboration skillsBS in Computer Science/Computer Engineering or equivalent experience/skills.", "jobDescription": "The Technology Development Group at Apple is actively looking for a highly motivated Software Engineer to contribute and build Apple’s future technologies in Augmented Reality (AR) and Virtual Reality (VR) space. The successful candidate will demonstrate deep knowledge of Camera software stack ranging from ISP firmware, kernel drivers to user-space application. Candidate is expected to be proficient in operating systems concepts, software development, embedded firmware development and C/C++ programming. Role entails designing and developing real-time software stack for Apple's revolutionary AR/VR roadmap.\n\nOur team builds technology that defines industry standards, and therefore we seek people who thrive to innovate. Tenacity and the passion to learn are skills we value on our team, and if you want to impact millions of customers by working on the most advanced technology solutions, we want to talk to you."}, "200440188": {"jobID": "200440188", "origin_search": null, "posted": "Nov 4, 2022", "jobTitle": "Software Developer in Test - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440188/software-developer-in-test-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in computer science or equivalent field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proficiency in Java/Python.Proficient with Front-End, UI, Micro-Services architectures and Rest API.Working experience with Cloud technologies (like AWS).Experience with technologies like Hadoop, Oracle, Cassandra, Hive, Kafka messaging is a plus.High expertise in building test frameworks along with functional testing and end to end automation skills using Java/Python.Good experience in writing test plans, defining test strategy, test data generation techniques and crafting test specifications.Practice of testing strategies and methodologies, exposure to test harnesses is a plus.Proven QE technical lead ability. Very responsible, organized, driven, and passionate about quality. Very positive attitude, with excellent work ethics.Proven track record to deliver high-quality design, code, and tests, on tight schedules. Results oriented and deadline driven.Excellent analytical, problem solving and communication skills, with cross-functional teams.Experience with GitHub, defect management and continuous automation is idealCI/CD integration experienceExcellent collaboration and interpersonal skills.Curious about new technologies and quick learner.BS/MS in computer science or equivalent field.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.\n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.\n\nWe are looking for an engineer with skills and passion to help build out our large scale platform. The QE team fills the mission-critical role of ensuring that our sophisticated, large-scale systems are healthy, supervised, automated, and designed to scale with consistent performance. As an engineer, you will work alongside our team of engineers to create and supervise quality systems in the context of a micro-services architecture, identify continuous improvement opportunities and implement best practices. You will be performing design engineering analysis and development. You will contribute to ensure we provide a world-class user experience for our customers."}, "200342085": {"jobID": "200342085", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "System Engineering Program Manager (EPM) - Technology Development Group (TDG)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200342085/system-engineering-program-manager-epm-technology-development-group-tdg?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "EducationBS/MS CE/EE/ME or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Understanding of consumer electronics system architecture.Demonstrated ability to work through system-level development tradeoffs.Developed skills for planning and executing development in advanced consumer electronics products - both prototype build events and overall product planning.Strong technical background in Electrical, Mechanical, or Software Engineering.7+ yrs of relevant hardware engineering experience in consumer electronics.5+ yrs of project management experience.Proactive and highly self-motivated; good critical thinking capabilities and strong attention to detail.Ability to operate well in an environment with rapid development cycles and constant change.Experience as primary point of contact with vendors and CM partners to establish a daily build plan, provide clear direction and guidance to meet the program and build objectives.Willingness to travel internationally to support development builds.EducationBS/MS CE/EE/ME or equivalent work experience", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for an experienced, highly technical EPM to join the team driving definition and development of a new product category. If you have broad experience across various key hardware technologies (e.g displays, cameras, RF, custom silicon), a strong product/customer focus, experience guiding complex programs through the development process, and the ability to distill tradeoffs down to key factors and drive critical product decisions we’d love to hear from you!!!"}, "200408565": {"jobID": "200408565", "origin_search": null, "posted": "Aug 12, 2022", "jobTitle": "WiFi P2P Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200408565/wifi-p2p-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid knowledge of data structures and their applicationsExperience developing software using C/C+, Objective-C, or SwiftStrong competence and experience in Layer 2, Layer 3 networking, QoSStrong analytical and problem-solving skills.Excellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while driving multiple projects across teamsPreferred Qualifications:Knowledge and experience of different LAN and WAN technologiesKnowledge of IEEE 802.11/WiFi Protocols.Experience developing software using embedded SDKs, frameworks and/or BSPs.Linux / Unix kernel networking stack knowledge and understanding of operating system fundamentals.Solid understanding of OO design principles and design patterns.Experience with hands-on development and troubleshooting on embedded targets. e.g., GDB, shell scripting, packet tracing (tcpdump, wireshark)Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred.", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience.\nAs part of the WiFi software development team, we make decisions that influence the connectivity experience on products people use every single day, across the world. Are you a software development enthusiast? Are you passionate about internet-enabled devices and networking protocols? Do you want to learn more about WiFi and other wireless technologies? If your answer is yes, we may have the job for you."}, "200441710": {"jobID": "200441710", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Studies Project Manager, Health", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441710/studies-project-manager-health?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. degree in biomedical engineering or any engineering field, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "5-7+ years of project management experienceStrong human research background with clear understanding of study lifecycleExperience working with and handling external sites and/or managing vendorsStrong organizational and leadership skills with a track record of timely project deliveryExperience running virtual and/or remote studies and knowledge on conducting clinical studies with Hardware/Software devicesStrong problem solving skills and critical thinkingExperience in budgeting and financial forecasting at a project/study levelB.S. degree in biomedical engineering or any engineering field, or equivalent-  Thrive in a fast-paced environment-  Ability to adapt, improve, and influence teams to embrac best practices-  Knowledge of domestic and International regulations-  Self-motivated and proactive with critical thinking and resourcefulness to drive the project to success-  Excellent communication skills, both verbal and written-  Experience with performing audits with various regulatory agencies a plus-  Some travel is required, approximately 15-20%", "jobDescription": "The Health Group conceives of and proves out exciting new technologies for Apple’s future products and features. We are seeking a Studies Project Manager to lead human study efforts in collecting data to support development and validation of new health sensors and algorithms."}, "200463273": {"jobID": "200463273", "origin_search": null, "posted": "Feb 14, 2023", "jobTitle": "Firmware Engineer - AirPods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463273/firmware-engineer-airpods?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of proven excellence in firmware, device driver, or equivalent experienceExperience with MCUs, peripherals, features, and development environmentsSolid C/C++ coding abilitiesKnowledge of audio, DSP and Bluetooth technologies is preferredFamiliarity with real-time audio (sample rates, buffering, I2S, PCM, drivers)Strong electrical system and software debugging skillsPassion for product ownership and track record of product developmentExcellent written and verbal communication skillsBS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience.", "jobDescription": "The AirPods Firmware team is looking for an enthusiastic engineer to join our team. This is an individual contributor role to develop the technical development of the audio platform for our products. You will have the opportunity to drive the technology and product development for Apple's consumer audio products. In this role, you will work with a wide cross-functional team to continually innovate technology implemented in Apple products."}, "200375691": {"jobID": "200375691", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Firmware Engineer - AirPods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200375691/firmware-engineer-airpods?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent, experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "5+ years of proven excellence in firmware, device driver, or equivalent experienceExperience with MCUs, peripherals, features, and development environmentsSolid C/C++ coding abilitiesKnowledge of audio, DSP and Bluetooth technologies is preferredFamiliarity with real-time audio (sample rates, buffering, I2S, PCM, drivers)Strong electrical system and software debugging skillsPassion for product ownership and track record of product developmentExcellent written and verbal communication skillsBS or M.S. in Computer Science, Computer Engineering, Electrical Engineering, or equivalent, experience.", "jobDescription": "The AirPods Firmware team is looking for an enthusiastic engineer to join our team. This is an individual contributor role to develop the technical development of the audio platform for our products. You will have the opportunity to drive the technology and product development for Apple's consumer audio products. In this role, you will work with a wide cross-functional team to continually innovate technology implemented in Apple products."}, "200463154": {"jobID": "200463154", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Senior Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463154/senior-embedded-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. / PhD. preferred, B.E/B.S/ in Computer Science, Electrical Engineering or related majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Excellent software design, problem solving and debugging skillsSolid programming skills - C / C++Minimum 10 years of direct related experience in system softwareGood written and oral interpersonal skillsSound decision-making and ability to work independentlyStrong critical thinking and analytical skillsAbility to mentor other engineersM.S. / PhD. preferred, B.E/B.S/ in Computer Science, Electrical Engineering or related majors", "jobDescription": "Want to work on cutting edge technology that keeps the customer front and center? The Video Engineering group at Apple is responsible for creating the image/video core technologies used in almost all Apple products and services. As an embedded software engineer, you'll be developing drivers and firmware, interacting with Core OS, Computer Vision algorithm, display and camera teams as well as hardware design teams to deliver system software critical to future revolutionary products as well as core technology products that are known and loved by so many users. Functionality critical to the product along with power and performance centric development are the salient features of the role. As a member of a fast-paced team, you will also have the unique and exciting opportunity to shape upcoming products that will delight and inspire millions of people every day!"}, "200394970": {"jobID": "200394970", "origin_search": null, "posted": "Aug 17, 2022", "jobTitle": "WiFi Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200394970/wifi-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "WiFi driver SW developmentWiFi protocol and 802.11 standardEmbedded Linux programmingProven excellence in Software development, with deep understanding of ARM architecture and RTOS conceptsDeep understanding of data structures, object-oriented design, and system architecture in an embedded environmentStrong software engineering skills including design, programming (using C, C++), scripting (Python preferred, Perl) and debuggingIn-depth understanding and strong hands-on experience on 802.11 technologies and standardsProficient understanding of TCP/IP suite of protocolsExperience with versioning and automation tools, such as git or unit testingEffective written and oral communication skills, particularly with technical content.Highly organized, creative, motivated, and passionate about achieving resultsBachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe success we are striving will be the result of very skilled people working in an environment which nurtures creativity, partnership, and thinking of old problems in new ways. \n\nThe mission of the WiFi Technology team - Build the world’s best WiFi experience and most innovative use cases by inventing and improving state-of-the-art technologies. We develop ground breaking WiFi technologies and ecosystems that are central to Apple’s products - the iPhone, Mac products, HomePod, and more! New challenges arise every day that require the sharp problem-solving skills of individuals. Are you in for these challenges? \n\nJoin us! We are looking for a forward-thinking, self-confident, experienced firmware engineer to design, develop & launch next-generation WiFi technologies in Apple products."}, "200436122": {"jobID": "200436122", "origin_search": null, "posted": "Oct 14, 2022", "jobTitle": "Hardware System Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436122/hardware-system-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors, Masters or PhD degree in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong Electrical Engineering fundamentals (analog/digital, RF, EM, signal/power integrity, etc.)Experience with creating and managing stress test plan, executing large scale tests and debugging issuesExperience in test automation and test script development (Python preferred, knowledge on Tcl, Shell and SQL is a plus)Experience with 3D EM or multi-physics simulationsExperience with high speed (PCIe, USB, DP, etc) and low speed (I2C, SPMI, SPI, etc) IO validation including protocol-level and electrical levelKnowledge on computer network and/or SOC architectureKnowledge on understanding how HW, FW, and SW work together to ensure a product's functionality and performance.Familiar with display, camera and/or sensor technologies and their performance validationExperience in board CAD tools including Cadence Concept & AllegroExcellent communication and presentation skillsBachelors, Masters or PhD degree in Electrical Engineering or equivalent", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. And the same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it!\n\nWe are seeking a hardworking system validation engineer to join our Engineering Team and work on revolutionary products."}, "200463844": {"jobID": "200463844", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "iPhone Touch EE Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463844/iphone-touch-ee-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "•Bachelor’s degree + 2 years of experience\n•Master’s degree in Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Strong electrical engineering background in board-level analog and mixed-signal design.Demonstrated experience in all phases of circuit design, development and validation.Schematic design and layout experience (SPICE or Cadence experience a plus).Circuit simulation experience (LCR extraction, signal integrity, etc.).Proficient with using lab equipment (DMM, SMU, Oscilloscope, etc.).Proficiency in MATLAB and Python scripting tools.Excellent written and verbal communication skills and solid teamwork.•Bachelor’s degree + 2 years of experience\n•Master’s degree in Electrical Engineering", "jobDescription": "The goal of the iPhone Touch Sensing Technology team is to enable the world’s best User Experiences through state-of-the-art sensing solutions. The team designs, develops, and delivers high-precision, low-latency MultiTouch solutions that are the gold standard in the smartphone/mobile industries. New challenges arise every day that require innovation across several technical disciplines, including Electrical Engineering, Manufacturing process, Physics, and Algorithms. Come join us in delivering technology from proof-of-concept through ultra-high-volume production! Our team features a collaborative and hands-on environment that cultivates engineering excellence and creativity."}, "200305901": {"jobID": "200305901", "origin_search": null, "posted": "Oct 26, 2021", "jobTitle": "Silicon Validation Triage Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200305901/silicon-validation-triage-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Engineering or Electrical Engineering or equivalent is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "System-level understanding of CPU/SoC architecture, DRAM/memory, and boards.Experience with Silicon chip bringup, validation and debug.Enjoy hands-on debug and problem-solving.Patient and disciplined problem-solving skills in the face of partial data.Good understanding of typical Silicon debug features and techniques.Clear and concise interpersonal skills.Effective collaboration across teams.Understanding of system software and kernel concepts.Moderate UNIX command line and scripting skills.ADDITIONAL DESIRABLE QUALIFICATIONSKnowledge of SoC and IP design flows.Knowledge and use of lab measurement and analytical equipment.IP block-level knowledge.Knowledge of manufacturing test flows and steps.Knowledge of SOC validation concepts.C, Assembly, UNIX system programming.Kernel and device driver programming and concepts.BS/MS in Computer Engineering or Electrical Engineering or equivalent is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work at Apple have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? \n\nAs a member of the Apple SOC Silicon Validation Team, you will use your knowledge of SOC/IP design, debug features and related tools, validation, and problem-solving in order to drive failures to resolution. You will be debugging failures that come from validation, software checkout, or factory screening that appear to be Silicon issues or that require Silicon expertise in order to root cause. You will work at the cross-section of hardware and software and partner with engineers to quickly root cause failures. You will also drive systematic improvements in debug methods, tools and features based on your findings and expertise."}, "200429502": {"jobID": "200429502", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Senior Software Engineer (Java, NoSQL, web services) - AMP Commerce Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200429502/senior-software-engineer-java-nosql-web-services-amp-commerce-engineering?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "A BS Computer Engineering/Computer Science is required. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "7 or more years of Java programming experience.Strong Object-oriented programmingExtensive hands-on software engineering experience, particularly with Java and Service Oriented ArchitecturesStrong Knowledge of databases both SQL and NoSQL and entity relationship modelingExtensive experience programming for eventual consistencyExtensive experience working in a large code baseExtensive experience/knowledge working on highly scalable applications and RESTful web servicesStrong knowledge of scalability and performance issuesExcellent interpersonal skillsCuriosityWilling to take ownership and set direction, especially in gray areasThe attitude that technical debt as an opportunity for better engineeringStrong sense of responsibilityExcellent judgment and integrity with the ability to make timely and sound decisionsInterest in the commerce domainA BS Computer Engineering/Computer Science is required. MS preferred.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries.\n\nThese engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.\n\nThanks to Apple’s outstanding integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep dedication to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, flexible, and multi-functional, offering greater exposure to the array of opportunities here."}, "200387537": {"jobID": "200387537", "origin_search": null, "posted": "Jan 24, 2023", "jobTitle": "Software Developer, WTE", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200387537/software-developer-wte?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Passion to building scalable and legible software solutions across the stack2+ years of experience in development in C, C++, ObjectiveC or SwiftAbility to work collaboratively with multiple teamsInquisitive, and seek to tackle problems in innovative waysLaser passionate about the customer experienceExcellent problem solving and intuitive debugging skillsEager to get your hands dirty!Bachelor’s Degree in Computer Science, Computer Engineering, Electrical Engineering, or equivalent experience required.", "jobDescription": "Join our Wireless Technology Ecosystem(WTE) team and drive innovation that matters! We craft and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. If you're passionate about security and want to work on the world’s most groundbreaking mobile payment systems, then we may have the job for you."}, "200448523": {"jobID": "200448523", "origin_search": null, "posted": "Dec 13, 2022", "jobTitle": "SoC Correlation Product Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448523/soc-correlation-product-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Experience with system level characterization using functional / virus like worst case use cases & correlating to ATE.Understanding of PDN impact on Vmin, ATE test content, system level test programs/ functional content and test hardware.Experience working with and driving cross functional teams.Statistical data analysis tools to perform high volume characterization & production data analysis.Experience in scripting (Python, JMP, PERL etc.) is a plus.BS and a minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). \n\nJoining this group means you’ll be responsible for crafting and building the technology that operates Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product! \n\nWe are seeking a multifaceted engineer to develop system level test programs for debug, characterization, qualification, and production of SoC devices."}, "200447691": {"jobID": "200447691", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Connectivity RF Hardware Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447691/connectivity-rf-hardware-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "BSEE and 10+ years of relevant industry experienceExperience with RF component and circuit integration into consumer productsFluent in one or more connectivity wireless system like WiFi, Bluetooth, UWB or NFCMust be an excellent communicator, both written and oralMust be able to interact closely with offshore engineering development and manufacturing partnersSuccessful track record of delivering highly innovative, and high quality communications productsBe well organized and have the ability to be flexible in a changing work environmentInternational travel as needed and when approved to do soB.S. and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for taking on big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. Join us and help build world-renowned wireless systems that connect customers to their world like never before.\n\nWe have built the best RF hardware design team on the planet! We’re looking for a passionate individual to join our Connectivity RF Hardware team. We support WiFi, Bluetooth, UWB, NFC, GPS, and emerging technologies. As an RF Hardware Design Engineer at Apple, you will contribute to the architecture and product level design integration of next generation wireless radio solutions in all product categories including iPhone, iPad, Home, Watch, AirPods and more."}, "200458485": {"jobID": "200458485", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Digital/Mixed Signal IP Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458485/digital-mixed-signal-ip-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Bring up new silicon and new platforms.Develop software to interact with IP.Work with DV teams to run RTL simulations and analyzing waveforms.Develop automation tools.Review and implement test plans.Review design specifications.Define and review platform requirements and features.Drive data collection.Coordinate with various design, dv, dft, hardware & lab teams.Generate reports.Working with and automating lab instruments.Additional Desirable QualificationsExperience in scripting/automation using Tcl/Perl/Python/ShellExperience with source control applications like Git/SVN/Perforce etc.Experience in data management.Experience with Pandas/R/JMP/Tableau or other data analysis software is a plus.Familiarity with DFT concepts, JTAG, device physics and ASIC design flow.Understanding of digital and analog design & being able to read RTL is a plus.BS and a minimum of 3 years relevant industry experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work at Apple have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Do you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology?"}, "200450117": {"jobID": "200450117", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Senior RFIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450117/senior-rfic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experience.RF/analog and mixed-signal design experience in cutting-edge RF CMOS design.Direct experience in designing and bringing into mass production ZIF RF transceivers in deep sub-micron RFCMOS technology.Deep understanding of analog, mixed-signal and RF circuit design. This includes design of on-chip LNAs and PAs, PLL/VCO/DCO/LOGEN blocks, mixers, baseband filters and amplifiers, data converters and calibration methods associated with such high performance wireless systems and ZIF designs. Experience should also include understanding of DFT and DFM techniques for mass production environment.Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability and other analog impairments.Deep understanding of CMOS device physics, RF device modeling, device noise parameters and inductor modeling.Familiarity with various RF transceiver architectures and their trade-offs, system specifications and ability to work with system architects to translate system requirements into circuit requirements at IC level; strong understanding of impact of modulation type to radio architecture and requirements.Demonstrated capability to work with digital design group for an optimum partition between digital and analog domain.Familiarity with the integration flows and challenges of wireless SoCs.Familiarity with mixed-signal mode verification methodology (SystemVerilog, AMS, Nanotime).Strong knowledge of desense and able to work closely with board RF/HW/Antenna teams to optimize board/module layouts for desense mitigation. Also, has experience with desense mitigation with integrated PMUs/DSPs (i.e. substrate isolation, return loops, package isolation, frequency planning, etc).Familiarity with Cadence Virtuoso, Spectre RF, Matlab, EM simulation (EMX, HFSS) and similar tools.Extensive experience in Si characterization and debug.Ability to drive strong production test/QA methodologies.Extensive experience in IP sourcing and management.BS and 10+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this highly visible role, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200461273": {"jobID": "200461273", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "OS Charging Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461273/os-charging-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S., M.S. in Electrical & Computer Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent programming skills with knowledge of C/C+.Strong understanding of operating systems, hardware, and embedded systems.Proven experience in writing complex kernel drivers and embedded firmware.Collaborates well with cross functional engineering teams.Passionate about new technology bring-up with hardware/software dependencies.B.S., M.S. in Electrical & Computer Engineering or equivalent experience-  3+ years of industry experience developing device drivers and/or hardware bring-up.-  Proven C/C++ skills are required.-  Hands on experience with IOKit or micro-controller development a plus.-  Comfortable reading schematics and working with logic analyzers and/or oscilloscopes.-  Knowledge of computer and/or smartphone system architectures. Familiarity with modern power management techniques.-  Familiarity of battery management algorithms.-  Knowledge of control system theory-  Experience with IOKit drivers on macOS or iOS.-  Familiarity with wireless charging standards such as Qi (WPC) or PMA.", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience! Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices!\n\nWe are looking for an exceptional software engineer to design and implement wired and wireless battery charging software and firmware for the next generation Apple products. New challenges arise every day that require the sharp problem-solving skills of passionate & smart individuals. You will be required to explore novel system power and battery management software algorithms and ship them into our products. The influence of the proposed innovations will span across system architecture, hardware, kernel drivers, firmware, and global system behavior, striving to satisfy both word class system performance and power delivery constraints at the same time."}, "200465094": {"jobID": "200465094", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "OS Charging Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465094/os-charging-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S., M.S. in Electrical & Computer Engineering or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent programming skills with knowledge of C/C+.Strong understanding of operating systems, hardware, and embedded systems.Proven experience in writing complex kernel drivers and embedded firmware.Collaborates well with cross functional engineering teams.Passionate about new technology bring-up with hardware/software dependencies.B.S., M.S. in Electrical & Computer Engineering or equivalent experiencePreferred skills and experience:-  3+ years of industry experience developing device drivers and/or hardware bring-up.-  Proven C/C++ skills are required.-  Hands on experience with IOKit or micro-controller development a plus.-  Comfortable reading schematics and working with logic analyzers and/or oscilloscopes.-  Knowledge of computer and/or smartphone system architectures. Familiarity with modern power management techniques.-  Familiarity of battery management algorithms.-  Knowledge of control system theory-   Experience with IOKit drivers on macOS or iOS.-  Familiarity with wireless charging standards such as Qi (WPC) or PMA.", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience! Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices!\n\nWe are looking for an exceptional software engineer to design and implement wired and wireless battery charging software and firmware for the next generation Apple products. New challenges arise every day that require the sharp problem-solving skills of passionate & smart individuals. You will be required to explore novel system power and battery management software algorithms and ship them into our products. The influence of the proposed innovations will span across system architecture, hardware, kernel drivers, firmware, and global system behavior, striving to satisfy both word class system performance and power delivery constraints at the same time."}, "200451737": {"jobID": "200451737", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Custom Silicon Management Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451737/custom-silicon-management-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Proven experience in either the full SOC design flow up to tapeout or post silicon characterization with exposure to working with design teams to find/fix bugs.Familiarity with the development flow from concept to mass production is an advantageExperience with vendor relationships is a plusPassion for continuous improvements in flows, communication and organizationExposure to hardware and software integration challenges.Familiarity with either analog or digital design and development or post-silicon validation/characterization flows.Experience working in a multifaceted fast-paced & multi-functional engineering environment.Strong desire to quickly learn project development and follow defined metrics & methodologiesExcellent interpersonal, leadership and communication skills.BS + 3 years of relevant experience.", "jobDescription": "Apple is looking for semiconductor engineering professionals with strong leadership and communication abilities to ensure that our 3rd party developed analog/mixed-signal Custom Silicon designs meet the technical, quality, and schedule requirements for all of our hardware products. In this position you will represent Apple in front of our custom silicon vendors all over the world. You will be responsible for driving the full Silicon development cycle from and initial concept, vendor selection, implementation, validation, qualification through ramp for mass production. You will use your technical knowledge including effective program / project management skills to drive silicon program schedules and resolve technical issues that enable timely silicon delivery into Apple products. Additionally, you will work with internal and external teams to influence prioritization, lead issue resolution, communicate status/issues/next steps and participate in continuous improvement initiatives."}, "200440289": {"jobID": "200440289", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Color Management Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440289/color-management-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD degree in Computer Science OR Electrical Engineering OR Equivalent Degree OR Equivalent Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Software development expertise in C, C++ or an equivalent languageScripting expertise in Matlab, Python or an equivalent languageComfort with describing problems using mathematicsInterest in media, color and display technologiesInterest in building algorithms & prototypes, and constructing visually compelling demosInterest in building tools & methodologies to characterize media and display color qualityBS/MS/PhD degree in Computer Science OR Electrical Engineering OR Equivalent Degree OR Equivalent Experience-  Problem solving and communication skills-  Ability to stay focused and prioritize your work-  Enjoy working in a collaborative environment", "jobDescription": "The Display and Color Technologies organization in Apple's Interactive Media Group is at the core of designing and implementing solutions for rendering visual media on displays. \n\nExamples of technologies include rendering high dynamic range video and games, media composition, ambient adaptation, and pro color features such as display presets. \n\nOur organization is also responsible for optimizing the subjective and objective color quality of media renditions, and working with key partners to adopt new media and display features.\n\nWe are looking for candidates with strong engineering and mathematical intuition who are excited to tackle new problems, working with a team from product conception to shipping production quality color and display features."}, "200193872": {"jobID": "200193872", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Motion Sensing System Integration Engineer – Inertial Sensors", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200193872/motion-sensing-system-integration-engineer-inertial-sensors?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Requires PhD degree in engineering or BS/MS degree plus a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "4+ years of hands-on experience and proven track record in sensing system hardware engineering.Fundamental knowledge and experience in physics, mechanical, electrical, and material science engineering.Practical understanding of accelerometers and gyroscopes.Experience interfacing microcontrollers with analog and digital sensorsPractical knowledge of C/C++, embedded programming, and signal processing.Solid board bring-up and debugging skills.Proficient in data collection, data analysis, and statistical analysis tools (Matlab, Python,JMP).Excellent written and verbal communication skills and solid collaboration and leadershipskills.The willingness and ability to travel are required.Requires PhD degree in engineering or BS/MS degree plus a minimum of 3 years of relevant industry experience", "jobDescription": "You will play a key role in specifying, developing, characterizing, and validating motion sensing systems. You should be familiar with MEMS sensor technologies such as inertial sensor performance metrics, inertial sensor usage and limitations, and system integration.\n\nThe Motion Sensing Hardware Team features a collaborative environment with creative, smart people and state of the art technologies. This team defines and integrates MEMS accelerometers and gyroscopes across a variety of Apple products such as iPhones, iPads, and Watch. Engineering excellence and thoroughness, invention and patent creation are expected, encouraged and supported. Opening up the boundaries to design and ship innovative products with exclusive technologies and user experiences is the main goal of this sensing technology team at Apple."}, "200455231": {"jobID": "200455231", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Firmware Quality Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455231/firmware-quality-engineering-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or Electrical Engineering (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$269,000,"}, "benefits": null, "requirements": "5+ years of software development/testing experience with embedded systems2+ years of lead/management experienceScripting skills (Python preferred)Familiarity with C/C++ or object oriented programmingFamiliarity with hardware and software interaction for embedded systemsStrong advocate for quality, with good understanding of SQA methodologies & practicesStrong communication skillsMust be self directed, analytical and work well in a large cross functional environmentBS/MS in Computer Science or Electrical Engineering (or equivalent)- Knowledge of iOS, macOS, or Linux- Working knowledge of Bluetooth protocols and/or Human Interface Devices (HID) protocol- Knowledge of low-level and system level communication- Experience with consumer audio or video technologies", "jobDescription": "Do you enjoy understanding the system firmware architecture and simplifying it into smaller testable modules? How would you like to lead a team responsible for building quality into our products?   \n\nWe are the Audio System Quality team, and we are looking for a Firmware Quality Engineering Manager for advanced audio products like AirPods, AirPods Pro, and AirPods Max. We work closely with firmware, software, and hardware teams to deliver the best audio experience for our customers.   \n\nCome join us and be a part of a team using creativity and innovation to qualify features and technologies that our customers love!"}, "200394920": {"jobID": "200394920", "origin_search": null, "posted": "Jun 23, 2022", "jobTitle": "Simulation & Image Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200394920/simulation-image-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS or PhD in a relevant field (EE, CS, Physics, Optics, Image Science or Applied Mathematics)."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Expertise in C/C++ programming languagesExpertise with physically-based renderingExpertise with numerical methods, applied mathematics and statisticsExperience with GPGPU algorithm developmentExperience with lens-based imaging systems, optical simulation and/or CMOS sensor modelingExperience with computational imaging techniques, including reconstruction algorithmsExperience with high-performance and distributed computingExperience with Machine-Learning techniques and frameworksExperience with scripting languages such as Matlab or PythonKnowledge of photography and photographic principalsGreat interpersonal skills - the ability to collaborate across groups.MS or PhD in a relevant field (EE, CS, Physics, Optics, Image Science or Applied Mathematics).", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a team that sets the standard in fostering excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products?\n\nThe Image Sciences team, a part of the Camera Hardware and Depth Team, develops novel metrology and calibration processes to enable both machine-vision-driven and photographic experiences, targeting optical and sensor characteristics, non-destructive detection of defects inside complex imaging systems and multi-camera calibration as used in Portrait Mode.\n\nThe team is seeking an image scientist with broad skills to help develop next-generation, high-throughput simulation frameworks to assist the design and architecture of products, including AR/VR features."}, "200351689": {"jobID": "200351689", "origin_search": null, "posted": "Apr 12, 2022", "jobTitle": "Core WiFi Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200351689/core-wifi-embedded-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent.\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid knowledge of data structures and their applicationsExperience developing software using C/C+, Objective-C, or JavaStrong competence and experience in Layer 2, Layer 3 networking, QoSStrong analytical and problem-solving skills.Excellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while driving multiple projects across teamsPreferred Qualifications:Experience developing software using embedded SDKs, frameworks and/or BSPs.Knowledge and experience of different LAN and WAN technologiesKnowledge of IEEE 802.11/WiFi Protocols.Linux / Unix kernel networking stack knowledge and understanding of operating system fundamentals.Solid understanding of OO design principles and design patterns.Experience with hands-on development and troubleshooting on embedded targets. e.g., GDB, shell scripting, packet tracing (tcpdump, wireshark)Bachelor's degree in Computer Science or equivalent.\n\nMasters Degree is preferred.", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience. \n\nAs part of the WiFi software development team, we make decisions that influence the connectivity experience on products people use every single day, across the world. Are you a software development enthusiast? Are you passionate about internet-enabled devices and networking protocols? Do you want to learn more about WiFi and other wireless technologies? If your answer is yes, we may have the job for you."}, "200457619": {"jobID": "200457619", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457619/software-development-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "- BS/MS in Computer Science or Electrical Engineering (or equivalent)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "Software development/testing experience with embedded systems.Experience Scripting skills (Python preferred) Familiarity with C/C++ or object oriented programmingFamiliarity with hardware and software interaction for embedded systems. Experience working with or building fixtures a plus.Strong advocate for quality, with good understanding of SQA methodologies & practices Strong communication skillsMust be self directed, analytical and work well in a large cross functional environment- BS/MS in Computer Science or Electrical Engineering (or equivalent)-  Knowledge of low-level and system level communication-  Experience with consumer audio or video technologies-  Working knowledge of Human Interface Devices (HID) protocol", "jobDescription": "Are you a self-starter who loves developing tools and infrastructure? \n\nWe are the Audio System Quality team, and we focus on end to end system tests for advanced audio products like AirPods and AirPods Pro! \n\nYou will have the opportunity to work closely with our firmware, software and hardware teams to deliver the best audio experience for our customers. If have a passion for testing, automation and working with fixtures, come join our team!"}, "200440827": {"jobID": "200440827", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Display Modeling Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440827/display-modeling-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. or higher. in Engineering or Physics with 5+ years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Has 5+ years experience in software development in complex operating environmentsCapable of working with and refactoring large code basesExpert in compiled languages (C/C++)Experience with clang/gcc/msvc for cross-platform applicationsExperience with source control systemsAble to create software solutions and algorithms for physical systemsCan effectively communicate with developers and users to improve and expand the codeB.S. or higher. in Engineering or Physics with 5+ years of experiencePreferred Qualifications:- Experience with OpenCL or CUDA- Technical computing background with exposure to both scientific algorithm development and software delivery- Experience in a full software development life cycle- Capable Python programmer- Background in optics or similar science", "jobDescription": "From the Apple I computer to the iPhone, Apple has a history of creating revolutionary consumer products. Apple is looking for a talented software developer who will help continue this trend by contributing to an in-house software package that will enable our designers to discover the next generation of Apple products. This role requires an expert in compiled languages (C/C++) who can develop new functionalities and improve the reliability, performance, and efficiency of the current code base. The candidate will work with a diverse engineering team that includes software developers, computational scientists, optical engineers, human perception experts, product design engineers, and experimental physicists. If you have a passion for creating innovative algorithms and learning new physics, then we would like to hear from you."}, "200440187": {"jobID": "200440187", "origin_search": null, "posted": "Nov 4, 2022", "jobTitle": "Software Developer in Test - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440187/software-developer-in-test-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in computer science or equivalent field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficiency in Java/Python.Proficient with Front-End, UI, Micro-Services architectures and Rest API.Working experience with Cloud technologies (like AWS).Experience with technologies like Hadoop, Oracle, Cassandra, Hive, Kafka messaging is a plus.High expertise in building test frameworks along with functional testing and end to end automation skills using Java/Python.Good experience in writing test plans, defining test strategy, test data generation techniques and crafting test specifications.Practice of testing strategies and methodologies, exposure to test harnesses is a plus.Proven QE technical lead ability. Very responsible, organized, driven, and passionate about quality. Very positive attitude, with excellent work ethics.Proven track record to deliver high-quality design, code, and tests, on tight schedules. Results oriented and deadline driven.Excellent analytical, problem solving and communication skills, with cross-functional teams.Experience with GitHub, defect management and continuous automation is idealCI/CD integration experienceExcellent collaboration and interpersonal skills.Curious about new technologies and quick learner.BS/MS in computer science or equivalent field.", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work.\n\nOur technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.\n\nWe are looking for an engineer with skills and passion to help build out our large scale platform. The QE team fills the mission-critical role of ensuring that our sophisticated, large-scale systems are healthy, supervised, automated, and designed to scale with consistent performance. As an engineer, you will work alongside our team of engineers to create and supervise quality systems in the context of a micro-services architecture, identify continuous improvement opportunities and implement best practices. You will be performing design engineering analysis and development. You will contribute to ensure we provide a world-class user experience for our customers."}, "200456729": {"jobID": "200456729", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "Engineering Program Manager, Autonomy Evaluation - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456729/engineering-program-manager-autonomy-evaluation-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science, Physics, Mathematics or equivalent required"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years of program management experienceCritical thinker with exceptional written and verbal communication skillsDemonstrated experience developing and maintaining roadmaps with competing customer needsExperience leading teams to align on goals, develop plans, and monitor/control executionHands-on experience analyzing data and developing intuitive visualizationsBS in Computer Science, Physics, Mathematics or equivalent required", "jobDescription": "Apple is looking for a world-class Engineering Program Manager to join the Special Projects Group and focus on autonomous technologies. This individual will define and drive projects across a broad set of internal teams to establish quantitative standards for the evaluation of autonomous technologies."}, "200391075": {"jobID": "200391075", "origin_search": null, "posted": "Dec 8, 2022", "jobTitle": "Wireless Systems Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200391075/wireless-systems-test-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor or Masters in Computer Science, Electrical engineering, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands-on experience with testing cellular technologies (5G, LTE, UMTS, CDMA, IMS etc).Excellent work experience on MTBF issues analysis e.g. Performance, CA, 5G, VoLTE, SRVCC, CSFB, Crashes, Resets, Panics etcGood knowledge of how to write testable codeGood understanding of MTBF/Stability Testing, Automation Tools, Test Suits, Execution and test setupsExposure to modem bring-up from early development to maintenance phaseAbility to work efficient with teammates who work remotelyGood attention to detail, strong written and interpersonal skillsExperience in leading global teamsBachelor or Masters in Computer Science, Electrical engineering, or equivalent", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nThe Wireless Frameworks and Services team is looking for a highly motivated and hardworking Wireless Systems Test Engineer to help develop and maintain test automation for all Apple platforms. (i.e Apple Watch, Apple TV, AirPods, iOS and macOS)"}, "200464589": {"jobID": "200464589", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "RFIC Layout Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464589/rfic-layout-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience in custom RF/analog layout for radio transceivers with extensive knowledge of deep sub-micron CMOS (FinFet experience is a must)Knowledgeable in layout techniques for device matching, minimizing parasitics, RF shielding, and high frequency routing.Solid understanding of RC delay, electromigration, and coupling.Understanding of guard rings, DNW, PN junctions, and advanced process effects such as LOD, WPE, etc.High level proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc. in FinFet Technology.Knowledge of CADENCE layout tools.Excellent communication skills and able to work with cross-functional teams.BS and 3+ years of relevant industry experience.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Wireless SoC Radio Team designs state-of-art highly energy efficient CMOS radios, from RF to bits. To deliver these radios, our team is responsible for the design of a wide range of RF, analog, and mixed-signal blocks from RF front-end amplifiers to data converters, including baseband filters, baseband and RF phase-locked loops, crystal oscillators, and bandgap references. We are working on new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nIn this role, you will work closely with the RFIC design team to layout and verify custom RF and analog IP for complex SoC products. You will have a critical impact on developing Apple’s state-of-the-art radios and getting them into hundreds of millions of products."}, "200284561": {"jobID": "200284561", "origin_search": null, "posted": "Jan 3, 2023", "jobTitle": "Component Validation Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200284561/component-validation-developer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Excellent knowledge in one or multiple cellular technologies: UMTS, HSPA, HSPA+, LTE, NR etc.Excellent Protocol Development Experience in one or more of NAS/AS/Data Plane protocols preferably in LTE/NR domainExcellent software developing and debugging skills including design, programming (C, C++, script) and debuggingStrong experience in cellular protocol stack host test or simulation environment development is key.Experience in test case scripting and regression test suites debugging conforming to relevantETSI/3GPP protocol technical specifications is a big plusExperience ofTTCN-3, development and debugging/integration of TTCN-3 test cases is a huge plusStandard Software development & tool environment experience is a plusHighly motivated and proactive, fast learner, a good team playerExcellent verbal and written communication skillsBachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree", "jobDescription": "The people here at Apple don’t just build products— they craft the kind of wonder that has revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Imagine what you could do here. Join Apple, and help us leave the world better than we found it. A job at Apple is unlike any other you’ve had. You will be challenged. You will inspired. And you’ll be proud! At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Join the Wireless Technologies and Ecosystems organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200375835": {"jobID": "200375835", "origin_search": null, "posted": "May 5, 2022", "jobTitle": "Display Technologist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200375835/display-technologist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS degree in Physics, Optics, Material Science or Electrical Engineering."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Knowledge in organic light emitting diodes (OLED) or light emitting diodes (LED) displays.Hands-on experience with electrical/optical characterization and simulation of optoelectronic devices.Experience in ray-tracing simulation of optical components using commercial tools (LightTools/Zemax) or equivalent softwares.Capability of using a generic programming language (such as Matlab or Python) to solve practical problems.Capability to analyze large quantity data and draw significant and practical conclusions.Outstanding communication and presentation skills, with the ability to work with partners across multiple teams.Candidate with outstanding strength in one or more qualifications does not need to rigorously meet all qualifications.PhD or MS degree in Physics, Optics, Material Science or Electrical Engineering.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of our Display Technologies group, you’ll help ensure our products’ displays work beautifully through the successful design, fabrication, and implementation of components in Apple devices. From initial concept to mass production, you’ll develop highly innovative displays for the full line of Apple products, including Apple Watch, iPhone, iPad, and Mac. Through touch and sight, these displays are how millions of Apple customers connect with our products every single day. Together, you’ll collaborate with multifunctional teams across Apple to make each interaction a magical experience to see and touch. \n\nApple is looking for a creative Display Technologist who can lead innovations to Apple's outstanding display technology features. As a Technologist in the Display Investigation team, you will have a wide range of responsibilities in exploring, investigating, and implementing new display technologies for use in Apple products. Candidates with strong problem-solving skills combined with deep curiosity about displays will be preferred."}, "200357163": {"jobID": "200357163", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Sr Engineering Project Manager, Employee Experience & Productivity", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200357163/sr-engineering-project-manager-employee-experience-productivity?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS degree in computer science, engineering, or equivalent field with 5+ years or MS degree with 3+ years experience, or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "10+ years experience as a Technical or Engineering Project ManagerExperience in the travel industry and with travel solutions such as Global Distribution SystemsAbility to understand developers on a technical levelStrong experience with Agile and Scrum developmentHighly organized with a strong ability to supervise and follow up on details with technical and non-technical audiencesAbility to successfully manage multiple projects at the same timeAbility to help maintain high velocity for the development teamExperience managing software projects based on a variety of technologiesExperience with project management tools such as Jira and OmniplanStrong report creation skillsStrong writing, speaking, and presentation skillsExceptional patience, persistence, and flexibilityAble to find a way to get things done under constraintsThrives in a fast-paced environment and is curious about new technologiesA passion for delivering top quality code at high velocityBS degree in computer science, engineering, or equivalent field with 5+ years or MS degree with 3+ years experience, or equivalent", "jobDescription": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nThe IS&T Corp Systems team is looking for a dynamic, motivated Project Manager to drive projects for a variety of internal lines of business. Are you interested in travel? Want to help build the next generation of Apple Travel applications and systems? Then we want to hear from you!\n\nApple Travel Engineering is looking for an Engineering Project Manager to assist in building our iOS apps, TravelWeb and Expenses applications to bring an amazing travel experience to our employees. Our team is enthusiastic, agile, and focused on providing the best possible experience for our users and our business partners!"}, "200455081": {"jobID": "200455081", "origin_search": null, "posted": "Jan 17, 2023", "jobTitle": "Motion Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455081/motion-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's or Master’s degree in Computer Science, EECS, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong C++ coding skills (3+ years)Solid understanding of algorithm design and data structuresStrong and intuitive understanding of object-oriented designsExperience delivering production code for embedded or real-time systemsEffective communication skills, written and verbal, and attention to detailBachelor's or Master’s degree in Computer Science, EECS, or equivalent experience.", "jobDescription": "The CoreMotion Motion & Interaction team has created innovative ways for users to interact with their devices through motion. When you play games by simply moving your devices, or use the compass to find your way, it’s the work of engineers and scientists on this team. Join CoreMotion and work with the people who have created the sensor fusion technologies and motion gestures that power games, augmented reality, and numerous other features on Apple’s devices."}, "200451182": {"jobID": "200451182", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Cellular Data Plane System Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451182/cellular-data-plane-system-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Accomplished System Architect with strong upper layer (MAC, RLC, PDCP, SDAP, TCP/IP, QUIC) protocol system design experience, a good understanding of the control plane protocols (RRC, NAS, IMS), and knowledge of the PHY layer.In-depth knowledge of wireless communication protocol implementation (software design/performance optimization, hardware acceleration).Understanding of end to end system performance aspects involving the UE and network is necessary. Familiar with the performance impact of CPU/Cache/Memory architecture, knowledge of system dimensioning tradeoffs, and low power design is a plus.Experience in 3GPP wireless standardization is a significant plus (5G-NR/4G LTE/ UMTS/GSM/CDMA).Experience with Python and/or C/C++ for algorithm development, prototyping, modeling, and simulation. Experience working in a fast-paced startup team is highly appreciated.BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. \n\nWireless technologies have become a crucial part of all Apple devices that delight our customers. With the latest developments in cellular, we apply a sophisticated simulation platform to study performance of our devices in complicated radio and network conditions and gain insights for system design. \n\nWe are searching for a hardworking engineer with 10+/- years experience to join our exciting team of innovators. In this role, you are a key member of the cellular data plane team working on modem systems architecture aspects for the L2/L3/L4 Layers."}, "200464578": {"jobID": "200464578", "origin_search": null, "posted": "Mar 4, 2023", "jobTitle": "Engineering Manager, Cloud Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464578/engineering-manager-cloud-technologies?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$156,400", "max": "$311,300,"}, "benefits": null, "requirements": "You’ve spent years building, growing, and leading high-performing engineering teams in the SaaS, platform, or tooling domainsYou’re comfortable navigating complex problem spaces, providing your team with clear visionYour track record of delivering impressive tools, services, and platforms from scratchA deep knowledge of public cloud platforms like AWS or GCP, backend services, and the UI/CLI/SDKs customers use to interact with your toolsBachelor or equivalent industry experience", "jobDescription": "Apple’s Cloud Technologies group builds tools, services, and platforms enabling Apple engineers to deliver impact for the business at scale. We reduce cost, cognitive load, and time to market by providing simplified experiences over sophisticated platforms.\n\nAs our user base scales, it’s paramount for us to see opportunities to scale our tools and offerings for them, like building a new CI or Observability platform to ensure velocity, quality, and resilience remain high. You will be a direct link between Cloud Technologies and the engineers who rely upon us to do their jobs every day, so a focus on technical details with a product mindset are critical.\n\nWe are looking for a best-in-class leader who can move between engineering lead and cross-functional seer who can build from scratch, iterate on existing platforms, and bring together customers teams to drive strategy, roadmaps, and ultimately, adoption."}, "200257219": {"jobID": "200257219", "origin_search": null, "posted": "Jun 22, 2021", "jobTitle": "Software Engineer, 3D Applications (AR/VR)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200257219/software-engineer-3d-applications-ar-vr?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Proficient in one or more of the following languages: C/C++, Objective-C, SwiftFundamental knowledge of software engineering technologies, methodologies, ​and practicesFamiliarity with 3D math, linear algebra, 3D geometry, graphics, and renderingBS in Computer Science OR equivalent experienceInterest or proficiency in UI/UX designProficiency in macOS, iOS, tvOS or watchOS development Experience with low-level graphics APIs (Metal, OpenGL, DirectX)Experience developing AR/VR applicationsFamiliarity with ARKitExperience using iOS frameworks like UIKit, AVFoundation, Core Motion, Core ML, CloudKit, SiriKit, StoreKit, etc.Experience with Unix development, daemons, cross-process communication, etc", "jobDescription": "Are you ready to explore a new application domain with a talented and collaborative team? Apple's Technology Development Group is seeking skilled 3D application developers to help us build graphically intense and highly interactive applications. This team is working with some of Apple's most advanced technologies including the augmented reality (AR) and virtual reality (VR) support offered in ARKit and Metal 2. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every day."}, "200450891": {"jobID": "200450891", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded 5G/4G Cellular ASIC Physical Layer Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450891/embedded-5g-4g-cellular-asic-physical-layer-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience with hardware control for physical layer 4G/5G or other modem data path processingUnderstanding of 5G and 4G 3GPP protocolsDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with C and C++, compilers, build and source code control toolsSignificant experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programmingSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of a world class modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a 5G/4G Cellular ASIC Physical Layer Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing powerful cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200236288": {"jobID": "200236288", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AR/VR Graphics Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200236288/ar-vr-graphics-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science OR equivalent degree and at at least 3 years of experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Programming skills and knowledge of C / C++3D math for graphics/games (linear algebra)Communication and collaboration skillsBS/MS in Computer Science OR equivalent degree and at at least 3 years of experience.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace", "jobDescription": "The Technology Development Group (TDG) is looking for a Software Development Engineer to help us push the limits of the next generation of interactive experiences on our platform. This team is working with some of Apple’s most advanced technologies including augmented reality (AR) and virtual reality (VR) offered in ARKit and Metal 2. As a member of our creative organization, you will have the uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day."}, "200450710": {"jobID": "200450710", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450710/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE w/ 2+ years experience or Ph.D in EE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "At least 2 years of relevant industry experienceStrong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsMSEE w/ 2+ years experience or Ph.D in EE", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200464446": {"jobID": "200464446", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Lab Operations Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464446/lab-operations-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in EE/CS/CE or equivalent knowledge and experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$132,500", "max": "$260,600,"}, "benefits": null, "requirements": "Experience delivering excellent customer service and resolving customer issues and escalations effectivelyUnderstand and deal well with fast-moving development cycles; remains flexible and calm in the face of ambiguityDetailed knowledge and understanding of product development processesShown ability to handle schedules and team deliverables across multiple projects simultaneouslyExperience with relational databases and analyzing large data setsManagement experience in an engineering or technical project management environmentBS/MS in EE/CS/CE or equivalent knowledge and experience", "jobDescription": "Why Apple?\n\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk. \n\nThe iOS Hardware Distribution Team is looking for an innovative and enthusiastic manager with a track record of building deep relationships and managing large scale logistics. You will work cross-functionally across many teams at Apple to manage the distribution of prototype hardware to multiple software organizations and maintain a library of previous generations of hardware for all ongoing software development activities. In the process, you will need to understand the relationship of hardware components to software features to inform how best to support the engineering community. This role requires the ability to balance technical prowess and teamwork with excellent customer service in a fast-paced, dynamic environment.\n\nWe’re looking for people who enjoy designing robust solutions to solve problems rather than focusing on completing tasks as fast as possible."}, "200452128": {"jobID": "200452128", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Cellular RF Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452128/cellular-rf-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 10+ years of relevant industry experience required\n\nBSEE, MSEE/PhD preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Excellent skills in low-level programming expertise using C++, C and assembler, embedded systems proficiency, 32-bit micro-controllers ISR, real-time processing, and limited and shared resources.Strong skills in computer architecture, HW/SW co-verification, debugging using RTL simulation and SystemC environments as well as target HW.Experience with control of RF transceiver and RF front-end components for 4G/5G data path processing.Sound knowledge of communication theory, Wireless standards, Radio architecture and Interfaces.Deep understanding of software engineering principles, and core computer science fundamentals.Proficiency in debugging embedded software systems and familiarity with JTAG and ETM Trace tools.BS and 10+ years of relevant industry experience required\n\nBSEE, MSEE/PhD preferredApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Do you have a passion for invention and self-challenge? Do you thrive on pushing the limits of what’s considered feasible? As part of an elite RF transceiver team, you’ll craft sophisticated innovative embedded firmware that delivers more performance in our products than ever before. Join us and help us innovate new wireless systems technologies that continually outperform the previous iterations!\n\nIn this role, you will develop the embedded systems for cellular RF transceivers and radio systems. You will work on the design, implementation as well as verification of our real-time control firmware with all aspects of embedded software development. This position requires a close collaboration with our system engineers, hardware developers, and system verification/integration engineers."}, "200463927": {"jobID": "200463927", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Cellular Protocol Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463927/cellular-protocol-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum of 2 years experience with embedded/telecom/wireless areas.Strong Software Engineering skills including design, programming (C, C++, script) and debugging.Experience in 3G, 4G or 5G NR technology is a strong plus.Highly motivated and self-directed.Excellent debugging skills.Solid understanding of 3GPP/ETSI standards.Thrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelor or graduate degree in Electrical Engineering, Computer Engineering, Computer Science or equivalent degree.", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200467284": {"jobID": "200467284", "origin_search": null, "posted": "Mar 2, 2023", "jobTitle": "New Product Technology Project Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467284/new-product-technology-project-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS/BA + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "Experience related to build planning, material clear to build, supplier management, logistics, budget, and procurementConfiguration management and Bill of Material (BOM) experienceProficient in Excel or Numbers and learning new software applications to promote efficiency and productivityEffective reciprocal communication skills (written and verbal)Strategic critical thinking and problem-solving skill capabilitiesAttention to detail with multitasking and prioritization abilitiesBS/BA + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products! \n\nApple's Hardware Technology Engineering Program Management Team is looking for a resourceful Engineering New Product Technology Project Manager (NPT PM) to drive NPI build planning and material readiness for key technologies. Responsibilities will encompass build matrix management, materials forecast and planning, CTB (Clear to Build) analysis and reporting, logistic readiness, budget, procurement, and configuration management activities. Preferred candidate is a strategic problem solver who enjoys collaborating with cross-functional teams to communicate changes, analyze risks, and execute complex mitigation strategies in support of engineering development builds."}, "200462449": {"jobID": "200462449", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "AIML - Technical Program Manager, ML Systems Evaluation Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462449/aiml-technical-program-manager-ml-systems-evaluation-engineering?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. or M.S. in Computer Science or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$96,500", "max": "$188,000,"}, "benefits": null, "requirements": "5+ years technical program management experience working with ML systemsExperience with creation of frameworks for evaluation for ML productsStrong organizational skills and experience working on large multi-functional teamsOutstanding communication and presentation skills, written and verbal, to all levels of organizationSelf-motivated and pro-active, with multi-tasking, creative and critical thinking capabilitiesBuild relationships, drive work, and influence outcomes in those areasB.S. or M.S. in Computer Science or related field", "jobDescription": "Lead large-scale end-to-end ML systems that requires multifaceted and innovative approaches to evaluate and validate them efficiently. The ML Systems Evaluation Engineering (MLSEE) team within the AIML org at Apple is looking for an exceptional Technical Program Manager to drive the evaluation frameworks for our Machine Learning systems at a global scale and deliver the best customer experience. \n\nIn this role, you will work closely with multiple engineering teams and contribute to the design, planning and execution of the evaluation road-map and architecture for ground breaking ML evaluation frameworks. You will operate in a highly multi-functional environment to keep pushing the boundaries of automation and ML evaluation."}, "200397383": {"jobID": "200397383", "origin_search": null, "posted": "Jul 18, 2022", "jobTitle": "HomeKit Sr. Software Engineer - Quality Assurance", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200397383/homekit-sr-software-engineer-quality-assurance?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree in Computer Engineering, Computer Science or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$124,100", "max": "$206,900,"}, "benefits": null, "requirements": "5 years of quality engineering experienceFamiliar with computer science fundamentals, including operating systems and TCP/IP networkingExperience with black box and end user testingExperience with developing test plans and casesProficient with debugging through log analysis and A/B regression testingExperience with WiFi or Bluetooth (BLE) test, a plusCapable of working on and communicating program needs cross-functionallyExperience qualifying real products and championing customer experienceThrives in a collaborative environment and can clearly communicate complex issuesObsessively passionate and inquisitive, and seek to solve everyday problems in innovative waysLaser-focused on the smallest details that are meaningful to our customersBachelor's degree in Computer Engineering, Computer Science or equivalent experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. \nHomeKit enables an entire ecosystem of secure and intelligent home connectivity.  We are developing technologies and crafting experiences that revolutionize the way people interact with the world around them."}, "200451176": {"jobID": "200451176", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "SoC Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451176/soc-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Demonstrated expertise in SoC hardware architecture in the area of consumer electronics. Experience in the areas of Wireless and Cellular technologies such as LTE/5G NR is preferred.Must have outstanding SoC and system architecture fundamentals backed with substantial experience. This means a good understanding of power and performance tradeoffs, transient and steady-state performance states, idle and dynamic power states, as well as how SoC data and control flows interact.Sound understanding of Microprocessor Subsystems, Memory Controllers and Communication Fabrics.Good understanding the Digital ASIC Flow and Debug methodology.Solid understanding of electrical and thermal considerations at the chip, package and system levels.Good understanding of hardware-software interfaces.Excellent communication skills across organizations and at the executive level.Excellent written skills for clear and concise reporting.Excellent organization skills to prioritize conflicting requirements.Strong cross-site teamwork skills with the willingness to work independently.BS and 10+ years of relevant experience.", "jobDescription": "We’re a unique team of innovative, diverse individuals who have come together from multiple backgrounds to create advanced Cellular Architectures. The people who work here are generalists in nature, and together we complement each other. It is the passion of exploring uncharted territory that makes us thrive.  Our team is seeking a highly motivated and experienced SoC Architect to help drive strategic 5G Cellular Modem technology, analyze key architectural trade-offs in coordination with cross-functional domain experts."}, "200446531": {"jobID": "200446531", "origin_search": null, "posted": "Dec 2, 2022", "jobTitle": "Senior Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446531/senior-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors| phd", "major": "BS in Computer Science or equivalent experience 8 years of related experience with a Bachelor’s degree; or 6 years and a Master’s degree; or a PhD with 3 years experience; or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "In this role, the Senior Automation QA Engineer will design and maintain automation frameworks used in the testing of computer vision algorithms. This involves close collaboration in a cross-functional team of Software Development & QA engineers, architects, project managers and other Apple automation teams. Responsibilities include defining and implementing the automation framework, monitoring CI performance & test results analysis, maintaining databases for test cases and test results, use case validation, evaluating and reporting current quality of existing technologies and new features, developing and maintaining test toolsExperience with developing, running, and triaging automated test suites.Strong understanding of the software development lifecycle, test methodologies, and a passion for quality processes.Detail oriented, analytical, and creative with problem solving.Experience in implementing initiatives across teams.Ability to investigate, debug and triage difficult problems and independently work towards results.Ability to work effectively both independently and cross functionally, as part of a larger team.Strong organizational and communication skills.Experience in building and maintaining test framework in scripting languages (e.g. Python)BS in Computer Science or equivalent experience 8 years of related experience with a Bachelor’s degree; or 6 years and a Master’s degree; or a PhD with 3 years experience; or equivalent experience.", "jobDescription": "The Technology Development team is looking for a Senior Automation Engineer to enhance our capabilities to track and improve the quality for new and exciting technologies. We’re seeking an excellent communicator and problem solver who can help evaluate and uphold our software testing processes to ensure the highest quality and best practices. You would be instrumental in helping us maintain Apple’s high quality and attention to detail for future products by ensuring the code we write is well tested and integrated. As a member of our fast-paced group, you will have the unique and rewarding opportunity to be part of and shape upcoming products that will delight and inspire millions of Apple’s customers every day.   If you are a highly motivated engineer with aspirations to build powerful automation, cultivate learning, and lead automation efforts across teams at Apple that is crafting the future of augmented reality technology in Apple product platforms, we want to hear from you!"}, "200451169": {"jobID": "200451169", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "SoC Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451169/soc-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Demonstrated expertise in SoC hardware architecture in the area of consumer electronics. Experience in the areas of Wireless and Cellular technologies such as LTE/5G NR is preferred.Must have outstanding SoC and system architecture fundamentals backed with substantial experience. This means a good understanding of power and performance tradeoffs, transient and steady-state performance states, idle and dynamic power states, as well as how SoC data and control flows interact.Sound understanding of Microprocessor Subsystems, Memory Controllers and Communication Fabrics.Good understanding the Digital ASIC Flow and Debug methodology.Solid understanding of electrical and thermal considerations at the chip, package and system levels.Good understanding of hardware-software interfaces.Excellent communication skills across organizations and at the executive level.Excellent written skills for clear and concise reporting.Excellent organization skills to prioritize conflicting requirements.Strong cross-site teamwork skills with the willingness to work independently.BS and 10+ years of relevant experience.", "jobDescription": "We’re a unique team of innovative, diverse individuals who have come together from multiple backgrounds to create advanced Cellular Architectures. The people who work here are generalists in nature, and together we complement each other. It is the passion of exploring uncharted territory that makes us thrive.  Our team is seeking a highly motivated and experienced SoC Architect to help drive strategic 5G Cellular Modem technology, analyze key architectural trade-offs in coordination with cross-functional domain experts."}, "200407347": {"jobID": "200407347", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Claris - Backend Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200407347/claris-backend-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Computer Science, Engineering or related Degree or equivalent software engineering experience\n\nWe are looking for a highly motivated and proactive thinker who can think strategically and stay connected to our customers. The ideal candidate will possess a high level of integrity, creativity, initiative, accountability, communication and interpersonal skills, with a commitment to teamwork and excellence. \n\nClaris is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Claris will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Candidates should have good communication skills, a passion for software development and a working knowledge of:Go programming language (at least 2 years professional working experience)Strong analytical and problem solving skillsExperiences with NoSQL Databases (MongoDB)Micro-service architecturesRESTful APIsContainerized software development (Docker, Kubernetes)Computer Science, Engineering or related Degree or equivalent software engineering experience\n\nWe are looking for a highly motivated and proactive thinker who can think strategically and stay connected to our customers. The ideal candidate will possess a high level of integrity, creativity, initiative, accountability, communication and interpersonal skills, with a commitment to teamwork and excellence. \n\nClaris is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Claris will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, new ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nClaris International Inc., a wholly-owned subsidiary of Apple Inc., is building the future of low-code software development. We are looking for talented individuals for our back-end engineering team. Our back-end technology stack is a micro-services architecture built on Kubernetes using Go and MongoDB."}, "200446660": {"jobID": "200446660", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Module Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446660/wireless-module-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS with + 3 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Deep understanding of Wireless technologies.Extraordinary skill in Hardware and Software integration, problem solving and optimization.Responsible for crafting DUT Control boards.Programming experience in C/C++/Matlab/Python required.Experience with data/yield analysis, JMP or similar tool a plus.Experience working with and programming multiple Mass production RF testers: Litepoint, Advantest and Teradyne.Very driven and self-motivated. Capable of driving vendors, test partners and setting test strategies.Skilled at driving cross-functional decision and cooperating with other test teams (upstream/downstream) for a sound end-to-end product test strategy.Minimum BS with + 3 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! Ready to join our RF Design team? \n\nThe Wireless Module Test Engineering Lead (WMTE) will be responsible for designing and driving strategy for all high-volume RF module tests at the module factories adhering to the internal processes/objectives. The Lead engineer is responsible for research, design, and development of test methodologies at the module vendors for multiple Wireless technologies (Wifi/UWB/GPS/Cellular/NFC). They would need to work with multiple chipsets across wireless technologies and plan the appropriate high volume test strategy. This position will support multiple product lines from the Hardware Technology organization from early concept through MP. The WMTE will apply a confirmed EE/RF background to understand technical details, issues and risks."}, "200461632": {"jobID": "200461632", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "React Frontend Engineer (Javascript) - AMP Universal Media", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461632/react-frontend-engineer-javascript-amp-universal-media?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "4 year degree or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of experience in a professional software development positionProficient in JavaScript, Typescript, HTML, CSSExperience crafting complex applications using React or a comparable JS framework (e.g.: Angular, Vue, Backbone, Ember)Experience creating phenomenal web UIExperience with *nix and macOSFamiliarity with version control systems such as Git4 year degree or equivalentApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other legally protected characteristics. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "The Apple Media Products Engineering team is one of the most exciting examples of Apple's long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a substantial scale, meeting Apple's high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries. These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple's outstanding integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep dedication to strengthening Apple's privacy policy, one of Apple's core values. Although services are a bigger part of Apple's business than ever before, these teams remain small, flexible, and cross-functional, offering greater exposure to the array of opportunities here. We are looking for an outstanding software engineer to join the Apple Universal Media team and help us build the next generation products that change the way millions of users consume video. As a Software Engineer at Apple, you will be owning key modules of the product and be responsible for delivering industry grade quality solutions."}, "200459094": {"jobID": "200459094", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Sr. Engineering Manager, Modem System Testing", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459094/sr-engineering-manager-modem-system-testing?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in computer science, computer engineering, electrical engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$309,500,"}, "benefits": null, "requirements": "Proven experience leading a team of test engineers.Hands-on experience in Cellular System Testing, Certification, IOT, and/or Cellular System Performance.Solid experience of 5G NR PHY/MAC and higher layer control and user planesConsistent record of leading cellular modem commercialization effortsGood understanding of mmWave challenges and 5G Standalone protocolStrong understanding of 3GPP specifications (LTE & NR Air Interface, PHY, MAC, RLC, RRC, PDCP, and NAS layer).Driving testing efforts with script development and automation on simulator platforms including Keysight, Anritsu, R&S, Spirent, etcBroad-spectrum of knowledge and understanding of the end-to-end wireless system architecture from wireless physical layer all the way to application layer.Ability to build and drive a team of engineers to achieve excellence and efficiency.Attention to the smallest details that are significant to customers.Excellent communication and presentation skillsBachelor’s degree in computer science, computer engineering, electrical engineering, or equivalent experience", "jobDescription": "Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic. \n\nJoin the Wireless Technologies and Ecosystems organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide We build and seamlessly integrate technologies that enrich peoples' lives and deliver the best user experience. Our team is looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Multifaceted, encouraging, and innovative people who build industry-defining technologies are the norm at Apple.\n\nIf you're passionate about building technology that will make a difference, we may have the job for you!"}, "200210439": {"jobID": "200210439", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200210439/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE w/ 2+ years experience or Ph.D in EE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "At least 2 years of relevant industry experienceStrong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsMSEE w/ 2+ years experience or Ph.D in EE", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200446662": {"jobID": "200446662", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Module Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200446662/wireless-module-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS with + 10 years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Deep understanding of Wireless technologies.Extraordinary skill in Hardware and Software integration, problem solving and optimization.Responsible for crafting DUT Control boards.Programming experience in C/C++/Matlab/Python required.Experience with data/yield analysis, JMP or similar tool a plus.Experience working with and programming multiple Mass production RF testers: Litepoint, Advantest and Teradyne.Very driven and self-motivated. Capable of driving vendors, test partners and setting test strategies.Skilled at driving cross-functional decision and cooperating with other test teams (upstream/downstream) for a sound end-to-end product test strategy.Minimum BS with + 10 years of relevant industry experience is required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product! Love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day! Ready to join our RF Design team? \n\nThe Wireless Module Test Engineering Lead (WMTE) will be responsible for designing and driving strategy for all high-volume RF module tests at the module factories adhering to the internal processes/objectives. The Lead engineer is responsible for research, design, and development of test methodologies at the module vendors for multiple Wireless technologies (Wifi/UWB/GPS/Cellular/NFC). They would need to work with multiple chipsets across wireless technologies and plan the appropriate high volume test strategy. This position will support multiple product lines from the Hardware Technology organization from early concept through MP. The WMTE will apply a confirmed EE/RF background to understand technical details, issues and risks."}, "200425778": {"jobID": "200425778", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Compiler Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425778/compiler-integration-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Any language, plus an ability to learn as needed is sufficient.Curiosity about software and process. Success will require the ability to think critically about how things work and find opportunities for improvements.Ability to investigate and debug difficult problems. This role often requires triaging and solving multiple complex systems, so you'll need the ability and interest to dig deep.Excellent communication, organization and interpersonal skills. In this role, you will need to communicate clearly, and coordinate complex tasks among many people.Ability to drive processes to integrate compiler and language runtime changes into Apple's developer tools and products. In addition to finding technical solutions to problems, you will be involved in coordinating between multiple teams within Apple and the open source community using clear, consistent and timely communication.Knowledge of how compilers work. This role will revolve around interaction with the compiler and other tools within the development ecosystem, and it is important to understand how they fit together.Experience using git for software developmentExperience with continuous integration systems and infrastructure, such as Jenkins or Xcode ServerExperience with Swift, Objective-C, C, C++, Python, CMakeInterest in or familiarity with concepts in programming languages, compilers, and type theoryExperience contributing to open source projects", "jobDescription": "Do you want to be part of a core technology team that builds Apple's software stack used both internally and externally, and seen as a standard by millions of developers? The Compiler Tools and Integration team at Apple is looking for an integration engineer to help integrate and qualify the clang and swift compilers. As an integration engineer on the compilers team, you will engineer and drive solutions and tools to deliver compiler changes more quickly and improve on compiler quality."}, "200455353": {"jobID": "200455353", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Sr. Display Electrical Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455353/sr-display-electrical-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MS / PHD EE"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "MS in EE or related field3-5 years work experienceModule or system design and architecture focused on defining detailed electrical specs to meet high level requirementsPCB design including component selection, schematic capture, and layoutExperience using circuit simulation tools such as HSPICE or SpectreExperience working with cross functional teams on multi-disciplinary HW designs (HW, FW, SW, Mechanical/Thermal, Optical)Hands on experience with prototype IC or PCB bring-up, validation, and failure analysisCoding or scripting proficiency with Python, Matlab, or similar toolsMS / PHD EEPreferred Qualifications•\tPhD in EE or related field, or 7 years work experience•\tExperience in one or more of: power (DC-DC converters, power management, low power design), analog and mixed-signal circuit design•\tExperience in display technology, such as LCD, OLED, DLP, LCOS, e-paper•\tExperience with PCB simulations for PDN, SI/PI/crosstalk, and EMI/EMC•\tAbility to travel internationally up to 10% of the time", "jobDescription": "At Apple you will continuously push the envelope. You can't just pick off-the-shelf components. Instead, you must get creative and define them. As a member of our team, you will design and build the most advanced mobile display modules, with best-in-class performance, quality, and reliability. Your work will directly impact user experience for hundreds of millions of people.\nAs a Display EE Architect, you will lead projects, from concept phase, all the way through engineering builds, and into volume manufacturing. You will work with internal and external teams to ensure a coherent end to end solution that challenges the status quo."}, "200462858": {"jobID": "200462858", "origin_search": null, "posted": "Feb 13, 2023", "jobTitle": "Developer Tools Engineering Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462858/developer-tools-engineering-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Engineering, Electrical Engineering, Computer Science, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$309,500,"}, "benefits": null, "requirements": "Positive and respectful attitude in a diverse environment.Strong interest in tools and systems that support developing, building, testing, and releasing software.Excellent programing, technical architecture, and system design skills.Experience growing, mentoring, and managing a team of high-performing engineers from diverse backgrounds.Preferable: Experience owning the full lifecycle of an internally- or externally-facing product, including design and analysis, feature prioritization, collecting early feedback, launch, and customer onboarding.BS in Computer Engineering, Electrical Engineering, Computer Science, or equivalent experience.", "jobDescription": "Our team is on a mission to provide innovative infrastructure and tools that impact engineers’ work by making software easier to create, build, test, and distribute. We believe that streamlining software engineering is an important part of unlocking developer creativity and innovation, and we enjoy when Apple customers see that in the products we ship.\n\nWe are looking for an exceptional engineering manager interested in improving the quality and velocity of developing software across Apple, using their technical knowledge and real-world experience leading teams focused on cloud-native development environments or scalable backend services for building, testing, indexing, integrating, or deploying code.\n\nWe believe that every member of a team brings unique skills and perspective. Far more than any specific experience or skill, we are looking for technically hands-on engineering managers who want to design, build, and ship reliable software and services that solve real-world problems, develop their own skills while mentoring their team, and ultimately enable others to develop amazing applications. You would join a small, tight-knit group of engineers who build exciting new technology, and have fun while doing so."}, "200467485": {"jobID": "200467485", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "iPad Touch HW - Touch EE Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467485/ipad-touch-hw-touch-ee-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. in EE or Physics related fields (PhD preferred) + 3 yrs related industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Strong logical thought process and analytical skill set. Ability to break-down complex problems fundamental blocks that can be analyzed via understanding of electro-magnetic interactionsElectrical engineering background in analog and mixed-signal design, especially board-level circuitsHands-on experience in system-level designExcellent written and verbal communication skills and solid teamwork and leadership skillsProficiency in FEA (Comsol, ANSYS, Maxwell) MATLAB, SPICE, or similar simulation and modeling toolsM.S. in EE or Physics related fields (PhD preferred) + 3 yrs related industry experience", "jobDescription": "The Sensor Technology team develops cutting-edge sensor solutions and technologies that are central to Apple’s products. The key goal of the team is to enable the world’s best user-experience through state- of-the-art sensor solutions, such as the high-precision, low-latency multi-touch and stylus sensors in our products. New challenges arise everyday that require the sharp problem-solving skills of talented and smart individuals. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation."}, "200460991": {"jobID": "200460991", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "Display Panel Development Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460991/display-panel-development-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Program/project management experience in product developmentUnderstanding of OLED display technology and performance trade-offs preferredExperience with manufacturing scale-upExtensive experience with large cross functional teamsExperience in product development: concept & feasibility, development and launchExperience working with teams of diverse technical backgrounds and quickly learning from themAbility to apply analytical thinking to product development needsAbility to connect, network and influence others within a large product organizationExperience as a technical project lead, lead engineer, responsible for delivering a product or product componentBS + 3 years of relevant experience", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, resourceful people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. Do you want to join us in these pursuits? Join us to help deliver the next groundbreaking Apple products! \n\nApple is looking for a world-class Engineering Program Manager to join the Display team."}, "200409977": {"jobID": "200409977", "origin_search": null, "posted": "Aug 12, 2022", "jobTitle": "WiFi Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200409977/wifi-software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in WiFi driver SW development and integration with C/C++ in an embedded environmentStrong understanding on data structures, object-oriented design, and SW development methodologyIn-depth understanding and hands-on experience with WiFi protocols and 802.11 standardsExperience in various WiFi use cases such as roaming, cellular handover, and multimedia data streamingProficient understanding of TCP/IP and networking protocolsStrong analytical skill for problem-solving and system-level optimization (CPU cycle, memory, power, etc)Effective written and oral communication skills, particularly with technical content.Highly organized, creative, motivated, and passionate about achieving resultsBachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred.", "jobDescription": "Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe success we are striving will be the result of very skilled people working in an environment which nurtures creativity, partnership, and thinking of old problems in new ways. \n\nThe mission of the WiFi Technology team - Build the world’s best WiFi experience and most innovative use cases by inventing and improving state-of-the-art technologies. We develop ground breaking WiFi technologies and ecosystems that are central to Apple’s products - the iPhone, Mac products, HomePod, and more! New challenges arise every day that require the sharp problem-solving skills of individuals. Are you in for these challenges? \n\nJoin us! We are looking for a forward-thinking, self-confident, experienced firmware engineer to design, develop & launch next-generation WiFi technologies in Apple products."}, "200456319": {"jobID": "200456319", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Display Module Optical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456319/display-module-optical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "-  Masters Degree in optical engineering, mechanical engineering, electrical engineering, physics, or a related subject area with 5+ years confirmed experience. PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Technical expertise and experience in a subset of the following fields are required: optical design and characterization, optical modeling, geometrical and physical optics, semiconductor optoelectronics, display technologies, sensor technologies, statistical analysis. Knowledge and experience in display optics is a strong plusExperience with module engineering and mass production procedures. Knowledge and experience in module engineering role is a strong plusHave a track record in taking initiative, define and able to implement independently complete tasks in timely matter. Prioritizing their own work and simultaneously making significant contributions to multiple programs and supporting coworkers with optical expertiseCreativity and out-of-box thinking in problem-solving and root cause analysis Experience with failure analysis connecting optical device performance to process outcomesHands-on experience in optical measurement systems (characterization, test, and validation)Hands-on experience with programming languages used for data acquisition (Python, LabVIEW), statistical analysis (JMP, MATLAB) and optical simulation tools (LightTools, Lumerical FDTD, TMM solvers) is strongly desired-  Masters Degree in optical engineering, mechanical engineering, electrical engineering, physics, or a related subject area with 5+ years confirmed experience. PhD preferred.-  Domestic and international travel, up to 10% of time", "jobDescription": "Do something different! Apple is seeking a hardworking module engineer with phenomenal passion on next-generation display technologies. In this role, you will investigate on the wafer-level optics and process integration development for novel diffractive optical components in the display field, facing new technical challenges and crafting solutions the world doesn't know of yet.\n\nIn this position, you will apply your expertise, including but not limited to general optics, diffraction optics, optical metrology, module integration, and collaborate with world-class multi-functional teams & worldwide top suppliers, to innovative manufacturable mass-production solutions for diffractive optical components, and to craft the future of interactive and display technologies."}, "200371007": {"jobID": "200371007", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Engineering Manager, Mac Power Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200371007/engineering-manager-mac-power-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MS/BS Degree in Computer/Electrical Engineering or Computer Science"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$157,000", "max": "$276,000,"}, "benefits": null, "requirements": "Shown technical leader with 2+ years of team management experienceDetail oriented with strong analytical skills to help lead complex investigations and debug issuesDeep knowledge of computer architecture, EE fundamentals and concepts of power consumption, power management and low power designConsistent track record of driving technical innovationExcellent oral and written communication skills, including executive level presentations; ability to filter and distill relevant information for the right audienceMS/BS Degree in Computer/Electrical Engineering or Computer Science", "jobDescription": "The Mac Systems Quality team is looking for a highly motivated and experienced manager to lead a passionate team responsible for the validation and optimization of power and battery life on all new Mac products. Your main responsibilities include supervising data collection and analysis, distilling the data for cross-functional partners, driving issues to resolution, and expanding the team and its technical infrastructure to accommodate Apple’s product roadmap. We are seeking an individual with shown leadership, management, and team building skills comfortable working in a constantly evolving, collaborative environment.  \n\nDo you have an analytical mind and enjoy solving challenging problems in a fast paced and dynamic environment? Do you like working on a team that makes a difference with the products they create? You can help to drive and improve the quality of future Apple products that will delight and inspire millions of Apple’s customers every single day. Come join a creative team of engineers dedicated to keeping Mac innovation the highest in the industry."}, "200448125": {"jobID": "200448125", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448125/software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Advanced experience in Python & SwiftStrong fundamentals in one of C++, Java, or C languagesAdvanced experience in developing test automation systemsExperience with handling complete end-end Software lifecycle of software projects from requirements, design, development to maintenanceDeep understanding of Software engineering design methodologiesStrong experience in Object Oriented programming, database systems, data structures, big data and excellent debugging skillsProficiency in using Git repository & software integration toolsExperience with UNIX shell scriptingStrong Knowledge of working with different communication protocols like socket, GPIB, RS232, USB, UART and basics of Networking is a plusProficiency in UI/UX design and implementation is a plusBasic understanding of RF lab test equipment is a plusStrong written and verbal communication skillsBS required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur team is looking for a passionate, self-motivated individual with strong in-depth knowledge of software methodologies to develop test automation infrastructures, tools and applications."}, "200448222": {"jobID": "200448222", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics (GPU) Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448222/graphics-gpu-performance-analysis-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Ability to work well in a team and be productive under aggressive schedulesExcellent communications skills, self-motivated and well organizedProficient Python programmerStrong software debug skills is viewed as necessary for this roleMinimum requirement of BS degree", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? In our Silicon Technologies group we help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this role as part of the GPU Performance Analysis team, you will be responsible for developing tools and content needed to aid performance analysis, tuning, and debug of Apple’s GPU products."}, "200461519": {"jobID": "200461519", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "GPU Performance Modeling Engineer - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461519/gpu-performance-modeling-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience. Degree in Computer Science, Electrical Engineering or Computer Engineering is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong knowledge and experience in GPU architecture, micro-architecture design, or performance analysis with an emphasis on hardware/software co-designStrong software skills and proficiency in C/C++ and a scripting language such as Python or RubyExperience working on performance model development and experimentation (GPU or CPU)Knowledge and experience with GPU performance benchmarks and workloadsStrong interpersonal skills and creativity to help the team solve design challengesKnowledge of 3D graphics APIs, operating system internals, and compiler technology a plusBS and 10+ years of relevant industry experienceBS and 10+ years of relevant industry experience. Degree in Computer Science, Electrical Engineering or Computer Engineering is preferred", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. Join us to help deliver the next groundbreaking Apple product!\n\nWe are seeking a highly motivated, innovative, and dedicated engineer to join the Platform Architecture GPU Performance Modeling Team; we are a group that is driving advanced exploration for next generation GPU architectures and micro-architectures in iPhone, iPad and Mac products. We rely on strong analytical skills and close collaboration to deliver the best overall solution to our customers. In this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting highly performant products to millions of customers quickly."}, "200450893": {"jobID": "200450893", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded 5G/4G Cellular ASIC Physical Layer Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450893/embedded-5g-4g-cellular-asic-physical-layer-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceExperience with hardware control for physical layer 4G/5G or other modem data path processingUnderstanding of 5G and 4G 3GPP protocolsDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with C and C++, compilers, build and source code control toolsSignificant experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programmingSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a 5G/4G Cellular ASIC Physical Layer Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to change directions on constantly evolving requirements."}, "200450894": {"jobID": "200450894", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded 5G/4G Cellular ASIC Physical Layer Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450894/embedded-5g-4g-cellular-asic-physical-layer-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceExperience with hardware control for physical layer 4G/5G or other modem data path processingUnderstanding of 5G and 4G 3GPP protocolsDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with C and C++, compilers, build and source code control toolsSignificant experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programmingSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you’ll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before. We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a 5G/4G Cellular ASIC Physical Layer Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to change directions on constantly evolving requirements."}, "200380423": {"jobID": "200380423", "origin_search": null, "posted": "Jun 3, 2022", "jobTitle": "Capture Stage Operator", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200380423/capture-stage-operator?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA or equivalent Film and TV Production experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "You have a minimum of 3 years of hands-on work with Volumetric or Photogrammetry capture systems.You’re able to communicate effectively and represent the integrity of Apple when working with capture talent, multi-functional partners, and vendors.You’re capable of guiding subjects through a multi-part protocol while also running supporting hardware and software.You have experience operating and maintaining lighting and camera systems, as well as iterating on camera and light placement and functionality, to optimize captured data sets.You have experience programming in Python and Javascript, building processing pipelines working in on-premise and cloud-based environments.You have experience running post processing systems, processing queues, and solving technical issues.You have system administration experience including Mac and Windows.You have experience working with hardware and software vendors, reporting bugs, and resolving issues in production systems.BA or equivalent Film and TV Production experience.", "jobDescription": "Are you interested in joining an award-winning team devoted to doing exciting and innovative work?\n\nAs a company, Apple strives to surprise and delight our millions of customers, and our team in particular makes a point of operating at the intersection of imagination and technology! This Capture Stage Operator position entails overseeing the capture process and processing pipeline as well as interacting with other members of a talented, inclusive, cross-discipline team. We are looking to add a self-starter who can foster alignment on project development, contribute to a project’s success, and act thoughtfully under pressure.\n\nDo you want to be a vital part of a diverse organization crafting groundbreaking technology? Then we want to hear from you!"}, "200464547": {"jobID": "200464547", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "iPad Hardware System Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464547/ipad-hardware-system-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS Electrical/Computer Engineering or equivalent required; MS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong EE fundamentals including analog and digital designExperience working with multifaceted multi-functional teamsAbility to analyze solutions and make system design trade-offsExcellent written and verbal communication/presentation skillsExperience in several of the following areas:Schematic capture and rigid/flexible PCB layoutFundamentals of Signal and Power IntegrityLow voltage power regulation and deliveryProven track record to understand technology and debug problems at varying levels of abstraction, from the system-level down to the silicon/transistor levelProven understanding of design and validation requirements for common interfaces (e.g. I2C, SPI, JTAG, I2S) and preferably high-speed interfaces (e.g. USB, MIPI, PCIe, HDMI, DP, Thunderbolt, DDR Memory, Ethernet)Understanding of computer architecture and design tradeoffsExposure to numerical modeling, simulation, and analysis tools such as Spice, 2d/3d field solvers, power & signal integrityUse of scripting languages to assist with hardware development, and data analysisBeyond technical capability, we prize curiosity, creativity, integrity, leadership, collaboration, and a passion for learningBS Electrical/Computer Engineering or equivalent required; MS preferred", "jobDescription": "The iPad hardware team is looking for engineers who are motivated by the opportunity to tackle big challenges. Use your skills in electrical engineering, system integration, and collaboration with multi-functional teams to make design decisions that will benefit millions of iPad users worldwide!\n\nWe are a team of system electrical engineers that own entire products from concept to ship. We sit at the center of Apple’s wider engineering team, working multi-functionally with mechanical engineering, software, silicon engineering and other module teams such as wireless, battery, camera, sensing, display, and factory test."}, "200460952": {"jobID": "200460952", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Hardware System Engineer – iPhone System Technologies — IO interface", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460952/hardware-system-engineer-iphone-system-technologies-io-interface?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BSEE plus a minimum of 3 years, or MS/PhD plus a minimum of 2 years relevant industrial experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Strong EE fundamentals and problem solving skillsFamiliar with SoC and mobile system architectureKnowledge and experience with high speed interfaces such as USB, PCIE, DisplayPort, MIPI, and lower speed interfaces such as SPI, I2C, UART, JTAG, GPIO, etcExperience with using test equipment such as oscilloscope, power supply, and logic analyzers is requiredExperience with using frequency and time domain tools such as VNA and TDR is highly desiredSI/PI analysis experience using spice to run channel simulation is a plusExcellent problem solving, collaboration, and interpersonal skills, ability to work independently, and proven ability to innovate are requiredBSEE plus a minimum of 3 years, or MS/PhD plus a minimum of 2 years relevant industrial experience", "jobDescription": "The iPhone HW Engineering team is seeking an hard-working electrical hardware engineer to work on the iPhone system technologies area - IO interfaces. The ideal candidate should have deep knowledge with all aspects of high speed and low speed interfaces and their implementation on hardware systems, including IO specs/protocol, controller/PHY high level design in silicon, system integration, silicon/system bring up, validation, performance tuning, and issue debug."}, "200461796": {"jobID": "200461796", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Optical Sensing HW - Optical Sensing HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461796/optical-sensing-hw-optical-sensing-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "Degree in Optics, Physics or equivalent. B.S./M.S. with industry experience, or Ph.D."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong background in optical designExperience with optical simulation (LightTools, FRED, Zemax, or similar)Hands-on with optical lab equipments (spectrophotometer, photo detector, light source, etc.)Excellent written and verbal communication skillsExperience supporting volume manufacturing is a plus, such as failure analysis, statistical analysis, etc.Experience with display optics is a plusDegree in Optics, Physics or equivalent. B.S./M.S. with industry experience, or Ph.D.", "jobDescription": "Design, develop, and launch next-generation optical-sensing technologies. \nBring devices to life and enable them interact with users and the environment in ways never imagined before. The optical sensing team integrates optical sensors across a variety of Apple products such as iPhones, iPads and Macs. The optical sensing team is looking for someone who is a self-driven go-getter. Strong experience with optics, optical system design, and detectors is required. Join us in crafting solutions the world doesn't know of yet."}, "200379132": {"jobID": "200379132", "origin_search": null, "posted": "Dec 15, 2022", "jobTitle": "Localization QA Tester", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200379132/localization-qa-tester?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA or MA in Localization, Languages, International Studies, Business Management."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum 2 years experience in a technical translation or localization QA role.Full working proficiency of both written and spoken English.Native-level fluency in one of the following languages:  Russian, Finnish, Korean, Canadian French, Thai, Danish, Indonesian, Italian, Hong Kong Chinese, Croatian, Romanian.Handle the translation, transcreation, linguistic review, and technical QA of different types of feature flows across all platforms (iOS, macOS, tvOS, watchOS, Android, 3rd party TVs, Web).Proficiency with Apple products and services, as well as localization CAT tools and content management systemsStrong appreciation for product and cultural nuances by geography.Understanding of engineering processes, especially in agile software and app development.Demonstrated involvement with hands-on testing for your language and confirmed experience in effectively mitigating complex localization issues.A passion for breaking UI flows to improve the quality of our products and services.Hard-working, with the flexibility to lead simultaneous projects with tight deadlines, varying scope and complexity requiring flexibility and prioritization skills.Excellent teammate with a meticulous demeanor and attention to details.Strong analytical, communication, and interpersonal skills.Knowledge of machine learning and/or scripting languages is a plus.BA or MA in Localization, Languages, International Studies, Business Management.", "jobDescription": "Apple products and services build powerful personal connections with customers around the world. Join our team to help localize UI features that resonate in all languages and regions.\n\nWe are looking for highly dedicated and experienced hands-on technical localization QA testers to join our Server UI Localization team in the Services organization and participate in Apple’s exponential international growth. The role supports Apple Media Products (App Store, Music, Video, Books, Podcasts, Fitness+, News), Apple Cloud Services, Maps, and Identity Management Services.\n\nAre you passionate about linguistics and QA?  Join us and advocate for our customers to ensure they have the best experience in our ecosystem."}, "200461295": {"jobID": "200461295", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "GPU Performance Modeling Engineer - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461295/gpu-performance-modeling-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience. Degree in Computer Science, Electrical Engineering or Computer Engineering is preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong knowledge and experience in GPU architecture, micro-architecture design, or performance analysis with an emphasis on hardware/software co-designStrong software skills and proficiency in C/C++ and a scripting language such as Python or RubyExperience working on performance model development and experimentation (GPU or CPU)Knowledge and experience with GPU performance benchmarks and workloadsStrong interpersonal skills and creativity to help the team solve design challengesKnowledge of 3D graphics APIs, operating system internals, and compiler technology a plusBS and 10+ years of relevant industry experienceBS and 10+ years of relevant industry experience. Degree in Computer Science, Electrical Engineering or Computer Engineering is preferred", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. Join us to help deliver the next groundbreaking Apple product!\n\nWe are seeking a highly motivated, innovative, and dedicated engineer to join the Platform Architecture GPU Performance Modeling Team; we are a group that is driving advanced exploration for next generation GPU architectures and micro-architectures in iPhone, iPad and Mac products. We rely on strong analytical skills and close collaboration to deliver the best overall solution to our customers. In this highly visible role, you will be at the center of a chip design effort working with all disciplines, with a critical impact on getting highly performant products to millions of customers quickly."}, "200450348": {"jobID": "200450348", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Engineering Project Manager, Charging CoreOS", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450348/engineering-project-manager-charging-coreos?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or related field, preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years of project management experience in software developmentStrong understanding of and experience in managing complex, multi-functional software projectsSound technical foundation and a highly motivated self-starterExcellent spoken and written communication with the ability to tailor communication style to multiple audiencesKnowledge of software engineering standard methodologies and related dependenciesAbility to build relationships and influence othersExcellent attention to detail and highly organizedAbility to turn incomplete, conflicting, or ambiguous inputs into solid action plansIdentifying risks, developing mitigation strategies, and facilitating resolutionsBS in Computer Science or related field, preferred.", "jobDescription": "Why Apple? Imagine what you could do here. At Apple, new insights have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nApple’s Core OS group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience!  We are looking for an experienced Software Engineering Program Manager to lead highly cross-functional efforts delivering exceptional performance and battery life across all Apple platforms.\n\nThis role requires an energetic and motivated individual with strong communication, organization, and technical skills who work well in a fast-paced dynamic environment. The ideal candidate will be self-motivated and also have a desire to learn, develop and build on technical expertise during product development. Our environment cultivates product innovation, rapid product iteration, and a liberating amount of autonomy."}, "200425349": {"jobID": "200425349", "origin_search": null, "posted": "", "jobTitle": "Client & Data Test Engineer, Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200425349/client-data-test-engineer-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200457622": {"jobID": "200457622", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Sensing System HW Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457622/sensing-system-hw-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$45.67", "max": "$68.75/hr,"}, "benefits": null, "requirements": "Strong electrical engineering background in analog and mixed-signal system-level circuit designExtensive experience in MATLAB, SPICE, or similar simulation and modeling toolsSensor and systems integration experience preferredExcellent written and verbal communication skills and solid teamwork and leadership skillsBS or MS in Electrical Engineering or equivalent", "jobDescription": "Come design, develop, and launch next-generation Sensing Technologies. The Sensing Systems teams integrates MEMS, magnetic, and capacitive sensors across a variety of Apple products such as iPhones, iPads, MacBooks. Bring devices to life and enable them interact with users and the environment in ways never imagined before. Join us in crafting solutions the world doesn't know of yet! The sensing team is looking for someone who knows analog, has board-level design experience and is a dedicated go-getter!"}, "200457618": {"jobID": "200457618", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Cellular Software Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457618/cellular-software-engineering-program-manager?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS EE/CS/CE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "At least 5+ years of program management experience in wireless software, system and platform's development.Good Understanding of cellular communications technologies (5G-NR/4G LTE/ UMTS/GSM/CDMA) is a significant plus.Driving multi-functional efforts across major technical fields: SW, HW, Silicon, and QA.Outstanding communication and presentation skills to engineers, managers, and execs.Identifying risks, developing mitigation strategies, and facilitating resolutions.Sound technical foundation and a highly motivated self-starter.Knowledge of software engineering standard methodologies and related dependencies.Strong leadership skills and ability to inspire team members.BS/MS EE/CS/CE or equivalent", "jobDescription": "Why Apple? We live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are targeting will be the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking of old problems in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.   As a Software EPM, you will get a front row seat to deliver the best experience to our users. You will need experience with software development fundamentals, proven leadership capabilities, excellent communication skills, and a desire to work with an amazing engineering team to develop ground-breaking initiatives in the cellular software space.  If you relish responsibility and are excited by the opportunity to build products that delight millions of customers then we want to hear from you - please apply!"}, "200433422": {"jobID": "200433422", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "WiFi P2P Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200433422/wifi-p2p-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Solid knowledge of data structures and their applicationsExperience developing software using C/C+, Objective-C, or SwiftStrong competence and experience in Layer 2, Layer 3 networking, QoSStrong analytical and problem-solving skills.Excellent analytical, programming and debugging skillsThrive in a collaborative environment and can clearly communicate while driving multiple projects across teamsPreferred Qualifications:Knowledge and experience of different LAN and WAN technologiesKnowledge of IEEE 802.11/WiFi Protocols.Experience developing software using embedded SDKs, frameworks and/or BSPs.Linux / Unix kernel networking stack knowledge and understanding of operating system fundamentals.Solid understanding of OO design principles and design patterns.Experience with hands-on development and troubleshooting on embedded targets. e.g., GDB, shell scripting, packet tracing (tcpdump, wireshark)Bachelor's degree in Computer Science or equivalent\n\nMasters Degree is preferred.", "jobDescription": "Join our Sensing and Connectivity team and drive innovation that matters! We build and seamlessly integrate technologies that enrich people’s lives and deliver the absolute best user-experience.\nAs a member of the WiFi team, we make decisions that influence the connectivity experience on products people use every single day, across the world. Are you a software development enthusiast? Are you passionate about internet-enabled devices and networking protocols? Do you want to learn more about WiFi and other wireless technologies? If your answer is yes, we may have the job for you."}, "200460776": {"jobID": "200460776", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Software Engineering Manager, Apple Media Products - Core Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460776/software-engineering-manager-apple-media-products-core-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science, plus 10 years minimum experience in related field required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$173,000", "max": "$299,000,"}, "benefits": null, "requirements": "Experience leading complex engineering projects from inception to production.Can see the big picture, set a vision, and grow the team and platform in accordance to that vision.Enjoys deep technical and product discussions. Has attention to detail and can context switch across multiple projects.Can provide hands-on technical leadership, including mentoring, guiding, and motivating the engineers.Experience leading and growing a team, including hiring and performance management.Excellent communication skills. Can effectively communicate complex ideas and make compelling arguments.Effectively collaborate with engineers, product managers, designers, collaborators, partners, etc.Hands-on experience working on scalable web services and features that span multi-functional teams.Strong analysis skills coupled with a deep understanding of data structures and algorithms.Experience with NoSQL data stores like Solr, Elastic Search, Redis, Memcached, Cassandra, Voldemort, etc.Experience with Java. Any other JVM or functional languages like Clojure is a plus.BS or MS in Computer Science, plus 10 years minimum experience in related field required.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you can accomplish. \n\nWould you like the stimulation and challenges of building world-class, extraordinary scalable systems that power App Store, Music, TV+, Fitness+, Arcade and many more? Then this is the opportunity for you at Apple! We strive to provide a flawless experience for millions of customers and developers. \n\nThe Apple Media Products (AMP)Core Services team is looking for an Engineering Manager to lead an outstanding team of Software Engineers that owns, develops, and maintains the online content system that houses all the catalog and editorial metadata used to power our Apple services. \n\nWith the online content system being a key player in our stack, you will be central in the development of new features across all Apple Media Product services. \n\nCome be part of the incredible team that owns critical infrastructure and drives new features."}, "200447456": {"jobID": "200447456", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "App Developer (Automation) - iOS / MacOS / WatchOS", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447456/app-developer-automation-ios-macos-watchos?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- Bachelors or Master’s degree with relevant work experience in Computer Science Engineering or similar"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Deep understanding of Object Oriented Application design principles with excellent debugging skillsPerseverance to learn new things and ability to drive a project from a simple idea to the finished product in a fast paced environmentStrong knowledge of at least one scripting language (preferably Python)Strong knowledge or experience with Swift/Objective-C, UIKit, CoreFoundation, Cocoa (macOS or iOS), remote data handling, REST, asynchronous/multithreaded programming, unit testing.Knowledge of Apple framework paradigms and commonly used patterns.You have strong analytical and interpersonal skills with an ability to thrive in a multi-functional environment.Excellent verbal and written communication skills required- Bachelors or Master’s degree with relevant work experience in Computer Science Engineering or similarNice to have:- Solid understanding of MongoDB (NoSQL) or any other similar database- AWS server admin knowledge- Understanding of iOS/MacOS or Linux environment- Familiarity with Web application development", "jobDescription": "We are the Field Design Engineering team, and we are looking for a highly motivated App Developer with in-depth knowledge of Software methodologies and excellent programming skills. The position requires a critical thinker with strong debugging skills and a curiosity about learning new technologies. You will contribute in designing the automation system and applications for the latest iPhone, iPad and Apple Watch products and help to drive and improve the quality of future Apple products.   \n\nYou will be working with several cross-functional teams to understand the automation requirements and will be involved in an effort to develop innovative tools, maintain, and improve our automated systems that are used across multiple wireless technologies and the globe.  \n\nCome join our team!"}, "200451048": {"jobID": "200451048", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Silicon Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451048/silicon-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS+ 3 years of relevant experience. MS preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience in the areas of system validation and ASIC design validation.Proven experience with design, simulation, debug, and performance analysis of high-speed digital ICs.Strong bringup and debugging skills and hands-on lab work. Experience with complex test equipment setups.Expertise in software automation skills in Python.Strong technical background in FPGA prototype emulation, and debug.Silicon validation, failure analysis and debug expertise.Design with RTL coding in Verilog is a must.Good knowledge of validating system level designs based on embedded processors and peripherals, such as; SPI, I2C, UART, JTAG, PCIe.Prior hands-on automation script development and optimization (using C, Python).Well versed in the usage of advanced lab equipment (scopes, BERTs, programmable power supplies, spectrum analyzer, etc).Shown analytical and problem-solving abilities.Knowledge and experience in embedded firmware development is big plus.Knowledge of one or more of wireless technologies like Thread, WLAN, UWB, Bluetooth is desirable.BS+ 3 years of relevant experience. MS preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you like to work on ground breaking technologies that enable amazing new products? Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nApple is looking for qualified, motivated silicon validation engineers. You will be working as part of a team doing pre/post-silicon bring- up, debug, and validation of wireless sub-systems.\n\nThis position is for a senior engineer with experience in system validation, who understands that the tight interaction between pre-silicon design and post-silicon validation is the key to shipping quality products. In this role, you will work closely with both IC design teams, FPGA emulation teams as well as firmware and system teams within Apple as we drive execution from first silicon through to mass-production release. \n\nYou will be expected to participate in all levels of this process, including the definition of custom board-level hardware for IC bring-up and test, defining and executing validation plans, and working with module and system teams to support their design integration and debug of system-level issues."}, "200442627": {"jobID": "200442627", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "AIML - Sr Program Manager, Technical Learning", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442627/aiml-sr-program-manager-technical-learning?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree in Learning & Development, Software Engineering, Business, or related fields \nProfessional proficiency in English"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "Experience delivering technical learning for technical audiencesDepth of experience with software engineering on Apple platforms (iOS, macOS, Objective-C, Swift, Xcode)Shown success in working with senior leaders and multiple stakeholders to influence alignment and actionPassion for adult learning and championing a culture of developmentDemonstrated success in negotiating, contracting, and communicating within an organizational frameworkProven track record to work well individually and in teams, work under tight achievements, and successfully balance multiple tasksExcellent oral, written, and interpersonal communication skills. Facilitation or teaching skills preferred5-years' proven experience crafting and implementing learning and development solutionsMinimum 3 years of demonstrated ability in consultancy or client relationship managementBachelor's Degree in Learning & Development, Software Engineering, Business, or related fields \nProfessional proficiency in English", "jobDescription": "Imagine what you can accomplish at Apple! We design products and services loved by people around the world, and we revolutionize entire industries. Behind every adventurous idea is a team of Apple employees, committed to the hard work it takes to make a dream become a reality. Developing opportunities for our employees to come together — to learn, to share, and to encourage one another — is essential to our work. It builds a sense of wonder and possibility that leads to the kind of innovation only Apple can deliver.\n\nThe AIML University team is looking for a Technical Learning Program Manager. You will be the face of technology training for AIML. You will uncover technical learning needs, influence learning strategy, and build solutions that support engineers. \n\nJoin the AIML University team and design employee opportunities as unique as you’d expect from Apple!"}}