{"200194354": {"jobID": "200194354", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "Optical Sensing HW - Laser Design Engineer (Laser Sensing)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200194354/optical-sensing-hw-laser-design-engineer-laser-sensing?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD degree in Optics, Physics or equivalent, or Bachelor/MS degree in engineering and related work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong devices-physics background, with a solid understanding of semiconductor physics, optical processes in semiconductors, and driver-level analog EE.Strong experience with semiconductor device designs. Design and simulation experience on semiconductor lasers, especially VCSELs and gratings is a strong plus.Experience in a typical programming language (matlab, python, etc) for modeling, simulation, and computation.Experience with one or more commercial device-modeling packages (Crosslight, Photon Design, Comsol, Lumerical, or similar) is a plus.Familiarity with compound semiconductor-device processing (III-V, II-VI, etc) and failure analysis tools.Experience with lab characterization, including laser drivers, optical metrology (spectrometers, oscilloscopes, and free space optics.), and time-resolved measurements.Excellent written and verbal communication skills; Solid teamwork skills in a highly multi-functional team environment.PhD degree in Optics, Physics or equivalent, or Bachelor/MS degree in engineering and related work experience.", "jobDescription": "The Laser Sensing Hardware group designs sensors and illuminators for Apple products, including components of the revolutionary FaceID system and digital crown in Apple Watch Ultra. This multi-disciplinary group of engineers are responsible for architecture, design, and manufacturing development of new sensing solutions. \n\nThe team is looking for someone who knows semiconductor lasers and is a self-driven go-getter. Experience with photodiodes is a plus. You will specify, develop, and validate new semiconductor components for new sensors."}, "200458799": {"jobID": "200458799", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "AIML - Software Development Engineer in Test, ML Systems Evaluation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458799/aiml-software-development-engineer-in-test-ml-systems-evaluation?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S or M.S in Computer Science, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "7+ years of proven ability to define/design/develop/maintain end-to-end as a SDET or SDE to support automation using any combinations of Swift (XCTest), Objective-C, Python or JavaSolid proven ability to define/design/execute/maintain product evaluation planning with clear quality metricsExperience with CI/CD automation and deployment tools such as TeamCity, Jenkins, Docker, Kubernetes + Git, GitHubExperience in logging and debugging tools i.e., Grafana, Splunk, shell scriptingExperience working on embedded devices as well as how those devices work across massively distributed systemsExcellent written and verbal communication and interpersonal skills, including achieving team goals, negotiation and getting stakeholder buy-in.B.S or M.S in Computer Science, or equivalent experienceAdditional languages such as Shell, Javascript are recommendedExperience with Apple ecosystem. Experience with iOS, macOS development, XcodeExperience with troubleshooting automation runs in 24/7 lab environment", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Build groundbreaking technology for large scale systems, natural language, big data, artificial intelligence. Partner with the people who built the intelligent assistant that helps millions of people get things done — just by asking.\n\nCome join the Machine Learning System Evaluation Engineering team at Apple. We are a diverse, international and passionate group about quality engineering and crafting innovative test and automation strategies to help us understand the quality of Siri while every part of the system is advancing.\n\nWe are looking for highly motivated Software Engineer who can own and drive test planning and automation development for to join our team. Join the team responsible for ensuring the quality of Siri languages across all Apple Products, and other cloud based services."}, "200462385": {"jobID": "200462385", "origin_search": null, "posted": "Feb 24, 2023", "jobTitle": "AIML - Sr Software Engineer, AIML Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462385/aiml-sr-software-engineer-aiml-siri-and-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MSc in Computer Science or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Systems programming experienceStrong Swift/Objective C coding skillsC++ coding skills desirableAPI design & developmentiOS SDK knowledgeFamiliarity with embedded system environmentsKnowledge of machine learning environments is desirableBS or MSc in Computer Science or equivalent work experience.", "jobDescription": "Siri is fast becoming the best way to get things done, by talking to our machines through artificial intelligence. Hundreds of millions of people now use Siri to send a message, play their favourite song, or even take a selfie. Now imagine what you could do here! Work on groundbreaking technology and build components with machine learned models, shipped to Apple products to redefining the way people and devices interact."}, "200452019": {"jobID": "200452019", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "SoC Physical Design Methodology Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452019/soc-physical-design-methodology-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.You have a strong intellectual curiosity, with excellent communication skills. You're organized and a self starter.You have physical design experience on SoC designs working with advanced technology nodes.Knowledgeable about interconnects, including parasitics extraction, performance analysis, and how manufacturing effects make them non ideal.Extensive knowledge of power delivery, electrical analysis, and how power-supply noise impacts chip performance.You have circuit design and analysis experience, especially for standard cells. In particular, you know how to perform Spice simulations.Familiar with static timing analysis tools and methodologies.Proven understanding of scripting languages such as Python and Tcl.Experience with machine learning is a plus. Experience with flow development for a large number of users on a tight schedule is a plus.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nAs a Physical Design Methodology Engineer, you will be an active participant in the team responsible for ensuring our physical design methodology is efficient, lean, and reliable."}, "200464384": {"jobID": "200464384", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "AIML - Release Engineering Manager, Siri & Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464384/aiml-release-engineering-manager-siri-information-intelligence?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Computer Science, a related field, or equivalent work experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$142,000", "max": "$214,500,"}, "benefits": null, "requirements": "6+ years in roles as DevOps, SRE and at least 2 years leading an engineering team or operations teamLeadership skills such as making presentations to leadership, running war rooms, inspiring teams, and influencing the organization to improve quality and coding best practicesHave a deep understanding of release engineering, branching and software configuration managementExperience working with engineering and project management teamsExperience in troubleshooting large distributed applications or mobile client applicationsTrack record of empowering your team to deliver results independently as part of a geographically diverse teamTroubleshooting and debugging skills: Analyze and investigate test failures, errors, infrastructure and build issuesBachelor’s degree in Computer Science, a related field, or equivalent work experience is required.", "jobDescription": "The AIML Integration and Delivery team is looking for exceptional leaders who are excited about leading a team to operate and automate the delivery of new experiences on Siri. \n\nWe are working to take future releases of Siri to the next level. As an organization, we are responsible for running release management and deploying all Siri server and client code, as well as machine learning models for Siri that affect 1 billion+ customers. If you are excited about the challenges of making development and releases more efficient while every part of the system is advancing, come help us solve these problems and be part of improving efficiency across the Siri and AIML organization! \n\nIn this role, you will lead a distributed team playing a part in ensuring the quality and delivery of groundbreaking technology for large-scale systems, natural language, big data, and artificial intelligence to end users. You will be leading conversations with various multi-functional teams of engineering and project management. You will lead them to identify issues and root causes, fix and prevent build and infrastructure failures, ensure frictionless delivery of features, and make the lives of our AIML organization better."}, "200378599": {"jobID": "200378599", "origin_search": null, "posted": "May 13, 2022", "jobTitle": "C++ Software Engineer (ML Implementation / integration)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200378599/c-software-engineer-ml-implementation-integration?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. in Computer Science or relevant fields with 5+ years of experience\nM.S. in Computer Science or relevant fields with 3+ years of experience \nPhD in Computer Science or relevant fields with 1+ years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum 3 years of professional software development experience in modern C++ & Python (Objective C/C++ is a plus).Familiar with algorithm implementation and optimization with platform constraints.Experience in computer vision / machine learning product development and delivery. Experience in working with complex software stacks.Creativity and curiosity for solving highly sophisticated problems.Excellent communication and collaboration skillsB.S. in Computer Science or relevant fields with 5+ years of experience\nM.S. in Computer Science or relevant fields with 3+ years of experience \nPhD in Computer Science or relevant fields with 1+ years of experience", "jobDescription": "The Video Computer Vision organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video. We have contributed to the FaceID and FaceKit project in the past and more recently the new LIDAR iPad and iPhone sensors. We are looking for the right engineer to help us take our efforts to the next level.\n\nIn this role, you will work together with similar minds in a unique development team where your skills and expertise will be put into the Apple products. This role is highly multi-functional and you will work very closely with various highly skilled machine learning and software development teams developing groundbreaking algorithms."}, "200440956": {"jobID": "200440956", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "High-Performance C++ SWE (machine learning)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440956/high-performance-c-swe-machine-learning?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "A bachelor's degree or higher in Computer Science, Engineering, Physics, Applied Mathematics or related fields, with 5 years industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Highly skilled in C/C++ and OOP,  proficient in scripting language such as Python or Matlab.Extensive knowledge of and experience with software debugging, troubleshooting, performance analysis and tuning.Knowledge of professional software engineering and best practices for the full software development life cycle, including coding standards, code reviews, source control management, and testing.Experience in real time computer vision system and 3D geometry is a plus.Proactive, analytical thinking, excellent problem solving and communication skill.A bachelor's degree or higher in Computer Science, Engineering, Physics, Applied Mathematics or related fields, with 5 years industry experience.", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life. We're looking for an exceptional software engineer with broad skills to join us to take part in our high-impact projects for Apple’s next generation products."}, "200449834": {"jobID": "200449834", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Software Engineer (Java)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449834/software-engineer-java?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS degree in computer science or information management, 5+ years of experience, or MS degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Expertise in Java and Java Enterprise technology applications architecture, design, development and support6+ years experience in designing and developing scalable enterprise level back end solutionsProven skills and Hands-on programming experience in Java, Spring, multi-threading, REST, Data Caching Services, DB schema design and data access technologiesExtensive hands-on experience with Machine Learning and building solutions for large-scale data infrastructureExperience crafting and architecting distributed systems, concurrent programming, and coding data structuresHands-on with architecture, design, development and deployment of enterprise systemsExperience rolling out distributed, large-scale, low latency web applicationsPrevious experience designing ecosystems for Web applications & API PlatformsExperience in architecting and defining Application layer in SOA/Micro Services landscapeExperience in building, orchestrating, and deploying highly scalable REST based stateless APIs/web services for web applications / mobile clientsUnderstand security concepts and build reliable and safe distributed applicationsExperience with leading and mentoring EngineersSolid knowledge of applications performance improvement techniques and caching solutionsAbility to successfully multi-task and support multiple, concurrent projectsExperience with Reactive Java applications is a plusBS degree in computer science or information management, 5+ years of experience, or MS degree- Excellent analytical and quantitative skills- Experience in working in a large enterprise, with a global environment, across multiple timezones and geographies- Excellent communication and collaboration skills and ability to multi-task- To be successful you are self-motivated; driven to achieve and exceed expectations- Attention to detail- Comfortable working in a loosely structured organization", "jobDescription": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job. \n\nThe Engineering Solutions team is looking for an experienced Java Software Engineer. In this role you will be partnering with cross functional teams across Apple. You will work closely with our business leaders and other partners to implement these new solutions. The candidate must be able to work independently, understand the needs and build the solutions for sophisticated architecture and comfortable working under pressure at times."}, "200460405": {"jobID": "200460405", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Production Services - Site Reliability Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460405/production-services-site-reliability-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- B.S. in Computer Science or related work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Passion in building reliable, scalable, and performant distributed systemsUnderstanding of distributed systems w.r.t. application, networking, and securitySRE or Dev/Ops experience in managing customer-facing systems in 24/7 environmentExperience in managing and monitoring fleets of *nix systems or container platformsExcellent judgment and integrity with ability to make timely and sound decisionsAbility to anticipate the needs of others and adapt to changing conditions- B.S. in Computer Science or related work experienceDesired, but not required, skills and experiences:- Experience as SCM administrator (e.g. Github, or similar)- Experience with container platforms (e.g. Docker, or similar)- Experience with monitoring and alerting (e.g. Prometheus, Grafana, or similar)- Experience with data analysis (e.g. Splunk, or similar)", "jobDescription": "The Production Services Site Reliability Engineer (SRE) role resides within the Software Delivery organization, which is at the core of the Apple software release process. This role is responsible for creating and maintaining services, which are used by software engineers to develop Apple software for delivery to customers around the world. The Production Services team drives reliability and performance engineering, instruments observability of services, responds to incident alerts, and reports on SLI/SLO metrics for visibility across the organization. This SRE role is essential in maintaining production services that are used to deliver the state-of-the-art operating systems, applications, and firmware to Apple customers."}, "200388536": {"jobID": "200388536", "origin_search": null, "posted": "Jun 9, 2022", "jobTitle": "AR/VR Software Engineer Applications", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200388536/ar-vr-software-engineer-applications?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Having strong interest in exploring a wide range of ideas of building user experiencesExperience shipping applications for Apple platforms (macOS, iOS, iPadOS, tvOS, watchOS). Strong Computer Science fundamentals. Detail-oriented approach to solving problems and building new things. Excellent verbal and written communication skills. Excitement to be part of a fast-paced and diverse organizationWe are looking for an engineer who can build delightful interactive experiences in iOS, ARKit, and SwiftYou thrive translating technical capabilities, questions, and constraints into prototypesYou are someone who can work cross-functionally in new and under-defined areas3D production/UX experienceBuild Applications in Xcode/SwiftBS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceOptional: Familiarity with 3D graphics APIs or game engines. Optional: Familiarity with AR technologies. Optional: 3D math/linear algebra fundamentals. Unreal/Unity Game engine experience is a plus.", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer to help push the visual fidelity of runtime graphics on Apple devices. Imagine yourself building applications that push the limits of Apple’s most advanced technologies, while developing your expertise in Augmented and Virtual Reality (AR/VR). As a core member of our team, you will leverage and expand your expertise in Apple's app development technologies, while working closely with organizations across Apple (Human Interface, Marcom, etc.) to implement apps that will delight, inspire, and inform feature development for tools and rendering."}, "200459747": {"jobID": "200459747", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "AIML - Sr Software Engineer, Siri Performance & Reliability", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459747/aiml-sr-software-engineer-siri-performance-reliability?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expert knowledge working with Spark and other distributed data technologies (e.g. Hadoop,Presto, Flink, Druid) for building efficient & large scale data pipelines.Expert knowledge of one or more object-oriented programming languages (Java, C++, Scala).Expert knowledge of one or more scripting languages (Python, Ruby, Bash etc.).Strong experience in data architecture and data modeling, SQL skills to analyze and explore data, identify patterns and draw insights.Solid knowledge of algorithms and design patterns.Excellent communication skills, and thrive in a collaborative team environment, strong problem solving skills, critical thinker, and self-starterStrong desire to learn, push the envelope, and share knowledge with others.Passionate about customer focus, with the understanding of business impact to drive the system improvementWHO YOU ARE-  You are an excellent communicator focused on delivering impact-  You are a self-starter, demonstrate curiosity can navigate ambiguity to deliver-  You are relentless in pursuit of excellence and are excellent at making trade-offs wisely-  You are humble and partner with your team and cross functional partners to deliver relentlessly on the team’s vision-  You are strong technically and mentor and coach junior team members to deliver to their full potentialApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining who people all over the world use their devices. Create groundbreaking technology for large scale systems, spoken language, big data, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking.\n\nThe vision for the Siri Performance & Reliability metrics team is to empower Siri organization by developing innovative tools infrastructure, automated data analysis and visualization to improve Siri performance and reliability for our customers. Join us, and impact hundreds of millions of customers across a plethora of Apple of devices!"}, "200404860": {"jobID": "200404860", "origin_search": null, "posted": "Oct 5, 2022", "jobTitle": "Senior Machine Learning Manager, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200404860/senior-machine-learning-manager-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "4+ years of experience building machine learning capabilities across many different product areas at scale\n\n3+ years management experience\n\nPhD or equivalent experience in Machine Learning, Statistics, Forecasting, Optimization, Reinforcement Learning or related field with experience building production systems or have equivalent experience working with large data science / machine learning projects in industry"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$196,000", "max": "$343,500,"}, "benefits": null, "requirements": "Differentiated, recognized expertise in automated bidding systems, ad campaign optimization algorithms, advertiser side measurement.Ability to define quarterly/yearly roadmaps as well as formulate a strategic vision that aligns with the broader organization.Demonstrated success mentoring and growing a team technically as well as developing growth plans for its members.Ability to apply and implement research concepts, ultimately in production quality code.Experience defining clear, testable research hypotheses, including intended impact on the business.Deep knowledge of design of experiments, online experimentation approaches, preferably at scale.Ability to formulate and advocate for R&D objectives and results to cross-functional team members including executive business leadership and product management.Experience contributing and/or reviewing research for top conferences and publications.Deep fluency in Java or Python.Experience with Spark, Hadoop or other distributed frameworks.4+ years of experience building machine learning capabilities across many different product areas at scale\n\n3+ years management experience\n\nPhD or equivalent experience in Machine Learning, Statistics, Forecasting, Optimization, Reinforcement Learning or related field with experience building production systems or have equivalent experience working with large data science / machine learning projects in industry", "jobDescription": "At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in the App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy.\n\nWe are seeking a self-motivated individual that will build out the next generation of our ads platforms and ensure that Apple provides the most relevant and high quality ads experience while maintaining a healthy marketplace. Your team will develop models that improve our platform across the board, developed production code to generate recommendations and work closely with business partners to help drive the development of new products as well as perform large scale and complex experiments to understand their effects.\n\nYou will drive strategic outcomes through meaningful innovation in multiple fields by leading the development and application of advanced techniques and algorithms to improve our ad network. You have, or will develop a deep understanding of the ad network behavior, and will work with product management and business leadership to prioritize an innovation roadmap across multiple technical domains. You will lead the conception, development, and delivery of innovative capabilities that differentiate our products and are core to our business.\n\nYou should have experience developing and implementing machine learning algorithms, ideally within the ads space. You will have an excellent understanding of scalable architectures and thrive working in Agile environments. The ability to be a great teammate under tight deadline constraints is key to success."}, "200438141": {"jobID": "200438141", "origin_search": null, "posted": "Nov 14, 2022", "jobTitle": "Software QA Engineer - Video Apps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200438141/software-qa-engineer-video-apps?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree in Computer Science/Engineering, or equivalent experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$88,100", "max": "$186,600,"}, "benefits": null, "requirements": "1-3 years experience as a Quality Assurance (QA) EngineeriOS and macOS familiarityExperience with photo/video/film editingExperience in testing multiple platform OS applications (iOS/macOS preferred)Analytical, methodical, inquisitive and persistent problem solver committed to driving quality forwardProficient at balancing multiple efforts simultaneously and meeting strict deadlinesCan extract user scenarios from software feature descriptions and requirements to translate them into effective test plans and cases.Proven bug detection, isolation, and regression skillsActive user of photo/video on social mediaComfortable and adaptable in a fast-paced, multifaceted environmentAbility to abstract technical details and effectively communicate to audiences at different levelsBachelors Degree in Computer Science/Engineering, or equivalent experience required.Experience in photo, video editing is required", "jobDescription": "Imagine what you could do here! The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThe Video Applications team is looking for a Software QA Engineer with photos, video editing background to contribute to the production of innovative tools for creative professionals, video makers and visual storytellers. It requires a highly proactive individual with strong creative, technical and analytic skills and passion for new technologies related to computer vision/on device machine learning."}, "200448520": {"jobID": "200448520", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Media-IP SoC Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448520/media-ip-soc-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experienceStrong understanding of SoC, fabric, and memory system architecturesStrong software development and organizational skills especially with modular object-oriented SW architectures in C++Looking for people who are fast learners with strong problem solving and analytical skillsExcellent written and verbal communication skills for cross-functional collaboration and presentationsPREFERRED QUALIFICATIONSGood understanding of data analytics, statistics, and applied ML (machine learning) for analyzing large data setsExperience with performance model development & analysisExpertise in C++ & latest STL libraries, knowledge of Python, Lua, and shell scripting languagesGood understanding of QoS, arbitration, and queuing theoryNo multi-media expertise requiredBS and 3+ years of relevant industry experience", "jobDescription": "Do you love crafting elegant solutions to highly complex challenges? Are you a big-picture forward-thinking who understands how each element affects all the others? At Apple, our Architecture group is responsible for connecting our hardware and software into one unified system! Join this team, and you’ll collaborate with engineers across Apple to design how all of our technologies work in unison! \n\nWe are looking for a Media-IP SoC Performance Engineer to join our small dynamic team. We own the performance models of several of the complex multi-media IPs in Apple’s SoCs. These IPs are central to the customer experience in almost all of Apple’s products from Apple Watch, iPhone, iPad, MacBook, and next generation product lines. In this highly visible role, you will collaborate closely with cross-functional teams to develop, verify, and use performance models for data driven architectural exploration and validation."}, "200448488": {"jobID": "200448488", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Media-IP SoC Performance Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448488/media-ip-soc-performance-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experienceStrong understanding of SoC, fabric, and memory system architecturesStrong software development and organizational skills especially with modular object-oriented SW architectures in C++Looking for people who are fast learners with strong problem solving and analytical skillsExcellent written and verbal communication skills for cross-functional collaboration and presentationsPREFERRED QUALIFICATIONSGood understanding of data analytics, statistics, and applied ML (machine learning) for analyzing large data setsExperience with performance model development & analysisExpertise in C++ & latest STL libraries, knowledge of Python, Lua, and shell scripting languagesGood understanding of QoS, arbitration, and queuing theoryNo multi-media expertise requiredBS and 3+ years of relevant industry experience", "jobDescription": "Do you love crafting elegant solutions to highly complex challenges? Are you a big-picture forward-thinking who understands how each element affects all the others? At Apple, our Architecture group is responsible for connecting our hardware and software into one unified system! Join this team, and you’ll collaborate with engineers across Apple to design how all of our technologies work in unison! \n\nWe are looking for a Media-IP SoC Performance Engineer to join our small dynamic team. We own the performance models of several of the complex multi-media IPs in Apple’s SoCs. These IPs are central to the customer experience in almost all of Apple’s products from Apple Watch, iPhone, iPad, MacBook, and next generation product lines. In this highly visible role, you will collaborate closely with cross-functional teams to develop, verify, and use performance models for data driven architectural exploration and validation."}, "200444152": {"jobID": "200444152", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Motion Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200444152/motion-software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's or Master’s degree in Computer Science, EECS, or equivalent experience.\n1-2 years professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Developed C/C++ or ObjC code for a shipping product in a peer reviewed environment.Demonstrated ability to break down complex requirements into orthogonal and independent components for the purpose of building composable software.Experience with software designs where logic/behaviors crosses thread, process, and machine boundaries.Implemented signals processing, statistical modeling, and/or machine learning algorithms to run on platforms with limited compute and memory.Employed usage of higher level languages (e.g. python, matlab) and posix utilities to expedite common computing tasks.Bachelor's or Master’s degree in Computer Science, EECS, or equivalent experience.\n1-2 years professional experience.Familiarity with the following: - AI/ML - Public facing API design. - Objective-C or Swift. - Modern C++ idioms. - Distributed systems. - ARM assembly. - Inertial sensors. - Navigating and understanding large code bases.", "jobDescription": "CoreMotion team has built innovative ways for users to improve their health and fitness. When you exercise and move with your devices, it's the sensor fusion algorithms from the engineers and scientists on this team, that track human motion and provide interpretable insights. Join CoreMotion to work with people who have expertise and passion to model human movement and have a postive impact in users' lives. As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple's customers every single day."}, "200460179": {"jobID": "200460179", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Imaging & Sensing Incubation, HW Design Electrical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460179/imaging-sensing-incubation-hw-design-electrical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MSEE with 3+ years of industry experience or BSEE with 5+ years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "ELECTRONICS EXPERIENCE in the following areas:Processor peripheral interfaces (PCIe, USB, I2C, SPI, storage, high speed serial interfaces)Power supply designStrong working knowledge of Signal and Power Integrity and best practices for PCB layout and constructionExperience with lab equipment, including oscilloscopes, logic analyzers, and multi-metersPreferred Qualifications:ELECTRONICS EXPERIENCE in the following areas:SOC’s, microcontrollers, microprocessors (ARM), FPGA’sCamera electrical protocols (e.g., MIPI, LVDS, SDI, DP, HDMI)Sensors or transducersTaking designs from concept through manufacturing & test, perform mechanical assembly for quick prototypes, and bring-up/debug & validation of digital designsMSEE with 3+ years of industry experience or BSEE with 5+ years of industry experience", "jobDescription": "Apple's Incubation Team develops prototype hardware systems that are fundamental to delivering future products & features.\n\nThe team is seeking a skilled Electrical Engineer to create high performance hardware systems supporting Computer Vision, Machine Learning, and Photography applications that break new ground in Technology and User Experience.\n\nThis role offers an incredible opportunity to work with and learn from extraordinary team members in multiple disciplines, while contributing on exciting design applications. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation."}, "200440318": {"jobID": "200440318", "origin_search": null, "posted": "Mar 6, 2023", "jobTitle": "Computer Vision Data Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440318/computer-vision-data-scientist?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in Data Science, Statistics, Bioinformatics, Operations Research, Computer Science, or similar quantitative domain."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "Extensive knowledge in statistical data analysis and machine learning techniques.Solid programming skills with Python for data processing and development.Experience developing data science pipelines, tool-chains, and workflows.Have a big enough toolbox to know how to find patterns in large and messy data, identify targets for performance, and identify sources of variance about those targets.Experienced with data visualization (e.g. matplotlib/ggplot/tableau).Have excellent verbal and written communications skills and experience in influencing decisions with information.You are self-motivated and curious with demonstrated creative and critical thinking capabilities and an innate drive to improve how things work.You have a high tolerance for ambiguity in a fast paced environment. You find a way through. You anticipate. You connect and synthesize!PhD or MS in Data Science, Statistics, Bioinformatics, Operations Research, Computer Science, or similar quantitative domain.", "jobDescription": "Do you have a passion for computer vision and deep learning problems? We are looking for someone who thrives on collaboration and wants to push the boundaries of what is possible today! The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. Our data scientist will work closely with other members of the Video Computer Vision org to implement model evaluation pipeline, analyze large scale data to help influence product decision and improve product quality. This position will require strong analytical and coding skills, presentation skills, and collaborating with multiple teams. You will get to work on computer vision products like FaceID and exciting future technologies."}, "200449187": {"jobID": "200449187", "origin_search": null, "posted": "Mar 4, 2023", "jobTitle": "RF System Integration Engineer – Cellular Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449187/rf-system-integration-engineer-cellular-technologies?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE required, MSEE preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Solid understanding of RF fundamentals and communication theoryExperience programming in C/C++ with good object oriented design principalsGood understanding of RF metrics and knowledge of cellular standards including LTE and 5G (PHY)Hands-on Experience with RF/Wireless lab equipment like call box testers, spectrum analyzers, etcEnergy and drive to thrive in a dynamic environmentBSEE required, MSEE preferred.-  Recent experience with automation, scripting and development of test plans-  Familiarity with data processing and statistical tools-  Good understanding of cellular 3GPP (2G/3G/4G/5G) RF standards-  Experience with RF-Transceiver/Baseband Physical & Layer 1 control-  Strong technical background in 5g-NR/LTE/UMTS physical layer", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming products, services, and customer experiences very quickly. Every single day, people do amazing things at Apple. Join us in creating the best products in the world, crafting best techniques and methodologies that enhance user experience.\n\nThe System RF group at Apple is growing rapidly and looking to onboard individuals with passion for wireless tech, eagerness to learn and who want to collaborate with the brightest minds to bring forth exciting products that enrich people's lives.\n\nYou will become part of a hands-on development team that furthers engineering finesse, creativity and innovation. You will be responsible for integration of the RF sub-system into multiple products, perform in-depth data analysis, assess design maturity and make contributions to current and future design. Interact and work closely with teams from hardware, software and systems across Apple as well as chipset and instrument vendors. You will develop techniques, algorithms, and methods to guarantee consistent and reliable wireless performance on Apple products. The scope of work spans both sub 6GHz and mmWave development. Bring passion and dedication to your job and there's no telling what you could accomplish!"}, "200460711": {"jobID": "200460711", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Camera ISP Algorithms Prototyping Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460711/camera-isp-algorithms-prototyping-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD in imaging fields, or PhD in a non-imaging field but with 2+ years practical camera imaging experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "PhD in imaging fields, or PhD in a non-imaging field but with 2+ years practical camera imaging experienceBackground/experience in camera ISP pipeline OR strong background in statistics/signal processing is requiredAbility to work effectively with other developers to bounce ideas, reduce uncertainty in new solutions, and formulate solutions into practical algorithmsSelf driven and passionate for both camera technologies as well as prototyping and productization of themAbility to learn quickly and become familiar with multiple different technology areasAlgorithm prototyping in Matlab requiredBackground in human visual processing would be a plusA strong plus would be Python or C/C++ experience, or willingness to pick up and work on on-device C/C++ prototypingPhD in imaging fields, or PhD in a non-imaging field but with 2+ years practical camera imaging experience", "jobDescription": "Apple's Camera algorithm team is looking for extraordinary algorithm prototyping engineers to work on the prototyping of image capture and processing/rendering algorithms that serve all Apple product cameras. As part of the team, you will work on camera/ISP/Machine learning technologies based on Apple crafted image signal processing pipeline and HW components, such as the Apple Neural Engine. Here you will have the chance to define the way the Apple camera captures, processes, and renders outstanding still image and video quality. Our close-knit team fosters an environment of algorithms innovation, rapid product prototyping, and collaboration at both team and multi-functional levels. We work closely with various teams, such as Silicon Design, camera hardware, camera software and QA. Our team environment is multifaceted, fast-paced and requires a self-starter attitude."}, "200452584": {"jobID": "200452584", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Next Generation Cellular Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452584/next-generation-cellular-technologies?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, and coding theory).Strong background in wireless communications research preferably with information-theoretic background and coding theory.Deep-knowledge of communication system theory, forward-error correction (FEC), machine learning models for communications.Knowledge of cellular communication standards.Experience with Matlab/C, design flow, algorithm development, link-level simulation (floating-point and fixed-point).BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200459863": {"jobID": "200459863", "origin_search": null, "posted": "Jan 28, 2023", "jobTitle": "Software Engineer, Core Services - Apple Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459863/software-engineer-core-services-apple-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science. 5 years professional software engineering experience preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Expert knowledge of developing and scaling Java web applications with very stringent latency requirements.Experience working with NoSQL solutions like Cassandra, Voldemort, Redis, and Memcached. Experience working on data pipelines using Kafka, Spark, HDFS. Experience working with Solr / Lucene.Strong object oriented design and analysis skills coupled with a deep understanding of data structures and algorithms.Experience working with object relational databases like Hibernate Experience with protocols like TCP/IP, HTTP, SSL Knowledge of JVM hosted languages like Clojure is a plus.Experience writing effective unit and integration tests. Outstanding critical thinking and debugging skills.Ability to effectively work with cross functional teams to understand requirements and engineer highly performant implementations.Ability to develop, advocate for, and build consensus on coding best practices.Additional Requirements:Build large scale web-based projects and features, ensuring robust & maintainable solutions are implemented with special attention to performance and usability details. Effectively demonstrate feature prototypes to executives. Develop, advocate for, and build consensus on, coding standard methodologies. Ability to effectively work with multi-functional teams to understand requirements and engineer highly performant implementations. Experience with crafting web applications that scale to millions of requests per second is highly preferred.BS or MS in Computer Science. 5 years professional software engineering experience preferred.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you can accomplish. Would you like the stimulation and challenges of building world-class, extraordinary scalable systems that power App Store, Music, TV+, Fitness+, Arcade and many more? Then this is the opportunity for you at Apple! We strive to provide a flawless experience for millions of customers and developers. Apple Media Products Core Services team is looking for a software engineer to help build creative features that will enhance the experience of using these services for our millions of customers around the world. We will work on building and enhancing large-scale systems using distributed data stores with a strong focus on scalability and performance. We partner with a variety of cross and multi-functional team members from a diverse array of groups across the company. You will join a hands-on development team that fosters creativity and generates novel solutions based on engineering excellence. Be a part of an innovative impactful team making a difference."}, "200449019": {"jobID": "200449019", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Shader Subsystem Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449019/graphics-shader-subsystem-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Lead delivery of features in a complex GPU or CPU blockStrong System Verilog/UVM experience. Ability to develop complex test benches from scratch.Strong OOP coding skills (preferred languages are C/C++, Python, Perl, RubyExperience developing random instruction generators, either for GPU or CPUsExperience with cosimulation checkersGraphics pipeline, OGL/Metal/OCL programming experience is a bonusMachine learning experience is a bonusBS degree + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices. \n\nAs part of the GPU shader core verification team, you will be involved in end-to-end functional and architectural verification of Apples next generation GPUs. If you are a verification engineer that enjoys working on core GPU/CPU architecture, graphics rendering, and building complex test benches from scratch, this will be an exciting role for you. We use cutting edge verification methodologies, and emphasize innovation to enable Apple's silicon leadership."}, "200414522": {"jobID": "200414522", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "Senior iOS Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200414522/senior-ios-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of experience developing iOS appsProficiency in a systems programming language, such as C/C++, Objective-C, Swift, etc.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceInterest or proficiency in UI/UX designFamiliarity with ARKitExperience using iOS frameworks like UIKit, AVFoundation, Core Motion, Core ML, CloudKit, SiriKit, StoreKit, etc.Experience with Unix development, daemons, cross-process communication, etc.", "jobDescription": "The Technology Development Group (TDG) is looking for iOS Applications Engineers to help us build the next generation of interactive applications for our platform. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV). As a member of our organization you will assist us in crafting future products that will delight, inspire and empower millions of people."}, "200377201": {"jobID": "200377201", "origin_search": null, "posted": "Aug 8, 2022", "jobTitle": "Senior Manager, Data Engineering, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200377201/senior-manager-data-engineering-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in Computer Science, Distributed Systems, Software Engineering, or related Field; and experience designing, building, maintaining, and extending web- scale production systems."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You are a clear and effective communicator, and enjoy collaborative problem solving.You have a track record of continuously aiming for engineering excellence, leading teams to adopt standard methodologies, meticulous development and quality processes.You have deep experience leading teams that deliver critically important data processing capabilities, to production applications, with substantial scale and expensive failure modes.You have a deep understanding of innovative data engineering approaches, and you stay on top of developments, and are aware of what leading players are doing.You have experience leading teams that implement and extend highly performant, resilient, reliable, and understandable data processing pipelines You have deep experience with Spark, Hadoop, HIVE, Kafka, Cassandra or other distributed systems.You have extensive expertise in Python, Java, Scala, SQL, and/or other relevant languages and frameworks.You have worked in cloud environments and are familiar with object stores, inference engines, and common cloud-native data storage and processing frameworks.You have worked in CI/CD environments, understand supporting technologies and standard processes.You understand statistics and are capable of using data analysis techniques to understand data quality, profile system loads, understand the relationships between business metrics, and technical metrics.You have experience working closely with operational teams on deployment, monitoring, and technology management concerns.Experience in Ad Tech is a plus.BS/MS/PhD in Computer Science, Distributed Systems, Software Engineering, or related Field; and experience designing, building, maintaining, and extending web- scale production systems.", "jobDescription": "At Apple, we work every single day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative content on their devices, while helping publishers and developers promote and monetize their work. Our technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy!\n\nWe are looking for a hardworking and inspirational leader who can excel in an Agile environment, lead our development efforts for the next generation of Ad Tech; and target systems with a strong focus on user privacy, while redefining the industry. For end-users, we strive to provide high privacy guarantees, and for advertisers we want to enable new mechanisms to target the right audiences. \n\nYou will collaborate with data scientists, and lead a team of engineers to design, develop, and implement solutions. You will leverage open source, build tools, develop frameworks, and create components that will enable us to improve and scale our advertising targeting systems. The successful candidate will help drive new approaches, while preserving the privacy of our consumers, and change the way advertising works with data."}, "200312941": {"jobID": "200312941", "origin_search": null, "posted": "Nov 19, 2022", "jobTitle": "Pre-Silicon Driver Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200312941/pre-silicon-driver-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Technical BS/MS degree or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Good Programming with knowledge of C/C++Understanding of Driver development or Operating System conceptsUnderstand either CPU or GPU architecturesExcellent written and oral communication skillsTechnical BS/MS degree or equivalent experienceExperience with Metal, OpenGL, OpenCL, DirectX, CUDA or other GPU programming languages or other parallel programming languages is a plus", "jobDescription": "Apple’s GPU Software team provides the graphics software foundation across all of Apple’s innovative products, including iPhone, iPad, Apple TV, Mac, and Apple Watch. Apple ships Metal API, our unified graphics and compute API that provides near direct access to our GPUs on all products. \n\nJoin our team and you’ll collaborate with engineers across Apple to develop tools and APIs to enable developers to produce cutting edge applications for graphics, machine learning, and compute."}, "200465172": {"jobID": "200465172", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "SOC Cache Architecture Performance Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200465172/soc-cache-architecture-performance-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. and 10+ years of relevant industry experience. Masters, or PhD in EE, CS, or related field preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Ideally, you will have a B.S. and 10+ years of relevant industry experience and posses:Good written and verbal communication skills.Deep understanding of cache micro-architecture, data coherency protocols, and on-chip interconnect architecture.Good knowledge of C++, including templates and the STL.Experience in writing and using SoC performance models, and transforming the simulation results into compelling performance analysis.Ability and enthusiasm to work with experts in other domains, such as CPU, GPU, Display, Camera, and Machine Learning, to understand their cache usage requirements, and help them apply good performance modeling practices to drive architecture and design decisions.Proficiency in scripting languages, ideally Python.B.S. and 10+ years of relevant industry experience. Masters, or PhD in EE, CS, or related field preferred.", "jobDescription": "Do you love crafting elegant solutions to complex problems? Do you enjoy learning how systems work from the big picture down to the smallest detail? As part of the SoC Performance group, you’ll work with a diverse set of cross-functional teams to help architect, optimize, and ship our industry-leading SoCs powering Apple products from iPhone to Apple Watch, iPad, Macs, and more! \n\nYou’ll join a team of performance architects who deeply analyze the way our SoCs are used by real software, in order to ensure that software can harness the full power of our chips and to drive the design of future SoCs to be an even better match for real-world use cases. We’re looking for experienced, passionate, and highly motivated individuals to help us set the standard on the performance, efficiency, and hardware/software integration of Apple’s products!\n\nYou will enjoy this role if:\n\n-  You're interested in hardware design, hardware/software co-design, hardware/software optimization, and power/performance tradeoffs.\n\n-  You derive satisfaction from not only performing the analysis, but using your interpersonal skills to use your analysis to influence the direction of the organization.\n\n-  You enjoy doing deep-dives into hardware and software parts that are outside of your immediate area of responsibility, to establish relationships across the organization and apply the findings to innovate the parts you own."}, "200462079": {"jobID": "200462079", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Software Engineer (Full Stack), Employee Experience & Productivity", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462079/software-engineer-full-stack-employee-experience-productivity?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in computer science or equivalent industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of Software development experience designing and building complex, highly available, large scale Web applications.Solid understanding of full web technology stack: RESTful services, client-side frameworks, data persistence technologies.Experience building pixel-perfect, robust and, accessible user interfaces on the web.Proficient in one or more JavaScript framework like Angular, React, Vue or equivalent.Strong understanding of TypeScript and the latest ECMAScript standards.Fluent in CSS3 and Less/Sass (ability to write mixins, partials, functions, etc) and usage in large scale applications.Hands on experience with Java and related technologies: Java, Web Services, Spring Framework, Spring Boot, Hibernate, JUnit/TestNG.Experience with non-relational, NoSQL databases.Experience in web analytics, accessibility standards, and SEO techniques.Strong problem solving skills.Passion for building a rich and innovative user experience.Excellent communication and collaborative skills.Ability to collaborate effectively with teams located in different locations.BS degree in computer science or equivalent industry experience.Having any of the following are definite pluses for this role:Ability to learn and apply new technologies quickly.Experience with reactive or functional programming.Experience with Node.js.Experience with search platforms (e.g.: Solr, Elastic).Experience with cloud technologies and integrating/deploying SAAS solutions.Experience with Build Tools.Experience with data visualization technologies.", "jobDescription": "Imagine what you could do here at Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. What inspires you? Creating something new and finding solutions to complex problems? Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nIS&T Corporate Systems team is looking for a creative and motivated Software Engineer with excellent problem solving and interpersonal skills. The work we do here has a large impact on Apple, from enabling our internal businesses to do their best work, to providing rich, highly useable experiences to our customers and partners.\nOur teams foster a collaborative environment with creative, smart & fun people using state of the art technologies. Engineering excellence is expected. Come join us for this once in a lifetime opportunity in building solutions for Apple that have a worldwide impact."}, "200463904": {"jobID": "200463904", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Program Manager, Worldwide AppleCare Support Programs", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463904/program-manager-worldwide-applecare-support-programs?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA or BS degree in Computer Science, Computer Engineering or similar technical field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "5 to 7 years experience managing projects or programs, including large, cross-functional, contact center, and support initiatives; with an emphasis in software technologyTechnical project management for a product (can be a physical product, app, or system)Proficient in iterative UI/UX design, including sketches, wireframes, concept, feature development in close collaboration with cross-functional stakeholders; with ability to make time vs. complexity tradeoffsExcellent visual, communication, and presentation skills to help others understand design rationale and product decisions. Communicates design and engineering requirements to project team/leaders.Collaborates across All phases (design, testing and implementation) of the engineering project using breadth of technical knowledge and experience. Evaluates technical risks and takes action to minimize the risks assessed.Experience in product development and Engineering, AR, VR, 3D graphics, Unity, Xcode, Swift, Mobile App development, and related software technologies. SwiftUI and RealityKit frameworks a plusProficient with iOS / iPadOS app development for multiple genres of apps: productivity, lifestyle, social media, educational, entertainment, and/or games.Exceptional interpersonal skills; thrives in highly collaborative projects, effective at building consensus, handles high stakes decisions with ease with the ability to cut through ambiguityProven oral and written communication skills; ability to become fluent in technical concepts and explain to non-technical partnersAble to travel several times a year to support initiatives.BA or BS degree in Computer Science, Computer Engineering or similar technical field", "jobDescription": "The AppleCare Support Programs Team is seeking an innovative and passionate Technical Program Manager to oversee a growing portfolio of contact center projects. This position will work directly with Engineering and development teams daily on Software / Hardware projects. It will set strategy, evaluate ideas, prioritize features, define releases, manage product roadmap, timelines, budget, and provide regular updates to senior leadership on progress. This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), and machine learning (ML). They will influence worldwide support strategy for new initiatives, and build strong relationships with a broad set of teams. Collaborates across all phases - design, testing and implementation of the engineering project using breadth of technical knowledge and experience. Other key partnerships include members of all other AppleCare organizations, IS&T, Retail, Legal, Privacy, Product Marketing, Hardware Engineering, Software Engineering, Security, and more. This a key role in delivering AppleCare’s capital investment portfolio."}, "200466815": {"jobID": "200466815", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "AI/ML Next Generation Wireless Systems Research Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466815/ai-ml-next-generation-wireless-systems-research-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Research experience on solving interdisciplinary problems via technologies based on Artificial Intelligence and Machine Learning (AI/ML).Publications in prestigious machine learning conferences/journals such as ICML, NeurIPS, JMLR, ICLR, ACL, and CVPR.Solid mathematical foundation including Linear Algebra, Probability Theory and Statistics, Estimation Theory, and Information Theory.Working knowledge in Algorithms, Optimization, and Object Oriented Programming.Deep understandings of classical neural network architectures and learning methods such as CNN, RNN, Graph Neural Networks, Self-supervised Learning, Transformer, Federated Learning, Reinforcement Learning, and GAN.Experience on prototyping AI/ML concepts via hardware/software, model analysis, and developing varied perspectives to solve problems.Abilities to make independent contributions as well as promote team collaboration.Good programming and code management skills.Familiarity with ML frameworks such as PyTorch and TensorFlowBS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation wireless solutions by groundbreaking AI/ML techniques. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will experience the unique and rewarding opportunity to craft next generation wireless technologies that will generate deep impact on future Apple products and inspire global Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part in all Apple devices that delight our customers. In our unit, our mission is to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will participate on defining system level ideas, proposing, and developing innovative concepts & algorithms, performing sophisticated system simulations, and working on prototyping platforms to quickly prove your ideas for current and next generation (5G/6G) cellular systems via innovative AI/ML paths."}, "200408561": {"jobID": "200408561", "origin_search": null, "posted": "Aug 10, 2022", "jobTitle": "AR/VR Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200408561/ar-vr-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience shipping applications for Apple platforms (macOS, iOS, iPadOS, tvOS, watchOS).Strong Computer Science fundamentals.Detail-oriented approach to solving problems and building new things.Excellent verbal and written communication skills.Excitement to be part of a fast-paced and diverse organization.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceOptional: Familiarity with 3D graphics APIs or game engines.Optional: Familiarity with AR technologies.Optional: 3D math/linear algebra fundamentals.", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Software Engineer to help meaningfully impact the way people stay connected. Imagine yourself building fundamental applications on top of Apple’s most advanced technologies, while developing your expertise in Augmented and Virtual Reality (AR/VR).\n\nAs a core member of our team, you will leverage and expand your expertise in Apple's app development technologies, while working closely with organizations across Apple (Human Interface, Frameworks, etc.) to design, architect, and implement apps that will delight, inspire, and empower millions of users."}, "200452662": {"jobID": "200452662", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Next Generation Cellular Technologies", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452662/next-generation-cellular-technologies?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong analytical and problem-solving skills (linear algebra, random processes, detection and estimation, and coding theory).Strong background in wireless communications research preferably with information-theoretic background and coding theory.Deep-knowledge of communication system theory, forward-error correction (FEC), machine learning models for communications.Knowledge of cellular communication standards.Experience with Matlab/C, design flow, algorithm development, link-level simulation (floating-point and fixed-point).BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. Join us to help deliver the next groundbreaking Apple product. \nDo you love working on challenges that no one has solved yet? Are you ready to join a team transforming hardware technology? In this role, you will be a key member of the system engineering team working on modem systems features and requirements."}, "200259604": {"jobID": "200259604", "origin_search": null, "posted": "Dec 5, 2022", "jobTitle": "AIML - Machine Learning Researcher, MLR", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200259604/aiml-machine-learning-researcher-mlr?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD, or equivalent practical experience, in Computer Science, or related technical field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Demonstrated expertise in machine learning research.Publication record in relevant conferences (e.g., NeurIPS, ICML, ICLR, AAAI, CVPR, ICCV, ECCV, ACL, EMNLP, etc).Hands-on experience working with deep learning toolkits such as Tensorflow or PyTorch.Strong mathematical skills in linear algebra and statistics.Ability to formulate a research problem, design, experiment, implement and communicate solutions.Ability to work in a diverse collaborative environment.PhD, or equivalent practical experience, in Computer Science, or related technical field", "jobDescription": "Play a part in building the next revolution of machine learning technology. We're looking for passionate mid-level and senior researchers to work on ambitious curiosity driven long-term research projects that will impact the future of Apple, and our products. In this role, you'll have the opportunity to work on innovative foundational research in machine learning.\n\nAs a member of the team, you will be inspired by a diversity of challenging problems, collaborate with world-class machine learning engineers and researchers to impact the future of Apple products, and publish some of your results in high-quality scientific venues."}, "200420086": {"jobID": "200420086", "origin_search": null, "posted": "Aug 31, 2022", "jobTitle": "Algorithms Evaluation Engineer - Camera Calibration", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420086/algorithms-evaluation-engineer-camera-calibration?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS CS/CE/EE (or equivalent) in the area of computer science, computer vision, machine learning, robotics, optics,  is helpful."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "You have at least 2 years of experience working, in the area of testing with camera systems and computer vision features.Strong practical knowledge of Python or other scripting language.Strong knowledge of camera module operation.Familiar with camera calibration methods.Familiar with imaging systems & camera technology.Experience with computer vision/video processing preferred.Experience with image evaluation and performance testing preferred.Experience on camera/depth sensing device/optical device testing preferred.Passion for quality, exceptional attention to detail.Excellent written and verbal communication skills, be able to describe and document clearly.bility to work multi-functionally with other teams and groups.BS or MS CS/CE/EE (or equivalent) in the area of computer science, computer vision, machine learning, robotics, optics,  is helpful.", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life. Examples include FaceID, Animoji/Memoji, Scene Understanding, People Understanding and Positional Tracking (VIO/SLAM)."}, "200455668": {"jobID": "200455668", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "Human Factors Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455668/human-factors-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree required (Master’s or doctorate preferred) with a concentration or extensive work in human factors, industrial engineering, cognitive engineering, human-computer interaction, or experimental psychology."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Excellent communication and interpersonal skills, attention to detail, patience, and aesthetic sensibilityPassion for assessing and enhancing usability of productsCurious about human interaction with technology and novel featuresExpertise in creating thorough experimental designs, utilizing scientific methodsExpertise in conducting usability studies and interview techniques related to product use is requiredMixed methods expertise to combine quantitative and qualitative research approachesAbility to customize data collection tools, as well as manipulate, analyze and visualize outputsRelevant proven experience in human factors and/or consumer product usability evaluation is required.Ability to distill research insights into presentations for engineers and designers in a concise wayBachelor’s degree required (Master’s or doctorate preferred) with a concentration or extensive work in human factors, industrial engineering, cognitive engineering, human-computer interaction, or experimental psychology.Expertise of survey development and deploymentExpert in extracting insights from qualitative interview dataExperience with scripting/programming for data manipulation and research applications (e.g., R, Matlab, Python)Expertise with motion capture systems", "jobDescription": "Apple is looking for a Human Factors engineer/UX researcher to apply user-centered design principles to the design and development of Apple products.\n\nThis role requires working at the intersection of many disciplines, on a variety of projects and with multiple partners. Curiosity to delve into new domains, the ability to learn from cross- functional, often highly technical partners and quick thinking are key.\n\nIdeal candidates have 2+ years industry experience focused on software and hardware usability with products, with the ability to anticipate, study and observe user interactions. They are technical, able to utilize and customize quantitative log collection, while also intuitively relating to the user and applying their intuition."}, "200460402": {"jobID": "200460402", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Display EE Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460402/display-ee-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "- Normally requires a PhD degree in Electrical Engineering, or MSEE degree plus minimum 5 years work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "- Open minded and enthusiastic about new technologies and prototyping- Good communication and leadership skills to work with internal and Vendor teams- Have experiences in one or more of the following areas:- Behavior modeling of device, circuit and system- Analog / Mixed-signal design (IC and/or PCB)- Testing and metrology design- Experiences in any of the following area is a plus- High volume manufacturing process and testing- Machine learning- Strong theoretic analysis capability and characterization/modeling experience.- Strong hands-on experimental ability w/ prototyping experience.- Normally requires a PhD degree in Electrical Engineering, or MSEE degree plus minimum 5 years work experience.", "jobDescription": "Apple is looking for an energetic, creative and self driven engineer to work on future Display hardware/ software technologies for Apple products. In this role, you will be the focal point of defining next-gen architecture for Apple products. The position allows you to work on wide range of of topics including prototyping, hardware & silicon definition, software & algorithm development, hands-on characterization, concept demo to executives."}, "200436746": {"jobID": "200436746", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "AIML - Senior Research Engineer, ML Innovation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436746/aiml-senior-research-engineer-ml-innovation?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "PhD in CS, EE, Statistics, or equivalent."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "-  Strong algorithmic and statistical knowledge.-  Strong understanding of the fundamental mathematics and architectures of ML technologies.7 years experience on training, evaluating, and characterizing ML models and systems.5 years of experience in at least one ML domain, NLP, computer vision, reinforcement learning, and its application.Excellent leadership and communication skills are a plus.Strong programming skills are a plus.PhD in CS, EE, Statistics, or equivalent.", "jobDescription": "A premier ML innovation team in Apple, is looking for Senior and Principal Machine Learning Engineers for working on algorithms and systems for ML model understanding and adaptation. The team is addressing critical issues in ML model evaluation including detection and repair of drifts and biases, as well challenges for personalizing models on devices under the strict privacy policies principles at Apple. The opportunity is to develop and ship on device technology (and algorithms) that improves the lives of billions of Apple customers."}, "200440780": {"jobID": "200440780", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "AR/VR Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440780/ar-vr-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "2+ years experience in software development.Track record of building complex applications that are functional, beautiful and delightful.Experience using iOS frameworks like UIKit, AVFoundation, Core Motion, Core ML, CloudKit, SiriKit, StoreKit, etc.Experience with Unix development, daemons, cross-process communication, etcAttention to detail, creativity and passion.Proficiency in a systems programming language, such as C/C++, Objective-C, Swift, etc.BS in Computer Science OR equivalent experienceInterest or proficiency in UI/UX designProficiency in macOS, iOS or Unix developmentExperience developing AR/VR applicationsFamiliarity with ARKit and/or RealityKit", "jobDescription": "The Technology Development Group (TDG) is looking for AR Applications Engineers to help us build the next generation of interactive applications for our platform.  This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV).  As a member of our organization you will assist us in crafting future products that will delight, inspire and empower millions of people."}, "200457225": {"jobID": "200457225", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "AR/VR Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457225/ar-vr-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "2+ years experience in software development.Track record of building complex applications that are functional, beautiful and delightful.Experience using iOS frameworks like UIKit, AVFoundation, Core Motion, Core ML, CloudKit, SiriKit, StoreKit, etc.Experience with Unix development, daemons, cross-process communication, etcAttention to detail, creativity and passion.Proficiency in a systems programming language, such as C/C++, Objective-C, Swift, etc.BS in Computer Science OR equivalent experienceInterest or proficiency in UI/UX designProficiency in macOS, iOS or Unix developmentExperience developing AR/VR applicationsFamiliarity with ARKit and/or RealityKit", "jobDescription": "The Technology Development Group (TDG) is looking for AR Applications Engineers to help us build the next generation of interactive applications for our platform.  This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), machine learning (ML) and computer vision (CV).  As a member of our organization you will assist us in crafting future products that will delight, inspire and empower millions of people."}, "200404417": {"jobID": "200404417", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Program Manager, Worldwide AppleCare Support Programs", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200404417/program-manager-worldwide-applecare-support-programs?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BA or BS degree in Computer Science, Computer Engineering or similar technical field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$230,000,"}, "benefits": null, "requirements": "5 to 7 years experience managing projects or programs, including large, cross-functional, contact center, and support initiatives; with an emphasis in software technologyTechnical project management for a product (can be a physical product, app, or system)Proficient in iterative UI/UX design, including sketches, wireframes, concept, feature development in close collaboration with cross-functional stakeholders; with ability to make time vs. complexity tradeoffsExcellent visual, communication, and presentation skills to help others understand design rationale and product decisions.  Communicates design and engineering requirements to project team/leaders.Collaborates across All phases (design, testing and implementation) of the engineering project using breadth of technical knowledge and experience.  Evaluates technical risks and takes action to minimize the risks assessed.Experience in product development and Engineering, AR, VR, 3D graphics, Unity, Xcode, Swift,  Mobile App development, and related software technologies.  SwiftUI and RealityKit frameworks a plusProficient with iOS / iPadOS app development for multiple genres of apps: productivity, lifestyle, social media, educational, entertainment, and/or games.Exceptional interpersonal skills; thrives in highly collaborative projects, effective at building consensus, handles high stakes decisions with ease with the ability to cut through ambiguityProven oral and written communication skills; ability to become fluent in technical concepts and explain to non-technical partnersAble to travel several times a year to support initiatives.BA or BS degree in Computer Science, Computer Engineering or similar technical field", "jobDescription": "The AppleCare Support Programs Team is seeking an innovative and passionate Technical Program Manager to oversee a growing portfolio of contact center projects.  This position will work directly with Engineering and development teams daily on Software / Hardware projects.  It will set strategy, evaluate ideas, prioritize features, define releases, manage product roadmap, timelines, budget, and provide regular updates to senior leadership on progress.  This team is working with some of Apple's most advanced technologies including augmented reality (AR), virtual reality (VR), and machine learning (ML).  They will influence worldwide support strategy for new initiatives, and build strong relationships with a broad set of teams.  Collaborates across all phases - design, testing and implementation of the engineering project using breadth of technical knowledge and experience.  Other key partnerships include members of all other AppleCare organizations, IS&T, Retail, Legal, Privacy, Product Marketing, Hardware Engineering, Software Engineering, Security, and more.  This a key role in delivering AppleCare’s capital investment portfolio."}, "200466454": {"jobID": "200466454", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Camera Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466454/camera-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "BS degree and relevant internship experienceA real passion for embedded software developmentProficiency in C/C++Proficiency in development of multi-thread software within embedded RTOS systemFamiliarity with camera pipeline and HW componentsBS/MS in Computer Science or Electrical Engineering", "jobDescription": "Apple's Camera Firmware team is looking for an extraordinary firmware engineer to drive state of the art technologies for Apple products. As part of the team you would work on core camera/ISP/Machine learning technologies, including Apple crafted Image signal processing pipeline and HW components, where you will have the chance to define the way that Apple develops, tests and manufactures all of its products. Our close-knit team fosters an environment of product innovation, rapid product iteration and collaboration at both team and multi-functional levels with a liberating amount of autonomy."}, "200451466": {"jobID": "200451466", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "SRAM Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451466/sram-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for applicants with work experience within a SoC design cycle, developing circuits and SRAM/Register File for low power, low voltage and high performance.Knowledge of Cache design/architecture, memory hierarchy is a huge plus.Working knowledge of RTL modeling.Solid understanding of industry-standard design tools.Deep understanding of nanometer device physics, leakage mechanisms, technology interactions with device behavior.Ability to devise experiments and analyze data for silicon debug.Machine Learning algorithms (ML) and scripting is a big plus.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? \n\nBe a part of a world-class silicon design team which delivered an incredible high performance M1 chip for our Mac line of products and chips for our flagship products (iPhone, iPad, Mac, Airpods, HomePod and Watch). \nAs part of our Digital Custom Group (DCG), you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the foundation that allows us to bring customers experiences they’ve never before envisioned!\n\nThis is a highly visible role at the heart of a silicon design effort, making a critical impact delivering products to market quickly. Your designs will strongly influence CPU / GPU / SoC / Neural Engine / Camera designs in Apple's Custom Silicon group."}, "200439606": {"jobID": "200439606", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Touch Validation Hardware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200439606/touch-validation-hardware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "Bachelors degree in Electrical Engineering, Mechanical Engineering, Mechatronics or similar discipline. MS/PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Experience with NX, SolidWorks or similar, and low-volume prototyping (laser cutter, 3D printer, drill press, hand tools)Track record of analog electronics design and validationThorough familiarity with lab measurement techniques and test equipment including spectrum analyzers, including automation with scriptingExperience with PCB schematic design and test board developmentProficient in high-level programming languages for test automation. Experience with Python is a major advantageExcellent written and verbal communication skills and solid teamwork skills are essentialBachelors degree in Electrical Engineering, Mechanical Engineering, Mechatronics or similar discipline. MS/PhD preferred.", "jobDescription": "The Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPads, AppleWatch, and more. You will play a key role in developing hardware performance measurement systems for validation, and ensuring that the Touch Technology team delivers the world’s best multi-touch user experience."}, "200384223": {"jobID": "200384223", "origin_search": null, "posted": "Oct 17, 2022", "jobTitle": "Sr. iOS Engineer - Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200384223/sr-ios-engineer-ad-platforms?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "New York City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "6-8 years of industry experience.Expertise of Swift / Objective-C, iOS / macOS fundamentals and frameworks.Are inspired to design, build, instrument, measure and refine.Have a passion to write and help others produce efficient code.Confident with GCD and asynchronous programming.Excellent written and verbal communication skills.Believe mentoring is something everyone should be doing all of the time.Bachelors Degree or equivalent experience.", "jobDescription": "At Apple, we work every single day to build products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and forward-thinking content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in Apple News and Search Ads in App Store. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy."}, "200461489": {"jobID": "200461489", "origin_search": null, "posted": "Feb 4, 2023", "jobTitle": "AIML - ML Engineer (Speech Recognition), Siri and Information Intelligence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461489/aiml-ml-engineer-speech-recognition-siri-and-information-intelligence?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Cambridge", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS, MS, in Computer Science, Computer Engineering, or equivalent degree with 3+ years experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience with machine learning model optimization for on-device applicationsStrong coding skills in Python, C/C++Comfortable with frequent, incremental code testing and deploymentHard working and detail oriented individual who will have a profound impact in speech recognition quality on various hardware platformsDemonstrated strength in handling technical uncertainty and collaborating with partner teams to solve complex machine learning modeling problemsBS, MS, in Computer Science, Computer Engineering, or equivalent degree with 3+ years experience", "jobDescription": "Want to join the team building an intelligent assistant that helps millions of people get things done? You will be part of a cross-functional team consisting of software engineers as well as machine learning scientists and will have a large impact on the Siri product, bringing speech recognition to the next level. You should be creative, hard working, and ready to communicate and collaborate with multiple teams."}, "200460836": {"jobID": "200460836", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "Data Scientist, Apple Services Digital Marketing", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460836/data-scientist-apple-services-digital-marketing?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree or equivalent preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$207,000,"}, "benefits": null, "requirements": "Attains clear understanding of statisticsCapability to code in SQL and Python or R to work with large data setsKnowledge of machine learning techniques (clustering, decision trees, artificial neural networks, regression, classification, Keras, etc)Experience building custom data models and algorithms to apply to data setsUnderstanding of digital marketing data - Social, SEO, Paid, etcExperience creating data visualizations with various programming languages (JavaScript and D3 preferred)Understanding of NLP techniques for text representation and semantic extractionDeep knowledge of text representation techniques (such as bag of words, sentiment analysis, n-grams etc.)Ability to work and speak to both creative and technical teamsAbility to solve problems with an analytical mind set5-7 years of experience manipulating data sets and using statistical models plus NLP to extract insights and visualize them for stakeholdersBachelor’s degree or equivalent preferred.", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it! \n\nApple is looking for a data scientist to work on the Apple Services Digital Marketing team to help us understand public consumer feedback at scale, excavate insights to optimize our marketing and products, and monitor external brand relevancy. This person must have a deep understanding of statistics, machine learning techniques, digital marketing data and NLP to identify actionable insights and have the ability to successfully evangelize, educate, and enable within a very large organization."}, "200451468": {"jobID": "200451468", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "Custom Circuit Pathfinding Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451468/custom-circuit-pathfinding-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Experience in one or multiple of the following areas is highly desirable: Machine learning accelerators, non-volatile memory circuits, memory subsystems, 3D integration / new packaging technologies, advanced device technologies, design /technology co-optimization (DTCO).Deep understanding of deep submicron device physics, leakage mechanisms, technology interactions with device behavior for logic, SRAM and NVM memories.Ability to conduct experiments during silicon debug, gathering and analyzing data; and use scripting to support efficient handling of ATE data.Familiar with mixed signal verification and behavioral models for mixed signal blocks.Familiar with digital flow from RTL to GDS.Proficiency in scripting languages (Python /Perl or others) and CAD automation tools.Knowledge of industry standard circuit and design tools.Excellent communication and presentation skills. Ability to propose and get buy-in new initiatives and communicate effectively with internal / external teams.BS and a minimum of 3 years of relevant industry experienceApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Do you have a passion for crafting entirely new solutions? As part of our Digital group, you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Your efforts will be groundbreaking, often literally. Join us, and you’ll help design the tools that allow us to bring customers experiences they’ve never-before envisioned! You will be part of an exciting silicon design group that is responsible for designing pioneering ASICs. We have an extraordinary opportunity for Circuits Engineers to design advanced custom digital megacells (SRAM memories, on-chip sensors, ML accelerators data path) used in a high performance / low power SOC."}, "200451744": {"jobID": "200451744", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "Analog and Mixed Signal IP Data Automation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451744/analog-and-mixed-signal-ip-data-automation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree\n3 years of experience\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in data science and machine learning for data exploration and analysis.Proficiency in Python and its latest features.Knowledge in automating silicon data collection using state-of-the-art instruments; high-speed oscilloscopes, logic analyzer, spectrum analyzers, and others.Knowledge in using robotic arms or pick-and-place machines increase data collection efficiency.Experience in creating custom UI dashboards using Kube, Docker, or on bare metal OS.Knowledge in different remote transports using PyVISA over TCP/IP and USB.Experience in articulating and translating business needs to technical requirements.Capable of independently driving projects of varying sizes and scopes — some will take weeks and some months — and you will need to know when to dive deep.Proven experience building automation solutions to solve business problemsExperience in problem abstraction, automation, and creating APIs for relevant tasks.Ability to effectively collaborate in a dynamic & diverse environment.Bachelors Degree\n3 years of experience\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "In this hybrid (hardware/software) role, you will develop state-of-the-art automation flows to store, analyze, and visualize data collected from from analog-and-mixed signal IPs and systems.\n\nAt Apple, we work every single day to craft products that enrich peoples’ lives. Do you love working on challenges that no one has solved yet? Do you like automating tasks that span across multiple continents? We have an opportunity for a forward-thinking and especially hardworking Automation Engineer. As a member of our multifaceted group, you will have the rare and great opportunity to work on upcoming products that will surprise and delight millions of Apple’s customers every day!"}, "200456397": {"jobID": "200456397", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "ASIC Design Engineer - Neural Engine DMA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456397/asic-design-engineer-neural-engine-dma?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree + 0 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Knowledge of front-end ASIC RTL digital logic design using Verilog or System Verilog.Strong problems-solving skills using finite state machines, pipelining, parallelism, and similar computer-architecture fundamentals.Knowledge of front-end implementation tasks such as synthesis, timing, area/power analysis, linting, and logic equivalence checks.Good collaboration skills with excellent written and verbal communication skills.Knowledge of core DMA concepts such as: flow control, arbitration, address translation, caching, on-chip interconnects, and performance analysis.Prefer familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB), and relevant scripting languages (Python, Perl, TCL).Bachelor's degree + 0 Years of Experience", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly transparent role, you will be at the center of the Pixel IP design effort to accelerate machine learning applications. You will collaborate with all teams, making a critical impact getting functional products to millions of customers quickly."}, "200436128": {"jobID": "200436128", "origin_search": null, "posted": "Oct 31, 2022", "jobTitle": "HID-Embedded Signal Processing Algorithm Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200436128/hid-embedded-signal-processing-algorithm-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in EE/Math/Physics"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "2+ years of experience in developing, optimizing, and implementing complex algorithms on resource constrained platformsProven understanding of (and willing to learn) topics like signal processing, linear algebra, statistics, machine learning, adaptive filters etc.Background in numerical methods and techniques, especially as relates to stability in real-time DSP algorithmsStrong software programming skills in C/C++, PythonExperience with sensing hardwareBS/MS in EE/Math/Physics", "jobDescription": "Join the engineering team crafting next-generation touch interfaces for iPad, Pencil, iPhone, Watch, and more. We are an eclectic group with backgrounds in signal processing, computer science, estimation algorithms, human factors, and more, dedicated to inventing new ways of interacting with Apple products and shipping amazing products every year.\n\nWe are looking for a signal processing or imaging engineer with strong C/C++ implementation skills. Your good communication skills and ability to drive discussions with multi-functional teams would come in very handy.\n\nTo summarize, you will be working on innovative projects and will be responsible for productizing algorithmic solutions, and you will be part of the team shipping products to millions of users every year."}, "200408605": {"jobID": "200408605", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "AIML - Senior Data Engineer, AIML Data", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200408605/aiml-senior-data-engineer-aiml-data?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S., M.S. in Computer Science, Computer Engineering, or equivalent experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "5+ years of data engineering experience3+ years of coding in Python, Java, Scala, or other mainstream programming languages3+ years working with technical partners from multi-functional groups to collect business requirements, build consensus, and handle expectations3+ years building and monitoring robust data pipelines in distributed computing environmentsExperience with designing schema for instrumentation and logging systems, OR experience supporting and partnering with data science is desiredB.S., M.S. in Computer Science, Computer Engineering, or equivalent experience.", "jobDescription": "Data Engineers think differently. We value engineering rigor and partnership, unit testing and pragmatism, best practices and empathy, all in equal parts. Data engineers understand that driving meaningful impact is more than enabling our own work; true impact comes from helping others to unlock their full potential. We measure our success in the accomplishment and enablement of others.\n \nThe vision of the AIML Data organization is to improve products by using data as the voice of our customers.  Data Engineers assure that voice is heard clearly by those that need to hear it most.  We build optimized and robust engineering systems, curated data products, and collaborate with both data scientists and engineering partners to remove noise, ensure quality, and streamline discovery."}, "200448264": {"jobID": "200448264", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Media-IP SoC Performance Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448264/media-ip-soc-performance-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 20+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$166,500", "max": "$250,000,"}, "benefits": null, "requirements": "BS and 20+ years of relevant industry experienceStrong understanding of SoC, fabric, and memory system architecturesStrong software development and organizational skills especially with modular object-oriented SW architectures in C++Looking for people who are fast learners with strong problem solving and analytical skillsExperience with performance model development & analysisExcellent written and verbal communication skills for cross-functional collaboration and presentations5+ years of experience in performance modeling and architecturePREFERRED QUALIFICATIONSGood understanding of data analytics, statistics, and applied ML (machine learning) for analyzing large data setsExpertise in C++ & latest STL libraries, knowledge of Python, Lua, and shell scripting languagesGood understanding of QoS, arbitration, and queuing theoryNo multi-media expertise requiredBS and 20+ years of relevant industry experience", "jobDescription": "Do you love crafting elegant solutions to highly complex challenges? Are you a big-picture forward-thinking who understands how each element affects all the others? At Apple, our Architecture group is responsible for connecting our hardware and software into one unified system! Join this team, and you’ll collaborate with engineers across Apple to design how all of our technologies work in unison! \n\nWe are looking for an experienced Media-IP SoC Performance Architect to join our small dynamic team. We own the performance models of several of the complex multi-media IPs in Apple’s SoCs. These IPs are central to the customer experience in almost all of Apple’s products from Apple Watch, iPhone, iPad, MacBook, and next generation product lines. In this highly visible role, you will collaborate closely with cross-functional teams to develop, verify, and use performance models for data driven architectural exploration and validation."}, "200449018": {"jobID": "200449018", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Shader Subsystem Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449018/graphics-shader-subsystem-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Prior design verification experience on CPU or GPU coresSystem Verilog/UVM experienceStrong OOP coding skills (preferred languages are C/C++, Python, Perl, RubyStrong CPU or GPU architectureGraphics pipeline, OGL/Metal/OCL programming experience is a bonusMachine learning experience is a bonusBS degree + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you will be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices. \n\nAs part of the GPU shader core verification team, you will be involved in end-to-end functional and architectural verification of Apples next generation GPUs. If you are a verification engineer that enjoys working on core GPU/CPU architecture, graphics rendering, and building complex test benches from scratch, this will be an exciting role for you. We use cutting edge verification methodologies, and emphasize innovation to enable Apple's silicon leadership."}, "200461955": {"jobID": "200461955", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "System Administrator", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461955/system-administrator?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Associates or equivalent experience, 5+ years in system administration or equivalent roles."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$97,700", "max": "$206,900,"}, "benefits": null, "requirements": "3+ years system administration MacOS, Linux and Windows experience for workstations, compute farms, and data centersScripting experience: unix shell scripting, zsh, pythonHomebrew or other package managerExperience managing TCP/IP networksExperiences providing customer support to non-technical and technical end-users across more than one physical siteGood problem solving skills in complex and changing environmentsPassion to learn new technology, hardware and softwarePhysical demands associated with this position include occasionally lifting & carrying machines into a server rack. (up to 40 lbs)Associates or equivalent experience, 5+ years in system administration or equivalent roles.Experience managing Quantum SAN in media productionExperience with virtualization, docker setup and administrationAdministrating MacOS systems with Jamf or MDMExperience with package managers and building package installers for Mac OS", "jobDescription": "The Mac system performance and architecture (SPA) team is responsible for all aspects of Mac performance spanning hardware (CPU, GPU, DRAM, storage), software (OS, drivers, applications), and other system characteristics (thermals, power, acoustics). This spans performance modeling, guiding architecture tradeoffs, performance verification, performance debug, and workload characterization. We are looking for a system administrator to handle a compute farm and a collection of end-user systems as a System Administrator for SPA. \n\nIf this sounds like you, please consider applying!"}, "200463854": {"jobID": "200463854", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Touch ASIC Digital Architect (EE)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463854/touch-asic-digital-architect-ee?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in Electrical Engineering or industry experience equivalent, with 5+ years of digital design and architecture experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience leading chip architecture and/or digital design is desirable, preferably in touch or communications.Hands-on experience in design, development and launch of high volume IC designs in consumer products; direct experience with touch technology and/or flat panel display technology is beneficial.Strong electrical engineering background embedded system design including ASIC microarchitecture, computer architecture, SoC architecture, and custom or standard DSP or hardware accelerator microarchitectureExperience in FPGA emulation system design preferred, including leading pre-silicon system validation, prototype bring-up, debug, validation, characterization, and module integration supportExcellent written and verbal communication skills and solid teamwork and leadership skills.Proficiency in MATLAB, Verilog, or similar simulation, design and modeling tools.Experience with DSP, estimation algorithms, and/or machine learning HW is a plus.M.S. or Ph.D. in Electrical Engineering or industry experience equivalent, with 5+ years of digital design and architecture experience.", "jobDescription": "Design, develop, and launch next-generation Touch Technologies in Apple products.\n\nThe Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the Touch Technology team is to enable the world’s best multi-touch user-experience. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. \n\nThe ASIC Digital architect is a key architect responsible for analyzing the application and coming up with cost and power optimized digital for the touch and other sensing ASICs. These designs may include one or multiple processor and/or DSP cores and microarchitecture of custom control engines."}, "200460172": {"jobID": "200460172", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "AIML - Senior Security and Privacy Architect, ML Platform and Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460172/aiml-senior-security-and-privacy-architect-ml-platform-and-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "10+ years of software development experience5+ years of experience in data security domain. Proficient in best practices and enforcement for data security and data governanceExcellent verbal and written communication skills, able to collaborate cross-functionally with program managers and engineering partnersExperience in influencing and driving key product innovations and opportunities across diverse collaboratorsPassionate about operational excellence through proper automation and engineering processesStrong distributed systems and engineering backgroundSuperb problem-solving skills, and able to thrive in a fast-paced and dynamic environment.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products. Apple benefits programs vary by country and are subject to eligibility requirements. Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Data Platform team within the AIML organization powers analytics, experimentation, and ML feature engineering to power Siri, Search, and other ML features we all love in our Apple devices. The mission of the Data Platform org is to provide our engineers and data scientists an innovative, reliable, secured, and easy-to-use infrastructure for ingesting, storing, processing, and interacting with data and ultimately help the teams that build data-intensive applications be successful. You will work with many cross-functional teams and lead the planning, execution, and success of technical projects with the ultimate purpose of improving Siri and Search experience for Apple customers.\n\nWe are looking for a senior data security architect who is passionate in enhancing data security by building frameworks and architectures using cutting edge technology at every level of the technical stack. You will guide product and infrastructure teams to ensure user data security is a core component in every feature we ship.\n\nAre you passionate about building security-first data platform and solving data problems at scale? Come join us and be part of the Data Platform journey."}, "200442142": {"jobID": "200442142", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "AIML - Senior Data Security Architect (Data Platform), ML Platform & Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200442142/aiml-senior-data-security-architect-data-platform-ml-platform-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "10+ years of software development experience5+ years of experience in data security domain. Proficient in best practices and enforcement for data security and data governanceExcellent verbal and written communication skills, able to collaborate cross-functionally with program managers and engineering partnersExperience in influencing and driving key product innovations and opportunities across diverse collaboratorsPassionate about operational excellence through proper automation and engineering processesStrong distributed systems and engineering backgroundSuperb problem-solving skills, and able to thrive in a fast-paced and dynamic environment.", "jobDescription": "Data Platform team within the AIML organization powers analytics, experimentation, and ML feature engineering to power Siri, Search, and other ML features we all love in our Apple devices. The mission of the Data Platform org is to provide our engineers and data scientists an innovative, reliable, secured, and easy-to-use infrastructure for ingesting, storing, processing, and interacting with data and ultimately help the teams that build data-intensive applications be successful. You will work with many cross-functional teams and lead the planning, execution, and success of technical projects with the ultimate purpose of improving Siri and Search experience for Apple customers. \n\nWe are looking for a senior data security architect who is passionate in enhancing data security by building frameworks and architectures using cutting edge technology at every level of the technical stack.  You will guide product and infrastructure teams to ensure user data security is a core component in every feature we ship.\n\nAre you passionate about building security-first data platform and solving data problems at scale?  Come join us and be part of the Data Platform journey."}, "200451963": {"jobID": "200451963", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Display Technologist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451963/display-technologist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "-  PhD or MS degree in Physics, Optics, Material Science or Electrical Engineering, with at least 3 years of relevant experience.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent qualifications in 3 or more areas below is required:-  Strong knowledge in optics and physics.-  Hands-on simulation of optoelectronic devices.-  Capability of using a generic programming language (such as Matlab or Python) to solve practical problems.-  Capability to analyze large quantity data and draw meaningful/useful conclusions.-  Experience with machine-learning classification or optimization algorithm design and implementation.-  Outstanding communication and presentation skills, with the ability to work with stakeholders across multiple teams.-  PhD or MS degree in Physics, Optics, Material Science or Electrical Engineering, with at least 3 years of relevant experience.\n\nApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities.", "jobDescription": "We are looking for a creative Display Technologist who can lead innovations to Apple's outstanding display technology features. As a Technologist in the Display Investigation team, you will have a wide range of responsibilities in exploring, investigating, and implementing new display technologies for use in Apple products! Candidates with strong problem-solving skills combined with deep curiosity about displays will be preferred."}, "200467321": {"jobID": "200467321", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "Sr. AR/VR Applications Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467321/sr-ar-vr-applications-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Extensive track record of building and shipping complex and delightful applications or user-facing systems on consumer platforms (mobile/web/gaming/etc.).Extensive experience in modern software engineering practices (Object-oriented programming, functional programming, declarative user interfaces, test driven-development, etc).Strong Computer Science fundamentals.Detail-oriented approach to planning, execution, and maintenance.Excellent communication skills; ability to collaborate successfully with peers from diverse experiences and backgrounds.Ability to drive results in a fast-paced and agile organization.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceOptional: Experience with Apple's development frameworks and technologies (Swift, ObjC, SwiftUI, UIKit, etc). Optional: Familiarity with rendering APIs (RealityKit, Metal, etc). Optional: Familiarity with ARKit. Optional: Familiarity with game engine design and 3D rendering. Optional: Strong 3D math/linear algebra fundamentals. Optional: Experience in prototyping of user-facing features and working with designers. Optional: Proven track record of designing and building pleasant User Experiences. Optional: Experience in mentoring and/or providing technical leadership to groups of engineers.", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Senior Software Engineer to help us build cutting-edge applications for our next-generation interactive computing platforms. Imagine yourself driving the development of amazing applications built on top of Apple’s most advanced technologies, while developing your expertise in Augmented and Virtual Reality (AR/VR).   As a core senior member of our team, your role is to own the architecture and execution of complex and novel features; while working alongside your peers. You will also collaborate closely with organizations across Apple (Human Interface, Frameworks, etc.) to design and implement apps that will delight, inspire, and empower millions of users."}, "200464761": {"jobID": "200464761", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "Product Management Leader, Ad Platforms", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464761/product-management-leader-ad-platforms?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science, Statistics, Operations Research, Economics, or related areas"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$183,500", "max": "$334,500,"}, "benefits": null, "requirements": "-  10+ years of product management experience building ML software products.-  5+ years of building advertising technology including platforms (ad exchange, or supply side platform), ad networks (mobile), and search advertising.-  Demonstrated ability handling an impactful Product Management team.-  Experience partnering with external teams and cross functional partners to deliver on shared outcomes.-  Customer first point of view with a track record of building ML solutions that optimize for end user and advertiser experience goals.-  Ability to demonstrate data driven approaches to justify product opportunities and measure success.-  Solid understanding of modern machine learning and its components with track record of collaborating with ML engineers and data scientists on technical design discussions and proposing simple, creative solutions to sophisticated problems.-  Outstanding communication and presentation abilities, with an ability to influence and collaboratively build consensus.-  Self-motivated and proactive, with demonstrated creative and critical thinking capabilities.BS or MS in Computer Science, Statistics, Operations Research, Economics, or related areas", "jobDescription": "At Apple, we work every day to create products that enrich people's lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Our technology and services power advertising in Apple News, Stocks, and in the App Store. Our platforms are highly performant, deployed at scale, and set new standards for enabling effective advertising while protecting user privacy.\n\nWe are seeking a world-class Product Management Leader to lead a team of product managers responsible for the next generation of marketplace algorithms and optimization features. Are you passionate about crafting products at the intersection of machine learning and user experience? Do you want to enable users to discover content that is exciting and relevant to them while driving value for advertisers? Are you interested in mentoring others to help them grow in their careers and become next generation leaders at Apple? If so, we are searching for you!\n\nThe ideal candidate would have built products related to online advertising, search, recommendation systems, and human ratings with experience in ML/data driven product management. In addition, the ideal candidate would also have experience directly managing and developing people. We are looking for a strong leader who can define a product vision, strategy and roadmap, then successfully lead teams from development to launch and continued optimization and operation of the product."}, "200448260": {"jobID": "200448260", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Media-IP SoC Performance Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448260/media-ip-soc-performance-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 20+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "BS and 20+ years of relevant industry experienceStrong understanding of SoC, fabric, and memory system architecturesStrong software development and organizational skills especially with modular object-oriented SW architectures in C++Looking for people who are fast learners with strong problem solving and analytical skillsExperience with performance model development & analysisExcellent written and verbal communication skills for cross-functional collaboration and presentations5+ years of experience in performance modeling and architecturePREFERRED QUALIFICATIONSGood understanding of data analytics, statistics, and applied ML (machine learning) for analyzing large data setsExpertise in C++ & latest STL libraries, knowledge of Python, Lua, and shell scripting languagesGood understanding of QoS, arbitration, and queuing theoryNo multi-media expertise requiredBS and 20+ years of relevant industry experience", "jobDescription": "Do you love crafting elegant solutions to highly complex challenges? Are you a big-picture forward-thinking who understands how each element affects all the others? At Apple, our Architecture group is responsible for connecting our hardware and software into one unified system! Join this team, and you’ll collaborate with engineers across Apple to design how all of our technologies work in unison! \n\nWe are looking for an experienced Media-IP SoC Performance Architect to join our small dynamic team. We own the performance models of several of the complex multi-media IPs in Apple’s SoCs. These IPs are central to the customer experience in almost all of Apple’s products from Apple Watch, iPhone, iPad, MacBook, and next generation product lines. In this highly visible role, you will collaborate closely with cross-functional teams to develop, verify, and use performance models for data driven architectural exploration and validation."}, "200464205": {"jobID": "200464205", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Product RF Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464205/product-rf-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum Requirement:\n\nBSEE OR EQUIVALENT EDUCATION \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuits"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Knowledge of EM or RF hardware or antenna designKnowledge of integration of wireless technologies such as cellular, GPS, Wifi, and NFC into products.Knowledge of RF schematic and PCB layout practices and guidelines.Excellent interpersonal skillsMinimum Requirement:\n\nBSEE OR EQUIVALENT EDUCATION \n\nCoursework or experience in antenna/RF design, wireless communications, EM, or circuitsAs a Product RF Design engineer, you would have the opportunity to work and expand on multiple aspects of RF technology. While these are not required from you, they will help you in pushing boundaries of innovation at Apple. A non-comprehensive list may include:- Knowledge of electromagnetic simulation tools- Hands-on experience with RF lab instrumentation- Ability to debug Desense issues and characterize noise sources- Experience with production environment and statistical analysis", "jobDescription": "At Apple, you will have a once-in-a-lifetime opportunity to deliver outstanding performance for wireless products. As a member of the Product RF Design team, you will be at the forefront of wireless technology as we push the boundaries of achievable performance in wireless for innovative products. You will become part of a hands-on product development team that shapes and influences current and future generations of Apple products.\n\nWe’re looking for dedicated and motivated engineers with good fundamentals in one or more areas of RF/wireless and electromagnetic theory, antenna design, system integration, & wireless communications."}, "200338509": {"jobID": "200338509", "origin_search": null, "posted": "Sep 22, 2022", "jobTitle": "Senior 3D Software Engineer (AR/VR Applications)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200338509/senior-3d-software-engineer-ar-vr-applications?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "Extensive track record of building and shipping complex interactive 3D applications and experiences on consumer platforms (mobile/web/game consoles/VR, etc).Deep knowledge of interactive 3D application fundamentals and technologies (rendering, interactions, game engine internals, etc).Extensive experience in modern software engineering practices (Object-oriented programming, functional programming, declarative user interfaces, test driven-development, etc).Strong Computer Science fundamentals.Strong 3D math skills.Detail-oriented approach to planning, execution, and maintenance.Excellent communication skills; ability to collaborate successfully with peers from diverse experiences and backgrounds.Ability to drive results in a fast-paced and agile organization.BS / MS / PhD in Computer Science OR equivalent degree OR equivalent experienceOptional: Expertise in 3D rendering and shader development on consumer platforms.Optional: Experience in prototyping of gaming concepts or user experiences in VR or on consumer platforms.Optional: Familiarity with Apple's development frameworks and technologies (Swift, ObjC, SwiftUI, UIKit, etc).Optional: Familiarity with ARKit.Optional: Experience in mentoring and/or providing technical leadership to groups of engineers.", "jobDescription": "Apple’s Technology Development Group (TDG) is looking for a Senior 3D Software Engineer to help us build cutting-edge 3D applications for our next-generation interactive computing platforms. Imagine yourself driving the development of amazing applications built on top of Apple’s most advanced technologies, while developing your expertise in Augmented and Virtual Reality (AR/VR). \n\nAs a core senior member of our team, your will leverage your expertise in building interactive 3D applications to innovate, architect, and execute complex and novel features; while working alongside your peers. You will also collaborate closely with organizations across Apple (Human Interface, Frameworks, etc.) to design and implement apps that will delight, inspire, and empower millions of users!"}, "200447471": {"jobID": "200447471", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447471/software-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S., or M.S., and/or 3+ years of industry experience in software development field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "To succeed within this role, you should have shown experience in several of the following areas:-  3+ years of hands-on software development experience-  Experience designing, developing and maintaining software services or solutions-  Strong Object Oriented Programming skills and proficiency in Python or Java-  Experience with microservice architecture & developing APIs / RESTful services-  Experience with building solutions in the cloud (AWS, GCP, Kubernetes, etc.)-  Experience with relational and any NoSQL databases (MongoDB, Cassandra, Redis, etc.)-  Familiarity with full stack development, and expertise in Web development frameworks like Django or others-  Bonus for experience with distributed systems (Spark, Presto, etc.)-  Able to quickly learn new and existing technologies-  Bonus for UI/UX development experience-  Excellent communication and collaboration skills-  Excellent problem solving and analytical thinking skillsB.S., or M.S., and/or 3+ years of industry experience in software development field.", "jobDescription": "Apple's Technology Development Group (TDG) data team is responsible for managing data and ML infrastructure that empowers cutting edge computer vision ML at Apple. In this position, you will have the opportunity to work on challenging infrastructure problems, in the design and development of data/ML platform and pipelines at scale. We are looking for a driven Full Stack Engineer who enjoys the design and development of such software solutions. As a member of a fast-paced team, you will be collaborating with multiple teams, including ML scientists, to ensure the development and delivery of effective solutions.\n\nAs a Full Stack Engineer your job responsibilities will include:\n\n-  Design, develop and maintain software services required for efficient data management\n\n-  Participate in design reviews with peers and collaborators to ensure correct solution is picked\n\n-  Review code with peers to provide and get feedback on implemented solution\n\n-  Triage issues and provide debugging and tracking support to resolve them\n\n-  Contribute to API documentation where necessary\n\n-  Coordinate and work closely with team members and other engineering teams\n\n-  Implement ETL pipelines when necessary"}, "200459861": {"jobID": "200459861", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Silicon Validation Software Engineer: SoC Performance and QoS Validation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459861/silicon-validation-software-engineer-soc-performance-and-qos-validation?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelor's degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience with performance benchmarking and high-performance architecturesKnowledge of computer architecture, system architecture, SoC architecture, and memory systemsUnderstanding of video and image processing systemsExperience with pipelining, bus architectures, and protocols is preferredExperience with embedded systems programming (e.g. bare-metal, RTOS, kernel, driver programming)Understanding of common data structures, algorithms, Operating Systems concepts, and multi-threaded programmingKnowledge in C programmingSkilled at scripting – Python, bashExperience with some data analysis and data visualization tools is preferredMinimum requirement of a bachelor's degree.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, inquisitive people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.    \n\nAre you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly, and we are hiring all levels from junior to senior roles. As part of the silicon validation team, you will plan, write, integrate, and drive performance testing of Apple’s custom designed SoCs."}, "200256576": {"jobID": "200256576", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "AIML- Front-End Engineer Opportunities, ML Platform & Infrastructure", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200256576/aiml-front-end-engineer-opportunities-ml-platform-infrastructure?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Our applications are complex and strong programming skills and computer science fundamentals are essential. Whether you have a traditional CS degree or self-taught or learned some other way, we’d love to talk with you."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "3+ years of experience in a professional software development positionStrong problem solving skills and ability to write performant and clean code with high quality.Proficient in JavaScript, Typescript, HTML, CSSExperience crafting complex applications using React or a comparable JS framework like Angular, Vue, Aurelia, EmberExperience in front-end designPassion for building a rich and innovative user experienceStrong problem solving skills and ability to write performant and clean code that’s high quality.Quick learner who can pickup new technology stacks, programming languages and be able to deliver features.Our applications are complex and strong programming skills and computer science fundamentals are essential. Whether you have a traditional CS degree or self-taught or learned some other way, we’d love to talk with you.", "jobDescription": "Imagine what you could do here. At Apple, great ideas quickly become extraordinary user experiences. Would you be excited to take on big challenges that could create a positive impact for billions of people? Are you passionate about building elegant product experiences with a world-class engineering and design team?\n\nDo you want to make Spotlight search, Siri and Apple products smarter for our users?  Our teams are building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how billions of people use their computers and mobile devices to search and find what they are looking for. As part of this group, you will work have an opportunity to imagine and build products that delight our customers every single day."}, "200462121": {"jobID": "200462121", "origin_search": null, "posted": "Feb 8, 2023", "jobTitle": "ISE, Special Projects - Sr. Software Incubation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462121/ise-special-projects-sr-software-incubation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors in Computer Science, Computer/Electrical Engineering, or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "5+ years of professional software engineering experienceStrong object-oriented design and programming skillsDeep expertise with Apple SDKs including frameworks such as: UIKit, CoreData, CoreAnimation, CoreGraphics, or AVFoundationProficiency in Objective-C, Swift, C or C++Ability to take designs, sketches, layouts, and workflows and implement them in softwareStrong written and verbal communication skillsAbility to work independently and collaborate across a multi-disciplinary team of engineers, researchers, and designersBachelors in Computer Science, Computer/Electrical Engineering, or equivalent work experience.", "jobDescription": "Are you passionate about enabling compelling new experiences through software? Do you enjoy rapidly exploring and iterating on new, sometimes astonishing, ideas? The Intelligent System Experience Special Projects team explores and prototypes new, novel, and paradigm shifting ideas in system experience, computer vision, machine learning and natural language processing with emphasis on motivating future system intelligence technologies. \n\nWe are a new and growing team. This is an exciting time to join and have impact across our entire portfolio. We are especially looking for people who love to collaborate across subject areas and teams, and are motivated and inspired by the potential to help shape the future of system experiences across the entire Apple ecosystem."}, "200319964": {"jobID": "200319964", "origin_search": null, "posted": "Feb 10, 2023", "jobTitle": "Front End Web Architect - Claris", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200319964/front-end-web-architect-claris?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience architecting large-scale applicationsFamiliarity with modern web front-end technologies React preferred (e.g. Angular, Vue.js)Proven understanding of HTML and CSSStrong object-oriented design techniques and reusable component designStrong analysis, problem solving, and troubleshooting skillsStrong verbal and written communications skillsBS in Computer Science or equivalent-  You will join a hands-on development team that fosters creativity and generates novel solutions to deliver engineering excellence.-  We partner with a variety of cross and multi-functional team members from a diverse array of groups across the company-  Are deeply accountable for your work? Your passion for product ownership and track record of product development will prove critical to your success on our team.-  You have excellent judgment and integrity with the ability to make timely and sound decisions-  Ability to stay focused and prioritize your workload while achieving exceptional quality-  You are upbeat, adaptable, and results oriented with a positive demeanor-  You bring passion and dedication to your job and are committed to our vision and supporting the developer community", "jobDescription": "Are you passionate about applying your deep understanding of the cloud in creative ways? Are you the type to “make stuff happen”? We at Claris International Inc., a wholly owned subsidiary of Apple Inc., the top, standalone desktop database company, are searching for a software engineer. \n\nWe have an established product line and expansive customer base, and we are advancing existing technologies and developing new and exciting products. In this position you will develop web technologies and the full-stack."}, "200366883": {"jobID": "200366883", "origin_search": null, "posted": "Aug 9, 2022", "jobTitle": "Quality Engineering Manager - Front End SW Applications", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200366883/quality-engineering-manager-front-end-sw-applications?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree or MS in Computer Science/Software Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$157,000", "max": "$276,000,"}, "benefits": null, "requirements": "3+ years experience as a Software Quality Manager preferably for Mobile/MacOS applications5+ years of strong hands-on experience developing test automation frameworks and driving test automation efforts for SW apps (Preferably in Python)3+ years of strong hands-on test automation experience in PythonStrong leadership skills to work with cross functional partners (Algs, FW, SW, Ops, EPM)Strong test experience with UI/UX testing and front end SW applicationsStrong presentation skillsTeam Builder: Proven track record demonstrating the ability to attract, hire, motivate and develop the best engineersTechnically Agile: Ready to deep dive into technical areas when needed but also discuss these topics to a non-technical audiencePriority Driven: At ease working in a continually changing, dynamic environment and driving top issues to resolutionExec Presence: Ability to summarize key points and tie them back to the customer experienceCustomer Focused: Passionate about user-focused design, high-quality applications, and what we can do to improve itHighly organized, creative, motivated, and passionate about achieving resultsBachelor's degree or MS in Computer Science/Software Engineering", "jobDescription": "If you’re passionate about using data to shape exciting new technologies, come join us in the Human Input Devices team. Quality is a critical part of everything we do, as a Quality Manager in HID you will lead a team of passionate engineers, working cross-functionally in a fast-paced environment, facing exciting new challenges daily. You possess a high-energy personality with excellent communication and interpersonal skills, attention to detail, patience, and a tenacity for high quality data. Come join us in crafting solutions the world hasn’t seen yet."}, "200262888": {"jobID": "200262888", "origin_search": null, "posted": "Jan 4, 2023", "jobTitle": "Touch ASIC Digital Architect (EE)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200262888/touch-asic-digital-architect-ee?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in Electrical Engineering or industry experience equivalent, with 5+ years of digital design and architecture experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience leading chip architecture and/or digital design is desirable, preferably in touch or communications.Hands-on experience in design, development and launch of high volume IC designs in consumer products; direct experience with touch technology and/or flat panel display technology is beneficial.Strong electrical engineering background embedded system design including ASIC microarchitecture, computer architecture, SoC architecture, and custom or standard DSP or hardware accelerator microarchitectureExperience in FPGA emulation system design preferred, including leading pre-silicon system validation, prototype bring-up, debug, validation, characterization, and module integration supportExcellent written and verbal communication skills and solid teamwork and leadership skills.Proficiency in MATLAB, Verilog, or similar simulation, design and modeling tools.Experience with DSP, estimation algorithms, and/or machine learning HW is a plus.M.S. or Ph.D. in Electrical Engineering or industry experience equivalent, with 5+ years of digital design and architecture experience.", "jobDescription": "Design, develop, and launch next-generation Touch Technologies in Apple products.\n\nThe Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the Touch Technology team is to enable the world’s best multi-touch user-experience. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. \n\nThe ASIC Digital architect is a key architect responsible for analyzing the application and coming up with cost and power optimized digital for the touch and other sensing ASICs. These designs may include one or multiple processor and/or DSP cores and microarchitecture of custom control engines."}, "200457102": {"jobID": "200457102", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "ASIC Design Engineer - Pixel IP DMA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457102/asic-design-engineer-pixel-ip-dma?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors Degree + 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in multimedia IP/SoC front-end ASIC RTL designTight-knit collaboration skills with excellent written and verbal communication skillsExperience working multi-functionally with architecture, design, and verification teams to specify, design, and debug designsPrevious experience designing dedication DMA engines (especially related to machine learning applications), data storage, memory controllers, networking, image processing, and/or interconnectsGood understanding of arbitration, address translation, caching, on-chip interconnects, and performance analysisFamiliarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB)Experience in front-end implementation tasks such as synthesis, area and power analysis, linting, and logic equivalence checksBachelors Degree + 3 years of experience", "jobDescription": "Do you love creating sophisticated solutions to highly complex challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly visible role, you will be at the center of the Pixel IP design effort in pixel processing. You will collaborate with all teams, making a critical impact getting functional products to millions of customers quickly."}, "200463598": {"jobID": "200463598", "origin_search": null, "posted": "Feb 16, 2023", "jobTitle": "Computer Vision/Deep Learning Algorithms Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463598/computer-vision-deep-learning-algorithms-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS in Computer Science, Electrical Engineering, Robotics, Physics, Applied Mathematics or related fields, with 5 years industry experience or a PhD degree with equivalent industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Extensive knowledge in deep learning and computer vision techniquesStrong fundamentals in 3D geometry and geometric computer visionSolid C++ and Python skillsUnderstanding of deep learning frameworks and workflowExperience in working with large data sets and improving infrastructure pipelinesCreativity and curiosity for solving highly complex problemsExcellent communication and collaboration skills* Great to have: knowledge and experience in temporal reasoning and representationMS in Computer Science, Electrical Engineering, Robotics, Physics, Applied Mathematics or related fields, with 5 years industry experience or a PhD degree with equivalent industry experience.", "jobDescription": "Do you have a passion for computer vision and deep learning problems? We are looking for someone who thrives on collaboration and wants to push the boundaries of what is possible today! The Video Computer Vision org is a centralized applied research and engineering organization responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We balance research and product to deliver Apple quality, state-of-the-art experiences, innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life."}, "200460095": {"jobID": "200460095", "origin_search": null, "posted": "Jan 31, 2023", "jobTitle": "AIML - Sr. Robotics Research Engineer, ML Innovation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200460095/aiml-sr-robotics-research-engineer-ml-innovation?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "M.Sc., or Ph.D. in computer science, engineering, or equivalent professional experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "5+ years of experience in programming autonomous robots and systems.5+ years of experience in decision making, motion planning, and control systems.3+ years of experience in applied machine learning and AI algorithms.5+ years of professional software development experience in C++ and Python.5+ years of hands-on experience in R&D of state of the art AI and robotics algorithms, systems.Background in robotics algorithm integration, testing and experiments.Familiarity with real-time, multi-process, multi-threaded coding, and command line in Linux.Experience with agile development methodologies.Ability to cut through ambiguity and follow through to task completion despite roadblocks or distractionsAbility to prioritize with technical expertise and manage time wisely in a fast-paced, dynamic environmentCreative, collaborative, and passionate about R&D on extraordinary products and experiencesExcellent communication skills — you collaborate optimally with other teams and communicate clearly about your workAbility to work effectively within a geographically distributed teamM.Sc., or Ph.D. in computer science, engineering, or equivalent professional experience.", "jobDescription": "Our team works at the intersection of modern machine learning and robotics to shape the AI that will power the next generation of Apple products. We are looking for innovative and hardworking ML and robotics researchers and engineers that help us research, define, and develop complex intelligent robotic systems and experiences in the real world. Join Apple and help us leave the world better than we found it!\nIn this position, you will be working on challenging AI and robotic research problems with a cross-functional innovation team."}, "200456233": {"jobID": "200456233", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "Engineering Manager - ML Tools", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456233/engineering-manager-ml-tools?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science/Computer Engineering (or equivalent experience)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$278,000,"}, "benefits": null, "requirements": "2+ years managing small to medium sized teams4+ years developing cloud based app in Python (or similar language)4+ years using postgreSQL (or similar DB)3+ years deploying and operating cloud apps in AWSExperience with RustYou should also be self-directed, analytical, and work well in a team environment.BS/MS in Computer Science/Computer Engineering (or equivalent experience)* Experience with image manipulations is a plus but not a must* Experience working with large scale data in an ML development team", "jobDescription": "The Video Computer Vision organization is working on exciting technologies for future Apple products. Our focus is on ML based solution around real time image and video. We have contributed to the FaceID, ARKit and FaceKit project in the past and more recently the new LIDAR sensor. We are looking for the right Engineering Manager to help us take our efforts to the next level.\n\nIn this role, you will lead our ML Tools team for Apple’s Video Computer Vision Organization. Your role will be split between personal and organization management and as a core contributor. You will lead a team of 7 Individual contributors developing cloud based platforms, services and application that power data tools for ML workflows. You will architect, develop and maintain infrastructure, tooling, and engineering services for cloud based applications. You will be responsible for system bringup, deployment, reliability, security and service scalability. This role is highly cross-functional and you will work very closely with various highly skilled software development / ML teams developing cutting edge algorithms."}, "200451629": {"jobID": "200451629", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AI/ML Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451629/ai-ml-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "- Direct experience on solving interdisciplinary problems via machine learning (ML)- Publications in top machine learning conferences/journals such as JMLR, ICLR, NeurIPS, ICML, ACL, CVPR. -Knowledge in Algorithms, Optimization, Probability, Statistics and Information Theory Working experience in one or more of the following research directions in Neural Networks: Deep Reinforcement Learning, Federated Learning, Transformer, Transfer Learning, Online Learning, Generative Neural Network, Graph Neural Network, CNN, RNN etc- Shown track-record of innovation in AI/ML Programming experience in Python, MATLAB.- Demonstrate clarity of thought and strong analytical and problem-solving skills.- Ability to work well both independently and within a team.- Excellent communication and presentation skills.- Familiarity with efficient implementation of AI/ML in hardware.- Good coding style and code management abilities.BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation groundbreaking AI/ML based wireless solutions. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will have the unique and rewarding opportunity to craft next generation wireless technology that will have deep impact on future Apple products and inspire millions of Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part of all Apple devices that delight our customers. In our unit, we have the mission to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will work on defining system level concepts, proposing, and researching innovative ideas & algorithms, performing sophisticated system simulations, defining and working on rapid prototyping platforms to help prove your ideas for current and next generation (5G/6G) cellular systems with strong AI/ML foundation."}, "200451630": {"jobID": "200451630", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AI/ML Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451630/ai-ml-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "-  Direct experience on solving interdisciplinary problems via machine learning (ML)-  Publications in top machine learning conferences/journals such as JMLR, ICLR, NeurIPS, ICML, ACL, CVPR.-  Knowledge in Algorithms, Optimization, Probability, Statistics and Information Theory Working experience in one or more of the following research directions in Neural Networks: Deep Reinforcement Learning, Federated Learning, Transformer, Transfer Learning, Online Learning, Generative Neural Network, Graph Neural Network, CNN, RNN etc-  Shown track-record of innovation in AI/ML Programming experience in Python, MATLAB.-  Demonstrate clarity of thought and strong analytical and problem-solving skills.-  Ability to work well both independently and within a team.-  Excellent communication and presentation skills.-  Familiarity with efficient implementation of AI/ML in hardware.-  Good coding style and code management abilities.BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation groundbreaking AI/ML based wireless solutions. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will have the unique and rewarding opportunity to craft next generation wireless technology that will have deep impact on future Apple products and inspire millions of Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part of all Apple devices that delight our customers. In our unit, we have the mission to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will work on defining system level concepts, proposing, and researching innovative ideas & algorithms, performing sophisticated system simulations, defining and working on rapid prototyping platforms to help prove your ideas for current and next generation (5G/6G) cellular systems with strong AI/ML foundation."}, "200451632": {"jobID": "200451632", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "AI/ML Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451632/ai-ml-wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Direct experience on solving interdisciplinary problems via machine learning (ML)-  Publications in top machine learning conferences/journals such as JMLR, ICLR, NeurIPS, ICML, ACL, CVPR.-  Knowledge in Algorithms, Optimization, Probability, Statistics and Information Theory Working experience in one or more of the following research directions in Neural Networks: Deep Reinforcement Learning, Federated Learning, Transformer, Transfer Learning, Online Learning, Generative Neural Network, Graph Neural Network, CNN, RNN etc-  Shown track-record of innovation in AI/ML Programming experience in Python, MATLAB.-  Demonstrate clarity of thought and strong analytical and problem-solving skills.-  Ability to work well both independently and within a team.-  Excellent communication and presentation skills.-  Familiarity with efficient implementation of AI/ML in hardware.-  Good coding style and code management abilities.BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Join us to help deliver system design of next generation groundbreaking AI/ML based wireless solutions. Do you love working on challenges that no one has solved yet? As a member of our dynamic R&D group, you will have the unique and rewarding opportunity to craft next generation wireless technology that will have deep impact on future Apple products and inspire millions of Apple’s customers every single day. Wireless and AI/ML technologies have become a crucial part of all Apple devices that delight our customers. In our unit, we have the mission to research and develop AI/ML based cellular wireless technology for our products. We are looking for expert and highly self-motivated machine learning engineers. You will work on defining system level concepts, proposing, and researching innovative ideas & algorithms, performing sophisticated system simulations, defining and working on rapid prototyping platforms to help prove your ideas for current and next generation (5G/6G) cellular systems with strong AI/ML foundation."}, "200356587": {"jobID": "200356587", "origin_search": null, "posted": "Mar 17, 2022", "jobTitle": "Senior Software Engineer (Web Services)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200356587/senior-software-engineer-web-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "BA in Computer Science, Computer Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of professional experience in a production environmentConsiderable hands-on experience developing services for backend APIs (e.g. REST, RPC, GraphQL)Write and maintain scalable enterprise quality servicesSet Up, configure maintain, and enhance proper infrastructure to support JavaScript / Node.js / TypeScript / Go based servicesMaintain and enhance out distributed microservice based API architectureProficiency using Git, JIRA, Datadog, Splunk, Jenkins, Docker, KubernetesEvaluate the technical trade-offs of every decisionBA in Computer Science, Computer Engineering or related field-  Professional experience with cloud infrastructure and AWS components-  Previously written and maintained headless ETL services-  Experience serializing structured data with Protobuf and transition through various communication patterns like gRPC and pub/sub-  Proven proficiency with relational databases and SQL", "jobDescription": "The autonomous visualization systems team is in search of a curious and innovative teammate who is passionate about leveraging groundbreaking web technology to deliver full stack experiences that surpass user expectations. The team works on many impactful web applications and services at Apple where quality and performance cannot be sacrificed. Join Apple and help us leave the world better than we found it!"}, "200355027": {"jobID": "200355027", "origin_search": null, "posted": "Nov 1, 2022", "jobTitle": "Software Engineer, Robotics ML Engineer - SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200355027/software-engineer-robotics-ml-engineer-spg?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "B.S. or M.S. in computer science, engineering, robotics or a related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "We are looking for solid programming skills in Python and C++ as well as experience and interest in one or more of these domains:on-device Machine Learning inference, using frameworks such as TensorRT or ONNX runtime. We are primarily a PyTorch shop but we believe that your experience in other Deep Learning frameworks would translate well in our environment.Robotics systems, where you have designed and implemented integrations between different components of a robotics stack, potentially using a framework like ROS. Familiarity with fundamental concepts such as motion planning or coordinate transformations is appreciated.Systems-level software engineering with a focus on performance-aware code (both in terms of CPU and memory). This includes multithreading and parallelism, algorithms, data structures, and familiarity with profiling tools such a perf.B.S. or M.S. in computer science, engineering, robotics or a related field.", "jobDescription": "Apple’s Special Projects Group is doing groundbreaking work in building autonomous systems based on Reinforcement Learning. We’re looking for Software Engineers who can help deploy these intelligent behaviors onto robots. This is a broad role covering neural network inference, performance optimization, and Robotics systems."}, "200440712": {"jobID": "200440712", "origin_search": null, "posted": "Dec 18, 2022", "jobTitle": "Computer Vision Power and Performance Optimization (PnP) Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200440712/computer-vision-power-and-performance-optimization-pnp-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in Data Science, Statistics, Bioinformatics, Operations Research, Computer Science, or similar quantitative domain."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "5+ years experience with hardware or software system power and performance analysis and optimizationStrong computer architecture knowledge is a must, embedded hardware in particularUnderstanding CPU/GPU architecture, low level operating system, memory and resource managementPhD or MS in Data Science, Statistics, Bioinformatics, Operations Research, Computer Science, or similar quantitative domain.", "jobDescription": "The Video Computer Vision org is a centralized applied research and engineering team responsible for developing real-time on-device Computer Vision and Machine Perception technologies across Apple products. We focus on a balance of research and development to deliver Apple quality, state-of-the-art experiences. Our team prides itself on innovating through the full stack, and partnering with HW, SW and ML teams to influence the sensor and silicon roadmap that brings our vision to life."}, "200262876": {"jobID": "200262876", "origin_search": null, "posted": "Jan 4, 2023", "jobTitle": "Touch ASIC Digital Architect (EE)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200262876/touch-asic-digital-architect-ee?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. in Electrical Engineering or industry experience equivalent, with 5+ years of digital design and architecture experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience leading chip architecture and/or digital design is desirable, preferably in touch or communications.Hands-on experience in design, development and launch of high volume IC designs in consumer products; direct experience with touch technology and/or flat panel display technology is beneficial.Strong electrical engineering background embedded system design including ASIC microarchitecture, computer architecture, SoC architecture, and custom or standard DSP or hardware accelerator microarchitectureExperience in FPGA emulation system design preferred, including leading pre-silicon system validation, prototype bring-up, debug, validation, characterization, and module integration supportExcellent written and verbal communication skills and solid teamwork and leadership skills.Proficiency in MATLAB, Verilog, or similar simulation, design and modeling tools.Experience with DSP, estimation algorithms, and/or machine learning HW is a plus.M.S. or Ph.D. in Electrical Engineering or industry experience equivalent, with 5+ years of digital design and architecture experience.", "jobDescription": "Design, develop, and launch next-generation Touch Technologies in Apple products.\n\nThe Touch Technology team develops cutting-edge Touch solutions and technologies that are central to Apple’s products, including the iPhone, iPad, MacBooks, and more. The key goal of the Touch Technology team is to enable the world’s best multi-touch user-experience. The team features a collaborative and hands-on environment that fosters engineering excellence, creativity, and innovation. \n\nThe ASIC Digital architect is a key architect responsible for analyzing the application and coming up with cost and power optimized digital for the touch and other sensing ASICs. These designs may include one or multiple processor and/or DSP cores and microarchitecture of custom control engines."}, "200441890": {"jobID": "200441890", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Display Mechanical Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441890/display-mechanical-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS with up to two years in Mechanical or Aerospace Engineering or similar."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$38.70", "max": "$67.78/hr,"}, "benefits": null, "requirements": "High energy personality with a real passion for learning and attention to detailExcellent prioritization, cross-functional collaboration, and written & verbal communication.Solid understanding of mechanical engineering fundamentals including properties of materials, solid mechanics, beam statics, Newtonian physics, and thermodynamics.The ability to perform mechanical design & validation, including the development of component or material evaluation tests, and failure analysis.3D/2D software expertise: 3D modeling (Pro/E, NX, CATIA, or Solidworks), engineering drawings, Geometric Dimensioning and Tolerancing (GD&T).Exposure to diverse manufacturing techniques such as injection-molding, sheet-metal stamping, 3D printing, and materials such as polymers, glass, and metals. Good understanding of DFA/DFM, & statistical tolerance analysis.Applied Design of Experiments (DOE) and scientific method to address engineering issues.Willingness and ability to travel internationally (~15%, primarily Asia).BS or MS with up to two years in Mechanical or Aerospace Engineering or similar.Preferred qualifications•\tExperience with simulation and analysis such as Finite Element Analysis (FEA) for structural and thermal, Computational Fluid Dynamics (CFD).•\tFamiliarity with Six Sigma methodology, process capability, and capable of large data set analysis using JMP, MATLAB, or Minitab.•\tElectro-mechanical design and/or manufacturing for high-volume products with an emphasis on reliability.", "jobDescription": "At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. We want outstanding engineers to bring passion and dedication to our team. \n\nApple’s Display Technologies group is looking for Mechanical Engineers to design and develop innovative display modules for future products. Here you will create next-generation technologies, processes, and components, and own the integration of them into groundbreaking, mechanically robust display designs with amazing performance."}, "200456572": {"jobID": "200456572", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "ASIC Design Engineer - Neural Engine DMA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456572/asic-design-engineer-neural-engine-dma?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree + 10 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in SoC front-end ASIC RTL digital logic design using Verilog or System Verilog.Experience working multi-functionally with architecture, design, and verification teams to specify, design, and debug designs.Experience in front-end implementation tasks such as synthesis, timing, area/power analysis, linting, and logic equivalence checks.Tight-knit collaboration skills with excellent written and verbal communication skills.Strong understanding of flow control, arbitration, address translation, caching, on-chip interconnects, and performance analysis.Prefer previous experience designing dedication DMA engines, multimedia IPs (especially AI/ML applications), data storage, memory controllers, networking, image processing, interconnects, and/or low power design.Prefer familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB), and relevant scripting languages (Python, Perl, TCL).Bachelor's degree + 10 Years of Experience", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly transparent role, you will be at the center of the Pixel IP design effort to accelerate machine learning applications. You will collaborate with all teams, making a critical impact getting functional products to millions of customers quickly."}, "200337482": {"jobID": "200337482", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "Build Engineer, SPG", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200337482/build-engineer-spg?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MSEE in Computer Science or related field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of SW development and build infrastructure experience.Excellent software development process skills.Previous experience working on a project that has a build and release process integrating at least 25 components.Experience with Jenkins or similar tools.Breath of knowledge on a variety of techniques and tools in the areas of build, test, deploy, and release.Have created and managed software package dependencies (such as: deb, dmg).Familiar with artifact management solutions (artifactory, aptly, package mirrors).Demonstrated experience with project level build tools such as bazel, CMake, Make, buck, ninja for large scale software.Experience in building C based projects.Deep understanding of build dependencies at various levels (header dependencies, linking dependencies, tools dependencies, package dependencies...)Ability to script in python, bash.Familiarity with macOS and Linux development and debugging tools.Experience with embedded systems software a plus.Experience with LLVM and/or Xcode is a plus.Excellent teamwork and communication skills.Strong verbal and written communication skills.Ability to manage multiple tasks and self-prioritize.Detail oriented.BS/MSEE in Computer Science or related field.• Coding experience in a C based language a plus (C, C++, ObjectiveC).• Familiarity with container eco-system (cluster schedulers, Kubernetes, docker, service registries, secrets management) is a plus.• Familiar with Virtualization Technologies (vmware, KVM) is a plus.", "jobDescription": "Apple is looking for a talented, detail oriented and results oriented software engineer to develop a build infrastructure for our next-generation products. In this position, you will have the opportunity to work with a group of top notch software engineers from related but different backgrounds to make a product truly innovative. To be successful in this role, the candidate must be hands-on, proactive, excellent at problem solving and have a strong desire to learn.\nThis build engineer candidate takes pride in creating and managing a build and test infrastructure as well as automated build tools using continuous integration practices. This engineer needs to closely work with cross-functional teams to identify the issues, design and implement the proper solution, and work with the engineering teams to properly test and deploy the changes. Critical thinking, writing solid and clean code, planning, documenting and communicating within the team and cross-functionally is critical to the success of the role."}, "200365693": {"jobID": "200365693", "origin_search": null, "posted": "", "jobTitle": "Software Engineer, Analytics - Apple TV Services", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200365693/software-engineer-analytics-apple-tv-services?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200432693": {"jobID": "200432693", "origin_search": null, "posted": "Oct 5, 2022", "jobTitle": "Imaging Scientist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200432693/imaging-scientist?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "M.S. or Ph.D. (preferred) in computer science, image science, EE or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Demonstrated ability in algorithm development for imaging systemsStrong proficiency in machine learning and deep learningStrong understanding in image processing, computer vision and AR/VR renderingProficiency in Python, TensorFlow/Pytorch, MATLABExperience using deep learning for inverse modelingStrong interpersonal skills for working with cross functional teamsExcellent written and verbal communication skills in EnglishM.S. or Ph.D. (preferred) in computer science, image science, EE or equivalent", "jobDescription": "The display visual experience team is looking for an individual to discover and develop algorithms for future Apple products. This position will focus on novel deep learning, display algorithm, application, and prototyping to enable the best front-of-screen experience of Apple products including iPhone, iPad, Watch, Mac and more. Experience on device forward and and inverse modeling using deep learning a plus. The team features a collaborative and hands-on environment that cultivates engineering excellence, creativity, and innovation in the interdisciplinary areas of image science, machine learning, computer science, and optics."}, "200455247": {"jobID": "200455247", "origin_search": null, "posted": "", "jobTitle": "Force Hardware - Sensor Design & Integration Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455247/force-hardware-sensor-design-integration-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "", "jobDescription": ""}, "200429147": {"jobID": "200429147", "origin_search": null, "posted": "Oct 14, 2022", "jobTitle": "Software Development Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200429147/software-development-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS, MS, or PhD in Computer Science, Computer Engineering, or a similar field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Real passion for the location domain. We believe that mobility is transformative, and that to realize that transformation, your devices need to understand the places you go and what they mean to you. That’s what we do. If you have experience in location estimation—GPS/GNSS, WiFi positioning, indoor localization, or discrete localization—we're especially eager to speak with you.5+ years experience developing commercial software. Most of the code you write will run on mobile devices, in the hands of hundreds of millions of Apple customers. We use Objective-C, but if you know C, modern C++, or Swift, you shouldn’t have a problem.A working knowledge of statistics fundamentals. Your code will make estimates, identify patterns, and quantify how strong they are. You should be comfortable using histograms, basic probability, and Bayes’s Theorem. If you have a background in signal processing, data science, or machine learning, that's even better.An ability to evaluate and optimize for system performance: memory, CPU, radios, etc. Our software needs to provide a high level of service while sipping power. We think this is a really exciting challenge. If it sounds frustrating to you, this isn’t the right position.A proven track record working effectively across teams. One of the cool things about Apple is how much you will work with people who have different expertise and responsibilities than you: apps, sensors, connectivity, and others. You’ll need to communicate clearly, plan collaboratively, execute flexibly, and cope with what will sometimes feel like a high degree of uncertainty.Experience processing real-world data at scale, server-side. Not every candidate will have experience with Spark, Hadoop, or NoSQL data stores, but the best ones will.BS, MS, or PhD in Computer Science, Computer Engineering, or a similar field", "jobDescription": "Our mission is to personalize the user experience on Apple devices based on where you go, when, and what those places mean to you. You’re experiencing our work whenever you see a suggested location in Maps or Calendar, or browse your Memories in Photos. We’re working for you whenever your phone engages Do Not Disturb While Driving or remembers where you parked. We’re looking for motivated, experienced technical leaders to help take our software to the next level of capability, quality, and impact. Do you have a background in GPS, WiFi location, or embedded sensing, and are looking to move up the stack? Do you know recommendation engines, and want to apply that experience to a deeply impactful and broadly applicable domain? Are you excited by the optimization problem of providing rich contextual intelligence within a constrained resource footprint? If any of these describe you, read on."}, "200304144": {"jobID": "200304144", "origin_search": null, "posted": "Oct 22, 2021", "jobTitle": "AR/VR Realtime 3D Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200304144/ar-vr-realtime-3d-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in Computer Science, Computer Graphics, CV/ML, Game Technology, or a related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$196,500,"}, "benefits": null, "requirements": "3+ years of experience in software development and real-time systemsExcellent 3D math and linear algebra skillsFamiliar with computer graphics fundamentalsProficiency in C/C++programmingBS/MS/PhD in Computer Science, Computer Graphics, CV/ML, Game Technology, or a related field-  Attention to detail, passion and the ability to master new applications and technologies quickly-  Fast technical uptake and ability to quickly switch context-  Strong communication, teamwork and cross-team collaboration skills-  Solid understanding of software engineering techniques, methodologies and practices-  Swift, Xcode, Objective-C is a plus-  Performance optimization is a plusApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "The Technology Development Group (TDG) is looking for a passionate software developer to help us with the development of some of Apple’s most advanced technologies and to build system features that power the next generation of interactive applications for our platform. This team is working in close collaboration with cross-functional teams across the SW and HW stack. As a member of our organization you will assist us in crafting future products that will delight, inspire and empower millions of people."}, "200451462": {"jobID": "200451462", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "SRAM Circuit Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451462/sram-circuit-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "We are looking for applicants with work experience within a SoC design cycle, developing circuits and SRAM/Register File for low power, low voltage and high performance.Knowledge of Cache design/architecture, memory hierarchy is a huge plus.Working knowledge of RTL modeling.Solid understanding of industry-standard design tools.Deep understanding of nanometer device physics, leakage mechanisms, technology interactions with device behavior.Ability to devise experiments and analyze data for silicon debug.Machine Learning algorithms (ML) and scripting is a big plus.BS and a minimum of 3 years of relevant industry experience", "jobDescription": "Do you have a passion for crafting entirely new solutions? \n\nBe a part of a world-class silicon design team which delivered an incredible high performance M1 chip for our Mac line of products and chips for our flagship products (iPhone, iPad, Mac, Airpods, HomePod and Watch). \nAs part of our Digital Custom Group (DCG), you’ll take imaginative and revolutionary ideas and determine how to turn them into reality! You and your team will apply engineering fundamentals and start from scratch if needed, bringing forward-thinking ideas to the real world. Join us, and you’ll help design the foundation that allows us to bring customers experiences they’ve never before envisioned!\n\nThis is a highly visible role at the heart of a silicon design effort, making a critical impact delivering products to market quickly. Your designs will strongly influence CPU / GPU / SoC / Neural Engine / Camera designs in Apple's Custom Silicon group."}, "200461288": {"jobID": "200461288", "origin_search": null, "posted": "Feb 6, 2023", "jobTitle": "Pro Workflow Video Expert", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461288/pro-workflow-video-expert?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s Degree or similar work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$177,000,"}, "benefits": null, "requirements": "5+ years of post-production experience with a specific focus on video editing, workflow, and finishing on Windows PCs or workstationsExpertise in one or more industry-leading NLEs such as Premiere Pro, Avid Media Composer, Blackmagic DaVinci Resolve, or Final Cut Pro XPassion and interest in being hands-on and influencing the design of future Apple products, including Mac, iPad, and iPhoneAbility to share & explain real-world workflows within video production to non domain expertsTechnically knowledgeable in key aspects of video production, including codecs, cameras, data & media management, and color scienceKey desire and ability to learn new things, from creative processes and techniques to the interaction of computer technology with those processes and workflowsKnowledge of delivery standards and practices for Broadcast and Streaming services for domestic and/or international marketsBachelor’s Degree or similar work experience-  Color grading expertise-  Experience working within a post-production team focused on editing collaboratively and remotely.-  Experience/expertise in more than one NLE-  Experience working on Cloud platforms-  Experience in collaborating with VFX / 3D artists/teams or as a post-production supervisor-  Production experience in any of the following positions: writer/director/assistant director/cinematographer/producer/line producer/editor/assistant editor-  Having built or spec’ed a Windows PC/Workstation for creative work-  Experience with AR / VR / MR-  Experience with Machine Learning in a creative context", "jobDescription": "Join a unique and highly specialized team of creatives and engineers within Apple's Pro Workflow team (PWF) tasked with shaping the future of the Mac, iPad, and iPhone. \n\nOne of the things that makes this group unique is that the engineers on the team specialize in the creative space but are a part of Apple's Hardware org. They work directly with our creative partners to identify and fix technical issues. They also work hand in hand with system architects to determine the future roadmap of Apple’s hardware.\n\nApple’s PWF team seeks a forward-thinking creative with extensive expertise in Post-Production Video workflow. The team comprises award-winning 3D/VFX, video, photography, and audio creatives, as well as highly specialized engineers and system architects."}, "200456544": {"jobID": "200456544", "origin_search": null, "posted": "Jan 10, 2023", "jobTitle": "ASIC Design Engineer - Neural Engine DMA", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456544/asic-design-engineer-neural-engine-dma?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree + 3 Years of Experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in SoC front-end ASIC RTL digital logic design using Verilog, or System Verilog.Experience working multi-functionally with architecture, design, and verification teams to specify, design, and debug designs.Experience in front-end implementation tasks such as synthesis, timing, area/power analysis, linting, and logic equivalence checks.Good collaboration skills with strong written and verbal communication skills.Good understanding of flow control, arbitration, address translation, caching, on-chip interconnects, and performance analysis.Prefer previous experience designing dedication DMA engines, multimedia IPs (especially AI/ML applications), data storage, memory controllers, networking, image processing, interconnects, and/or low power design.Prefer familiarity with common on-chip bus protocols such as AMBA (AXI, AHB, APB), and relevant scripting languages (Python, Perl, TCL).Bachelor's degree + 3 Years of Experience", "jobDescription": "Do you love crafting elegant solutions to highly sophisticated challenges? As part of our Hardware Technologies group, you’ll help design our next-generation, high-performance, power-efficient system-on-chips (SoCs). You will ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this highly transparent role, you will be at the center of the Pixel IP design effort to accelerate machine learning applications. You will collaborate with all teams, making a critical impact getting functional products to millions of customers quickly."}, "200452587": {"jobID": "200452587", "origin_search": null, "posted": "Feb 1, 2023", "jobTitle": "Senior Data Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452587/senior-data-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in Computer Science, Quantitative Finance, Math, Physics or a related Engineering degree."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proficient in SQLProficient in Spark or PythonExperience with MPP databases preferred6+ years of experience in data engineering and ETL pipeline development.3+ years of Spark development.6+ years of experience in Big Data Technologies (Hadoop, MapReduce, Hive etc…).Experience on Kubernetes, Docker preferred.Experience with Snowflake.BS in Computer Science, Quantitative Finance, Math, Physics or a related Engineering degree.Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe Product Marketing Customer Analytics team is seeking a Senior Data Engineer to support customer analytics with advanced, scalable and robust architecture, tools, data products, and critical data pipelines that are optimized for rapid business intelligence, data analysis, and data science."}, "200441549": {"jobID": "200441549", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Software Engineer, User Secrets", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441549/software-engineer-user-secrets?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "M.S. in Computer Science or equivalent industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "5+ years of growing experience with security distributed systemsA genuine passion for building effective, scalable, and useful tools for users to safeguard their most precious dataExcellent C and systems programming skillsAbility to deliver proven work on tight schedulesIndustry exposure to and knowledge of OS security, applied cryptography, and key managementExcellent collaboration skills. We work with teams responsible for many layers of Apple products, and our services are a core part of the technology stackM.S. in Computer Science or equivalent industry experiencePREFERRED SKILLS:-  Understanding of distributed systems and their unique challenges-  iOS and macOS exposure (end user, administrator, developer)-  Swift, Obj-C, C, C++ experience-  Ability to dive into and understand unfamiliar codebases and systems", "jobDescription": "Embedded within Apple’s Security Engineering & Architecture organization, the User Secrets team’s mission is to ensure that the user’s secret data stays their own, by using Apple’s hardware and software to deliver world-class encrypted data storage, synchronization, and recovery options. Our team contributes to the most secure operating systems in the world, and puts them in the hands of billions of customers — join us to help push our technologies to the next level!"}, "200314030": {"jobID": "200314030", "origin_search": null, "posted": "Nov 15, 2022", "jobTitle": "Machine Learning Video Algorithms Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200314030/machine-learning-video-algorithms-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "MS/PhD in Electrical Engineering or Computer Science\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Excellent problem solving skillsExpert knowledge of the principles, algorithms, and tools of deep learning, including models, training strategies, training dataset building, cost functions, quality metrics, etc...Expert knowledge of the principles, algorithms, and techniques in video/ image processing, and low-level computer vision, such as spatial scaling, optical flow estimation, segmentation, frame rate up conversion, noise reduction, color processing, etc.Excellent written and oral communication skillsProven programming skills using common ML tools such as Python, PyTorch, CUDA Metal, and C/C++Minimum 4 years of directly related experienceMS/PhD in Electrical Engineering or Computer Science\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped craft almost daily. At Apple, you will have the opportunity to work on products that are always leaders in the industry and occasionally, change the world!  The Video Engineering group at Apple is responsible for crafting the image/video core technologies used in almost all Apple products and services. \n\nWe are looking for a highly self-motivated and enthusiastic individual, who is able to excel in a technically meaningful environment, to fill in the position of video algorithm engineer."}, "200437792": {"jobID": "200437792", "origin_search": null, "posted": "Oct 28, 2022", "jobTitle": "System Frameworks Software Engineer - App Intents", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200437792/system-frameworks-software-engineer-app-intents?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS / MS in Computer Science OR equivalent degree OR equivalent experience and at least 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Passion for building, developing, and shipping softwareDeep practical skills and knowledge of protocol- and/or object-oriented programmingKeen ability to translate technical capabilities, questions, and constraints into prototypesBS / MS in Computer Science OR equivalent degree OR equivalent experience and at least 3 years of experience-  Experience programming with Swift and/or Objective-C is preferred-  Experience working on developer-facing frameworks OR experience working with Apple frameworks in customer-facing iOS and/or macOS applications is preferred-  Attention to detail, creativity, passion, and superior communication and collaboration skills-  Knowledge of AR/VR technologies, 3D graphics, and/or game engines is NOT required for this roleApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "The Technology Development Group (TDG) is looking for a Software Engineer to help us push the limits on the next generation of interactive experiences on our platform. As a member of our creative organization, you will have a uniquely rewarding opportunity to craft future products that will delight and inspire millions of people every single day.\n\nSystem frameworks are at the core of unleashing the potential of AR/VR on Apple’s platforms. Do you want to be at the forefront of ideating, building, and shipping groundbreaking experiences that build on top of the incredible capabilities of AR and VR? Our team is uniquely positioned at the intersection of design, frameworks, operating systems, and low-level software — by joining us you will work closely with peers across these functions to deliver life-changing products and experiences to our customers across all of Apple’s operating systems."}}