{"200420680": {"jobID": "200420680", "origin_search": null, "posted": "Sep 1, 2022", "jobTitle": "Software Engineer - Windows Media Products", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200420680/software-engineer-windows-media-products?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS in CS or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$95,000", "max": "$177,000"}, "benefits": null, "requirements": "You’ve built projects using Windows SDK, C, C++You’ve deep understanding of object oriented design, memory management, and performance optimization.You’ve had to deal with debugging performance problems, and you’re comfortable rooting out performance bottle-necks.You have experience writing multi-threaded, asynchronous code. If you haven’t used GCD, you can learn it here. If you have, we’d like to hear from you.You enjoy paying attention to details almost as much as the big technical wins. You've a consistent record of completing projects on-time and to specification.You’re used to communicating with a diverse team, with both experts and novices, in technical and non-technical roles.We appreciate any experience with popular JavaScript tools, frameworks and design principals, and a curiosity to stay up to date with the changing JavaScript ecosystem landscape.BS in CS or equivalent experienceApple is an equal opportunity employer that is committed to inclusion and diversity. Visit jobs.apple.com to learn more. If you do not consent to Apple storing your information in our system for Recruiting purposes, please reply to this email requesting deletion. For more information on Apple’s privacy policy please visit https://www.apple.com/legal/privacy/.", "jobDescription": "What happens when the world’s most innovative engineers collaborate with the world’s most creative storytellers? TV gets reinvented! The Apple TV app team created and manage the Apple TV app on iOS, macOS and tvOS platforms, which redefined and refined the way people watch their favorite shows, movies, and so much more — including everything they love from the major subscription services. Today, the team also manage one of the most exciting new realms at Apple: we bring viewers the critically acclaimed and award-winning Apple Originals in Apple TV+. The Apple TV App makes it possible for people around the world to easily access content from multiple video providers on their devices while helping those video providers promote and monetize their work. The group is responsible for delivering innovative features and managing the app on iOS, tvOS and macOS platforms. Apple TV app also integrates with platform features to enrich the experience outside the app, for example TV app Widget on iOS and iPad, Siri (queries like New Movies, Filter by Actor etc.), iOS Spotlight, tvOS Top Shelf, and many more."}, "200467502": {"jobID": "200467502", "origin_search": null, "posted": "Mar 4, 2023", "jobTitle": "Web Services Engineer - Localization Automation", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200467502/web-services-engineer-localization-automation?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor’s or Master’s Degree in Computer Science (or equivalent experience)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$105,500", "max": "$196,500"}, "benefits": null, "requirements": "Strong object-oriented programming and design skillsStrong analytical and problem solving skillsExperience with back-end frameworks (e.g. Ruby on Rails, Django)Experience with databases and indexing (e.g. Cassandra, SQL, Solr)A technical background in UNIX commands in TerminalExcellent written and verbal communication skills- Bachelor’s or Master’s Degree in Computer Science (or equivalent experience)Preferred Skills- Experience designing reusable API- Interest and background in translation, internationalization, localization, and international markets- Native level foreign language skills in reading, writing and speaking- Familiarity with Swift- Familiarity with version control systems such as subversion or git- A track record of shipping products", "jobDescription": "The Localization Automation Team is responsible for developing tools and technologies that allow Apple to localize and ship products such as iPhone, iPad, Apple Watch, Mac, Apple TV, and more across the world.\nWe are looking for a talented Software Engineer to take our localization process to the next level. You will be in charge of a crucial process that impacts every product with the objective of making it even better. You will also develop new tools and applications to enhance Apple's localization technologies."}, "200452169": {"jobID": "200452169", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Validation Engineer - RF Systems Cellular", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452169/wireless-systems-validation-engineer-rf-systems-cellular?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Practical knowledge of at least one Cellular Wireless technology including 2G, 3G, 4G, 5GPractical knowledge of cellular industry standards including 3GPP, 3GPP2, Carrier specifications including performance requirements, compliance requirements and required testing methodologiesExperience and a deep understanding of System Level RF Parametric its sources in RF component characteristics and behaviorHands on experience with bench level wireless testing, debug at the module, reference board or system levelDebug level experience on cellular radio systems at the conducted or radiated level is a plusUnderstanding of Antenna characteristics impact to radiated testing. Familiarity with radiated test setups, radiated chamber calibration and useExperience using RF lab test equipmentAbility to travel domestically and internationallyStrong written and verbal communication skillsBS with 3+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives! Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work towards ensuring Apple products conform and go beyond all applicable cellular industry standards and regulatory requirements."}, "200449284": {"jobID": "200449284", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Power Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449284/cellular-4g-5g-firmware-power-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience on working with power optimization methodologies as well as hands-on experience with power measurement tools, preferably in cellular technologiesAbility to work multi-functionally with different teams implement power verification test plan that will help achieve the outstanding modem targetsKnowledge in wireless systems, 4G/5G physical layer, protocol stack and procedures, power measurement and modem architecture, in particular C-DRX, Airplane modes, different sleep idle state transitionsValidated understanding of different interfaces like PCIe, USB, MPHY based RF-BB interconnects, frequency and voltage management and clocking schemesUnderstanding of SoC architectures, Fabrics, DDRs and DMAs will be an added plusShown track-record of innovation and hands-on experience in power measurement setup and test methodologyStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong understanding multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an outstanding modem team, we'll craft powerful embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world! As a Cellular 5G/4G Firmware Power Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on requirements."}, "200318905": {"jobID": "200318905", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Video Processing Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200318905/video-processing-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science, Electrical Engineering or related majors"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience with Video Processing and GPU programmingExperience with HDR pipelineColor Science a huge plusExcellent software design, problem solving and debugging skillsValidated programming skills and C/C++ coding abilitiesExperience in embedded real time multitasking software systemMinimum of 3 years direct related experience in software developmentGood written and oral interpersonal skillsBS/MS in Computer Science, Electrical Engineering or related majorsApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "Imagine the impact you can make. A billion users will use the technologies you helped build almost daily. At Apple, you will have the opportunity to work on products that are always leaders in the industry and occasionally, change the world! The Video Engineering group at Apple is responsible for developing image/video core technologies used in almost all Apple products and services.  In this role, you will develop frameworks for image and video compression/processing, implementing features for HDR playback on iPhone/iPad/Mac /AppleTV for applications like AppleTV+, Netflix, Amazon Prime, YouTube, Hulu, Disney+ and HBOMax.  As an embedded software engineer, you will work on the video/image subsystem, including new video compression/processing feature development, performance, and power optimization. The ideal candidate would be an extraordinary teammate and have a proven track record of development for large volume product shipment."}, "200461326": {"jobID": "200461326", "origin_search": null, "posted": "Feb 3, 2023", "jobTitle": "Display Hardware Electrical Engineer - Coexistence", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461326/display-hardware-electrical-engineer-coexistence?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$242,000,"}, "benefits": null, "requirements": "Strong fundamental electromagnetic and physics background related to coexistence problem in system designProven understanding of standard methodologies for system-level grounding, shielding, isolation and conducive/electromagnetic interference mitigationExperience in 3D EM simulations for debugging and mitigating complex EM coexistence issuesHands-on experience in EM and circuit simulation tools, such as: Ansys HFSS/Maxwell/SIWave, CST, ADS/Spice/Spectre, etcFamiliarity with lab equipment, such as: Impedance analyzer, VNA, TDR, real-time oscilloscope, spectrum analyzer, etcExcellent language skills, verbal and written", "jobDescription": "Imagine what you could do here. At Apple, phenomenal ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.\nThe Apple Display team is looking for an experienced, creative, and self driven engineer for the position of Display Hardware Electrical Engineer. This individual will perform in depth modeling, simulation and debugging of conductive and electromagnetic coupling effects on display module in Apple products."}, "200447643": {"jobID": "200447643", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "HardIP Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447643/hardip-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and minimum of 3+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "In depth knowledge of Semiconductor Manufacturing ProcessDeep understanding of High Speed Digital and Analog circuits, Design for Test and Manufacturing Concepts.Expertise in Semiconductor Test Methodology.Experience working with Digital, Mixed Signal, SOC Devices with hands on VLSI ATE experience. DFT experience is a plus.Strong Programming skills for writing and debugging test programs and HW related issues.Proficiency in programming with Scripting languages (IE., Perl/Python) and high level languages (IE., C/C++ or Visual Basic.)Able to work with test equipment (IE., oscilloscope, logic analyzer, etc)Experience High Speed Board Design & SI analysis.Travel is requiredBS and minimum of 3+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that moves Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!   \n\nWe are seeking a dynamic engineer to develop ATE test programs for debug, characterization, qualification and production of SoC devices specializing in HardIP tests."}, "200452263": {"jobID": "200452263", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452263/wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 10+ years of relevant experience required. MS and PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in crafting signal processing and wireless communications systems.Working knowledge of wireless communication systems (e.g., OFDM/MIMO, etc.) and hands-on experience with lab testing and characterization will be necessary.Strong understanding of communication theory & signal processing-related algorithm design (such as timing recovery, signal estimation and detection, MIMO signal estimation and detection, automatic gain control, channel estimation, equalization, coding theory, beamforming, etc.)Deep understanding of components/modules within wireless communication systems, and the possible impairments from those components, and the corresponding calibration and impairment reduction methods/algorithms, digital pre-distortion, PAPR reduction algorithms, Tx power control, etc.Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.Experience in modem architecture, microprocessor architecture, hardware and software control are a plus.Experience on low power algorithm design for power critical application is a plus.Experience with multi-radio coexistence management is a plus.Experience and knowledge on High Level Synthesis (HLS), silicon prototyping, emulation systems, and virtual platforms will be a plus.Experience on bring up of real silicon in lab and being able to efficiently use lab equipment (such as spectrum analyzer, signal generator, power meter, etc.) is helpful.Knowledge in existing wireless communication protocols; such as 5G/LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLEBS and 10+ years of relevant experience required. MS and PhD preferred.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our Wireless Silicon Design group, you will have the unique and rewarding opportunity to build upcoming products that will delight and encourage millions of Apple’s customers every single day!\n\nIn this technical role, you will be at the center of our silicon design group responsible for the wireless system design of our innovative wireless SoC products. You will have the chance to create algorithms and architectures of wireless communication systems, as well as collaborate with extraordinary RF/analog, HW, SW designers and architects to implement, verify, validate and bring up SoC products to production quality, providing them to millions of Apple customers!"}, "200452070": {"jobID": "200452070", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless Systems Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452070/wireless-systems-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 3+ years of relevant experience required. MS and PhD preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Experience in crafting signal processing and wireless communications systems.Working knowledge of wireless communication systems (e.g., OFDM/MIMO, etc.) and hands-on experience with lab testing and characterization will be necessary.Strong understanding of communication theory & signal processing-related algorithm design (such as timing recovery, signal estimation and detection, MIMO signal estimation and detection, automatic gain control, channel estimation, equalization, coding theory, beamforming, etc.)Deep understanding of components/modules within wireless communication systems, and the possible impairments from those components, and the corresponding calibration and impairment reduction methods/algorithms, digital pre-distortion, PAPR reduction algorithms, Tx power control, etc.Experience with Matlab or Python and/or C/C++ for algorithm development, modeling, and simulation.Experience in modem architecture, microprocessor architecture, hardware and software control are a plus.Experience on low power algorithm design for power critical application is a plus.Experience with multi-radio coexistence management is a plus.Experience and knowledge on High Level Synthesis (HLS), silicon prototyping, emulation systems, and virtual platforms will be a plus.Experience on bring up of real silicon in lab and being able to efficiently use lab equipment (such as spectrum analyzer, signal generator, power meter, etc.) is helpful.Knowledge in existing wireless communication protocols; such as 5G/LTE/WCDMA/GSM, 802.11a/b/g/n/ac/ax/be, 802.11ad/ay or Bluetooth/BLEBS and 3+ years of relevant experience required. MS and PhD preferred.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our Wireless Silicon Design group, you will have the unique and rewarding opportunity to build upcoming products that will delight and encourage millions of Apple’s customers every single day!\n\nIn this technical role, you will be at the center of our silicon design group responsible for the wireless system design of our innovative wireless SoC products. You will have the chance to create algorithms and architectures of wireless communication systems, as well as collaborate with extraordinary RF/analog, HW, SW designers and architects to implement, verify, validate and bring up SoC products to production quality, providing them to millions of Apple customers!"}, "200443144": {"jobID": "200443144", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "Wireless/RF Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443144/wireless-rf-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE or equivalent work experience required. \n\nMSEE/MBA Preferred, but not required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "5+ years of relevant experience in RF/Wireless in communications industry and/or hardware technology companyDemonstrated track record of development and integration of wireless technologies into productsExcellent organizational, interpersonal, presentation, and communication skillsEager to learn and be part of a teamWillingness and ability to travel internationally, when safe to do so.Preferred but not required:-  Working knowledge of hardware manufacturing processes-  Technical project/product management experience-  Experience in one or more of: RF Design/architecture, RF Test, RF application engineering, wireless system design, or related field.BSEE or equivalent work experience required. \n\nMSEE/MBA Preferred, but not required.Apple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "We invite you to join Apple's growing Wireless/RF EPM group. Our team is looking for a forward-thinking, hard-working, and motivated Engineering Program Manager to drive Apple’s new product introduction process for iPhone from prototype to mass production. If you are passionate about customer experience and thrive working alongside brilliant individuals, come join us!"}, "200430463": {"jobID": "200430463", "origin_search": null, "posted": "Oct 4, 2022", "jobTitle": "Senior Program Manager - Digital Customer Journeys", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200430463/senior-program-manager-digital-customer-journeys?team=MKTG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Education\n\nBA/BS or equivalent experience desired, MBA a plus"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$135,000", "max": "$242,000,"}, "benefits": null, "requirements": "High attention to detail and obsesses over customer experienceProactive self-starter; solutions-oriented with excellent analytical skills and data-driven decision making.Ability to collaborate cross-functionally and globally to leverage knowledge to gain competitive advantage. Proven ability to positively influence people across all functional areas of an organization.Builds bridges and fosters relationships; comfortable being a key point of contact and subject matter authorityOutstanding ability to problem solve, develop creative solutions, and work through ambiguity to define clarity, while maintaining an attention to detail.Deep knowledge of the global retail industry and digital commerce trends.Excellent verbal and written communication skills; demonstrated success building consensus for an innovative and bold vision, including presenting to executives.Proficient in Keynote and capable of crafting compelling, data-driven direction and storytelling.Experience in monthly payments, upgrade, ownership, loyalty programs a plusEducation\n\nBA/BS or equivalent experience desired, MBA a plus-  8-10+ years of experience in digital, retail, and/or other related commerce.-  Prior experience in customer journey definition, upgrade programs, and/or strategy roles a plus.-  Regular meetings with peers in Asia and Europe during overlapping business hours.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "Here at Apple, we don’t just create products — we build the kind of wonder that’s revolutionized entire industries. It’s the diversity of our people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple and help us leave the world better than we found it. \n\nJoin the Apple Retail Online Digital Experience and Merchandising team, and play a leading role in defining the experience and digital journey for customers navigating our Apple Online Store. The ideal candidate is customer-centric and able to set a clear vision for an outstanding experience. They are adept at simplifying the complex, collaborating across a highly matrixed organization, and have a highly strategic mindset, while also being willing and able to roll-up their sleeves and execute. They will possess strong analytical skills, be adept at project management, and have deep retail industry knowledge."}, "200452553": {"jobID": "200452553", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF Compliance Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452553/wireless-rf-compliance-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree with 3 or more years of relevant work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "You have experience and in-depth understanding of System Transceiver RF Parametric and RF component level characteristics and behaviors.You have working experience with lab equipment including network analyzers, signal generators, signal analyzers and call boxes (i.e., CMW/8960/UXM).Detailed understanding of at least one Wireless technology including 5G FR1, FR2, GSM, UMTS, CDMA, LTE, 802.11a/b/g/n/ac/ax and Bluetooth is a plus.Understanding of Antenna characteristics impact to radiated testing is preferred. Familiarity with radiated test setups, radiated chamber calibration and use are also a plus.Proficiency in MATLAB simulations, or STK, CST, HFSS simulation is a bonus.Knowledge on worldwide Regulatory standards in relation to carry a product to certification is a plus.Bachelor's Degree with 3 or more years of relevant work experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Apple Compliance Engineering team is looking for engineers to do wireless regulatory characterization and demonstrate regulatory compliance for different Apple products!"}, "200462797": {"jobID": "200462797", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "5G/4G Cellular Layer1 Control Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200462797/5g-4g-cellular-layer1-control-firmware-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Electrical Engineering or Computer Science or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum of 10 years of relevant industry experienceIn-depth hands-on experience with PHY L1 Software/Firmware in 3G/4G and/or 5G.Strong understanding of software engineering principles, and core computer science fundamentals.Strong understanding with C and/or C++, compilers, build and source code control tools.Experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programming.Working knowledge of computer architecture with particular emphasis on the HW/SW interfaces of high-speed communication subsystems.Experience with silicon prototyping, emulation systems, and virtual platforms.Strong experience with debugging embedded software systems.Familiarity with UARTs, JTAG, and oscilloscopes.Knowledge and experience of Matlab is a plusBS/MS in Electrical Engineering or Computer Science or equivalent", "jobDescription": "Join the Wireless Technologies and Ecosystems organization and be part of an outstanding team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide! As a Cellular Physical Layer Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for designing and productizing state-of-the-art cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to pivot on constantly evolving requirements."}, "200463829": {"jobID": "200463829", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "Engineering Manager, Windows Media", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463829/engineering-manager-windows-media?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Computer Science or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$155,500", "max": "$269,000,"}, "benefits": null, "requirements": "Proven track record as a hands-on Engineering ManagerYou have 3+ year managing a team while delivering high volume consumer softwareYou bring a track record of building strong multi-functional partnerships and leadership skillsComfortable working on tight schedulesYou are self-directed, analytical, and work well in a team environmentWe value strong problem solving and critical thinking skillsWe value your Passion for quality and attention to detailYOU BRING SIGNIFICANT EXPERIENCE IN ONE OR MORE OF THE FOLLOWING: (1) Windows development experience, or (2) iOS or OS X experience.Windows SDK/C/C++. Knowledge of Objective-C or Swift is a plusDigital Media Applications or framework developmentGraphics frameworksNetworking technologies, and client / server application developmentBS or MS in Computer Science or equivalent work experience.", "jobDescription": "What happens when the world’s most innovative engineers collaborate with the world’s most creative storytellers? TV gets reinvented. The Apple TV app team created and manage the Apple TV app on Apple and Windows platforms, which redefined and refined the way people watch their favorite shows, movies, and so much more — including everything they love from the major subscription services. Today, the team also manages one of the most exciting new realms at Apple: we bring viewers the critically acclaimed and award-winning Apple Originals in Apple TV+. \n\nThe Apple TV app makes it possible for people around the world to easily access content from multiple video providers on their devices while helping those video providers promote and monetize their work. At Apple, we work every day to create products that enrich people’s lives."}, "200452739": {"jobID": "200452739", "origin_search": null, "posted": "Feb 23, 2023", "jobTitle": "Large Display EE Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452739/large-display-ee-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 3 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "Consistent track record of leading projects and delivering products on time.Proven Technical Program or Project Management experience.Technical background with first-hand knowledge of any of cross-functional strengths.Good understanding of hardware and software integration challenges.Demonstrated ability to take initiative, develop and implement new processes.Experience in silicon chip development is a plusAbility to travel internationally; visit vendor sites, as needed.Excellent communication, organizational and leadership skillsBS + 3 years of relevant experience", "jobDescription": "Apple is looking for an extraordinary Engineering Program Manager to join the Display team! Prospective candidate will be driving program schedules and working with multi-functional team to resolve technical issues. This is an individual contributor role, helping lead the development process for silicon components and EE boards used in next generation Apple products. \n\nYou will lead program involving architecture scoping, prototyping, design, integration and launch of cutting-edge technologies for Apple devices."}, "200450075": {"jobID": "200450075", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Wireless MAC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450075/wireless-mac-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Very strong digital logic design fundamentalsExpertise in translating functional requirements into synthesizable Verilog or SystemVerilog RTLKnowledge of digital design flows such as RTL simulation and debug, synthesis, lint, STA and LECAbility to design multi-clock-domain logic and resolve CDC problems4+ years of experience in ASIC microarchitecture and RTL designUnderstanding of wireless standards, such as IEEE 802.11, 802.15, Bluetooth or 3GPP is a plusUnderstanding of ASIC low power design techniques, e.g. multiple supply domains configuration and management, dynamic power/clock scaling and power analysis is a plusFamiliarity with power estimation (vector-less and vector-based), modeling, profiling, and post silicon power correlationUnderstanding of ASIC test methodologies, including DFT, scan insertion, memory BIST, and others is a plusExcellent organizational skillsExcellent communications skills – both written and oral.BS and 10+ years of relevant industry experience.BS and 10+ years of relevant industry experience.", "jobDescription": "Come join Apple’s growing wireless silicon development team. Our wireless SOC organization is responsible for all aspects of wireless silicon development. With a particular emphasis on highly energy-efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture, and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. \n\nIf you enjoy a fast-paced and challenging environment and collaborating with people across different functional areas as well as thriving during crisis times, we encourage you to apply."}, "200433378": {"jobID": "200433378", "origin_search": null, "posted": "Nov 8, 2022", "jobTitle": "Cellular Systems Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200433378/cellular-systems-performance-analysis-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience with in system engineering/system performance analysis roleDeep knowledge of 5G and LTE PHY/MAC/Protocol stack, TCP/IPStrong scripting experience (Python preferred, Perl) and debuggingSW development and system design experience is a great plus.Knowledge of IOT protocols such as IEEE 802.15.4, Bluetooth, Zigbee or Thread Mesh is a plus.Home automation experience is a plus (Bluetooth, Zigbee, z-Wave, Thread Mesh)Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP standardsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering or equivalent", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200464059": {"jobID": "200464059", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "Formal Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464059/formal-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 10 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expert in SoC, CPU, GPU, and/or Cellular designs, as well as VLSI and digital logic design and verification techniques, or expert in formal tools and methodology and their application in and industrial settingDetail oriented mindset and desire to overcome challenges is requiredBS and a minimum of 10 years relevant industry experience.-  Formal Method or Formal Verification technologies experience and abstraction techniques-  Knowledge and experience in interpreting hardware specifications and using temporal logic assertion-based languages such as SVA or PSL or theorem provers-  Experience in using EDA formal tools and tool development experience is a plus-  Strong proficiency in any scripting language with excellent debugging skills-  Extraordinary teammate with excellent interpersonal skills-  Passionate about developing world-class/innovative formal verification solutions", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.\n\nWork with the best Formal Verification team in the world and acquire experience being at the center of a System-on-a-chip (SoC) design verification effort collaborating with design. Are you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly."}, "200448183": {"jobID": "200448183", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Graphics Hardware Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448183/graphics-hardware-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Orlando", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We would like you to have 3 years of relevant experience including:Strong background in verification of sophisticated hardware at system or component level with ability to debug issues across hardware and software.Deep knowledge of Computer Architecture and Memory sub-system micro-architecture.Expertise with various HDL simulators and waveform viewersStrong experience defining coverage space, writing functional coverage, analyzing results.Deep understanding of both RTL and gate-level simulation issues.Experience in GPU architecture and standards (OpenGL/CL, Vulcan, Metal) is desiredExperience with Python, Perl, Shell scripting, Makefiles, TCL is a plus.Experience with Formal Verification techniques and tools such as JasperGold is positiveAble to share ideas and collaborate under ambitious schedules.BS + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex problems? Do you intrinsically see importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining the Apple GPU group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this role, you'll be responsible for block and sub-system level pre-silicon RTL verification of embedded graphics cores. You will also support the top and post-silicon validation teams in ensuring the successful integration of our IPs into the full system."}, "200449273": {"jobID": "200449273", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Power Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449273/cellular-4g-5g-firmware-power-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience on working with power optimization methodologies as well as hands-on experience with power measurement tools, preferably in cellular technologiesAbility to work multi-functionally with different teams implement power verification test plan that will help achieve the outstanding modem targetsKnowledge in wireless systems, 4G/5G physical layer, protocol stack and procedures, power measurement and modem architecture, in particular C-DRX, Airplane modes, different sleep idle state transitionsValidated understanding of different interfaces like PCIe, USB, MPHY based RF-BB interconnects, frequency and voltage management and clocking schemesUnderstanding of SoC architectures, Fabrics, DDRs and DMAs will be an added plusShown track-record of innovation and hands-on experience in power measurement setup and test methodologyStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong understanding multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an outstanding modem team, we'll craft powerful embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world! As a Cellular 5G/4G Firmware Power Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on requirements."}, "200449312": {"jobID": "200449312", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Cellular 4G/5G Firmware Power Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449312/cellular-4g-5g-firmware-power-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Minimum BS and 10+ years of relevant industry experienceExperience on working with power optimization methodologies as well as hands-on experience with power measurement tools, preferably in cellular technologiesAbility to work multi-functionally with different teams implement power verification test plan that will help achieve the outstanding modem targetsKnowledge in wireless systems, 4G/5G physical layer, protocol stack and procedures, power measurement and modem architecture, in particular C-DRX, Airplane modes, different sleep idle state transitionsValidated understanding of different interfaces like PCIe, USB, MPHY based RF-BB interconnects, frequency and voltage management and clocking schemesUnderstanding of SoC architectures, Fabrics, DDRs and DMAs will be an added plusShown track-record of innovation and hands-on experience in power measurement setup and test methodologyStrong understanding of automation tools and scripting languages such as Python, C/C++, Java (a plus)Strong understanding multiple 4G/5G signaling and physical layer test equipment along with their automation interfacesExperience with network emulators, silicon prototyping, emulation systems, and virtual platforms a plusMinimum BS and 10+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an outstanding modem team, we'll craft powerful embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world! As a Cellular 5G/4G Firmware Power Verification Engineer, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded firmware verification, that thrives in a multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on requirements."}, "200458514": {"jobID": "200458514", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Virtuoso Custom CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458514/virtuoso-custom-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience in analog and digital new product development IC CAD support using EDA toolsSome experience supporting Cadence Composer Virtuoso, Layout tools, VXL, PCELLs, and CDFsExperience in programming languages such as DFII, Skill, Perl, TclProficient with Unix / Linux OS, utilities, and scriptingStrong communication skills in both oral and written.Minimum requirements of BS + 3 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient display and image sensors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows."}, "200458368": {"jobID": "200458368", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Virtuoso Custom CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458368/virtuoso-custom-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 3 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in analog and digital new product development IC CAD support using EDA toolsSome experience supporting Cadence Composer Virtuoso, Layout tools, VXL, PCELLs, and CDFsExperience in programming languages such as DFII, Skill, Perl, TclProficient with Unix / Linux OS, utilities, and scriptingStrong communication skills in both oral and written.Minimum requirements of BS + 3 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient display and image sensors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows."}, "200458521": {"jobID": "200458521", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Virtuoso Custom CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458521/virtuoso-custom-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Experience in analog and digital new product development IC CAD support using EDA toolsExpert in Cadence Composer Virtuoso, Layout tools, VXL, PCELLs, and CDFsDeep knowledge of programming languages such as DFII, Skill, Perl, TclProficient with Unix / Linux OS, utilities, and scriptingStrong communication skills both oral and written.Minimum requirements of BS + 10 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient display and image sensors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows."}, "200458863": {"jobID": "200458863", "origin_search": null, "posted": "Feb 27, 2023", "jobTitle": "SQA Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458863/sqa-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "- BS EE/CE/CS or equivalent (MS preferred)"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Demonstrates QA skills with at least 3 complete product cycles, from inception to customer shipment. Experience shipping customer facing products a plusExperience with hardware and/or software development lifecycleExperience with testing embedded consumer electronics or mobile devicesAbility to work with multi-functional and remote teams to collectively achieve test goalsStrong written and verbal communication as well as presentation skillsAbility to lead and drive testing of projects and featuresExperience with defect tracking systems (e.g. Jira, Bugzilla, etc.)- BS EE/CE/CS or equivalent (MS preferred)Nice to have:-  Understanding of Digital Audio, Bluetooth Audio, and Embedded Audio systems-  Ability to program or script in Python or other significant programming languages. (C++, Objective C, Ruby, JavaScript, etc.)", "jobDescription": "Are you interested in an exceptional opportunity to contribute on a highly motivated team passionate about ensuring quality user experiences happen on the world’s most creative and engaging consumer audio electronics products? \n\nThe Advanced Audio Devices SQA Team is seeking a highly driven, dynamic, and skilled test engineer with background in core audio and/or wireless technologies, guiding, and operating closely with the multi-functional teams to champion product quality of the AirPods product line.\n\nBring your passion to help us work collaboratively with our engineering partners to improve our software and hardware. Contribute as part of our diverse team of test engineers using flexibility and creativity to qualify features on our products that our customers love to use. You will use your unrivaled talents to help make our products more fun, reliable, and accessible to everyone!"}, "200461024": {"jobID": "200461024", "origin_search": null, "posted": "Feb 7, 2023", "jobTitle": "Apple Professional Learning Specialist", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200461024/apple-professional-learning-specialist?team=CORSV", "jobLocation": {"remote": "not specified", "city": "Cleveland", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "- Bachelor's degree required\n- Master's degree or Doctorate preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven experience as both a teacher and leader at the K-12 level;  Instructional design and coaching experience in a Higher Education setting or one-to-one learning environment is a plus.Familiarity with Common Core State Standards and content standards.Clear understanding of the fundamentals of instructional design.Exemplary leadership skills in the successful implementation of digital resources in instructing and classroom learning across multiple curricular areas.Experience improving basic skills and achievement across core content areas.Experience developing creative curriculums, specifically infusing digital resources to promote learning.Experience with professional development activities such as mentoring colleagues, offering workshops locally or nationally, presenting at conferences, etc.Experience delivering training and programs for students and parents on basic technology skills, the ethical and secure use of the Internet, and collaboration tools.Strong understanding of technology with hands-on knowledge of Apple products, software applications, and other education-related third party apps.Excellent knowledge and use of peripherals and apps to improve learning in areas such as math, science, social studies, English language arts and Special Education.Understanding of trends in the use of technology and national trends in education in general.- Bachelor's degree required\n- Master's degree or Doctorate preferredProven experience as a classroom teacher, instructional coach and/or curriculum consultant", "jobDescription": "The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nFor over 40 years, we’ve had the privilege of working alongside educators around the world. From that experience, we know that educators with powerful technology can unlock the unique genius in every learner, so they can make a difference.\n\nAs an Apple Professional Learning Specialist, you will help educational institutions transform their teaching and learning environments with Apple products. You will provide leadership and planning support, build professional learning plans, and offer hands-on instructional coaching and mentoring to support teachers in advancing their technology skills with an emphasis on innovation—to engage students in deeper learning.\n\nThis is a full-time corporate position with Apple for approximately one year. This annual support position is based onsite in the posting location."}, "200455973": {"jobID": "200455973", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Battery Management IC Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455973/battery-management-ic-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BSEE required plus 10+ years of relevant experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Proven experience in Battery Management architecture design and circuit developmentExperience with the specification and design of ADCs for Li_Ion parametric measurement, coulomb counting and other key parameters of a Battery Management systemSolid understanding of high resolution/accuracy ADC design and architecture technologies specifically of 1st/2nd order ∆∑ ADC and SAR architecturesFamiliarity with post processing ADC filtersIn depth understanding of performance improvement techniques such as dither, chopping and dynamic element matchingDeep understanding of circuit building blocks such as bandgaps, LDO’s, bias networks and clock oscillatorsKnowledge of Li-Ion Battery safety requirementsExperience with MATLAB/Simulink and Python or C programmingHands-on lab experience is a plusStrong initiative and ownership of responsibilities, productive, able to meet bold deadlinesGood written and verbal interpersonal skillsBSEE required plus 10+ years of relevant experience or equivalent\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "In this highly visible role, you will support the development of Battery Management ICs for Apple’s products. Your job is to define the requirements of such ICs and work closely with a vendor to implement those and ensure that they meet Apple’s high quality standards. The role involves working closely with different multi-functional teams within Apple as well as with external vendors. Occasional travel might be required.\n\nAt Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a forward-thinking and especially talented Battery Management IC Designer! We are looking to add a member to our dynamic group, who will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day!"}, "200448249": {"jobID": "200448249", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Cache Hierarchy Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448249/graphics-cache-hierarchy-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "At least 10 years of meaningful experience including:Experience developing unit or cluster level test environmentsExperience defining and executing unit level test plans. Expertise with verification languages such as SystemVerilogExperience with common verification methodologies such as UVMExpertise with HDL simulators and waveform viewers.Experience defining coverage space, writing coverage and coverage closureExperience working under strict schedule deadlines with the ability to manage multiple prioritiesStrong fundamental software and programming skillsExperience with cache verification and memory subsystem testing highly desired. Graphics architecture a plusExperience with Perl, Ruby, Shell scripting, Makefiles a plusExperience in leading or managing a team of engineers a plusBS + minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. \n\nThe Graphics Cache Hierarchy Verification Engineer will be responsible for the pre-silicon RTL verification of graphics memory subsystem units including Caches, Memory Management Unit, Interconnects and Link interface units. This includes deep understanding of the micro-architectural details of their block and how it works within the broader GPU design. A strong computer architecture background, and a solid foundation in verification methodology is required."}, "200452221": {"jobID": "200452221", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "CAD Flow Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452221/cad-flow-automation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of Bachelors Degree + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Experience in successfully completing/delivering projects.High ownership, self-sufficient, hands-on individual to drive quality across the project.Drive all the technical aspects of the flow and framework.Demonstrate innovative and creative thinking capabilities.Proficient with programming languages like Python, Perl, C++ etc.Strong programming, problem solving and communication skills.Experience with dashboards or tools like Splunk is a plus.Experience with version control tools like Perforce or Git a plus.Minimum requirement of Bachelors Degree + 10 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC)! You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, we will enable our customers to do all the things they love with their devices!\n\nIn this exciting and highly visible role, you will be responsible for architecting, and supporting a complex system that can be used to run various analysis, QA and release processes for a large set of IP’s. The role will require you to create specs, plan and execute activities by collaborating with CAD and design team colleagues."}, "200458928": {"jobID": "200458928", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Apple Silicon GPU Driver Engineer - Performance", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458928/apple-silicon-gpu-driver-engineer-performance?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSc, MSc, or equivalent experience in Computer Science, Computer Engineering, or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Excellent programming skills and knowledge of C/C++GPU programming with Metal, DirectX, Vulkan, CUDA, Direct Compute, OpenGL, or OpenCLInterest in diagnosing and fixing GPU performance issuesExcellent software design and problem solving skillsExcellent system debugging skillsExcellent written and oral communication skills including the ability to communicate clearly and concisely across multiple audiences to explain analytical outcomes and technical roadblocksBSc, MSc, or equivalent experience in Computer Science, Computer Engineering, or related field", "jobDescription": "We are looking for an engineer to join the Apple Silicon GPU Driver Performance Team, which is responsible for developing technology which helps make Apple Silicon GPUs blazingly fast. The ideal candidate will have a passion for squeezing the best possible performance out of the GPU, investigating forward-looking software and hardware architectures that enable new levels of GPU performance, and enjoys interacting with the low level details of the GPU architecture."}, "200458524": {"jobID": "200458524", "origin_search": null, "posted": "Jan 23, 2023", "jobTitle": "Virtuoso Custom CAD Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458524/virtuoso-custom-cad-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS + 10 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience in analog and digital new product development IC CAD support using EDA toolsExpert in Cadence Composer Virtuoso, Layout tools, VXL, PCELLs, and CDFsDeep knowledge of programming languages such as DFII, Skill, Perl, TclProficient with Unix / Linux OS, utilities, and scriptingStrong communication skills both oral and written.Minimum requirements of BS + 10 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient display and image sensors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows.\n\nAs a CAD Engineer of Custom Infrastructure Support, you will provide support for digital, analog and mixed-signal designs using Cadence. Responsibilities include general user support for both layout and schematic designers, tool customizations, Unix/Linux support and development testing of new tools and flows."}, "200435322": {"jobID": "200435322", "origin_search": null, "posted": "Oct 13, 2022", "jobTitle": "Lens Module Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200435322/lens-module-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "-  B.S. in Physics, Optical Sciences, EE, or equivalent\n\n-  M.S. or Ph.D. in Physics, Optical Sciences or EE preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Prior experience with building optical measurement setups, and performing hands-on measurements, preferably for imaging optics applicationsCapable of prototyping, conducting design of experiments, and analytical data processing-  B.S. in Physics, Optical Sciences, EE, or equivalent\n\n-  M.S. or Ph.D. in Physics, Optical Sciences or EE preferredPreferred Qualifications:-  Experience managing domestic and international vendors-  2+ years of industry experience in related fields", "jobDescription": "We are looking for an elite optical engineer to join a team that is making a big difference in the future of Apple. A successful candidate will not only need to develop new technologies and architect novel optical modules, but also educate a broad audience of people at Apple about their benefits and tradeoffs. The team features a broad engineering roster including optical engineers, human perception experts, product design engineers, and experimental physicists, which presents a unique opportunity to influence and learn from a diverse group of experts."}, "200458011": {"jobID": "200458011", "origin_search": null, "posted": "Jan 19, 2023", "jobTitle": "Wireless PHY Systems Scientist/Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458011/wireless-phy-systems-scientist-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS +10 years of relevant experience. Focus on Dig. Comm’s & Signal Proc., or equivalent is preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expertise in Digital Signal Processing, Wireless Communications, and wireless chip development.Proven grasp of complex wireless systems with strong capability to comprehend dependencies between system components and protocol layers and their interactions.Extensive hands-on SW programming skills for modeling and simulation of sophisticated systems from RF/PHY layer signals and channel modeling. All the way to MAC protocol/networking simulations; corresponding proficiency with Matlab/C/C++ required.Experience with fixed-point design and RTL vector generation. HLS experience is a plus.Experience with handling and processing large amounts of field and simulation data, including user-friendly visualization of complex test setups and simulation results, including measurement accuracies, system latencies, etc.Some familiarity with common analog/RF impairments encountered in wireless systems.Experience with and/or knowledge of industry standards such as Bluetooth, Ultra-Wideband, GPS, and/or other wireless protocols.Experience in lab FPGA/silicon bring-up, PHY/RF/MAC testing and debugging and usage of lab equipment.Some experience in IMU and/or camera/image signal processing, and/or some prior engagements in standards organizations or industry consortia are strong pluses.BS +10 years of relevant experience. Focus on Dig. Comm’s & Signal Proc., or equivalent is preferred.Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.", "jobDescription": "As a Wireless PHY Systems & Simulation Engineer, you will be a core member of our highly innovative and visible Wireless System-on-Chip (SoC) design team! What does that mean? You will help define modem architectures, develope physical-layer algorithms, and invent embedded DSP algorithms for chips enabling exciting new wireless applications! One emphasis of your specific role will be end-to-end simulation of sophisticated systems, modeling components from a multitude of signal processing fields. Including but not limited to propagation channel modeling, RF/antenna abstractions, PHY & MAC protocols and algorithms, and sensor fusion schemes to fuse wireless and non-wireless metrics. Application areas include ultra-wideband sensing and specialized wireless audio; products enabled or enhanced by our team’s SoC’s include specialized audio headsets (such as AirPods) and iPhones."}, "200452544": {"jobID": "200452544", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Next Generation Wireless Modem Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452544/next-generation-wireless-modem-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proven track record in design and prototyping of 4G/5G or IEEE 802.11/WiFi wireless systems.Experience with design and/or implementation of processing steps/algorithms for OFDM PHY receiver like channel estimation, Demodulation, Decoding and packet processing (e.g., MAC/RLC).Experience in defining system partitioning, control plane and data processing partitions, design mapping to different processing elements.Experience with prototyping or emulation of wireless designs using FPGA’s.Experience with performance benchmarking including resource utilization and power analysis for FPGA systems.Experience with AXI-based fabrics and high-speed interface protocols including MIPI, PCIe, Ethernet.Experience in memory sub-system architecture for baseband modem is a plus.BS and 10+ years of relevant experience.", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Smart people and inspiring, innovative technologies are the norm here. Are you ready to be part of a team transforming wireless technology? Come and work on challenges that no one has solved yet! We invite you to join us to help deliver the next groundbreaking Apple product."}, "200459382": {"jobID": "200459382", "origin_search": null, "posted": "Jan 30, 2023", "jobTitle": "Sr. Hardware Systems Design Electrical Engineer - iPhone", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459382/sr-hardware-systems-design-electrical-engineer-iphone?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS Electrical/Computer Engineering or equivalent required; MS preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Strong electrical engineering fundamentals including analog and digital designExperience working with dynamic multi-functional teamsExcellent verbal, written and presentation skillsExperience in several of the following areas:-- High speed digital design-- Schematic capture and PCB layout-- Hands-on lab experience with hardware bring-up and debug-- Fundamentals of signal and power integrity-- Understanding of low voltage power regulation solutions-- Integration of hardware into multi-functional systems-- Use of scripting languages to assist with hardware development-- Familiarity with the challenges of taking a product from design through to productionBS Electrical/Computer Engineering or equivalent required; MS preferredPosition will require some international travel", "jobDescription": "Do you have a feeling of deep happiness when a design decision that YOU were responsible for is showcased in a newly released product?  Do you just beam at the thought of “I made that!”?  Would you like to have that same feeling again, and again? \n\nThe iPhone team is looking for expert Hardware Design Engineers who are motivated by the chance to define design decisions, often difficult ones, that will benefit millions of iPhone users worldwide. Using your skills in Electrical Engineering as well as your board and system level knowledge, you can make a difference in so many lives!\n\nOur team is collaborative, creative and passionate about what we do and the products we make. We want to hear from you!"}, "200464591": {"jobID": "200464591", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "Manager, Health & Safety Innovation Environment and Supply Chain Innovation (ESCI)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464591/manager-health-safety-innovation-environment-and-supply-chain-innovation-esci?team=OPMFG", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree in Chemical Engineering, Mechanical Engineering, Occupational Safety, Industrial Hygiene or a related field; advanced degree preferred\n5+ years of experience in chemical and manufacturing related  safety management in global manufacturing settings"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$225,000,"}, "benefits": null, "requirements": "Proven track record of developing and managing health and safety programsStrong leadership skills with experience in managing and mentoring teamsExcellent communication skills with the ability to collaborate and influence both internal and external stakeholdersStrong analytical skills with the ability to analyze data and formulate strategic recommendationsDeep knowledge of relevant safety regulations and industry standards including machine safety, hierarchy of safety controls and green chemistryExperience in developing and implementing safety protocols and proceduresExperience managing complex programs including setting goals, vendor management and executing to roadmap with cross-functional dependenciesBachelor’s degree in Chemical Engineering, Mechanical Engineering, Occupational Safety, Industrial Hygiene or a related field; advanced degree preferred\n5+ years of experience in chemical and manufacturing related  safety management in global manufacturing settingsExcellent communication and presentation skillsExperience directly managing teams and budgetsExperience with supply chain automationExperience with implementing green chemistry principlesCertification in industrial hygiene, functional safety and/or hazard materials managementWillingness to travel domestically and internationally (10% time)", "jobDescription": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. \n\nThe Environment and Supply Chain Innovation (ESCI) group is seeking a dynamic leader who can drive change and develop leading occupational health and safety practices for emerging manufacturing technologies in our global supply chain. People come first in everything we do at Apple. This includes ensuring the safety and well-being of those working in our supply chain. In this critical role, you will have the opportunity to make a real difference by playing a key role to shape the future of both mechanical and chemical related safety best practices. Join us and lead a global team to advance our vision for a safer, sustainable, and more resilient supply chain.\n\nThe ideal candidate is a passionate and experienced safety professional with a track record of driving positive change cross-functionally."}, "200451129": {"jobID": "200451129", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451129/embedded-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Minimum requirement of a bachelors degree"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$50.72", "max": "$76.44/hr,"}, "benefits": null, "requirements": "Proficient in C or C++Experienced with embedded software, bare metal.Minimum requirement of a bachelors degreeFamiliar with boot code, low-level OS code, device drivers, and IO devicesExperience with computer initialization, SoC bring-up, debuggers, and networkingExperience with FPGA, Verilog, HDLUnix system-level programming, embedded LinuxScripting (Python, Bash, Perl, TCL, Lua)Experience with Xilinx Zynq or Altera SoC platformWorking knowledge of schematics and lab equipment", "jobDescription": "At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.\n\nFirmware and systems engineer for board management controllers and related projects. Platforms: Embedded Linux, bare metal, and Mac/Linux controlled laboratory devices. Secondary responsibilities include but are not limited to: hardware specification and schematic review, embedded Linux infrastructure, regression and release systems, utilization tracking, regression/release systems, and manufacturing support for a cross-functional team.\n\nApple designs many product-destined SoCs and test chips each year; each one has multiple complex bring-up and characterization boards designed for them; our team enables our full suite of firmware for each board to enable both in-person and remote bring-up, analysis, and debug of the silicon in person and at scale."}, "200443089": {"jobID": "200443089", "origin_search": null, "posted": "Nov 16, 2022", "jobTitle": "System Silicon Program Manager (SSPM)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443089/system-silicon-program-manager-sspm?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "MS or BS Degree in technical discipline"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "We're looking for someone with 5+ years of experience in SOC/VLSI Chip Design, ASIC Chip Design, or Technology process development.You have 1+ year of Technical Program or Project Management experience, Systems Support/Customer Support experience.We're looking for experience working in a dynamic engineering environment, strong at multi-tasking, and real-time crisis management!Strong desire to own/drive project development across multiple discipline teams.Experience working with ASIC & VLSI design flows, and leading silicon projects from concept to production.Great leadership and communication skills!MS or BS Degree in technical discipline", "jobDescription": "Do you love bringing calm to even the highest-intensity projects? Do you have a passion for working across a diverse set of disciplines? Our Engineering Project Management group acts as the hub between an exceptionally diverse collection of personalities and ideas. As part of our group, you’ll manage, organize, and support engineering development projects across Apple. You’ll take ownership of projects and handle every aspect from conception to production. You’ll also establish relationships across the company, guiding the work as it’s refined by your colleagues in engineering, marketing, and other teams. Together with our team, you’ll continue to uphold the world’s most successful product design process, bringing our magical technology to market seamlessly from concept through release.\n\nAs a System Silicon Program Manager, you will utilize your Program / Project management skills to drive system silicon plans and system silicon development process with system and cross functional teams at Apple. This is an individual contributor role with significant responsibility on managing system silicon requirements and needs. The SSPM will be responsible for driving system silicon plans and silicon problems resolution in timely manner to meet system build plans and production ramp. Role encompasses driving full system silicon cycle from initial system silicon plans, system silicon validation and qualification to mass production."}, "200452664": {"jobID": "200452664", "origin_search": null, "posted": "Jan 18, 2023", "jobTitle": "Product Design Engineer - iPad", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452664/product-design-engineer-ipad?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS in Mechanical Engineering or related field"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "High degree of motivation, curiosity, passion and creativity. You are not expected to be a technical expert, but you should be excited to learn as much as possible and apply your knowledge in new and creative ways!Design intelligence: mechanical intuition, creative problem solving, spatial reasoning, attention to detailEngineering fundamentals: statics, strength of materials, material science, statisticsExcellent communication skills: written, visual, and verbal. Ability to clearly convey design ideas and contribute to brainstorms3D CAD experience with any program. 2D drafting and GD&T a plusIndustry experience in the form of internships or design projects a plusInterested in traveling up to 10-20% throughout the year0-2+ yrs Mechanical Design industry experienceBS or MS in Mechanical Engineering or related field0-2+ yrs Mechanical Design industry experience", "jobDescription": "The iPad Product Design Team is a close-knit group of mechanical design engineers who work with a singular focus...to surprise and delight our customers with truly great products. At Apple, you will work alongside talented engineers and technology experts at the top of their fields while leveraging the tools, resources, and support of the world’s leading hardware company. We have a firm commitment to equity and diversity, recognizing that each employee contributes a wealth of perspectives to our culture. We seek to tap into this extraordinary resource and incorporate it into how we do business. Come join us and be empowered to generate the best and most impactful work of your life!"}, "200347073": {"jobID": "200347073", "origin_search": null, "posted": "May 1, 2022", "jobTitle": "Senior Software Engineer - Mass Storage", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200347073/senior-software-engineer-mass-storage?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "Bachelor's degree in CS/CE/EE ( or equivalent, or related field ). MS Preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "At least 5 years of relevant experience.Expert level C/C++ programming skills is a must.Experience with multi-threaded programming is a must.Experience with software debuggers (e.g. gdb, lldb) and tracing tools ( e.g. dtrace ) is a must.Should be proficient in Operating Systems and kernel architecture.Expert understanding of SCSI-based storage protocols ( e.g. SAS, parallel SCSI ) and SCSI commands sets ( e.g. SPC, SBC, MMC ).Familiarity with low level storage protocols like SATA, AHCI or NVMe is a plus.Familiarity with low level bus protocols such as PCIe, USB, and Fibre Channel is a plus.Experience using bus protocol analyzers is a plus.Understanding and using a bug management system is a plus.Experience presenting to senior management and partner teams is a must.Bachelor's degree in CS/CE/EE ( or equivalent, or related field ). MS Preferred.", "jobDescription": "Are you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices.\n\nBe a leading member of the engineering team creating next-generation storage technologies for all Apple platforms! We are looking for a Senior Storage Software Engineer and Hands-on Architect with an extensive background in Operating Systems, SCSI protocols, block storage stacks, IO performance/characterization, strong programming skills and experience leading design and development efforts."}, "200451404": {"jobID": "200451404", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer – Design Verification Flows and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451404/cad-engineer-design-verification-flows-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS+ 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Familiarity with Verilog and SystemVerilog is a plus.Familiarity with Xcelium or Modelsim or Synopsys VCS is required.Good communications skills are required and prior customer support experience is a plus.Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.Familiarity with Verdi, Indago and/or SimView is a plus.Scripting/coding abilities in Python/Perl is required.Good communications skills are required.Knowledge of C/C++ or any other OOP programming language is a plus.Proven track record dealing with customers internal or external would be a plus.Minimum requirement of BS+ 10 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world."}, "200451413": {"jobID": "200451413", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer – Design Verification Flows and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451413/cad-engineer-design-verification-flows-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS+ 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Familiarity with Verilog and SystemVerilog is a plus.Familiarity with Xcelium or Modelsim or Synopsys VCS is required.Good communications skills are required and prior customer support experience is a plus.Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.Familiarity with Verdi, Indago and/or SimView is a plus.Scripting/coding abilities in Python/Perl is required.Good communications skills are required.Knowledge of C/C++ or any other OOP programming language is a plus.Proven track record dealing with customers internal or external would be a plus.Minimum requirement of BS+ 10 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world."}, "200451519": {"jobID": "200451519", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer – Design Verification Flows and Methodology", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451519/cad-engineer-design-verification-flows-and-methodology?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirement of BS + 10 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Familiarity with Verilog and SystemVerilog is a plus.Familiarity with Xcelium or Modelsim or Synopsys VCS is required.Good communications skills are required and prior customer support experience is a plus.Experience writing or maintaining the script or Makefile that builds the simulation program from RTL is a plus.Familiarity with Verdi, Indago and/or SimView is a plus.Scripting/coding abilities in Python/Perl is required.Good communications skills are required.Knowledge of C/C++ or any other OOP programming language is a plus.Proven track record dealing with customers internal or external would be a plus.Minimum requirement of BS + 10 years of relevant industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions! Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In the CAD organization, you will get to create new software and technologies that will enable other Apple engineers to create products for millions of customers across the world."}, "200464044": {"jobID": "200464044", "origin_search": null, "posted": "Feb 22, 2023", "jobTitle": "CoreOS Software Engineer, Process Management & Lifecycle", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200464044/coreos-software-engineer-process-management-lifecycle?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in Computer Science or equivalent knowledge and experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Passion for low-level system technologiesFluency in the C programming language, exposure to object-oriented programmingExperience with UNIX-like systemsSystem design and architecture skillsStrong understanding of operating system fundamentals like threading, synchronization primitives, inter-process communication, scheduling, and virtual memoryExcellent collaborative skills, with the ability to work with a team to design system architectureA genuine passion for consumer devicesBS/MS in Computer Science or equivalent knowledge and experience-  Additional Success Factors:-  Knowledge of operating system implementation-  Skilled at interface and/or API design-  Experience with common embedded hardware architectures-  Familiar with cryptographic concepts and techniques-  Familiar with open source technologies and development communities such as Darwin, FreeBSD, Linux, etc.-  Development experience on macOS and/or iOS-  Familiar with XcodeApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in significant ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.Apple is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure equal opportunity for all applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics. Apple is committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Apple is a drug-free workplace.", "jobDescription": "The Core Darwin team in Core OS is looking for enthusiastic engineers interested in developing low-level system technologies for Apple’s operating systems. Darwin is the UNIX-like foundation at the heart of all Apple’s operating systems, stretching from the kernel up through low-level user components. These technologies provide a high quality, robust, and performant foundation on which iOS and macOS frameworks and applications are developed.\n\nThe Core OS organization is seeking an extraordinary engineer to work on state-of-the art technology for macOS, iOS, tvOS and watchOS. You should have a strong understanding of operating system fundamentals and experience working throughout the stack. As a member of the team, you would participate in all stages of software development, from new feature design and implementation, to maintenance and bug fixing of released code. You will develop and improve unit tests and performance tests, and may also work on diagnosing and resolving customer reported issues."}, "200449693": {"jobID": "200449693", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Power Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449693/cpu-power-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceThe ideal candidate should have broad knowledge related to software, operating systems, computer system organization, circuit analysis and logic design.Familiarity with high performance CPU architectureKnowledge of logic design principles along with timing and power implicationsSolid C programming and perl/python scripting experienceStrong CMOS design and analysis skillsStrong hands on lab experience characterizing and productizing power management featuresMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nWe are looking for a strong candidate to join our CPU team focusing on power modeling and reduction, prototyping and correlating pre-silicon expectations with post silicon measurements. In this highly visible role, you will be interfacing with multiple disciplines, with a critical impact on getting power efficient products to millions of customers quickly."}, "200351540": {"jobID": "200351540", "origin_search": null, "posted": "Sep 28, 2022", "jobTitle": "Input Device Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200351540/input-device-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in relevant field (EE, CS. Computer Engineering)\n5+ years HW development engineering in a team environment\nSuccessfully shipped one or more consumer or industrial products"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong expertise in embedded systems with focus on meeting tight constraints on power and miniaturizationProven track record in shipping products built upon MCUs and wireless connectivityAbility to identify tradeoffs between performance, power, latency, and know how to optimize system designs to meet requirementsSolid EE fundamentalsWorking knowledge of haptics and/or audio transductionWorking knowledge of signal integrity and power integrity in constrained systemsWorking knowledge of DC power conversion and Class-D amplifiersProficiency with Matlab, Python, SysML, or similar modeling toolsExperience with wireless and/or networking technology a plusEmbedded programming skills a plus.BS/MS/PhD in relevant field (EE, CS. Computer Engineering)\n5+ years HW development engineering in a team environment\nSuccessfully shipped one or more consumer or industrial products", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it!"}, "200452729": {"jobID": "200452729", "origin_search": null, "posted": "Dec 21, 2022", "jobTitle": "Wireless RF Compliance Validation Engineer - Inductive Charging", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452729/wireless-rf-compliance-validation-engineer-inductive-charging?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree with 3 or more years of relevant work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Practical knowledge of inductive charging hardware, architectures and system considerations as it related to emissions.Experience with performing regulatory tests including spurious emissions, occupied bandwidth, frequency accuracy, spectral mask, etc. at either conducted or radiated environments.Experience with hands-on disassembly and making of experimental modifications to intricate hardware as part of debugging issues.Experience using lab equipment including spectrum analyzers, power meters, network analyzers, vector signal generators/analyzers and oscilloscopes.Working knowledge of EM and radiated theory inside portable wireless devices including accurate grounding, shielding, and radiated emissions mitigation techniques is a plus.Experience with circuit-level and system-level simulations is a bonus.Strong technical reporting, presentation and communication skills.Bachelor's Degree with 3 or more years of relevant work experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day! Apple's Wireless Systems Compliance Engineering team is looking for a hardworking, proactive individual to take ownership for ensuring inductive charging products meet all worldwide Regulatory requirements!"}, "200447895": {"jobID": "200447895", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Cellular Layer1/Firmware Triage and Target Support Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447895/cellular-layer1-firmware-triage-and-target-support-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS + 3 years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Minimum BS + 3 years of relevant industry experienceExperience with embedded real-time software system bring-up, debug, and testProficiency in debugging embedded multi-mode software systemsFamiliarity with ETM, ETB, JTAG, HW breakpoints, Lauterbach, TRACE32 andany other trace and debug SW/toolsExperience in real-time tracing systemsExperience in scripting languages like Perl and PythonUnderstanding of 5G and 4G 3GPP standards, or similar Wireless standards(2G,3G, WiFi) and proficient knowledge on Physical Layer control is a plusMinimum BS + 3 years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, we'll diagnose sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new cellular technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world.\n\nAs a Cellular Layer 1 Firmware Engineer on this team, you will be at the center of the 5G/4G/multimode cellular firmware effort within a silicon design and firmware development group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to challenge what exists openly, and is flexible enough to shift on constantly evolving requirements."}, "200443823": {"jobID": "200443823", "origin_search": null, "posted": "Nov 15, 2022", "jobTitle": "Sr Panel Process Engineer (Touch Sensor team)", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443823/sr-panel-process-engineer-touch-sensor-team?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "phd", "major": "Ph.D. or Master degree in Physics, Chemistry, Material Science, Mechanical Engineering and or related Engineering background"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$121,000", "max": "$230,000,"}, "benefits": null, "requirements": "5+ years of relevant industry experienceProven track record and hands-on experience in photolithography, etching, thin film process integration, or nano imprint, inkjet, advanced dispensing, gravure coating, and other patterning technologies.Strong knowledge on optical film process, capacitive touch sensor.Demonstrated ability to perform DOE, SPC, Failure Analysis is a must.Experience in materials characterization: SEM, EDX, AFM, XRD, etc.Ability to travel internationally.Strong will power to push critical issues to closure with high working efficiency.Preferred:Knowledge and working experience of flexible or glass substrate, optical design, optical/chemical process simulation, array, color filter and touch sensor process development is highly desirable.Experience in materials characterization: SEM, TEM/FIB, EDX, AFM, XRD, DSC, etc.Experience working with off shore suppliers and manufacturersA working understanding of high volume manufacturing processesPh.D. or Master degree in Physics, Chemistry, Material Science, Mechanical Engineering and or related Engineering background", "jobDescription": "Apple is looking for a world-class Senior Panel Process and Optics Engineer with touch sensor and optical film process experience to join the PPO Engineering team.\n\nSenior Panel Process and Optics engineers must have a strong technical background in a relevant technical field, for example display, semiconductor or touch panel patterning process and fabrication. A successful candidate will work within a cross-functional team to realize next-generation sensor technologies. This position demands technical strengths, together with great communication and organizational skills."}, "200455300": {"jobID": "200455300", "origin_search": null, "posted": "Jan 9, 2023", "jobTitle": "SoC Design Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455300/soc-design-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum of BS + 0 years relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Knowledge of computer architecture and digital design fundamentals-  Knowledge of Verilog or SystemVerilog, digital simulation and debug-  Experience with Python, Perl, or similar scripting language-  Ability to work independently to deliver the project goals-  Experience with C/C++, assembly is a plus-  Excellent interpersonal skills and the dream to take on diverse challengesMinimum of BS + 0 years relevant industry experience", "jobDescription": "Does making the next great technology product excite you? Imagine what you could do here. At Apple, our new ideas have a way of becoming great products, services, and customer experiences very quickly. We bring passion and dedication to our job and when you are a part of that team there's no telling what you could accomplish. Design Verification Engineers at Apple are responsible for verifying the functionality and performance of Apple’s premier SOCs. This is a critical job within Apple's Hardware Technology and we'd love to have you join us."}, "200351548": {"jobID": "200351548", "origin_search": null, "posted": "Sep 28, 2022", "jobTitle": "Embedded Systems Audio Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200351548/embedded-systems-audio-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS/MS/PhD in relevant field (EE, CS. Computer Engineering)\n5+ years HW development engineering in a team environment\nSuccessfully shipped one or more consumer or industrial products involving audio"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Strong expertise in embedded systems with focus on audio and real-time performanceProven track record in shipping products built around modern SOC (system on chip) architectureAbility to identify tradeoffs between performance, power, latency, and know how to optimize system designs to meet requirementsSolid EE fundamentalsGood understanding of audio signals (formats, interface types, sampling theory, basic DSP)Working knowledge of signal integrity and power integrity in constrained systemsWorking knowledge of DC power conversion and Class-D amplifiersProficiency with Matlab, Python, SysML, or similar modeling toolsExperience with wireless and/or networking technology a plusEmbedded programming skills a plus.BS/MS/PhD in relevant field (EE, CS. Computer Engineering)\n5+ years HW development engineering in a team environment\nSuccessfully shipped one or more consumer or industrial products involving audio", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it!"}, "200441525": {"jobID": "200441525", "origin_search": null, "posted": "Nov 3, 2022", "jobTitle": "Display Electrical Architecture Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441525/display-electrical-architecture-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS/PH.D. EE degree or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Proficient electrical engineering background, especially in analog or mixed- signal circuit designExperience with simulation tools, for example, Matlab or Cadence  Hands-on lab experienceExcellent written and verbal communication skillBS/MS/PH.D. EE degree or equivalent", "jobDescription": "Apple is looking for an extraordinary Display Electrical Architecture Engineer to join the Display team. Display Electrical Architect must be out-of-box problem solver and will define the next generation display electrical architecture. A successful candidate will define the future display roadmap, help design qualification and be responsible for high quality engineering specification, analysis, verification and validation along the way. This position demands deep technical strengths in mixed-signal circuit design."}, "200277007": {"jobID": "200277007", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Display Electrical Architecture Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200277007/display-electrical-architecture-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS/PH.D. EE degree or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proficient electrical engineering background, especially in analog or mixed- signal circuit designExperience with simulation tools, for example, Matlab or Cadence  Hands-on lab experienceExcellent written and verbal communication skillBS/MS/PH.D. EE degree or equivalent", "jobDescription": "Apple is looking for an extraordinary Display Electrical Architecture Engineer to join the Display team. Display Electrical Architect must be out-of-box problem solver and will define the next generation display electrical architecture. A successful candidate will define the future display roadmap, help design qualification and be responsible for high quality engineering specification, analysis, verification and validation along the way. This position demands deep technical strengths in mixed-signal circuit design."}, "200375302": {"jobID": "200375302", "origin_search": null, "posted": "Sep 20, 2022", "jobTitle": "CoreOS Quality Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200375302/coreos-quality-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S. in Computer Science or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Advanced experience with UNIXSolid understanding of the fundamentals of operating systemsProgramming skills in C , Python or swiftExperience using a debuggerExcellent collaborative skills with outstanding verbal and written communication abilitiesUnderstanding of software development workflows and standard methodologiesB.S. in Computer Science or equivalent experience", "jobDescription": "In the Core Operating Systems group, you’ll ensure the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices.\n\nApple’s CoreOS organization is seeking a highly motivated test engineer to join the Core Darwin QA team. We recognize that the quality of our software is only as good as that of our testing. The right candidate for this position enjoys finding creative and unexpected ways to torture bits, from both white- and black-box perspectives."}, "200450897": {"jobID": "200450897", "origin_search": null, "posted": "Dec 16, 2022", "jobTitle": "Embedded 5G/4G Cellular Physical Layer DSP Firmware Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450897/embedded-5g-4g-cellular-physical-layer-dsp-firmware-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceExperience implementing digital signal processing algorithms using special purpose digital signal processing HWUnderstanding of 5G and 4G 3GPP protocolsDeep understanding of software engineering principles, and core computer science fundamentalsFundamental facility with C and C++, compilers, build and source code control toolsSignificant experience with memory constrained Real Time Operating Systems (RTOS) and concurrent programmingSolid understanding of computer architecture with particular emphasis on the HW/SW interfaces of high speed communication subsystemsExperience with silicon prototyping, emulation systems, and virtual platformsProficiency debugging embedded software systems. Familiarity with UARTs, JTAG, and oscilloscopesSome mainstream OS application level development and Python or Perl scripting experienceMinimum BS and 3+ years of relevant industry experience", "jobDescription": "Do you have a passion for invention and self-challenge? As part of an extraordinary modem team, you'll craft sophisticated groundbreaking embedded firmware that deliver more performance in our products than ever before! We'll work across subject areas to transform improved hardware elements into a single, coordinated design. Join us, and you’ll help us innovate new wireless systems technologies that continually outperform the previous iterations. By collaborating with other product development groups across Apple, you’ll push the industry boundaries of what wireless systems can do and improve the product experience for our customers across the world. As a Wireless Embedded Physical Layer DSP Firmware Engineer on this team, you will be at the center of the embedded 5G/4G/multimode cellular firmware effort within a silicon design group responsible for crafting and productizing groundbreaking cellular SoCs. This position requires someone comfortable will all aspects of embedded software development, that thrives in a multifaceted multi-functional organization, is not afraid to debate ideas openly, and is flexible enough to shift on constantly evolving requirements."}, "200466000": {"jobID": "200466000", "origin_search": null, "posted": "Mar 1, 2023", "jobTitle": "GPU Pre-Silicon Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200466000/gpu-pre-silicon-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + 10 years of relevant experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "Relevant GPU design experienceProven experience in technical leadership and/or project management experienceStrong communication and executive presentation skillsStrong time and task leadership skills with consistent attention to detailTechnical depth in one or more areas (architecture, logic, verification, physical design) and sufficient knowledge of others to understand tradeoffs and challenge the teamEqually comfortable in big-picture strategy and deep technical discussionsCan work collaboratively across multiple sites and multi-functionally throughout the entire organizationAble to build trust and lead through influenceComfortable navigating tough situations, balancing priorities and managing constraints while running sophisticated, fast-paced, programsDriven to continuously improve processes, methodologies, and toolsBS + 10 years of relevant experience", "jobDescription": "Come and join the team that delivers the GPUs in the M1/M2 Mac, iPhone, iPad, and Apple Watch! At Apple, we focus on innovative design and disciplined execution to build the most efficient GPUs that scale across our full range of products and deliver industry-leading power and performance. We work together across hardware, software, and systems teams to build truly optimized products and fantastic user experiences. To accomplish this, we need technical excellence combined with the expertise to work across the organization and to put each decision in the right context.\n\nWe are looking for a dedicated Engineering Program Manager or a technical leader who is passionate about getting into program management and inspiring the team to collaborate and deliver innovative designs within schedule constraints. The ideal candidate needs to be able to dig into sophisticated technical topics while balancing the strategic needs of the project and the tradeoffs involved in technology development.\n\nThe GPU Engineering Project Manager will be working closely with the GPU architecture, logic design, verification, physical design, DFT, and debug teams, as well as SoC, software, system, and others to drive the full program lifecycle from spec definition through execution, tapeout, and support of post-silicon activities and debug."}, "200459901": {"jobID": "200459901", "origin_search": null, "posted": "Mar 4, 2023", "jobTitle": "FPGA Design Engineer - Instrument Engineering", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459901/fpga-design-engineer-instrument-engineering?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor’s degree is needed, and we highly value Master’s or above. Relevant disciplines include Electrical Engineering, Computer Engineering, Computer Science, Math, Physics and other Engineering domains."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience designing RTL for high speed or multiple clock domain designs.Experience debugging FPGA with logic analyzers and oscilloscopesKnowledge of RF and DSP fundamentals.Strong interpersonal skillsInternational travel of 10% is requiredBachelor’s degree is needed, and we highly value Master’s or above. Relevant disciplines include Electrical Engineering, Computer Engineering, Computer Science, Math, Physics and other Engineering domains.-  2+ years experience designing modem or DSP algorithms in FPGAs or ASICs and successfully shipping products based on them-  3+ years experience optimizing the segmentation of the design for a target FPGA, synthesizing for FPGA and driving timing closure-  Experience with Xilinx Zynq platform and Microblaze-  Experience optimizing algorithms for power or execution speed", "jobDescription": "Do you have a passion for solving big challenges? Do you love pushing the limits of what’s considered feasible? As part of our Wireless Hardware group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world. On this team, you’ll help improve the performance of our products through innovative system-on-chip designs. You and your team will build platform architecture that paves the way for all-new experiences, including the ones that allow people to take advantage of our innovations in sensor technology. Together, our goal is to ensure nothing stands in the way of our customers’ connections with their devices. \n\nJoin us and help build world-renowned wireless systems that connect customers to their world like never before. This small team of extraordinary engineers designs and produces precision RF and Analog Test Equipment for use in calibrating and testing cellular, 5G, WiFi, BT, mmWave, UWB and NFC radios in millions of iPhones, iPads, Macs and Watches. All members of the team bring their own unique expertise to collectively take internal Apple products from concept to mass production. Each internal product is designed to Apple's exacting standards resulting in breathtaking test equipment that maintains the quality, accuracy and function of commercially available offerings."}, "200448730": {"jobID": "200448730", "origin_search": null, "posted": "Dec 9, 2022", "jobTitle": "SoC Security Engineer, Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448730/soc-security-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 10+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 10+ years of relevant industry experienceSolid background of applied cryptographyWorking experience in definition of secure systemsExperience in threat modeling and weaknesses analysisKnowledge of SoC architecture, microprocessor architecture a plusExposure to OS securityExcellent interpersonal skillsAbility to independently pursue new ideas and innovationsGood knowledge of Verilog/VHDLExperience in C/C++ and interpretive language such as Perl/PythonBS and 10+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, intelligent people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same real passion for innovation that goes into our products also applies to our practices strengthening our dedication to leave the world better than we found it. \n\nWe are looking for an experienced Security Engineer with experience spanning both hardware and software. You will work with a multi-functional engineering team to define, design, and verify security systems. Join us to help deliver the next groundbreaking Apple product!"}, "200450295": {"jobID": "200450295", "origin_search": null, "posted": "Dec 17, 2022", "jobTitle": "Software Engineer - Embedded Systems", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450295/software-engineer-embedded-systems?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor or Master degree in Computer Engineering, Computer Science, or Electrical Engineering."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Embedded firmware or kernel driver development in C or C++Experience with advanced micro-controllers or kernel level SoC programmingExperience with at least one peripheral protocol; e.g. I2C/SMBus, UART, SPI, USB, Network stack etcExperience writing command line tools (either C or scripting)Ability to read schematicsA focus on generating stable code through detailed testingExperience with code management tools like GitExcellent communication and collaboration skillsBachelor or Master degree in Computer Engineering, Computer Science, or Electrical Engineering.", "jobDescription": "The Apple SMC Platform group is seeking engineers to work on the software and firmware for the SMC (System Management Controller) in a wide range of Apple products!\n\nThe position requires high-level thinking to architect solutions across a variety of hardware, along with low-level programming skills and a passion for focusing and committing. Working on this technology you will have the opportunity to have a major impact on the implementation and quality of Apple's next generation products. Our environment cultivates innovation and rapid product iteration within a creative solution space."}, "200458683": {"jobID": "200458683", "origin_search": null, "posted": "Jan 20, 2023", "jobTitle": "IC Package Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458683/ic-package-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "- BS and 3+ years of relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "As the IC Package Design Engineer, you demonstrate fundamental knowledge or proven experience in the following:Proven fundamentals in the electrical/material/thermal/ or mechanical engineering field(s).Familiarity with various sophisticated package configurations and assembly/ substrate technology (wirebond, POP, etc.).Experience in package design and proficient in Cadence Allegro platform tools (PCB Editor, Advanced Package Designer, APD/SiP) or Mentor Xpedition platform tools.Basic understanding in some SI/PI tools (XtractIM, PowerSI, HFSS, Q3D, etc.), package model extraction, S-parameters and RLGC model.Basic knowledge of substrate manufacturing process, structure, design rules and material property.Proven understanding of high-speed interfaces, including DDR, PCIe, NAND, etc.Exposure to Unix environment, scripting languages (PERL, Python, TCL and or shell) and methodology.BS and 3+ years of relevant industry experience.Preferred Skills:Familiarity with CAM350/Valor or Calibre and CAD and experience with package design reviews.Knowledge of high-speed layout constraints (crosstalk mitigation, differential pairs, EMI/RFI, PCB/package resonance).Design experience with RFIC and 5G packages, SIP or module schematic and layout design experience.Solid understanding of Design Rules Check and Design for Manufacturing.- BS and 3+ years of relevant industry experience.", "jobDescription": "Do you have the attention for details and love for excellence to work towards an extraordinary result? Envision what you could do here! At Apple, we believe new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish!\n\nOur Hardware Technology Packaging team invents, designs, develops and integrates electronic packaging solutions for Apple’s internal and custom external components of hardware for its consumer electronic products such as iPhone, iPad, Mac, Apple Watch, Apple TV, etc.\n\nIn this highly visible role, you will own and drive sophisticated package selection, new generation product package structure and configuration optimization. You will be responsible for Package/SIP/module physical design and layout, optimization, DV and tape out; and work with multi-functional teams to achieve optimized mechanical/electrical/ thermal performance for various types of chips."}, "200456935": {"jobID": "200456935", "origin_search": null, "posted": "Jan 12, 2023", "jobTitle": "SoC Embedded Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200456935/soc-embedded-software-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and a minimum of 3 years relevant industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "3+ years of embedded software experience, including debugging and characterization.Exposure to SoC bring up.Expert embedded C programmer.Experience using laboratory equipment (e.g., logic analyzer, digital oscilloscope).Experience reading and working from device and board schematics.BS and a minimum of 3 years relevant industry experience.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.  At Apple, we go beyond the industry norm and demonstrate creativity in problem solving, ability to think dynamically and outside of standard convention, and adapt quickly to new technical areas. We promote innovation and new technology. The people who work here have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and a multitude of groundbreaking Accessories. We have done the same with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our dedication to leave the world better than we found it. You should join us to help deliver the next amazing Apple product!  Joining Apple as a SoC Embedded Software Engineer, you will craft and implement embedded software for System on a Chip (SoC) bring up and test. You will write software for Apple silicon in a bare metal environment and work closely with the Silicon Validation and Software Engineering teams to bring up new silicon and ensure the quality of every device when manufactured."}, "200450146": {"jobID": "200450146", "origin_search": null, "posted": "Mar 3, 2023", "jobTitle": "RFIC Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450146/rfic-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Irvine", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "BS and 3+ years of relevant industry experience.Experience in the area of Analog / Mixed-Signal IC design with advanced CMOS technology nodes.Direct tape out experience with one or more of the following blocks: on-chip LNAs and Pas, PLL/VCO/DCO/LOGEN blocks, mixers, baseband filters and amplifiers in deep sub-micron CMOS technology.Deep understanding of analog design concepts such as analysis of noise, linearity, mismatch, stability and other analog impairments.Deep understanding of CMOS device physics, RF device modeling, device noise parameters and inductor modeling.Familiarity with packaging effects, supply isolations, high frequency ESD structures, and circuit layout for optimum RF performance.Familiarity with various RF transceiver architectures and their trade-offs, as well as calibration methods used for different transceiver architectures.Understanding of system specifications and ability to work with system architects to translate system requirements into circuit requirements at IC level.Open to work with digital design group for an optimum partition between digital and analog domain.Familiarity with the integration flows and integration challenges of wireless SoCs.Familiarity with mixed-signal mode verification methodology (SystemVerilog, AMS, Nanotime).Knowledge of desense issues and able to work closely with board RF/HW/Antenna teams to optimize board layouts for desense mitigation. Experience with desense mitigation with integrated PMUs/DSPs (i.e. substrate isolation, return loops, package isolation, frequency planning, etc.)Familiarity with Cadence Virtuoso, Spectre RF, Matlab, EM simulation (EMX, HFSS) and similar tools.Experience in Si characterization and debug.Ability to drive strong production test/QA methodologies.BS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? The wireless RFIC team architects, designs, and validates radio transceivers integrated into complex wireless SoCs. Our wireless organization is responsible for all aspects of wireless silicon development that transform the user experience at the product level, all of which is driven by a best-in-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering.\nAs an RFIC design engineer, you will be at the center of a wireless SoC design group with a critical impact on getting Apple’s state-of-the-art wireless connectivity solutions into hundreds of millions of products."}, "200447734": {"jobID": "200447734", "origin_search": null, "posted": "Dec 7, 2022", "jobTitle": "Wireless Systems Validation Engineer – GNSS", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447734/wireless-systems-validation-engineer-gnss?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS with 3+ years relevant experience required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Practical knowledge of GNSS Radio Frequency (RF) validationPractical knowledge of GNSS standards like 3GPP & Carrier performance requirements, compliance requirements and required testing methodologiesKnowledge of system level RF parametric and its sources in RF component characteristics and behaviorHands-on experience with bench-level GNSS testing, debug at the module, reference board or system-levelExperience using RF lab test equipment (e.g. Call box, Power meter, Network analyzer, Spectrum analyzer, signal generator, etc.)Experience in conducted-level debug of GNSS systems is a plusStrong written and verbal communication skillsBS with 3+ years relevant experience required.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day!\n\nOur RF Systems Engineering team is looking for a passionate, self-motivated individual to work on integration of Global Navigation Satellite System (GNSS) technology into Apple’s wireless products."}, "200452059": {"jobID": "200452059", "origin_search": null, "posted": "Feb 21, 2023", "jobTitle": "IS&T HelpLine Analyst, Employee Experience & Productivity", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200452059/is-t-helpline-analyst-employee-experience-productivity?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Raleigh", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree or equivalent work experience preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Motivation and ability to work as part of a distributed teamGood interpersonal communications and customer service skillsExcellent English-language oral and written communications skillsExcellent telephone and email etiquetteExcellent time management and multi-tasking skillsFlexibility and adaptability to thrive in a dynamic, highly-demanding, constantly changing environmentAbility to maintain composure and customer-service focus in stressful situationsStrong troubleshooting and problem resolution skillsConceptual understanding of IP networking and basic network troubleshooting skillsConceptual understanding of multi-tiered and web-based information systems architectureExperience providing hardware and software technical support for Macs, iOS devices, Apple Watch, and Apple TVExperience using an IT service management or CRM system for tracking technical support casesExperience using a knowledge base systemFamiliarity with Retail POS and other retail IT systemsPREFERRED SKILLSCisco CCNA certification or working towards certificationBachelor's degree or equivalent work experience preferred.-  Work hours are variable. This is a 24/7, 365 days per year environment-  Weekend and holiday work required at times", "jobDescription": "Do you love understanding every detail of how new technologies work? Join the team that serves as Apple’s nerve center, our Information Systems and Technology group. There are countless ways you’ll contribute here, whether you’re coordinating technology needs for product launches, designing music solutions for retail locations, or ensuring the strength of in-store Wi-Fi connections. From Apple Pay to the Apple website to our data centers around the globe, you’ll help design and manage the massive systems that countless employees and customers rely on every day. You’ll also build custom tools for employees, empowering them to solve complex problems on their own. Join our team, and together we’ll explore all the ways to improve how Apple operates, freeing our employees to do what they do best: craft magical experiences for our customers.\n\nImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.\n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThe Information Systems & Technology (IS&T) team manages key business and technical infrastructure at Apple -- how we take an order online, the experience with technology in our retail stores, how much network capacity we need around the world, the processing of every credit card an iTunes customer uses, and closing the books. IS&T does it all. \n\nWe are looking for HelpLine Analyst to join our team. The IS&T HelpLine provides technical support to Apple’s employees, contractors, and vendors throughout the world, 24 hours a day, 365 days a year. We support Apple’s products and services from hardware to software as well as Apple’s elite information technology infrastructure from the data and voice networks to each user’s Mac or iOS device and everything in between. This is a very fast-paced and highly demanding internal help desk environment. If you have a strong passion to work in a growing environment of innovation while exuding deep collaboration skills, this position is for you. We’re committed to helping employees explore their potential."}, "200267169": {"jobID": "200267169", "origin_search": null, "posted": "Jul 15, 2022", "jobTitle": "Emulation Verification Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200267169/emulation-verification-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BSEE + 7 years of industry experience or MSEE + 5 years of industry experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "5+ years of experience with bring up, debugging and verification in EmulationUnderstanding of the tool flow from RTL to Emulation is a big plusGood understanding of any Standard Emulator (Palladium, Veloce, Zebu) OR FPGA (Xilinx, Altera) flowProven design verification skillsExperience in writing Synthesize-able SystemVerilog/Verilog code and SystemVerilog assertionsExperience with System Verilog verification environments including C/C++ DPI, UVMExperience on any Scripting (Perl/Python/TCL)Excellent analytical and debug skillsExperience in UVM Acceleration is plusBSEE + 7 years of industry experience or MSEE + 5 years of industry experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish! Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. \n\nAre you passionate about changing the world? We have a critical impact on getting high quality functional products to millions of customers quickly. We are looking for you to join our emulation team focusing on the creation, deployment, and support of sophisticated emulation environments. In this highly visible role, you will be at the center of a chip design effort collaborating with all fields. \n\nAre you ready to help us deliver the next groundbreaking Apple products?"}, "200450257": {"jobID": "200450257", "origin_search": null, "posted": "Dec 20, 2022", "jobTitle": "Wireless RF Compliance Validation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200450257/wireless-rf-compliance-validation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Working experience of antenna design and tests, in particular hands-on experience for compliance measurements is desirable.Working Experience with different wireless communication systems such as GSM/UMTS/LTE, 802.11xx, Bluetooth etc. including the corresponding system level specifications (e.g., ETSI 51.010, 51.05…) is important.Working Experience with regulatory requirements and certification process for wireless consumer devices, including FCC, PTCRB, CTIA, ETSI, 3GPP etc.Excellent communication skills required, both written & verbal.Experience with 5GmmWave standard and/or hands-on chamber/system level understanding is a plus.Experience with Antenna/EM simulation tools is a plus.BS degree in technical discipline with minimum 10 years of relevant experience.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? As a member of our dynamic group, you will have the unique and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple’s customers every day.\nApple SAR Engineering team is looking for an engineer to work on RF Exposure (SAR/MPE) characterization across different wireless technologies for Apple’s wireless products"}, "200447742": {"jobID": "200447742", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "SoC Constrained Performance Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447742/soc-constrained-performance-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters| phd", "major": "BS and 20+ years of relevant experience. MS or PhD in Electrical or Computer Engineering preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "The ideal candidate should possess a BS and 20+ years of relevant Power Architecture experience in addition to:Experience in high-performance and low power microprocessor architecture and design techniquesGood understanding in control system application and behaviorExpertise in high-performance SoC power delivery and thermalsExcellent modeling and simulator development skills. Able to code in C, Python and similar programming languagesBS and 20+ years of relevant experience. MS or PhD in Electrical or Computer Engineering preferred", "jobDescription": "Do you have a desire to seek out and solve exceedingly difficult challenges rather than the easy ones? Do you grow with adversity? Do you believe that truly valuable and meaningful accomplishments are the result of pushing the limits of perseverance? Do you believe that a world-class team with relentless drive can surpass even their own high expectations? We do! But we also realize this job isn’t for everyone. What we do isn’t easy, but you don’t take the easy path!\n\nAt Apple, products are holistically designed to deliver an unrivaled customer experience. SoC hardware, Systems and Software architectures are finely co-optimized and tuned for the highest performance and operating efficiency. The world leading multi-functional team of engineers that design these products rely on groundbreaking Constrained Performance Models to analyze and refine the architecture and implementation. The Constrained Performance Model is responsible for simulating overall performance and efficiency of Apple System on Chip (SoC) in the presence of electrical, thermal and reliability constraints and control systems. In this highly visible role as a Constrained Performance Modeling Architect, you will play the central role of driving the development of these simulators and collaborate with the multi-functional team of SoC, System and Software Architects to influence the design of future Apple products."}, "200449594": {"jobID": "200449594", "origin_search": null, "posted": "Dec 14, 2022", "jobTitle": "CPU Silicon Timing Correlation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200449594/cpu-silicon-timing-correlation-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experienceGood all round hardware and data analysis skillsGood understanding of VLSI design practice and static timing analysisData analysis skills and experience using Python/JMPUnderstanding of SoC/CPU architecture is desirableGrasp of structural test (ATPG, MBIST) methods is highly desirableLab experience (system, board or tester platform) desiredExcellent teamwork and communication. Ability to work with multiple teams in delivering a solution.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hard-working people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products! The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver groundbreaking Apple products!\n\nIn this highly visible role, you will be at the center of a chip design effort interfacing with many disciplines, with a critical impact on getting functional products to millions of customers quickly. You will be a member of a silicon timing characterization team. In this highly cross disciplinary role you will execute tasks that contribute to debugging physical issues in silicon and correlating silicon timing behavior with pre-silicon models."}, "200455320": {"jobID": "200455320", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "WW AppleCare Workforce Analyst", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200455320/ww-applecare-workforce-analyst?team=CUST", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's Degree or 2 or more years work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience using call center software with the ability to implement workforce management philosophies when reviewing Advisor schedules and staffing.Experience with creation and development of processes, procedures, and creative solutions.Excellent verbal and written communication skills.Proven ability to effectively coordinate, prioritize and balance multiple assignments and meet deliverables under tight deadlines.Highly motivated self-starter with the ability to work independently and also cohesively within a team.Highly analytical, meticulous, and tools savvy.Intermediate to advanced Microsoft Excel skills.Bachelor's Degree or 2 or more years work experience", "jobDescription": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you can accomplish.\n\nThe people here at Apple don’t just craft products - they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it!\n\nThe Workforce Management team is responsible for building and maintaining staffing for AppleCare Advisors worldwide, which will minimize customer wait time while factoring in service level agreements, operational parameters, headcount and relief while ensuring optimal queue coverage by collaborating closely with business partners on all non-productive activities within an Advisor's schedule for internal sites (i.e. trainings and group events). \n\nThis role works closely with vendor partners to ensure quality and timeliness standards for scheduling support are maintained. You will utilize a variety of tools to review staffing, training activities and large events all while ensuring effective communication and feedback with the vendor, your team, and business partners."}, "200459160": {"jobID": "200459160", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Software Engineer: CPU Power, Clocks, and Time", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459160/software-engineer-cpu-power-clocks-and-time?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 3 years relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Experience with low-level CPU hardware/software interfaces, cycle- and time-sensitive programmingDeep understanding of CPU structure, pipeline flow and clock hierarchyExperience using low-power optimization design features and use of dynamic frequency and voltage controlsLow-level (assembly and C language) programming experienceOn-Chip Debug (JTAG-level debugging)Oscilloscope /instrument setup and reading schematics diagramsDeveloped rigor in identifying high quality validation scenarios, coverage gaps, and effective use of debugging toolsAbility to work well on a team, yet responsible and self-driven in planning and executionBachelor's degree and a minimum of 3 years relevant experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. We are looking for a device-level software engineer to develop test code to drive the CPU Power, Clocks and Time functions with the goal of post-silicon validation and identifying design issues."}, "200404227": {"jobID": "200404227", "origin_search": null, "posted": "Jul 25, 2022", "jobTitle": "US-Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200404227/us-manager?team=APPST", "jobLocation": {"remote": "not specified", "city": "Woodland", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Proven ability to drive amazing customer experiences — and results — through team development.Experience with diplomatically managing multiple commitments to customers, staff, and operations.Ability to adapt to challenges while remaining calm in a constantly changing retail environment.• You have demonstrated leadership ability with at least five years of experience in a customer-facing sales setting.• Cross-industry experience is welcome.• You have a passion for learning about Apple technology and products.• Multilingual ability is a plus.• You’ll need to be flexible with your schedule. Your work hours will be based on business needs.", "jobDescription": "Do you have a passion for teaching and building relationships with others?   Keeping an Apple Store thriving requires a diverse set of leadership skills, and as a Manager, you’re a master of them all. In the store’s fast-paced, dynamic environment, you exhibit composure as you learn from each new challenge. You build and inspire high-performing teams of unique individuals who deliver positive experiences for customers as they learn, shop, and get support. Most importantly, you share the Apple vision with employees and customers. "}, "200441771": {"jobID": "200441771", "origin_search": null, "posted": "Jan 27, 2023", "jobTitle": "Media Quality Automation Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200441771/media-quality-automation-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Newport Beach", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS or higher in Computer Science, Computer Engineering, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "Proficient in development of new test automation using Python/SwiftExcellent analytical, programming and debugging skillsStrong communication and collaboration skillsFAMILIARITY WITH IOS, MAC OS X, AND UNIXPassion for learning new technologies, and eagerness to absorb new concepts-  Upbeat, adaptable, and results oriented with a positive attitudeBS or higher in Computer Science, Computer Engineering, or equivalent experienceExperience with testing consumer electronics, mobile applications and experiencesProficiency in scripting languages such as Python preferred and familiarity with Swift and JavaScript is a plusKnowledge of Apple Platform development using Xcode, Swift, and Objective C preferred but not necessary", "jobDescription": "Apple's Technology Development group is looking for a creative and dedicated engineer with leadership qualities to join our Media team. This technology powers the streaming media experiences on all of Apple’s platforms by building on core technologies and frameworks. If you are passionate about solving complex problems with sophisticated and creative solutions, then this job is the perfect fit for you."}, "200451385": {"jobID": "200451385", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "Analog Mixed Signal Micro Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451385/analog-mixed-signal-micro-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "You should have architecture, design, and production expertise in the following areas:High-speed wireline transceiver architectures and circuits. High-speed memory interface architectures and circuit.High-speed data converter architectures and circuits. Ultra-low-power analog circuits.Digitally-assisted analog circuits.You should be highly skilled in the following areas:Matlab/Simulink/Verilog A modeling.Data converter architectures and design trade-offs. Low-power and high-precision analog techniques.Architect circuit solutions that achieve challenging noise, linearity, power consumption, and silicon area requirements.AMS design flows and chip assembly techniques.Working with design, layout, and production test engineers.Excellent communication.BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented Architect. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Architect low-power high-performance AMS solutions."}, "200457629": {"jobID": "200457629", "origin_search": null, "posted": "Jan 26, 2023", "jobTitle": "Analog Mixed Signal Micro Architect", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457629/analog-mixed-signal-micro-architect?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Beaverton", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "You should have architecture, design, and production expertise in the following areas:High-speed wireline transceiver architectures and circuits. High-speed memory interface architectures and circuit.High-speed data converter architectures and circuits. Ultra-low-power analog circuits.Digitally-assisted analog circuits.You should be highly skilled in the following areas:Matlab/Simulink/Verilog A modeling.Data converter architectures and design trade-offs. Low-power and high-precision analog techniques.Architect circuit solutions that achieve challenging noise, linearity, power consumption, and silicon area requirements.AMS design flows and chip assembly techniques.Working with design, layout, and production test engineers.Excellent communication.BS degree in technical discipline with minimum 10 years of relevant experience.\n\nApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "At Apple, we work every single day to craft products that enrich people’s lives. Do you love working on challenges that no one has solved yet? Do you like changing the game? We have an opportunity for a visionary and uncommonly talented Architect. As a member of our dynamic group, you will have the rare and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day. Architect low-power high-performance AMS solutions."}, "200397394": {"jobID": "200397394", "origin_search": null, "posted": "Nov 9, 2022", "jobTitle": "Sr. Full Stack Engineer, Creativity Apps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200397394/sr-full-stack-engineer-creativity-apps?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in CS/CE or equivalent work experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proven track record (6+ years) of shipping high quality, tested code for complex web applications and setting architecture for new services with minimal guidanceProven background with modern frontend development using JavaScriptProven background in designing, implementing, and scaling Web services in Java and SpringAbility to work with ambiguity and take ownership of features/productCommitted to encouraging an open and inclusive work environmentAbility and desire to mentor others in achieving engineering excellence and to be a catalyst on the teamStrong communication, collaboration, and project management skillsBS/MS in CS/CE or equivalent work experience.", "jobDescription": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. If you bring passion, and dedication to your job and there is no telling what you could accomplish! \n\nThe Creativity Apps team is looking for a senior full stack engineer to lead development of services for creative pros and enthusiasts. You’ll be working with the world-class teams behind Final Cut Pro, Logic Pro, iMovie, and GarageBand to create next-generation tools for creators!"}, "200451527": {"jobID": "200451527", "origin_search": null, "posted": "Dec 19, 2022", "jobTitle": "CAD Engineer - Full-Stack Web Developer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200451527/cad-engineer-full-stack-web-developer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum requirements of BS degree + 0 years of industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "To succeed within this role, you should have shown experience in several of the following areas:-  Knowledge of JavaScript, React, or similar client-side development-  Hands-on development with Python-  Python-based server-side frameworks (FastAPI, Django) a plus-  Fundamentals of database model design, including Graph, Document, or Relational systems-  Usage of revision control systems (Git, Perforce)-  Comfort within Linux/Unix environments, experience in scripting languages-  Basic understanding of build and deployment tools (Docker, TeamCity, Jenkins)Minimum requirements of BS degree + 0 years of industry experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help support the design and manufacturing our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices!\n\nWe are looking for an individual who is passionate about joining Apple’s engineering team as a Full-Stack Web Developer. The Hardware Technologies team designs the best silicon on the planet and you could be a key part of enabling our success."}, "200459161": {"jobID": "200459161", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "Software Engineer: CPU Power, Clocks, and Time", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459161/software-engineer-cpu-power-clocks-and-time?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Bachelor's degree and a minimum of 3 years relevant experience."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Experience with low-level CPU hardware/software interfaces, cycle- and time-sensitive programmingDeep understanding of CPU structure, pipeline flow and clock hierarchyExperience using low-power optimization design features and use of dynamic frequency and voltage controlsLow-level (assembly and C language) programming experienceOn-Chip Debug (JTAG-level debugging)Oscilloscope /instrument setup and reading schematics diagramsDeveloped rigor in identifying high quality validation scenarios, coverage gaps, and effective use of debugging toolsAbility to work well on a team, yet responsible and self-driven in planning and executionBachelor's degree and a minimum of 3 years relevant experience.", "jobDescription": "Imagine what you could at Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. We are looking for a device-level software engineer to develop test code to drive the CPU Power, Clocks and Time functions with the goal of post-silicon validation and identifying design issues."}, "200458655": {"jobID": "200458655", "origin_search": null, "posted": "Feb 17, 2023", "jobTitle": "Analog/Mixed-Signal Layout Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200458655/analog-mixed-signal-layout-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Bachelors of Science in Electrical Engineering and 10+ years experience preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "-  Proven experience in analog/mixed-signal layout design of deep sub-micron CMOS circuits-  Experience in implementing analog layouts to achieve tight matching, low noise, and low power consumption. Layouts may include data converters, PLLs, analog blocks, resistors, capacitors, pad IOs, ESD structures, etc.-  High level of proficiency in custom and standard cell based floor-planning and hierarchical layout assembly.-  Must understand techniques for leading IR drop, RC delay, electro-migration, self heating and coupling capacitance.-  Must recognize failure prone circuit and layout structures, have experience with analog and DFM standard methodologies, and proactively work with circuit designer to identify the best approach to solving problems.-  Deep proficiency in interpretation of CALIBRE DRC, ERC, LVS, etc. reports.-  Knowledge of MENTOR GRAPHICS or CADENCE layout tools.-  Scripting skills in PERL or SKILL are considered a plus, but not required.-  Excellent communication skills and able to work with multi-functional teams.Bachelors of Science in Electrical Engineering and 10+ years experience preferred", "jobDescription": "Together we could help craft the future's finest devices. New insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your career, and there's no telling what you could accomplish! \n\nOur team is searching for a self-motivated engineer for the role of HSC Layout Designer. As a member of the HSC team, we will be working on the forefront of technology nodes to build outstanding custom analog and mixed-signal designs used to connect our world-class products to the world in the most efficient way possible.\n\nYou will become part of a development team that nurtures engineering excellence, creativity and innovation. Collaboration across teams is a key component of success at Apple. The right candidate will thrive in that type of environment. Multifaceted, thoughtful people and inspiring, innovative technologies are the norm here. \n\nWill you help us design the next generation of revolutionary Apple products?"}, "200463917": {"jobID": "200463917", "origin_search": null, "posted": "Feb 20, 2023", "jobTitle": "SoC Physical Design Engineer, Electrical Analysis", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463917/soc-physical-design-engineer-electrical-analysis?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "Minimum BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Minimum BS and 3+ years of relevant industry experience.Solid background and knowledge on computer architecture and digital system, circuit design, and low power techniques.Hands-on experience with ASIC or AMS physical implementation and analysis flow.Possess scripting skills to automate and debug verification flows for digital VLSI design.You have knowledge with industrial EDA backend verification tools like Redhawk, PrimeRail or Voltus and PrimeTime and Tempus.Past experience with sign-off on successful chip tape-outs will help you succeed on our team.Circuit design background and SPICE experience are a plus.Minimum BS and 3+ years of relevant industry experience", "jobDescription": "Imagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, hardworking people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product!\n\nAs a Physical Electrical Analysis Engineer on our SoC team, you will be driving the electrical analysis and verification of an SoC."}, "200447068": {"jobID": "200447068", "origin_search": null, "posted": "Dec 6, 2022", "jobTitle": "Home Product Design (PD) Engineering Program Manager", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200447068/home-product-design-pd-engineering-program-manager?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS or MS degree in engineering, ME preferred"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$113,500", "max": "$207,000,"}, "benefits": null, "requirements": "2-5 years of leading program management of mechanical engineering design of rapid development products comprising multiple materials of high aesthetic quality.Strong technical background with knowledge of manufacturing processes and mechanical engineering fundamentals.Resilience and flexibility when faced with uncertainty and changes in directionSelf motivated with strong critical thinking capabilitiesGreat attention to detail and ability to effectively handle complexityExcellent communication, organization, collaboration and leadership skills; ability to filter and distill relevant information for the right audienceBS or MS degree in engineering, ME preferred", "jobDescription": "Looking for a PD EPM to own and drive new product development in the Home EPM team! The PD Engineering Program Manager is responsible for the technical management of engineering development projects within Apple’s Product Design organization. They will understand the who, what and how of hardware development, create and manage the program plan, and successfully implement it while balancing several contending objectives and aggressive deliverable timelines."}, "200397891": {"jobID": "200397891", "origin_search": null, "posted": "Oct 28, 2022", "jobTitle": "Sr. Full Stack Software Engineer, Creativity Apps", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200397891/sr-full-stack-software-engineer-creativity-apps?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "Culver City", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "BS/MS in CS/CE or equivalent work experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Proven track record (6+ years) of shipping high quality, tested code for complex web applications and setting architecture for new services with minimal guidanceProven background with modern frontend development using JavaScriptProven background in designing, implementing, and scaling Web services in Java and SpringAbility to work with ambiguity and take ownership of features/productCommitted to encouraging an open and inclusive work environmentAbility and desire to mentor others in achieving engineering excellence and to be a catalyst on the teamStrong communication, collaboration, and project management skillsBS/MS in CS/CE or equivalent work experienceApple’s most important resource, our soul, is our people. Apple benefits help further the well-being of our employees and their families in meaningful ways. No matter where you work at Apple, you can take advantage of our health and wellness resources and time-away programs. We’re proud to provide stock grants to employees at all levels of the company, and we also give employees the option to buy Apple stock at a discount — both offer everyone at Apple the chance to share in the company’s success. You’ll discover many more benefits of working at Apple, such as programs that match your charitable contributions, reimburse you for continuing your education and give you special employee pricing on Apple products.Apple benefits programs vary by country and are subject to eligibility requirements.", "jobDescription": "At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. If you bring passion, and dedication to your job and there is no telling what you could accomplish!   The Creativity Apps team is looking for a senior full stack engineer to lead development of services for creative pros and enthusiasts. You’ll be working with the world-class teams behind Final Cut Pro, Logic Pro, iMovie, and GarageBand to create next-generation tools for creators!"}, "200459111": {"jobID": "200459111", "origin_search": null, "posted": "Feb 28, 2023", "jobTitle": "Cellular Systems Performance Analysis Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459111/cellular-systems-performance-analysis-engineer?team=SFTWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors | masters", "major": "Bachelors or Masters in Electrical Engineering or equivalent"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Hands on experience with in system engineering/system performance analysis roleDeep knowledge of 5G and LTE PHY/MAC/Protocol stack, TCP/IPStrong scripting experience (Python preferred, Perl) and debuggingSW development and system design experience is a great plus.Knowledge of IOT protocols such as IEEE 802.15.4, Bluetooth, Zigbee or Thread Mesh is a plus.Home automation experience is a plus (Bluetooth, Zigbee, z-Wave, Thread Mesh)Highly motivated and self-directedExcellent debugging skillsSolid understanding of 3GPP standardsThrive in a collaborative environment and can clearly communicate while confidently driving multiple projects across many teams.Obsessively passionate and inquisitive, and seek to solve everyday problems in innovative ways.Laser-focused on the smallest details that are meaningful to our customers.Bachelors or Masters in Electrical Engineering or equivalent", "jobDescription": "Join the Wireless Technologies and Ecosystems (WTE) organization and be part of a best-in-class team of engineers, working with multi-functional teams to drive innovation and develop products used by millions worldwide. We are looking for a highly reciprocal individual who can excel in a high-paced environment. Be ready to make something extraordinary when you come here. Dynamic, encouraging people and innovative, industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same real passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. You should join Apple if you want to help deliver the next amazing Apple product."}, "200422770": {"jobID": "200422770", "origin_search": null, "posted": "Sep 7, 2022", "jobTitle": "AR/VR Spatial Audio DSP Lead", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200422770/ar-vr-spatial-audio-dsp-lead?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "Most of our team has an advanced degree in EE, Acoustics, or Music Technology. \nWe're open to individuals who have found their own path to the top of the field."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$161,000", "max": "$278,000,"}, "benefits": null, "requirements": "Expert understanding of all common spatial audio concepts such as HRTF, spherical harmonic functions, artificial reverberation, and room impulse responses.Outstanding listening and communication skills.The ability to synthesize a solution from a diversity of viewpoints.Excellent programming skills in C/C++Experience with embedded real time audio systems.Most of our team has an advanced degree in EE, Acoustics, or Music Technology. \nWe're open to individuals who have found their own path to the top of the field.", "jobDescription": "We’re a diverse collection of thinkers and doers, continually reimagining what’s possible to help us all do what we love in new ways. The people who work here have reinvented entire industries with the Mac, iPhone, iPad, and Apple Watch, as well as with services, including iTunes, the App Store, Apple Music, and Apple Pay. The same passion for innovation that goes into our products also applies to our practices - strengthening our commitment to leave the world better than we found it.\n\nWe are looking for a AR/VR Spatial Audio DSP Lead, to drive the definition of cutting edge spatial audio architectures in high-performing and low-powered Apple devices. You will have a uniquely rewarding opportunity to lead the technological definition of future products that will delight and inspire millions \nof people every day."}, "200459626": {"jobID": "200459626", "origin_search": null, "posted": "Jan 25, 2023", "jobTitle": "HardIP Test Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459626/hardip-test-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and minimum of 10+ years of relevant industry experience is required."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$150,000", "max": "$269,000,"}, "benefits": null, "requirements": "In depth knowledge of Semiconductor Manufacturing ProcessDeep understanding of High Speed Digital and Analog circuits, Design for Test and Manufacturing Concepts.Expertise in Semiconductor Test Methodology.Experience working with Digital, Mixed Signal, SOC Devices with hands on VLSI ATE experience. DFT experience is a plus.Strong Programming skills for writing and debugging test programs and HW related issues.Proficiency in programming with Scripting languages (IE., Perl/Python) and high level languages (IE., C/C++ or Visual Basic.)Able to work with test equipment (IE., oscilloscope, logic analyzer, etc)Experience High Speed Board Design & SI analysis.Travel is requiredBS and minimum of 10+ years of relevant industry experience is required.", "jobDescription": "Do you love crafting sophisticated solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that moves Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! \n\nWe are seeking a dynamic engineer to develop ATE test programs for debug, characterization, qualification and production of SoC devices specializing in HardIP tests."}, "200463663": {"jobID": "200463663", "origin_search": null, "posted": "Feb 18, 2023", "jobTitle": "SOC Performance & Power Engineer - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463663/soc-performance-power-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. and 10+ years of relevant industry experience. Masters or PhD in EE, CS, or related field preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$144,500", "max": "$250,000,"}, "benefits": null, "requirements": "Great written and verbal communication skills.Proficient in C++ and one or more scripting languages, ideally Python.Strong computer architecture fundamentals and understanding of how HW and SW interact in a complex system.Computer system performance modeling experience of some kind.Ability and enthusiasm to work with experts in architecture, design, post-silicon analysis, software, and more.B.S. and 10+ years of relevant industry experience.B.S. and 10+ years of relevant industry experience. Masters or PhD in EE, CS, or related field preferred.", "jobDescription": "Do you love crafting elegant solutions to complex problems? Do you enjoy learning how systems work from the big picture down to the smallest detail? As part of the SoC Performance group, you’ll work with a diverse set of cross-functional teams to help architect, optimize, and ship our industry-leading SoCs powering Apple products from iPhone to Apple Watch, iPad, Macs, and more! You’ll join a team of performance architects who deeply analyze the way our SoCs are used in the real world, in order to ensure that software can harness the full power of our chips and to improve the design of future SoCs. We’re looking for experienced, passionate, and highly motivated individuals to help us set the standard on the performance, efficiency, and hardware/software integration of Apple’s products!\n\nYou will enjoy this role if:\n\n-  You're interested in hardware design, hardware/software co-design, hardware/software optimization, and power/performance tradeoffs.\n\n-  You derive satisfaction from not only writing code and analyzing its behavior, but in using that analysis to influence the direction of the organization.\n\n-  You know that a performance model is only as good as the stimulus (workloads) and analysis infrastructure around it, and are motivated to use your skills to work with others to build up all the parts of this ecosystem.\n\n-  You imagine, and/or measure, how the code you write will execute on the target hardware."}, "200463664": {"jobID": "200463664", "origin_search": null, "posted": "Feb 18, 2023", "jobTitle": "SOC Performance & Power Engineer - Platform Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200463664/soc-performance-power-engineer-platform-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "B.S. and 10+ years of relevant industry experience. Masters or PhD in EE, CS, or related field preferred."}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "Great written and verbal communication skills.Proficient in C++ and one or more scripting languages, ideally Python.Strong computer architecture fundamentals and understanding of how HW and SW interact in a complex system.Computer system performance modeling experience of some kind.Ability and enthusiasm to work with experts in architecture, design, post-silicon analysis, software, and more.B.S. and 10+ years of relevant industry experience.B.S. and 10+ years of relevant industry experience. Masters or PhD in EE, CS, or related field preferred.", "jobDescription": "Do you love crafting elegant solutions to complex problems? Do you enjoy learning how systems work from the big picture down to the smallest detail? As part of the SoC Performance group, you’ll work with a diverse set of cross-functional teams to help architect, optimize, and ship our industry-leading SoCs powering Apple products from iPhone to Apple Watch, iPad, Macs, and more! You’ll join a team of performance architects who deeply analyze the way our SoCs are used in the real world, in order to ensure that software can harness the full power of our chips and to improve the design of future SoCs. We’re looking for experienced, passionate, and highly motivated individuals to help us set the standard on the performance, efficiency, and hardware/software integration of Apple’s products!\n\nYou will enjoy this role if:\n\n-  You're interested in hardware design, hardware/software co-design, hardware/software optimization, and power/performance tradeoffs.\n\n-  You derive satisfaction from not only writing code and analyzing its behavior, but in using that analysis to influence the direction of the organization.\n\n-  You know that a performance model is only as good as the stimulus (workloads) and analysis infrastructure around it, and are motivated to use your skills to work with others to build up all the parts of this ecosystem.\n\n-  You imagine, and/or measure, how the code you write will execute on the target hardware."}, "200459928": {"jobID": "200459928", "origin_search": null, "posted": "Jan 28, 2023", "jobTitle": "HW Systems Engineering Manager - AirPods", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459928/hw-systems-engineering-manager-airpods?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Boulder", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": ""}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$179,000", "max": "$309,500,"}, "benefits": null, "requirements": "Must have excellent EE fundamentals. This means you have a deep understanding of why our discipline works the way it does; you've developed an intuition and can apply it to new topics because you understand the basics.Must have hands-on experience in prototype bring-up and debugging, functional verification. You have an ability to go learn how to quantify and test new technologies.Experience designing high volume products from beginning to end and dealing with contract manufacturers.Experience leading teams of engineers and managers designing electronics.", "jobDescription": "The AirPods Hardware group is searching for an exceptional candidate to manage a system team tasked with delivering amazing products; products only Apple could imagine and more importantly deliver.\n\nOur team is first and foremost a product team; we play a role in product definition and roadmap, we drive key technologies by partnering with diverse teams of experts, and we implement, validate and manufacture the hardware that gives life to beautifully crafted products."}, "200247574": {"jobID": "200247574", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "AIML - iOS Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200247574/aiml-ios-software-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Seattle", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S or M.S in Computer Science, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "2+ years of iOS development experience at the application level in Objective-C OR Swift AND C++Knowledge of Apple’s development APIs (Cocoa Touch, Cocoa, CoreFoundation)Proven experience leading cross-functional teams delivering software productsOutstanding communication and presentation skillsB.S or M.S in Computer Science, or equivalent experience", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. \n\nThe Siri iOS team is looking for exceptional engineers passionate about delighting customer’s experience, by producing cutting edge applications and technologies. We are a robust team looking for engineers excited about changing the future of speech technology."}, "200370703": {"jobID": "200370703", "origin_search": null, "posted": "Jan 11, 2023", "jobTitle": "AIML - iOS Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200370703/aiml-ios-software-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Pittsburgh", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S or M.S in Computer Science, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "2+ years of iOS development experience at the application level in Objective-C OR Swift AND C++Knowledge of Apple’s development APIs (Cocoa Touch, Cocoa, CoreFoundation)Proven experience leading cross-functional teams delivering software productsOutstanding communication and presentation skillsB.S or M.S in Computer Science, or equivalent experience", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. \n\nThe Siri iOS team is looking for exceptional engineers passionate about delighting customer’s experience, by producing cutting edge applications and technologies. We are a robust team looking for engineers excited about changing the future of speech technology."}, "200370713": {"jobID": "200370713", "origin_search": null, "posted": "Jan 6, 2023", "jobTitle": "AIML - iOS Software Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200370713/aiml-ios-software-engineer?team=MLAI", "jobLocation": {"remote": "not specified", "city": "Boston", "state": null, "country": "US"}, "educationRequirement": {"education": null, "major": "B.S or M.S in Computer Science, or equivalent experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "2+ years of iOS development experience at the application level in Objective-C OR Swift AND C++Knowledge of Apple’s development APIs (Cocoa Touch, Cocoa, CoreFoundation)Proven experience leading cross-functional teams delivering software productsOutstanding communication and presentation skillsB.S or M.S in Computer Science, or equivalent experience", "jobDescription": "Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. \n\nThe Siri iOS team is looking for exceptional engineers passionate about delighting customer’s experience, by producing cutting edge applications and technologies. We are a robust team looking for engineers excited about changing the future of speech technology."}, "200443296": {"jobID": "200443296", "origin_search": null, "posted": "Nov 15, 2022", "jobTitle": "TFT Panel Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200443296/tft-panel-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters| phd", "major": "PhD or MS in Electrical Engineering"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "Strong command of Electrical Engineering fundamentals (analog/digital circuit design)Experience with SPICE/Cadence modeling and simulation requiredExperience/in-depth technical knowledge of displays or related electronics preferred but not requiredExperience in display pixel, gate driver designs preferred but not requiredUnderstanding of Thin-Film Transistors and panel process preferred but not requiredExperience in characterizing panel optical and electrical performance preferredExperience in designing and manufacturing high volume display products preferredExcellent written and verbal communication skills requiredPhD or MS in Electrical Engineering", "jobDescription": "Apple is looking for a world-class Thin Film Transistor (TFT) panel design engineer to design, develop and launch the next TFT technologies for the portable, laptop and desktop displays in Apple products. The TFT panel design team is responsible for delivering the advanced TFT panel designs and technologies to enable the world’s best display performance in Apple products. Individual will serve as a focal point in architecting and developing the total TFT pixel and panel designs for mass production. This includes TFT pixel/control circuit simulation, circuit layout/optimization, whole panel architecture/simulation, and co-existence simulations with other components in Apple products."}, "200457623": {"jobID": "200457623", "origin_search": null, "posted": "Jan 13, 2023", "jobTitle": "Graphics (GPU) RTL Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200457623/graphics-gpu-rtl-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Austin", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + Minimum of 10 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": null, "max": null}, "benefits": null, "requirements": "We are looking for minimum of 10 years of relevant experience and the below:Deep understanding of the design and analysis of hardware and software graphics pipeline.Expertise in performance measurement and analysis of GPU micro-architectureKnowledge of logic design principles along with timing and power implications and an understanding of low power microarchitecture techniquesProficiency with vendor synthesis tools and understanding of PNR flowExpert knowledge of System Verilog hardware description languageGeneral knowledge of computer architecture and SIMD architecturesGPU RTL experience preferredBS + Minimum of 10 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processors. You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices! In this highly visible role, team members will develop power efficient, high performance 3D graphics processor microarchitectures targeted for low power mobile devices and high-performance personal computers."}, "200448639": {"jobID": "200448639", "origin_search": null, "posted": "Dec 12, 2022", "jobTitle": "Graphics Modeling Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200448639/graphics-modeling-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "Santa Clara Valley (Cupertino)", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS + minimum of 3 years of experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$130,000", "max": "$242,000,"}, "benefits": null, "requirements": "Proven expertise and knowledge of graphics rendering algorithms and architecturesExperience with GPU APIs, OpenGL, OpenCL, DirectX, MetalExcellent C/C++ programming skillsGPU modeling experience, no matter function or performance, is a strong plusExperience with graphics device drivers is idealExperience with scripting, DPI, Verilog/VHDL, Specman/System Verilog, design verification methodology and tools a plusTeam leadership experience a plusExcellent interpersonal skills and ability to collaborate under bold schedulesBS + minimum of 3 years of experience", "jobDescription": "Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. We are seeking a Graphics Modeling Engineer will deliver high-quality GPU function and/or performance models to meet the needs of GPU hardware development. This includes writing models for functional development and verification of a GPU design, performance exploration, performance validation, and power estimation. You will collaborate closely with the architecture team, hardware design team, design and verification teams."}, "200220258": {"jobID": "200220258", "origin_search": null, "posted": "Oct 27, 2022", "jobTitle": "Display Silicon Digital Architecture", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200220258/display-silicon-digital-architecture?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "masters", "major": "MSEE with 7+ years of experience in silicon architecture and design"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$136,000", "max": "$242,000,"}, "benefits": null, "requirements": "Hands on experience developing large FPGA and/or ASIC designsExperience with RTL coding, implementation, verification, debugging and deploymentExperience with digital architecture, data path design, bandwidth and latency constraints, memory subsystems, microcontroller integrationExperience with high speed SerDes, and serial interfaces like SPI and I2CExperience with programming languages for modeling and automationUnderstanding of PCB design and technologyMSEE with 7+ years of experience in silicon architecture and design", "jobDescription": "The display silicon architecture team defines the requirements for custom silicon and prototype hardware to enable new displays and new display technologies for Apple products.\nThe team develops a deep understanding of the performance and capabilities of our portfolio of custom silicon to enable reuse of existing chips for new products and to build on proven silicon IP when defining new chipsets. \n\nTeam members have a background in analog or digital chip design and use their experience and expertise to develop architectural requirements and guide the design and implementation of Apple custom silicon.\n\nIf you love Apple products, this role provides an opportunity to help define and shape the displays Apple will create in the years to come."}, "200459129": {"jobID": "200459129", "origin_search": null, "posted": "Feb 2, 2023", "jobTitle": "SoC Audio Design Engineer", "companyName": "Apple", "link": "https://jobs.apple.com/en-us/details/200459129/soc-audio-design-engineer?team=HRDWR", "jobLocation": {"remote": "not specified", "city": "San Diego", "state": null, "country": "US"}, "educationRequirement": {"education": "bachelors", "major": "BS and 3+ years of relevant industry experience"}, "jobType": {"internship": false, "partTime": false, "fullTime": true, "coop": false, "contract": false, "independent_contractor": false, "temporary": false, "oncall": false, "volunteer": "False"}, "visaSponsorship": {"none": true, "cpt_opt": true, "h1b": true, "eb": true}, "salary": {"min": "$115,000", "max": "$217,500,"}, "benefits": null, "requirements": "We'd like you to have:Experiences in low power digital IP related designProficiency in ASIC logic design and SoC integrationSystem architecture knowledge including one or more of the following:Bus fabric, especially APB/AHB/AXITiered memory systemsSystem debug architectureSerial communications like UART/SPI/I2C, etc.Hands-on skills in Shell and Perl scripting, Python is a plusPerformance analysis experience desirableEmbedded firmware development knowledge would be an advantageStrong skills in solving complex problems on the flyExcellent communication for collaboration across different functionsBS and 3+ years of relevant industry experienceApple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.", "jobDescription": "Would you like to join Apple’s growing wireless silicon development team? Our wireless SOC organization is responsible for all aspects of wireless silicon development with a particular emphasis on highly energy efficient design and new technologies that transform the user experience at the product level, all of which is driven by a world-class vertically integrated engineering team spanning RF/Analog architecture and design, Systems/PHY/MAC architecture and design, VLSI/RTL design and integration, Emulation, Design Verification, Test and Validation, and FW/SW engineering. In this highly visible role, you will be at the center of a silicon design group with a critical impact on getting functional products to hundreds of millions of customers quickly. Will you join us and do the work of your life here?"}}